[
    {
        "content": "<p>So first this was a great mathematical chat, and now we also have the most polite geopolitics section on the Internet! <em>(Not that the bar is very high…)</em></p>\n<p>I wonder: How many people, among those having a strong opinion on the current war in Israel and Palestine, have actually visited this location and talked to a varied sample of people living there? I expect that a direct experience of larger than some minimal width and depth would lead anyone to a moderate and cautious position. <em>(Dear reader, be aware that disclosing your travel history may make it harder to get certain visas and even lead to legal prosecution and jail time. I do not mean to nudge anyone to disclose their travel history on the Internet.)</em></p>\n<p>It is not clear to me what the solution would be.</p>\n<p>There is a theory that Benjamin Netanyahu orchestrated the whole story with Gaza and Iran to legitimize his unending reign. Say this theory is true all the way. How does supporting independent Palestine address the problem? It seems the fault is with the judicial system, either Israeli or international. Orchestrating a war must be illegal, right? So, how does supporting independent Palestine improve the judicial system? Maybe supporting an international judicial system directly would be more efficient?</p>\n<p>A more plausible theory from my point of view is that we are dealing with generalized hate between certain collective identities, on top of which some savvy people happily ride into prosperity. But the idea that distinct collective identities that hate one another currently exist on our planet seems to be out of consideration, even while the evidence for it seems to me easy to see. I wonder if this theory can be modelled mathematically, in a way similar to modelling, say, spread of a contagious disease across multiple cities. Collective identities would be our cities, and any particular basis for hate rhetoric would be a disease. Once we have a model that corresponds to reality well enough, we can have further discussion in practical terms, rather than ideological terms. How does this sound?</p>\n<p>As for ideology, it seems to me that legal systems are best understood it terms of [claims and liberties][1]. <em>(Which turn out to be dual in a mathematical sense!)</em> After some thinking I conclude that the European legal system and the Islamic legal system, in the ideological sense, are both utopian — beautiful on paper but practically unhelpful. This puts me in a sad position of having no ideological allies on either the European or the Islamic side of our planet. It would be very helpful to me personally if the discussion here was framed in these clear terms. What claims do we want to set up? What liberties do we want to set up?</p>\n<p>For instance: Do we want to forbid Israeli citizens to own land and build houses in Palestine? That means giving a particular claim right to the government of Palestine or, equivalently, not giving a particular liberty right to Israeli citizens.</p>\n<p>In this view, there is no such thing as a <em>«right to exist»</em> overall. Anyone has a liberty right to exist in the middle of the Pacific Ocean, or anywhere else in international waters, or on the Moon. It is hard, but no one can forbid you to. And no one has a claim right to live in any place on this planet at their choice. For instance, I cannot visit Paris and participate in any public protests there because I do not have a suitable passport or visa, so I do not even have a liberty right — rather, the government of France has a claim right to keep me away, even through use of lethal force. Some people have a claim right to exist in some particular place: for example, if you are a citizen of Germany, you can claim a good amount of money to support you while you are looking for work, and you can look for work your whole life. There is not enough stuff in the world to support any significant fraction of humans in this way — citizens of Germany are a privileged group. Most people do not even have a claim right to exist in their place of origin — they have to actively keep trying to stay afloat, doing boring and sometimes even painful work, until their body fails them.</p>\n<p>This hopefully makes it clear why I see <em>Universal Declaration of Human Rights</em> and <em>Koran</em> as equally mythical compositions.</p>\n<p>I am starving for a precise formulation of who we are, what we want to achieve, and how we get there. What better place to ask this than a mathematical forum?</p>\n<p>[1]: <a href=\"https://en.wikipedia.org/wiki/Claim_rights_and_liberty_rights\">https://en.wikipedia.org/wiki/Claim_rights_and_liberty_rights</a></p>",
        "id": 525929125,
        "sender_full_name": "Ignat Insarov",
        "timestamp": 1750951081
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"583446\">Ignat Insarov</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Returning.20a.20medal.2C.20freeing.20a.20people/near/525929125\">said</a>:</p>\n<blockquote>\n<p>How many people... have actually visited this location and talked to a varied sample of people living there? I expect that ... would lead anyone to a moderate and cautious position.</p>\n</blockquote>\n<p>If I tried at the present time, there is plenty of evidence that the government of Israel would prevent me from setting foot in what is left of Palestine or witnessing the genocide first hand. In fact, my public expression here would likely be enough to prevent me from reaching even Israel. Fortunately, I don't need to visit to see what's happening there. </p>\n<blockquote>\n<p>How does supporting independent Palestine address the problem?</p>\n</blockquote>\n<p>A significant number of people standing up for those who are being murdered and starved seems to me a pretty obvious prerequisite to ending that situation. There are more nuanced arguments to be made, but that's the start.</p>\n<blockquote>\n<p>Orchestrating a war must be illegal, right?</p>\n</blockquote>\n<p>Netanyahu and members of his government already been *charged of war crimes by the ICC. The primary problem is not the expressiveness of the laws here, it's that the court does not have the power in isolation to enforce judgements: members of the UN (for instance) have that responsibility and are not acting on it. An important function of protest (the main function?) is public opposition to the actions or decisions of one's government or expression of support for actions they should be taking. In this instance, supporting the people of Palestine by sanctioning the state of Israel.</p>",
        "id": 525937952,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1750953943
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Returning.20a.20medal.2C.20freeing.20a.20people/near/525937952\">said</a>:</p>\n<blockquote>\n<p>Netanyahu and members of his government already been convicted of war crimes by the ICC. </p>\n</blockquote>\n<p>Charged, not convicted: <a href=\"https://www.icc-cpi.int/defendant/netanyahu\">https://www.icc-cpi.int/defendant/netanyahu</a></p>",
        "id": 525947259,
        "sender_full_name": "JR",
        "timestamp": 1750957266
    },
    {
        "content": "<p>Note that I have never visited any country like Israel, Iran, Armenia or Taiwan. I have many friends and some of them travel here and there. All my information is strictly second hand. Maybe even third hand.</p>\n<p>It is unlikely that the Israeli border control will look you up and find your messages on a invitation only chat. They have on average about one minute to process a person. I assume you look presentable — do not say anything stupid, smile from your heart, and they will let you in. Then it is a simple matter of talking to people. There is a plenty of purely Arabic settlements on the land of Israel itself. The biggest one is the famous Nazareth that tourists visit all the time. Go there, stay there, live among the people. If nothing changed since I last checked, as a foreign national, you can also freely visit the West Bank Palestine. I suggest Jenin if you like your food spicy. Safed is another interesting location, the highest point of Israel and a center of religious study.</p>\n<p>The point is not to take photographs on the background of smoking ruins. The point is to understand whom you are talking about. People are not French or English all over the world. I infer from the way you talk that you are not aware how deeply and predictably distinct people belonging to different collective identities get to be.</p>\n<p>Waving any particular flag and returning any particular medals is a behaviour altogether disjoint from any standing up for anyone who is being murdered and starved. The way you stand for someone who is being murdered is by supporting justice, and the way you stand up for someone who is being starved is by supporting mercy. If you want to support either justice or mercy in Israel, Palestine, or any other location on this planet, your first step is to physically put your body at that location. If you cannot do that, send some trusted friends and admit that you personally failed at the first step — now you can only help your friends support either justice or mercy, but you can no longer support it directly.</p>\n<p>And I am not talking about any nuance. I am talking about facing concrete reality with your physical face.</p>\n<p>I know that there is an outstanding arrest warrant for Benjamin Netanyahu. As far as I know, there was no conviction of any kind so far. But this is a nuance, it does not matter. You say that public support for justice can be expressed by supporting the people of Palestine and sanctioning the state of Israel. This sounds to me like a very far and sudden leap in your otherwise careful reasoning. What relation does either Palestine or Israel have to any arrest warrants? Are you suggesting that the state of Israel should arrest Benjamin Netanyahu? But this is not what you have been saying so far. Are you suggesting that the people of Palestine should arrest Benjamin Netanyahu? But this is not what you have been saying so far, either.</p>\n<p>Mercy and justice are human values independent of any particular mythology. Allah is assumed to be merciful and just, ICC is assumed to be merciful and just. Everyone will be on board with you if you start from the position of supporting either mercy or justice. But this is not what you are doing.</p>\n<p>You have entirely ignored my call for precise specification of what you are standing for. I am ready and willing to join a great cause, but only you can explain what your particular cause is, I cannot infer it without your help.</p>",
        "id": 525947390,
        "sender_full_name": "Ignat Insarov",
        "timestamp": 1750957318
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"583446\">Ignat Insarov</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Returning.20a.20medal.2C.20freeing.20a.20people/near/525947390\">said</a>:</p>\n<blockquote>\n<p>The point is not to take photographs on the background of smoking ruins. The point is to understand whom you are talking about.</p>\n</blockquote>\n<p>The idea that one has to visit a place in order to understand what is happening there or as a prerequisite to taking action in support of people in that place, is outrageous. Ahead of anything that I personally might have experienced, do you expect me to believe that the politicians whom I've been protesting against have gone to the lengths you're demanding?</p>\n<blockquote>\n<p>Waving any particular flag ... is a behaviour altogether disjoint from any standing up for anyone who is being murdered and starved.</p>\n</blockquote>\n<p>If this were true, those flags wouldn't be banned in many places.</p>\n<blockquote>\n<p>If you want to support either justice or mercy in Israel, Palestine ...  your first step is to physically put your body at that location. If you cannot do that, send some trusted friends and admit that you personally failed at the first step...</p>\n</blockquote>\n<p>Did you miss the Freedom Flotilla doing exactly what you're suggesting and getting illegally detained by the IDF in international waters? Or the thousands who tried to travel to Gaza through Egypt who were obstructed by the Egyptian authorities?<br>\nThe release of the former being negotiated quickly was largely due to public pressure expressed through mass protests.</p>\n<blockquote>\n<p>And I am not talking about any nuance. I am talking about facing concrete reality with your physical face.</p>\n</blockquote>\n<p>It's nice that you imagine everyone to be sufficiently wealthy that it's reasonable in your mind to demand that they travel to every corner of the planet to be sufficiently worldly to take a position on current events, but that's simply not realistic. Fortunately for citizens of the world, your unreasonable standards for what constitutes substantive action don't align with reality either. Protest works. It takes time and energy, it's slow to be rewarded, but every advance in the rights of the marginalised in the past century is attributable to it.</p>\n<blockquote>\n<p>You say that public support for justice can be expressed by supporting the people of Palestine and sanctioning the state of Israel. What relation does either Palestine or Israel have to any arrest warrants?</p>\n</blockquote>\n<p>This is a troll question (to be honest it all reads as trolling) but since you pretend not to know: the arrest warrant is on charges of war crimes against Palestinians in Gaza. The political will to arrest Netanyahu does not exist in Israel. The rights of Palestinians in the occupied territory are so restricted that they do not have the power to arrest Netanyahu. Only external forces have any possibility of enforcing that warrant.</p>\n<blockquote>\n<p>I am ready and willing to join a great cause, but only you can explain what your particular cause is, I cannot infer it without your help.</p>\n</blockquote>\n<p>That's great news. I want to see the heads of states in the global north fulfilling their responsibility to enforce international law, and specifically to apply all diplomatic and political methods at their disposal to end the genocide in Gaza and hold those responsible furniture accountable. They are currently not doing so. It has long been the case that allies of Israel have overlooked the state's transgressions of international law because them doing so is contingent on there being the political will (i.e. public support) within the countries they represent for such actions. However, unlike in previous decades, polls indicate that Israel no longer has majority support of the public in countries such as the UK, France and the US, so that these leaders are also failing their democratic responsibilities.<br>\nAs citizens of those countries, it in turn falls to us to use all political and social tools at our disposal to pressure our leaders and representatives to fulfill their responsibilities. <br>\nThere is more, but text walls have limited impact; perhaps I'll elaborate tomorrow.</p>",
        "id": 525989945,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1750978474
    },
    {
        "content": "<p>So you feel outrage. Then feel outrage for some time, then calm down and think about it. How can you help someone if you have no idea who that person is, what they want, what they feel? So you want to help the people in Palestine. You think they are like you. And in some ways they are. But in other ways they are deeply and widely unlike you. Your attempts at help will miss the mark. You cannot even achieve peace and harmony between yourself and me, and we are far more alike than you and an average person in Palestine.</p>\n<p>I do not imagine everyone sufficiently wealthy to travel everywhere in the world. <em>(Although it is not at all expensive to travel if you are young and energetic.)</em> But I do imagine you sufficiently wealthy to afford a plane ticket to Israel. If that does not work, try Jordan — a lot of people of Palestinian origin live there.</p>\n<p>I do not pretend that I do not know what the arrest warrant is about. What I am asking is what you expect to happen. Do you expect to make the judicial system of Israel or Palestine to execute this warrant? No — as you say, there is no reason to expect this to happen. I also think so. So we agree that these arrest warrants are, for now, purely decorative. I shall go as far as to say the whole system of international law is, for now, purely decorative. Justice is not coming this way.</p>\n<p>I said in my first message that it seems to me a better approach to try and understand the feelings of the collective identities in question towards one another. I allow that your course of action can result in change in your local system of government, but I do not believe that you are helping achieve lasting peace in remote locations you have no idea about. The war in Israel is not an accidental event that you can cancel.</p>\n<p>The desire of my heart is lasting peace. I want to walk all the way from Beirut, to Damascus, to Jerusalem, everywhere. I do not see how your attempts at manipulation of the government of France can help that. I think you have no idea how to achieve lasting peace. I think you do not even have any idea why there is no peace right now. This is the only thought I want to transfer to you: that you should realize you have no idea about the war in Israel and it befits you to stay humble until you go there yourself, stay for a while and learn.</p>\n<p>All I ask is that you feel outrage for some time, then calm down and think.</p>",
        "id": 526021008,
        "sender_full_name": "Ignat Insarov",
        "timestamp": 1751006330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"583446\">Ignat Insarov</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Returning.20a.20medal.2C.20freeing.20a.20people/near/526021008\">said</a>:</p>\n<blockquote>\n<p>So you want to help the people in Palestine. You think they are like you. And in some ways they are. But in other ways they are deeply and widely unlike you. Your attempts at help will miss the mark.</p>\n</blockquote>\n<p>One way I can be certain that they are like me is that they need access to food, shelter and medicine, which the government of Israel is currently denying them. While I hope we can secure their freedom, I act in the first instance for their survival.<br>\nInternational political pressure ended Apartheid in South Africa. There is reason to believe that this can work. If you have any alternatives I'm missing that don't involve contributing to Israel's economy through tourism, I would love to hear them.</p>",
        "id": 526060393,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1751022267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> has marked this topic as resolved.</p>",
        "id": 526063309,
        "sender_full_name": "Notification Bot",
        "timestamp": 1751023459
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"583446\">Ignat Insarov</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Returning.20a.20medal.2C.20freeing.20a.20people/near/526021008\">said</a>:</p>\n<blockquote>\n<p>I allow that your course of action can result in change in your local system of government, but I do not believe that you are helping achieve lasting peace in remote locations you have no idea about.</p>\n</blockquote>\n<p>France is the second biggest exporter of arms outside the US. Many weapons and components are sold to Israel by France. The government of France has the authority to prevent those exports. Thus far it has fallen to workers at shipyards (for instance) to act in their stead by refusing to load them onto ships. Pressure on one government can have a meaningful impact on another's ability to wage war.</p>",
        "id": 526063509,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1751023559
    }
]