[
    {
        "content": "<p>I will just open this as a space for those who would like to continue discussing points touched during the <a href=\"#narrow/stream/229141-community.3A-events/topic/ACT.202025/near/521758607\">ACT community action meeting</a> kindly chaired by <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>.</p>",
        "id": 522165320,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1748966962
    },
    {
        "content": "<p>One point I would like to make re: the discussion on online vs in person accessibility.</p>\n<p>In conferences with a proceedings route, there is a different incentive kicking in, where those who submit for publication may both be less interested in in-person participation, and at the same time barriers (such as requiring in-person participation) can be more costly to one's career. I think this point is widely recognised, and that is why even at ACT 2025 which is as in-person as it gets, the CfP offered the possibility to submit for proceedings without guaranteeing physical participation.</p>\n<p>On the other hand, with \"informal\" events such as SYCO which typically have in-person speakers (while livestreamed), in my experience there isn't such a problem with the barrier to participation because missing out on one event is not seen as particularly costly.</p>",
        "id": 522167846,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1748967765
    },
    {
        "content": "<p>I think the pressure of going up to the front of a room in order to ask a question during that session is yet another reason in support of hybrid participation! <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 522168296,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748967899
    },
    {
        "content": "<p>Of course, ACT also has contributed talks.</p>\n<p>Perhaps we could start by acknowledging that these two \"parts\" are different, and try to strike a creative balance between their different requirements.</p>\n<p>I remember that in the covid heyday, there was at least some discussion of some more exotic conference formats.<br>\nOne such format may be</p>\n<ul>\n<li>\"fully hybrid\" online-centred plenary sessions for proceedings talks, removing any expectation of in-person participation for those (while leaving it as an option),</li>\n<li>together with 2+ in-person-centric \"local chapters\" for non-proceedings, at least one in North America and one in Europe—perhaps so that the \"plenary\" is in the morning in America and the afternoon in Europe, while the American local session is in the afternoon and the European local session is in the morning.</li>\n</ul>",
        "id": 522169437,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1748968251
    },
    {
        "content": "<p>A topic that I didn't have the chance to bring up in the session: joint calls for funding. Do we have a resource that helps people <strong>find sources of funding and apply to them</strong>? I especially mean projects at a scale of more than one individual: national or international funding that can create PhD and postdoc positions. The postdoc crisis is only getting worse, so if we're going to sustain opportunities for category theorists, we need to create the resources to open positions for them!</p>",
        "id": 522357684,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1749043384
    },
    {
        "content": "<p>I don't think we have such a resource.  There's a lot of collective wisdom about how category theorists can apply funding - but not, as far as I know, a very good system for aggregating it and making it easily available.</p>",
        "id": 522464052,
        "sender_full_name": "John Baez",
        "timestamp": 1749077126
    },
    {
        "content": "<p>Such funding advice is extremely country/region dependent. Most if not all of the advice for funding (and job) applications I found online was for the US and as a result useless to me here in Australia. The US works very differently to the EU, anyone outside those places might as well be operating in a parallel universe</p>",
        "id": 522485984,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1749090944
    },
    {
        "content": "<p>All the more reason for us to build a resource to aggregate this information. <br>\nSpeaking as a topos theorists, it can be very convenient to have detailed information about parallel universes so that they can be compared and contrasted with our own universe. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 522630607,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1749140817
    },
    {
        "content": "<p>And speaking as a category theorist: I just jumped from one universe to another!   So it's good to know about multiple universes.</p>",
        "id": 522637744,
        "sender_full_name": "John Baez",
        "timestamp": 1749143446
    },
    {
        "content": "<p>Here are the minutes from the meeting on Tuesday!<br>\n<a href=\"/user_uploads/21317/O9-rPmFDBHlcwUJYY5k1HFuk/03_06-ACT-Community-Meeting.pdf\">03_06 ACT Community Meeting.pdf</a></p>",
        "id": 522734569,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1749200419
    },
    {
        "content": "<p>Thanks for sharing the meeting minutes! It is encouraging to me to see the community discussing these topics.</p>\n<p>Upon reflection, one idea stands out to me. One of the participants indicated that one of the goals of in-person conferences is to help spark a variety of conversation between participants. I agree this is important! In that spirit, might there perhaps be some ways to further this goal in ways that have a higher degree of accessibility?</p>",
        "id": 522808793,
        "sender_full_name": "David Egolf",
        "timestamp": 1749226441
    },
    {
        "content": "<p>For example, I could imagine an online meeting with the explicit goal of creating a space for a variety of kinds of conversation. This would be different than a virtual meeting focused on a specific talk, but I suspect having a theme would still be helpful. Breakout rooms could be used to facilitate discussion in smaller groups on specific topics.</p>",
        "id": 522808834,
        "sender_full_name": "David Egolf",
        "timestamp": 1749226457
    },
    {
        "content": "<p>I also wanted to note the following, speaking from my experience of attending several in-person medical imaging conferences: In my experience, an in-person conference structure by itself does not automatically lead to substantial or diverse conversations between all researchers. As a very junior researcher, I simply didn't know who to talk to, or where the more wide-ranging conversations were taking place. I mostly gave my talk or presented my poster, and talked to other people at their posters. It did not feel like I had \"diverse\" conversations with other researchers.</p>",
        "id": 522810703,
        "sender_full_name": "David Egolf",
        "timestamp": 1749227199
    },
    {
        "content": "<p>So it seems to me that there is probably at least one other necessary ingredient beyond \"being in person\" for the production of diverse conversations not narrowly focused on a given poster or talk. It might be helpful to reflect as to what other ingredients might be involved, and whether these can potentially be intentionally created in online contexts.</p>",
        "id": 522810711,
        "sender_full_name": "David Egolf",
        "timestamp": 1749227202
    },
    {
        "content": "<p>One last comment: People attending conferences often do so as part of their participation with longer-term structures. For example, people present research that they have been working on, often in connection with a lab formally established at a university. People may also have longer term research goals, and talking to others about those can be helpful.</p>\n<p>So, if one wishes to expand the scope of people engaging with the community in conference-like settings (possibly online), it may be worth considering this: What longer term structures can be created in a more accessible way? For example, someone unable to be physically present at a conference may struggle to be physically present at a university as well - but they may still be interested in doing and presenting research work.</p>",
        "id": 522813359,
        "sender_full_name": "David Egolf",
        "timestamp": 1749228126
    },
    {
        "content": "<p>I do agree with your sentiment, and I was actually wondering whether we should be serious about sparking conversations at conferences such as ACT.</p>\n<p>Borrowing from other contexts, here’s an idea I had: maybe it could be interesting to dedicate some time (one afternoon?) of the conference to discussion groups on research topics raised by participants.</p>\n<p>(To those of you in the UK, yes, you know where I got the idea from).</p>\n<p>As I’m not part of the ACT organizing committee, I’m just putting this out there. But following Spivak’s philosophy: as soon as I know where I’ll be next year, I’d be happy to volunteer to help organize these sessions, if there's interest.</p>",
        "id": 522968853,
        "sender_full_name": "Antonio Lorenzin",
        "timestamp": 1749378267
    },
    {
        "content": "<p>By the way, the first couple ACTs were accompanied by reasonably lively activity here on this Zulip.   I'm sad that this has decreased.</p>",
        "id": 522974609,
        "sender_full_name": "John Baez",
        "timestamp": 1749385405
    }
]