[
    {
        "content": "<p>Category theory is often applied to programming methodologies that are quite generally applicable, so they will be applied to warfare as well as other things.</p>",
        "id": 342481931,
        "sender_full_name": "John Baez",
        "timestamp": 1679035777
    },
    {
        "content": "<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>",
        "id": 342486273,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679037847
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"389450\">Keith Elliott Eugene Mathew Peterson</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/Applied.20Categories.20and.20War/near/342478564\">said</a>:</p>\n<blockquote>\n<p>A while back, there was a discussion about the ethics of accepting funding from military sources. Although, not strictly brought into that discussion, are there military applications of category theory? If so what might they be? Are those methods strictly to increase lethal engagement, or could they also be used in so-called \"hybrid warfare\"? Could someone using the methods of applied category theory cause untold amounts of suffering? And is it possible that research in the area could inadvertently cause the suffering of others? Could there be a categorical arms race between nations? Is even asking these questions moral and/or ethical? Have we opened Pandora's box? </p>\n<p>It feels to me like the questions I'm asking are a lot like those asked of \"the bomb\". But I also could be overthinking things...</p>\n</blockquote>\n<p>Lol, tell me you want to trigger an online brawl without telling me you want to trigger an online brawl. My only suggestion is to move this discussion somewhere else. It will be ugly and I'd like not having to unsubscribe from this stream too, lol</p>",
        "id": 342553161,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1679057820
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/Applied.20Categories.20and.20War/near/342553161\">said</a>:</p>\n<blockquote>\n<p>Lol, tell me you want to trigger an online brawl without telling me you want to trigger an online brawl. My only suggestion is to move this discussion somewhere else. It will be ugly and I'd like not having to unsubscribe from this stream too, lol</p>\n</blockquote>\n<p>Yes please move this [rolls up sleeves]</p>",
        "id": 342574685,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1679062759
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"389450\">Keith Elliott Eugene Mathew Peterson</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/Applied.20Categories.20and.20War/near/342507744\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/Applied.20Categories.20and.20War/near/342481931\">said</a>:</p>\n<blockquote>\n<p>Category theory is often applied to programming methodologies that are quite generally applicable, so they will be applied to warfare as well as other things.</p>\n</blockquote>\n<p>I mean, yeah, but that's kind of a cheap shot. I was thinking more about data integration and control, such as the focus of DARPA's CASCADE program. Though, I'm sure there are many more potential applications outside my knowledge and imagination.</p>\n</blockquote>\n<p>Sorry, I was going to say more but I got distracted.  I was going to continue and say that if category theorists help the military with specific projects like CASCADE they will be helping develop specifically <em>military</em> applications of category theory.  This is why I quit working on CASCADE: they began the program using an example of organizing search and rescue missions in a yacht race in the Caribbean, but then it changed to more clearly military applications.  </p>\n<p>If category theorists work with the military it will also tend to help keep their military ahead of competing militaries, and civilians, in the development of generally applicable tools.</p>\n<p>There's a lot more to say but I'm still busy!</p>",
        "id": 342634028,
        "sender_full_name": "John Baez",
        "timestamp": 1679076254
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-practice.3A-applied-ct/topic/Applied.20Categories.20and.20War\">#practice: applied ct &gt; Applied Categories and War</a> by <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span>.</p>",
        "id": 342634291,
        "sender_full_name": "Notification Bot",
        "timestamp": 1679076332
    },
    {
        "content": "<p>For example, I could talk about using operads to help develop networks of communicating drones.  There are probably people doing this now.</p>",
        "id": 342635297,
        "sender_full_name": "John Baez",
        "timestamp": 1679076583
    },
    {
        "content": "<p>But this is just one of many military applications of category theory and other math, and I'm not an expert on them!</p>",
        "id": 342641845,
        "sender_full_name": "John Baez",
        "timestamp": 1679078536
    },
    {
        "content": "<p>Anyway, to these questions:</p>\n<blockquote>\n<p>Could someone using the methods of applied category theory cause untold amounts of suffering? And is it possible that research in the area could inadvertently cause the suffering of others? Could there be a categorical arms race between nations? Is even asking these questions moral and/or ethical? Have we opened Pandora's box? </p>\n</blockquote>\n<p>The Pandora's box has been opened, and it's called \"science, technology and mathematics\".    It can <br>\ncause untold amounts of suffering - or good.  Research in these areas can inadvertently cause immense suffering.   There is an arms race between nations in all areas of science, technology and mathematics.</p>\n<p>Category theory is part of this, and I don't think it can be cleanly separated out.   That is, if everyone doing category theory quit now, the effects would be rather subtle.    As people never tire of telling category theorists, almost anything you can do with category theory can also be done without it.  The difference is mainly that with category theory it's gets done in a clearer, more generalizable and less error-prone way.</p>",
        "id": 342642452,
        "sender_full_name": "John Baez",
        "timestamp": 1679078756
    },
    {
        "content": "<p>The military will eventually - and often quite promptly - use any sort of applied math that anyone comes up with.   So you can decide this is fine, or that it's unavoidable, and keep working on applied category theory... or avoid working on applied category theory, or avoid working on <em>explicitly military</em> applications of category theory, or for that matter <em>embrace</em> explicitly military applications of category theory: all these are self-consistent positions that people take.</p>\n<p>Here's my personal position: I want to pursue applications of category theory to human health, climate change, etc., because  I can actually make a difference there, and perhaps a good difference.  These fields may otherwise be a bit slow in adopting categorical methods.</p>",
        "id": 342644742,
        "sender_full_name": "John Baez",
        "timestamp": 1679079520
    },
    {
        "content": "<p>That's why I'm working on categories for epidemiological modeling, and the Mathematics for Humanity project.   For details try this:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2023/03/09/azimuth-project-news-2/\">Azimuth News</a>.</li>\n</ul>",
        "id": 342645137,
        "sender_full_name": "John Baez",
        "timestamp": 1679079645
    },
    {
        "content": "<p>OK so here is a <em>specifically</em> military thing that some folks have been interested in from the PoV of CT: <a href=\"https://www.google.com/search?q=mosaic+warfare\">https://www.google.com/search?q=mosaic+warfare</a></p>",
        "id": 342648678,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1679080843
    },
    {
        "content": "<p>About five years ago I was thinking of this sort of stuff in terms of three mathematical keys that I discussed publicly at the time: CT (for compositionality), topology (and some global geometry, for global properties), and statistical physics (for emergent properties). Imagine a bunch of gizmos that the military wants to coordinate. You might want to model each as a sensor, actuator, and interface. That's a 2-simplex. You might glue interfaces and maybe constrain actuators. Now you're making a simplicial set. There might be some function over local groups of gizmos. Now you have a local section in a sheaf. You might want to engineer a behavior under an ensemble of environmental conditions. Now you're doing statistical physics. Finally you might want to assemble subsystems or groups into systems or teams, or you might want to fuse data or compose various protocols. Now you're doing CT.</p>",
        "id": 342651240,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1679081716
    },
    {
        "content": "<p>I'll quote from <a href=\"https://arxiv.org/abs/1904.04869v1\">https://arxiv.org/abs/1904.04869v1</a>: \"operadic formulations or realizations of data structures for multirobot systems such as the one sketched here are especially desirable because they hold the promise of engineering distinct functionalities in a coherent way. For example, detailed missions can be encoded using flowgraphs [19], constraints can be encoded using weighted maximum satisfiability and/or linear temporal logic formulas, teams can be encoded using simplicial sets [17], etc., and each of these data structures has an associated notion of operad.\"</p>",
        "id": 342652161,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1679082079
    },
    {
        "content": "<p>From <a href=\"https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule\">https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule</a>:</p>\n<p><em>On the phone, Musk said that he was looking at his laptop and could see “the entire war unfolding” through a map of Starlink activity. “This was, like, three minutes before he said, ‘Well, I had this great conversation with Putin,’ ” the senior defense official told me. “And we were, like, ‘Oh, dear, this is not good.’ ” Musk told Kahl that the vivid illustration of how technology he had designed for peaceful ends was being used to wage war gave him pause.</em></p>\n<p>I would guess that quite a few of Starlink's developers were distressed by the prospects of <em>not</em> using it to wage war. Certainly I would have been distressed in such a position.</p>",
        "id": 386452928,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692643237
    },
    {
        "content": "<p><em>Musk’s sympathies appeared to be manifesting on the battlefield. One day, Ukrainian forces advancing into contested areas in the south found themselves suddenly unable to communicate. “We were very close to the front line,” Mykola, the signal-corps soldier, told me. “We crossed this border and the Starlink stopped working.” The consequences were immediate. “Communications became dead, units were isolated. When you’re on offense, especially for commanders, you need a constant stream of information from battalions. Commanders had to drive to the battlefield to be in radio range, risking themselves,” Mykola said. “It was chaos.” Ukrainian expats who had raised funds for the Starlink units began receiving frantic calls. The tech executive recalls a Ukrainian military official telling him, “We need Elon now.” “How now?” he replied. “Like fucking now,” the official said. “People are dying.” Another Ukrainian involved told me that he was “awoken by a dozen calls saying they’d lost connectivity and had to retreat.” The Financial Times reported that outages affected units in Kherson, Zaporizhzhia, Kharkiv, Donetsk, and Luhansk. American and Ukrainian officials told me they believed that SpaceX had cut the connectivity via geofencing, cordoning off areas of access.</em></p>",
        "id": 386453235,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692643345
    },
    {
        "content": "<p>Imagine the second Chushi Gangdruk corp and His Holiness finally made it to the border to take back Tibet and then the Internet cut off (China is also geofenced by Elon because apparently the Nepofactory Shanghai is just so good)</p>",
        "id": 386502952,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1692667715
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"623712\">Hypatia du Bois-Marie</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/386502952\">said</a>:</p>\n<blockquote>\n<p>Imagine the second Chushi Gangdruk corp and His Holiness finally made it to the border to take back Tibet and then the Internet cut off (China is also geofenced by Elon because apparently the Nepofactory Shanghai is just so good)</p>\n</blockquote>\n<p>Well like <a href=\"https://www.airandspaceforces.com/read-full-memo-from-amc-gen-mike-minihan/\">the commander of Air Mobility Command</a> I would think Taiwan circa 2025 is a more likely near term scenario</p>",
        "id": 386590454,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692705190
    },
    {
        "content": "<p>Is this discussion off-topic or has category theory made it into low earth orbit while maintaining a low profile?</p>",
        "id": 386615917,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1692712816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> Are you suggesting that you want connections in this discussion to be between war and category theory per se versus just to math and tech that uses math? In that even you may not be aware that folks at NASA and at various universities are doing all manner of category theory as part of a delay-tolerant networking effort involving Starlink, see e.g., <a href=\"https://www.youtube.com/watch?v=0H_Rtqw2RqM\">https://www.youtube.com/watch?v=0H_Rtqw2RqM</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"0H_Rtqw2RqM\" href=\"https://www.youtube.com/watch?v=0H_Rtqw2RqM\"><img src=\"https://uploads.zulipusercontent.net/21b5ea8d62fa8e101036b5960baa136f58fdc272/68747470733a2f2f692e7974696d672e636f6d2f76692f30485f527471773252714d2f64656661756c742e6a7067\"></a></div>",
        "id": 386620749,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692713975
    },
    {
        "content": "<p><a href=\"https://www.nature.com/articles/478309a\">Reason aligns with nonviolence.</a>  Be that as it may, given that there is war, we have a situation that is perceived differently by the warring armies, but there seems to be a glimmer of hope (see Professor F. William Lawvere's philosophical explanation in <a href=\"https://github.com/mattearnshaw/lawvere/blob/master/pdfs/1972-perugia-lecture-notes.pdf\">Perugia Notes</a>, pp. 127-129), albeit colored in sadness for all those at war invariably loose to the powers (securely situated at safe distant spaces) fueling wars (all of which reminds me of an ancient practice, where old kings who could no longer raise a sword would have young people fight and kill one another just for fun/favorite pastime of dilapidated bodies/minds).</p>",
        "id": 386675261,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1692730679
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276695\">Posina Venkata Rayudu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/386675261\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://www.nature.com/articles/478309a\">Reason aligns with nonviolence.</a>  Be that as it may, given that there is war, we have a situation that is perceived differently by the warring armies, but there seems to be a glimmer of hope (see Professor F. William Lawvere's philosophical explanation in <a href=\"https://github.com/mattearnshaw/lawvere/blob/master/pdfs/1972-perugia-lecture-notes.pdf\">Perugia Notes</a>, pp. 127-129), albeit colored in sadness for all those at war invariably loose to the powers (securely situated at safe distant spaces) fueling wars (all of which reminds me of an ancient practice, where old kings who could no longer raise a sword would have young people fight and kill one another just for fun/favorite pastime of dilapidated bodies/minds).</p>\n</blockquote>\n<p>FWIW your first link contains the passage <em>Reason, by itself, can lay out a road map to peace or to war, to tolerance or to persecution, depending on what the reasoner wants.</em> While some might argue for nonviolence no matter what, I have a hard time imagining Jesus Christ himself doing that instead of <a href=\"https://en.wikipedia.org/wiki/Cleansing_of_the_Temple\">flipping over tables and whipping folks</a> when circumstances warranted.</p>",
        "id": 386684518,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692734692
    },
    {
        "content": "<p>Without discounting all that <span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span> added, there is truth (notwithstanding the basic tenet of pragmatist (a' la American ;) epistemology: <a href=\"https://playinmath.wordpress.com/2023/02/08/history-and-philosophy-of-mathematic-reform/\">Truth is what I can get away with</a>), which can lead to <a href=\"https://philpapers.org/rec/POSGST\">peace</a>.</p>",
        "id": 386690126,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1692737292
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342648678\">said</a>:</p>\n<blockquote>\n<p>OK so here is a <em>specifically</em> military thing that some folks have been interested in from the PoV of CT: <a href=\"https://www.google.com/search?q=mosaic+warfare\">https://www.google.com/search?q=mosaic+warfare</a></p>\n</blockquote>\n<p>My intent is not to reinvigorate a debate, just to say that historically a VAST number of technologies funded by governments (not just USA and not just DOD funding elements) have been what is often called \"dual use\". This isn't unique to applications of category theory or math by any means. The discussed CASCADE program is a good example, since the dual use is search and rescue (SAR) but also <em>combat</em> search and rescue (CSAR). Dual use is often merely a change in application context and so very little if anything can be done in practice to avoid contributing to the crossover by those who might be concerned. </p>\n<p>Yes, I would say mosaic is the quintessential <em>compositional</em> force package design concept... so very relevant. For better or worse, there are a ton of possible applications of CT to military theory, doctrine, and practice. For instance, I think some of the constructions in categorical systems theory and cybernetics could be extended to model a more general theory of interacting adversarial systems. Another dual use arises: military (obviously) and competing firms within a marketplace. Not to mention applications to model a more general competition between national power structures (ideas like DIMEFIL) in which a military plays only a marginal (though most visible) role.</p>",
        "id": 386887560,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1692801732
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"612611\">Kyle Wilkinson</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/386887560\">said</a>:</p>\n<blockquote>\n<p>Dual use is often merely a change in application context and so very little if anything can be done in practice to avoid contributing to the crossover by those who might be concerned. </p>\n</blockquote>\n<p>I'll go further: publishing anything that might ever be applied while also hoping to control the outcome is FAFOing. </p>\n<p>One thing DoD has over Silicon Valley is an ability to develop and use ideas privately.</p>",
        "id": 386927312,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692814165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342486273\">said</a>:</p>\n<blockquote>\n<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>\n</blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>",
        "id": 387042006,
        "sender_full_name": "Jade Master",
        "timestamp": 1692873414
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387042006\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342486273\">said</a>:</p>\n<blockquote>\n<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>\n</blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>\n</blockquote>\n<p>Having been in a territory being attacked by an imperial military force just last month, I think you may have that sort of thing confused with the United States.</p>",
        "id": 387069683,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692882388
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/8SakFh4t0L6jlPQgYhKL8_DL/IMG_3096.png\">IMG_3096.png</a><br>\n<a href=\"/user_uploads/21317/EA9QOFqhKiJ0WUDig9fL-rRh/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/8SakFh4t0L6jlPQgYhKL8_DL/IMG_3096.png\" title=\"IMG_3096.png\"><img src=\"/user_uploads/21317/8SakFh4t0L6jlPQgYhKL8_DL/IMG_3096.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/21317/EA9QOFqhKiJ0WUDig9fL-rRh/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/EA9QOFqhKiJ0WUDig9fL-rRh/image.png\"></a></div><p>I took the original when waiting for a train on 8 July at 3AM at <a href=\"https://www.google.com/maps/place/49%C2%B012'04.9%22N+31%C2%B053'36.6%22E/\">https://www.google.com/maps/place/49%C2%B012'04.9%22N+31%C2%B053'36.6%22E/</a></p>\n<p><span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> now if you are gonna tell me again that US is an \"imperial military force\" with a straight face then you definitely know <a href=\"https://www.amazon.com/How-Tankie-Imperialists-Guide-Modern/dp/B0BLYBM37P\">how to tankie</a> with the best of em</p>",
        "id": 387104756,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692890645
    },
    {
        "content": "<p>I'm not interested in arguing with you about this. Was hoping to hear from someone else. Thanks.</p>",
        "id": 387108261,
        "sender_full_name": "Jade Master",
        "timestamp": 1692891340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387042006\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342486273\">said</a>:</p>\n<blockquote>\n<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>\n</blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>\n</blockquote>\n<p>If they want to eliminate a precise leader who appears to live in the same building than you, you prefer that they send special forces to captur him rather than destroying the whole building and kill lot of people. It's the way Ben Laden was captured as long as I understand. That's the kind of operations that the US or european countries know how to do, using lot of work on getting information and highly-trained soldiers with high-tech equipment. Compare this to Russia sending their soldiers to certain death by using low-tech \"human wave attacks\" in Ukrainia. I would prefer being an afghan guy, the US operating in my country, rather than an Ukrainian guy, Russia operating in my country. If they don't even care about the life of their people, they will care  even less about my life.</p>",
        "id": 387112043,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692892337
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387042006\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342486273\">said</a>:</p>\n<blockquote>\n<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>\n</blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>\n</blockquote>\n<p>I recently realized that Zulip allows for muting of threads, which means off-topic (wrt actual category theory math) discussions aren't forced on the larger group. This makes it much easier for me to consider engaging here and there in the fringe threads. That is neither here nor there, just felt like stating it.</p>\n<p>I will see if I can briefly offer a satisfactory response through the lens of nuclear deterrence terminology. There is a notion of countervalue and counterforce operations in nuclear deployment. There is no reason the terms can't extend to conventional munition deployment. </p>\n<p>In counterforce, strikes are limited to military targets. In countervalue, civilian populace and infrastructure are targeted. One goal of counterforce is to intentionally limit civilian impacts (as strange as it may sound given the nuclear context!). The US broadly applies this counterforce idea... with many, <em>many</em> mistakes no doubt, but generally tries. It's part of the legal framework of US armed conflict: LOAC. [Edit: I should say clearly this has not always been the case in the US, especially with respect to nuclear weapons. Also, I mention US in particular only because that's where I am]</p>\n<p>If I imagine myself to be a civilian in a nation under military action by a force practicing counterforce methods, I would want their targeting methods and munitions to be as precise as possible, limiting collateral effects and thus minimizing risk to me, who may not care one bit about the grand geo-political machinations surrounding the conflict. I think this is getting at what the OP was saying. </p>\n<p>On the other hand, if I am a civilian in a country subject to attack from a countervalue-oriented nation, I would very much like for their military to have highly ineffective weapons so they are less likely to work on me. </p>\n<p>Of course nothing is so simple, and everyone knows these ideas, so often military targets are intentionally placed within civilian areas (even by the \"good guys\"), like a \"human shield\" ploy, leading to difficulty in executing a purely counterforce operation. But one can still imagine the \"ideal\" scenario, as silly as it may seem to consider idealism in war. I would just say that nations vie for interests, and it's hard to avoid conflict in all cases, so one should hope that those responsible for carrying it out study and understand it as formally as possible.</p>",
        "id": 387113244,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1692892644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387042006\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342486273\">said</a>:</p>\n<blockquote>\n<p>If the military wants to improve their methods using category theory it doesn't mean that it will cause more suffering. Today they are able to act in a much \"cleaner\" way due to technology and thinking. And it means in particular less collateral damage if they want eg. to eliminate some leader of a terrorist organization. I think there is no ethical problem with asking these questions. I don't see how asking questions could be unethical.</p>\n</blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>\n</blockquote>\n<p>Sorry, I didn't answer the question. If I'm attacked by an imperial military force... Hmm... Again I prefer that they kill or capture all the military of my country and not me. Or better, that they destroy all the military equipment of the army of my country, without killing anybody, or something like this, precise and effective, which I'm sure will not kill me, my family and my friends.</p>",
        "id": 387121094,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692894989
    },
    {
        "content": "<p>Something good will be for example that they take the control of the energy sources, like fuel and electricity, or that they make all electronical devices innefective by making explode a nuclear bomb very high in the sky (I heard that this thing can make all printed circuit boards innefective? ) or that they hack the internet and the bank system of my country... I don't know. Something that doesn't kill too much people, by making use of thinking and technology.</p>",
        "id": 387122341,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692895406
    },
    {
        "content": "<p>Sorry, it was still not the question. Making weapons more effective is just a small part of how you can use category theory for instance in the army. I don't think that this is the main thing that interest military today. We already know how to make guns and bombs that do what they are conceived for.</p>",
        "id": 387123462,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692895770
    },
    {
        "content": "<p>I guess they will use category theory for different questions than how to improve weapons.</p>",
        "id": 387124007,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692895937
    },
    {
        "content": "<p>Thinking to war only as a question of weapons is clearly insufficient to get the full picture.</p>",
        "id": 387124379,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692896073
    },
    {
        "content": "<p>Yall may want to look at DoD's \"civilian harm mitigation and response action plan\"</p>",
        "id": 387125203,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1692896361
    },
    {
        "content": "<p>Yeah, I think lots of people here have a very ethereal and out of this world vision of war and that's a good read to go back in our reality.</p>",
        "id": 387125998,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1692896611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/386452928\">said</a>:</p>\n<blockquote>\n<p>I would guess that quite a few of Starlink's developers were distressed by the prospects of <em>not</em> using it to wage war. Certainly I would have been distressed in such a position.</p>\n</blockquote>\n<p>Per <a href=\"https://www.cnn.com/2023/09/07/politics/elon-musk-biography-walter-isaacson-ukraine-starlink/index.html\">https://www.cnn.com/2023/09/07/politics/elon-musk-biography-walter-isaacson-ukraine-starlink/index.html</a> <em>Elon Musk secretly ordered his engineers to turn off his company’s Starlink satellite communications network near the Crimean coast last year to disrupt a Ukrainian sneak attack on the Russian naval fleet.</em> </p>\n<p>This act of disabling technology that CT has been applied to benefited genocidaires.</p>",
        "id": 389649238,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694090516
    },
    {
        "content": "<p><em>“How am I in this war?” Musk asks Isaacson. “Starlink was not meant to be involved in wars. It was so people can watch Netflix and chill and get online for school and do good peaceful things, not drone strikes.”</em></p>",
        "id": 389649855,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694090694
    },
    {
        "content": "<p><em>Ukraine did want to press forward last year, before the fortifications were built.  It lacked the necessary weapons, and Elon Musk chose to cut Ukraine off from communications.  That move likely extended the war. Because Musk’s decision was based on his internalization of Russian propaganda about nuclear war, and was accompanied by his repetition of that propaganda, he made a nuclear war more likely.  If powerful men convey the message that just talking about nuclear war is enough to win conventional wars, then we will have more countries with nuclear weapons and more conventional wars that can escalate into nuclear ones. Ukraine has been resistant to this line of Russian fearmongering, fortunately for us all.</em></p>\n<p><a href=\"https://snyder.substack.com/p/the-state-of-the-war?r=f9j4c&amp;utm_campaign=post&amp;utm_medium=web\">https://snyder.substack.com/p/the-state-of-the-war?r=f9j4c&amp;utm_campaign=post&amp;utm_medium=web</a></p>",
        "id": 389788271,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694136427
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/389649855\">said</a>:</p>\n<blockquote>\n<p><em>“How am I in this war?” Musk asks Isaacson. “Starlink was not meant to be involved in wars. It was so people can watch Netflix and chill and get online for school and do good peaceful things, not drone strikes.”</em></p>\n</blockquote>\n<p>Funny those are all non-existent in China. When he visited China, did he seriously just went to the propaganda villages and nowhere else? Sigh...</p>\n<p>To remind y'all that it is literally if you don't support us, Ukraine, Taiwan, or dissidents in Hong Kong, you are supporting them.</p>",
        "id": 389799463,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1694142745
    },
    {
        "content": "<p>PS. I was archiving results of Chinese mathematicians who was slaughtered during the cultural revolution the other day; this is in the thesis of <a href=\"https://en.wikipedia.org/wiki/Xiong_Qinglai\">https://en.wikipedia.org/wiki/Xiong_Qinglai</a>:</p>\n<p><a href=\"/user_uploads/21317/IewztpOz21Zv9yNrW1kTP7NZ/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/IewztpOz21Zv9yNrW1kTP7NZ/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/IewztpOz21Zv9yNrW1kTP7NZ/image.png\"></a></div>",
        "id": 389799669,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1694142866
    },
    {
        "content": "<p>The context was some colleagues was talking about the revoking security clearance scene after watching Oppenheimer with comparison with our cultural revolution:</p>\n<blockquote>\n<p>The imagination of US people is indeed limited.<br>\nRevoking some security clearance and expulsion from the project to a well-known university are enough to make the entire academic community mad?<br>\nWith the security clearance there is even an inspection committee, and Oppenheimer even has an attorney?<br>\nThe attorney argued these procedures are not legal, not a fair fight, like being beaten up, with injustice?<br>\nAnd the committee even has a two-to-one passage; one of them even wrote a petition of dissent?<br>\nReally, don't even talk about McCarthyism to us; your McCarthyism in our country is just child game.</p>\n</blockquote>\n<p>Chinese mathematicians will never ever forget these; and we can't even if we want to because these persecutions have never gone away in our homeland.</p>",
        "id": 389800464,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1694143316
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387121094\">said</a>:</p>\n<blockquote>\n<p>Sorry, I didn't answer the question. If I'm attacked by an imperial military force... Hmm... Again I prefer that they kill or capture all the military of my country and not me. Or better, that they destroy all the military equipment of the army of my country, without killing anybody, or something like this, precise and effective, which I'm sure will not kill me, my family and my friends.</p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/387042006\">said</a>:</p>\n<blockquote>\n<p>I never understand this argument. Think from the perspective of a person in a territory being attacked by an imperial military force. Why would you want their weapons to be more effective?</p>\n</blockquote>\n<p>Also, this discussion on itself is just preposterous... Watch: <a href=\"https://en.wikipedia.org/wiki/Revolution_of_Our_Times\">https://en.wikipedia.org/wiki/Revolution_of_Our_Times</a>, you never would want to live under occupation.</p>\n<p><strong>You would want your weapons to be more effective</strong>, so that you don't just watch your family and friends just die or be \"disappeared\", so that you have a chance fighting for them, protecting them.</p>",
        "id": 389802140,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1694144323
    },
    {
        "content": "<p>Trust me you would; i've been in that situation multiple times now during my 20 years living in Beijing.</p>",
        "id": 389802607,
        "sender_full_name": "Hypatia du Bois-Marie",
        "timestamp": 1694144585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/389649855\">said</a>:</p>\n<blockquote>\n<p><em>“How am I in this war?” Musk asks Isaacson. “Starlink was not meant to be involved in wars. It was so people can watch Netflix and chill and get online for school and do good peaceful things, not drone strikes.”</em></p>\n</blockquote>\n<p>Starlink went down <em>precisely</em> in step with yesterday's attack on the Black Sea Fleet drydocks that destroyed a Kilo-class submarine and a landing ship, among other Russian naval assets. </p>\n<p><a href=\"/user_uploads/21317/uB-Pz1ls9Zp9mlptt_k088oN/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/uB-Pz1ls9Zp9mlptt_k088oN/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/uB-Pz1ls9Zp9mlptt_k088oN/image.png\"></a></div><p>Does anyone here think that this was merely coincidental? </p>\n<p>Following up, does anyone here still think that decrying work that defends democracies while participating in efforts (like let's just say using sheaves or operads to model systems or networks) that might conceivably be applied <em>to anything whatsoever in the real world</em> is actually intellectually defensible?</p>",
        "id": 390723468,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694611660
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390723468\">said</a>:</p>\n<blockquote>\n<p>Following up, does anyone here still think that decrying work that defends democracies while participating in efforts (like let's just say using sheaves or operads to model systems or networks) that might conceivably be applied <em>to anything whatsoever in the real world</em> is actually intellectually defensible?</p>\n</blockquote>\n<p>Equating work that advances military interests with \"work that defends democracies\" is not a concession I'm prepared to accept in the context of earlier debates in this thread. Nonetheless, I maintain that it is not hypocritical to do work which is applicable while decrying or refusing to associate with applications which one finds morally objectionable, given that applications of theoretical work are rarely unique.</p>",
        "id": 390726425,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694612562
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390726425\">said</a>:</p>\n<blockquote>\n<p>Equating work that advances military interests with \"work that defends democracies\" is not a concession I'm prepared to accept in the context of earlier debates in this thread. Nonetheless, I maintain that it is not hypocritical to do work which is applicable while decrying or refusing to associate with applications which one finds morally objectionable, given that applications of theoretical work are rarely unique.</p>\n</blockquote>\n<p>What \"military interests\"? In democracies the electorate decides, however imperfectly, what military capacity to build and when to use it.</p>",
        "id": 390730468,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694613708
    },
    {
        "content": "<p>I'm sure citizens of democracies all over the world have a strong sense of agency over the military organisations in their states... <span aria-label=\"melting face\" class=\"emoji emoji-1fae0\" role=\"img\" title=\"melting face\">:melting_face:</span></p>",
        "id": 390732555,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694614241
    },
    {
        "content": "<p>Do you even understand what a democracy is?</p>",
        "id": 390732733,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694614293
    },
    {
        "content": "<p>I have noticed a common thread in my adversarial interlocutors' reasoning wherein \"the people\" either do not have or ought not to have agency. In democracies the former is patently false, and the latter smells to me of sympathy for authoritarianism.</p>",
        "id": 390732966,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694614349
    },
    {
        "content": "<p>Living in what's considered a democratic state, I certainly feel my agency is pretty thin when it comes to military decisionmaking both in peacetime (assets to build) and in wartime (both when to have it happen and the doctrines to conduct it under).  This is not <em>unique</em> to the military, but rather common to many \"special interests\".  However, it's especially bad because of both the heavy consequences of those decisions and the heavy level of investment of those \"special interests\".</p>",
        "id": 390733954,
        "sender_full_name": "James Deikun",
        "timestamp": 1694614627
    },
    {
        "content": "<p>I also feel like while defensive wars like the current war (mostly) in the Ukraine are sometimes necessary, arms races between major powers only make these wars harder and make the defense of small states more dependent on major powers.  Those of us who are living in places where we are (mostly) free to develop and express our intellectual creativity as we choose shouldn't lend it to authoritarian powers by developing new kinds of weapons systems in peacetime that those authoritarian states can then copy or steal.</p>",
        "id": 390735912,
        "sender_full_name": "James Deikun",
        "timestamp": 1694615161
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390732966\">said</a>:</p>\n<blockquote>\n<p>I have noticed a common thread in my adversarial interlocutors' reasoning wherein \"the people\" either do not have or ought not to have agency. </p>\n</blockquote>\n<p>I feel that the efficacy of various democracies is off-topic, but it's certainly the case that individual agency is by design limited in a democracy (unless you happen to agree with the elected representatives on every policy). Given the infrequency of votes in many democracies, individual agency is mostly exerted by individual actions, such as refusing to engage with organisations that one distrusts.</p>",
        "id": 390736688,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694615376
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390735912\">said</a>:</p>\n<blockquote>\n<p>I also feel like while defensive wars like the current war (mostly) in the Ukraine are sometimes necessary, arms races between major powers only make these wars harder and make the defense of small states more dependent on major powers.  Those of us who are living in places where we are (mostly) free to develop and express our intellectual creativity as we choose shouldn't lend it to authoritarian powers by developing new kinds of weapons systems in peacetime that those authoritarian states can then copy or steal.</p>\n</blockquote>\n<p>Are you saying that people in Ukraine, Taiwan, Israel, and South Korea (among others) should not develop new weapons systems in peacetime because the Russians, Chinese, Iranians, or North Koreans might steal the ideas? Because it sure sounds like that to me.</p>",
        "id": 390736723,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694615388
    },
    {
        "content": "<p>You missed the US from your list there <span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span></p>",
        "id": 390736850,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694615417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390736688\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390732966\">said</a>:</p>\n<blockquote>\n<p>I have noticed a common thread in my adversarial interlocutors' reasoning wherein \"the people\" either do not have or ought not to have agency. </p>\n</blockquote>\n<p>I feel that the efficacy of various democracies is off-topic, but it's certainly the case that individual agency is by design limited in a democracy (unless you happen to agree with the elected representatives on every policy). Given the infrequency of votes in many democracies, individual agency is mostly exerted by individual actions, such as refusing to engage with organisations that one distrusts.</p>\n</blockquote>\n<p>Ridiculous. Refusing to engage is not exertion of agency but abdication of responsibility. Get out there and protest if you really hate something. I do.</p>",
        "id": 390737653,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694615650
    },
    {
        "content": "<p>Let's not pretend that Ukraine, Taiwan, South Korea, or even Israel are democracies on the leading edge of arms races, please.</p>",
        "id": 390737778,
        "sender_full_name": "James Deikun",
        "timestamp": 1694615684
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390736850\">said</a>:</p>\n<blockquote>\n<p>You missed the US from your list there <span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span></p>\n</blockquote>\n<p>Do you think American adversaries are better off stealing weapons systems from the US than having the US not develop them? Because that's not how espionage or reverse engineering or deployment cycles actually work.</p>",
        "id": 390738163,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694615799
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390737778\">said</a>:</p>\n<blockquote>\n<p>Let's not pretend that Ukraine, Taiwan, South Korea, or even Israel are democracies on the leading edge of arms races, please.</p>\n</blockquote>\n<p>Are you kidding? Take a look at the production for <a href=\"https://en.wikipedia.org/wiki/List_of_equipment_of_the_Republic_of_Korea_Army\">https://en.wikipedia.org/wiki/List_of_equipment_of_the_Republic_of_Korea_Army</a></p>",
        "id": 390738859,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694615995
    },
    {
        "content": "<p>And <a href=\"https://en.wikipedia.org/wiki/List_of_equipment_of_the_Israel_Defense_Forces\">https://en.wikipedia.org/wiki/List_of_equipment_of_the_Israel_Defense_Forces</a></p>",
        "id": 390738991,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616025
    },
    {
        "content": "<p>And re: Ukrainian arms development, don't get me started with Hrim short range ballistic missiles, Neptune anti-ship missiles, Bohdana howitzers, Beaver long-range aerial drones, Sea Baby long-range naval drones... all state of the art and developed during the war</p>",
        "id": 390739268,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616107
    },
    {
        "content": "<p>Or are you claiming that these aren't democracies?</p>",
        "id": 390739382,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616129
    },
    {
        "content": "<p>If you think that democracies are confined to Western Europe and Japan, then I have some unsettling news for you: those places don't invest in their military as much because they've outsourced it to the United States. Now I think that's a great deal for America but if you think it's still our initiative after 1991 then I have a <em>Zeitenwende</em> to sell you.</p>",
        "id": 390739694,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616241
    },
    {
        "content": "<p>By <em>constantly</em> developing new weapons systems, the US maintains an advantage over its adversaries in direct combat situations while at the same time making other democracies more dependent on the US for their defense and making it easier for authoritarian countries to suppress their own populations.  The advantage in actual weapons systems never lasts and constantly needs to be renewed because of reverse engineering and espionage.  The advantage in reserve creativity that underlies it never goes away because it's structural, but the US is constantly turning the global treadmill and using this capacity for aggressive force projection rather than strictly defense.</p>",
        "id": 390740429,
        "sender_full_name": "James Deikun",
        "timestamp": 1694616461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390737653\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390736688\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390732966\">said</a>:</p>\n<blockquote>\n<p>I have noticed a common thread in my adversarial interlocutors' reasoning wherein \"the people\" either do not have or ought not to have agency. </p>\n</blockquote>\n<p>I feel that the efficacy of various democracies is off-topic, but it's certainly the case that individual agency is by design limited in a democracy (unless you happen to agree with the elected representatives on every policy). Given the infrequency of votes in many democracies, individual agency is mostly exerted by individual actions, such as refusing to engage with organisations that one distrusts.</p>\n</blockquote>\n<p>Ridiculous. Refusing to engage is not exertion of agency but abdication of responsibility. Get out there and protest if you really hate something. I do.</p>\n</blockquote>\n<p>To be clear I wasn't advocating not voting, I was advocating not working for the military if you are opposed to their applications of your work. Protesting is great too, good call.</p>",
        "id": 390740444,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694616467
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390740429\">said</a>:</p>\n<blockquote>\n<p>By <em>constantly</em> developing new weapons systems, the US maintains an advantage over its adversaries in direct combat situations while at the same time making other democracies more dependent on the US for their defense and making it easier for authoritarian countries to suppress their own populations.  The advantage in actual weapons systems never lasts and constantly needs to be renewed because of reverse engineering and espionage.  The advantage in reserve creativity that underlies it never goes away because it's structural, but the US is constantly turning the global treadmill and using this capacity for aggressive force projection rather than strictly defense.</p>\n</blockquote>\n<p>Let me get this straight: you are claiming that if the US develops fewer weapons systems and does it less frequently, then the world will be safer. Or am I mischaracterizing your position?</p>",
        "id": 390742035,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616927
    },
    {
        "content": "<p>Yes, the Ukrainians developed the Hrim but they didn't invent short-range ballistic missiles, they developed the Neptune but they didn't invent anti-ship missiles.  I haven't confirmed they didn't invent a <em>category</em> of combat drones but they probably didn't and they didn't develop the drones.  There's plenty of creativity that goes into the operational details of a copy of a weapon system--differences in guidance and propulsion systems, in armor design when applicable, in setting up the most effective payload, but you're missing the forest for the trees.  It's the major powers that blaze most trails, and when small states <em>do</em> do it it's almost exclusively in times of active war.</p>",
        "id": 390742038,
        "sender_full_name": "James Deikun",
        "timestamp": 1694616928
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390742038\">said</a>:</p>\n<blockquote>\n<p>Yes, the Ukrainians developed the Hrim but they didn't invent short-range ballistic missiles, they developed the Neptune but they didn't invent anti-ship missiles.  I haven't confirmed they didn't invent a <em>category</em> of combat drones but they probably didn't and they didn't develop the drones.  There's plenty of creativity that goes into the operational details of a copy of a weapon system--differences in guidance and propulsion systems, in armor design when applicable, in setting up the most effective payload, but you're missing the forest for the trees.  It's the major powers that blaze most trails, and when small states <em>do</em> do it it's almost exclusively in times of active war.</p>\n</blockquote>\n<p>Bro the Ukrainians launched the first ballistic missile. It carried Sputnik.</p>",
        "id": 390742254,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694616983
    },
    {
        "content": "<p>If you think that was the Russians then I will be happy to discuss where the Soviet and Russian rocket motor industries diverge.</p>",
        "id": 390742389,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694617029
    },
    {
        "content": "<p>They invented the long-range naval strike drone. It's called the Sea Baby.</p>",
        "id": 390742533,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694617074
    },
    {
        "content": "<p>The US JADC2 comms effort is learning from Ukraine's Delta C2 app.</p>",
        "id": 390742668,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694617105
    },
    {
        "content": "<p>In 1991 Ukraine was the third largest military and nuclear power--larger than China. They made the mistake of not continuing that tradition (at American behest, to our shame) and look where it got them.</p>",
        "id": 390743403,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694617317
    },
    {
        "content": "<p>Ukraine got to its 1991 position as part of the Soviet Union, not as an independent power.  And actively rolling back existing capability, <em>especially</em> nuclear, is not something I support in most circumstances.  The military work I mostly oppose is the <em>most creative</em> work, inventing whole new categories of weapons, new combat doctrines, fundamental new capabilities in sensors and communication, etc.  You need not fear for the <em>existence</em> of your military-industrial complex as long as there are authoritarian states to oppose.</p>",
        "id": 390746322,
        "sender_full_name": "James Deikun",
        "timestamp": 1694618136
    },
    {
        "content": "<p>As to whether the world would be safer if the US refrained from these activities: I'm pretty sure thermonuclear weapons (the H-bomb) weren't invented truly independently by anyone other than the US; the US invented them in peacetime and they were stolen by the Soviets.  The existence of combat drones makes the world less safe by making both asymmetric warfare and fundamental democratic control over the military less effective and any period of time they could have been delayed by would have been welcome.  Fully unmanned weapons platforms currently under development take this even farther.</p>",
        "id": 390747699,
        "sender_full_name": "James Deikun",
        "timestamp": 1694618557
    },
    {
        "content": "<p>I actually agree with everything you just said except the idea that it's somehow wise to stifle creativity. Because other folks won't. That is the true arms race. As mathematicians we are all part of it. We can dodge it for a time, like Leray in his POW camp developing sheaves instead of PDE methods, but the day may come when those sheaves are eventually used for something. And it will probably end up touching warfighting. Necessity is the mother of invention and nothing says necessity like someone threatening you or those you protect.</p>",
        "id": 390749482,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694619077
    },
    {
        "content": "<p>Ask <span class=\"user-mention\" data-user-id=\"277067\">@Tom Leinster</span> if he intended someone like me to pervert his work.</p>",
        "id": 390749896,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694619217
    },
    {
        "content": "<p>Drones and unmanned weapons platforms have been and are a particularly dangerous game, allowing the substitution of industrial capacity for the capacity to replace trained soldiers, forcing a state or area that's being invaded to have to carry out a reverse invasion to deplete the aggressor's capacity to make war.  This is really not good for most states and people that are just trying to mind their own business until threatened and makes things just unilaterally better for aggressors, <em>especially</em> genocidal ones.</p>",
        "id": 390749963,
        "sender_full_name": "James Deikun",
        "timestamp": 1694619241
    },
    {
        "content": "<p>Come up with a way to stop drones! Two of my buddies took a company public that way.</p>",
        "id": 390750132,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694619286
    },
    {
        "content": "<p>Folks like <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> and <span class=\"user-mention\" data-user-id=\"275932\">@Matteo Capucci (he/him)</span> are busy laying the groundwork for folks like me who think about mosaic warfare to enable swarms of drones to work more naturally and easily than they otherwise would, and probably telling themselves that they aren't responsible for enabling me and mine (or say the Chinese and theirs).</p>",
        "id": 390750636,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694619458
    },
    {
        "content": "<p>I think the thing you've been doing with Tom Leinster's work is particularly the sort of thing people in the US shouldn't be doing.  The fact that the Chinese are investing much more heavily in technological espionage than we are is the best evidence that we are doing something wrong here.  We are accelerating military technology ahead of having any good pro-democracy political technologies to deploy in concert with it.  We're not going to make China disappear as a military power, and nor is China going to invade us anytime soon.  They may well invade Taiwan, believing we won't have the stomach to help defend a country we can't even bring ourselves to officially acknowledge, using the technologies they've stolen from us, and hoping to go on to steal the technologies like chip fabs we've exported to Taiwan on top of getting back their oh-so-precious territorial integrity.</p>",
        "id": 390752306,
        "sender_full_name": "James Deikun",
        "timestamp": 1694620004
    },
    {
        "content": "<p>I mostly do cyber work and once started a company aimed at defending American networks from principally Chinese threats, espionage near the front of the list.</p>",
        "id": 390752860,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694620158
    },
    {
        "content": "<p>See for example here: <a href=\"https://eqnets.wordpress.com/2009/12/08/the-chimera-of-cyberdeterrence/\">https://eqnets.wordpress.com/2009/12/08/the-chimera-of-cyberdeterrence/</a></p>",
        "id": 390753527,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694620348
    },
    {
        "content": "<p>I'm not trying to claim everything you've ever done wrt military applications is bad; I think it can even be acceptable sometimes to accept military funding for mathematical work if it's fundamental enough and particularly if you would otherwise accept other funding and do the exact same thing.  But I think it's legitimate to not let military funding draw you into doing work with a direct military application or a dual-use component that you might not otherwise do; <em>especially</em> if you don't understand the scope of the military applications involved; you might even want to let it steer you away.  And if even more people did this, we would have a safer world.  Nobody's saying you can prevent all military use of the work you do, much less the fundamental principles behind it; you can make it incrementally harder and more expensive though, and this is just as legitimate and respectable as engaging in protests.  Maybe it's more so, as methods of elite control in democracies have evolved substantially in the past decades to neutralize the power of protests, but we haven't (yet) developed a means of getting work done without any workers.</p>",
        "id": 390755180,
        "sender_full_name": "James Deikun",
        "timestamp": 1694620894
    },
    {
        "content": "<p>If nobody built weapons we would have a world that is safer against macro threats. <a href=\"https://www.amazon.com/dp/0195188047/\">It would also be far less prosperous</a> and thus far less safe against more common micro threats (e.g., bandits). We would not have the existential risk of nuclear weapons, but that seems like about the only upside of that dichotomy to me. </p>\n<p>Taken to an extreme, I would rather be a human than <a href=\"https://www.youtube.com/watch?v=avjdKTqiVvQ\">a chimp without a bone in 2001</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"avjdKTqiVvQ\" href=\"https://www.youtube.com/watch?v=avjdKTqiVvQ\"><img src=\"https://uploads.zulipusercontent.net/3802820d23c35bb5d992997ed869ecf679b5e681/68747470733a2f2f692e7974696d672e636f6d2f76692f61766a644b5471695676512f64656661756c742e6a7067\"></a></div>",
        "id": 390761666,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694623025
    },
    {
        "content": "<p><a href=\"https://www.amazon.com/dp/0300234090/\">Krepinevich</a> argues that \"militaries that went beyond the bounds of mere innovation to overturn the existing forms of warfare, changing the course of history and the fate of nations\" belong to the states that prosper. Better that democracies prosper than the alternative.</p>",
        "id": 390762330,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694623286
    },
    {
        "content": "<p>I happen to think that mosaic warfare will overturn the existing forms of warfare. Better that compositionality serve democracies in that end than the alternative. So I hope folks like Jules and Matteo keep it up to help enable democratic militaries circa 2040.</p>",
        "id": 390762882,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694623507
    },
    {
        "content": "<p>What exactly do you propose we do with decisive battlefield dominance over (say) the Chinese if we have it?  Invading aggressive authoritarian empires to remove them from the playing field has worked exactly once in modern history (WWII) with those empires having been functioning democracies in living memory, and containment has never had this effect at all, despite the hopes of the 1990s.  If anything democracy has been backsliding in democratic countries.  This is the area that needs all our creative efforts, not creating more nicely-placed explosions at will.</p>",
        "id": 390765790,
        "sender_full_name": "James Deikun",
        "timestamp": 1694624696
    },
    {
        "content": "<p>(And if anything, AI- and drone-enabled warfare is inherently anti-democratic as democracy's primary material role is as a technology for securing legitimacy by trading off some degree of elite control and AI- and drone-enabled warfare decrease the need for legitimacy experienced by the regimes employing them.)</p>",
        "id": 390767303,
        "sender_full_name": "James Deikun",
        "timestamp": 1694625247
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390765790\">said</a>:</p>\n<blockquote>\n<p>What exactly do you propose we do with decisive battlefield dominance over (say) the Chinese if we have it?  </p>\n</blockquote>\n<p>Nothing at all besides convincing them of it, with any luck. Wars are fought because of miscalculations: otherwise you'd just have the Melian dialogue.</p>\n<p>I'm a <em>si vis pacem</em> kind of guy; my current shop's mission statement is to \"deliver technology advantage to enable winning without fighting\" and I am on board with that.</p>",
        "id": 390771996,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694627072
    },
    {
        "content": "<p>But it's out of my hands. At the end of the day I put my faith in democracy and the Constitution. Silly I know.</p>",
        "id": 390772749,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694627350
    },
    {
        "content": "<p>The problem is there is only so far we can advance weapons technology and still have democracy among humans (by any known historical process), and we are treading very close to that line.  There's a clock and we are running it out by trying to stay far enough ahead of everyone to \"win without fighting\" when that \"winning\" doesn't involve anyone changing their long-term goals or behaviours.</p>",
        "id": 390772798,
        "sender_full_name": "James Deikun",
        "timestamp": 1694627372
    },
    {
        "content": "<p>And in fact we are going down the <em>specific paths</em> that run the clock down <em>fastest</em>.</p>",
        "id": 390773339,
        "sender_full_name": "James Deikun",
        "timestamp": 1694627555
    },
    {
        "content": "<p>Tell me a better way that has a snowball's chance in hell and I'll be all ears.</p>",
        "id": 390773751,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694627659
    },
    {
        "content": "<p>To focus on social technologies that make democracy more effective in internal competitions among decision-making processes.  What people were trying to do with \"economic liberalization\" but with methods that actually work rather than believing your own elite's propaganda.  We can also practice this at home and benefit from a strengthened democracy.  Basically to create deliberative, interested-party-involved decision processes that amplify people's intelligence and wisdom rather than diluting them like voting or committeeism.  And then putting them into practice, starting with decisions you could be making on your own.</p>",
        "id": 390775520,
        "sender_full_name": "James Deikun",
        "timestamp": 1694628240
    },
    {
        "content": "<p>OK how do you feel about something like using sheaves and LLMs (by asking an ensemble of questions like \"how consistent is A with B on a scale of 0-10\"?) to ID and automatically tag logical inconsistencies in linked documents like social media or legal briefs?</p>",
        "id": 390776351,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694628507
    },
    {
        "content": "<p>...or wikis in the intelligence community? [sad trombone]</p>",
        "id": 390776775,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694628665
    },
    {
        "content": "<p>And that all sounds great but I doubt it has better than a snowball's chance in hell.</p>",
        "id": 390777130,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694628800
    },
    {
        "content": "<p>I think of something like that as more of a decision support technology that is dual use.  But I think if AI as uninterpretable as LLMs is doing more of the heavy lifting in making decisions than humans then humans are screwed no matter which ones are nominally in charge.</p>",
        "id": 390777156,
        "sender_full_name": "James Deikun",
        "timestamp": 1694628811
    },
    {
        "content": "<p>Statistical physics works fine at going from randomness to interpretability provided you have enough events. Why not the same with LLMs?</p>",
        "id": 390777377,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694628891
    },
    {
        "content": "<p>I have found the results of this sort of Q&amp;A about consistency with LLMs to be pretty encouraging actually.</p>",
        "id": 390777501,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694628949
    },
    {
        "content": "<p>We're explicitly modelling LLM behavior on phenomena we find non-interpretable, as a substitute for interpreting them.  It's sort of the opposite of statistical physics if anything.</p>",
        "id": 390777630,
        "sender_full_name": "James Deikun",
        "timestamp": 1694628983
    },
    {
        "content": "<p>c.f. anecdotes about \"the more linguists we fired the more accurate the model got\"</p>",
        "id": 390777772,
        "sender_full_name": "James Deikun",
        "timestamp": 1694629041
    },
    {
        "content": "<p>Anyway for social decisionmaking you have to not just figure out when people are disagreeing, but have some process (and at least as good as \"fiat by randomly selected dictator\") for synthesizing the two or more viewpoints.  This is where most of the really interesting stuff happens.</p>",
        "id": 390778545,
        "sender_full_name": "James Deikun",
        "timestamp": 1694629265
    },
    {
        "content": "<p>(And TBH I'm not 100% claiming this has a better than a snowball's chance in hell so much as I'm claiming that going on in the current direction has <em>worse</em> than a snowball's chance in hell ...)</p>",
        "id": 390779107,
        "sender_full_name": "James Deikun",
        "timestamp": 1694629462
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390778545\">said</a>:</p>\n<blockquote>\n<p>Anyway for social decisionmaking you have to not just figure out when people are disagreeing, but have some process (and at least as good as \"fiat by randomly selected dictator\") for synthesizing the two or more viewpoints.  This is where most of the really interesting stuff happens.</p>\n</blockquote>\n<p>How about <a href=\"https://arxiv.org/abs/2005.12798\">https://arxiv.org/abs/2005.12798</a></p>",
        "id": 390779706,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694629687
    },
    {
        "content": "<p>Funded by DoD but hey</p>",
        "id": 390779827,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694629745
    },
    {
        "content": "<p>I've seen that one before; analysis like this is useful but it lacks the creativity (and the will; the DoD funding may or may not relate to this <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span>) to investigate how technology could augment social dynamics to be <em>less</em> controllable by stubborn individuals with opinions arbitrarily selected by some outside elite who is \"above the system\".</p>",
        "id": 390781469,
        "sender_full_name": "James Deikun",
        "timestamp": 1694630435
    },
    {
        "content": "<p>But definitely models like this are useful to help in evaluating a decisionmaking mechanism on desiderata like \"will people feel the decision is legitimate even if it goes against their private preference\" and \"does it reliably make use of people's private knowledge or does it degenerate to being controllable by coalitions\".  Part of having a good decisionmaking mechanism is it has to exert some influence over people's preferences but not too <em>much</em>.  But it has to be <em>some</em> both to reduce long-term conflict/polarization and to protect participants against outside influence from more hostile social processes that <em>do</em> affect their preferences.</p>",
        "id": 390782674,
        "sender_full_name": "James Deikun",
        "timestamp": 1694630946
    },
    {
        "content": "<p>Less controllable is conceptually easy in the US. Put a place for appropriations on tax returns. Use digital signatures and differential privacy to track stuff.</p>\n<p>I would say do the same for tax rates but that is more of a game-theoretical challenge, never mind a fiscal one.</p>",
        "id": 390783060,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694631099
    },
    {
        "content": "<p>The fundamental technical things here are basically solved. Now how are you gonna spend your time on tech?</p>",
        "id": 390783192,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694631138
    },
    {
        "content": "<p>I disagree that they are \"basically solved\" (and the weaknesses of opinion diffusion on social networks as a decision mechanism, while they include outside controllability, are hardly limited to that!)  Also if the non-controllability of the social network needs outside enforcement from a compliant sovereign regime it doesn't truly exist.  In order to \"win\" democratic decision making has to be effective at winning internal competitions against the alternatives, not just external ones where it's supported by a sovereign.  For one thing no sovereign in existence would choose to support it, including democratic ones.</p>",
        "id": 390784432,
        "sender_full_name": "James Deikun",
        "timestamp": 1694631618
    },
    {
        "content": "<p>(By the standard of what currently passes for \"democratic\"; decision mechanisms currently employed in democratic states are not efficient or effective enough to pass muster without significant \"steering\" by professionalized and self-interested elite blocs, nor resilient enough to prevent it in any case.)</p>",
        "id": 390785073,
        "sender_full_name": "James Deikun",
        "timestamp": 1694631864
    },
    {
        "content": "<p>One of the fundamental technical challenges of an effective democratic decision mechanism is asymmetric information; often special interests have significantly more information about the subjects of their shared interest than the average member of the general population.  How can we make use of that information, giving the people (whether within the self-interested group or outside) who gather that information fair compensation for doing so, without giving the special interests too much and letting them walk all over everyone else?  Direct democracy as usually implemented tends to lose hold of the information, while representative democracy (through lobbying) overrewards it substantially.  Markets have their own interesting failure mode (\"lemon markets\") for this kind of asymmetric information problem.  Why aren't you using sheaves to work on this?</p>",
        "id": 390786684,
        "sender_full_name": "James Deikun",
        "timestamp": 1694632549
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390784432\">said</a>:</p>\n<blockquote>\n<p>I disagree that they are \"basically solved\" </p>\n</blockquote>\n<p>I mean for the fairly concrete things that I proposed.</p>",
        "id": 390790053,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694633993
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390786684\">said</a>:</p>\n<blockquote>\n<p>Why aren't you using sheaves to work on this?</p>\n</blockquote>\n<p>I might end up paying folks to sheaves to work on the thing I described above. </p>\n<p>I spend my time working on security because I've always seen it as a prerequisite for democracy. And it is far from assured.</p>",
        "id": 390790584,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694634239
    },
    {
        "content": "<p>I guess I see it as the opposite: democracy is a prerequisite for security.  As long as we don't have true democracy, all our important decisions will come down to fights in some form or another.  And nobody can keep winning fights forever.</p>",
        "id": 390791403,
        "sender_full_name": "James Deikun",
        "timestamp": 1694634618
    },
    {
        "content": "<p>(Nor is constantly winning a string of fights exactly what I would describe as \"security\".)</p>",
        "id": 390792854,
        "sender_full_name": "James Deikun",
        "timestamp": 1694635284
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390792854\">said</a>:</p>\n<blockquote>\n<p>(Nor is constantly winning a string of fights exactly what I would describe as \"security\".)</p>\n</blockquote>\n<p>It is when compared to losing fights. And having the luxury not to fight is best.</p>",
        "id": 390794299,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694635863
    },
    {
        "content": "<p>\"Not fighting because everyone knows I'm the strongest\" is just a more comfortable kind of fighting, not an alternative to fighting.  It's still deciding things through strength, with a winner and a loser.  And you still have a risk of losing.</p>",
        "id": 390795490,
        "sender_full_name": "James Deikun",
        "timestamp": 1694636218
    },
    {
        "content": "<p>If a bunch of other people still <em>want</em> to take a crowbar to the back of your head the moment you're not looking, one day you won't be looking and you'll get a crowbar to the back of the head.  In the short term sometimes you need strength, I'm not disputing that.  But in the long term what living by strength usually buys you, is a crowbar to the back of the head.</p>",
        "id": 390796839,
        "sender_full_name": "James Deikun",
        "timestamp": 1694636708
    },
    {
        "content": "<p>What we need in the world is an alternative to nations living by strength, not an ever-increasing ratchet of strength like some kind of cartoon.</p>",
        "id": 390797341,
        "sender_full_name": "James Deikun",
        "timestamp": 1694636891
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390797341\">said</a>:</p>\n<blockquote>\n<p>What we need in the world is an alternative to nations living by strength, not an ever-increasing ratchet of strength like some kind of cartoon.</p>\n</blockquote>\n<p>I would love to get there. I can't make meaningful progress straight in that direction but I am confident that my dot product has the right sign. Hats off to anyone who can achieve a bigger coefficient.</p>",
        "id": 390800146,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694637906
    },
    {
        "content": "<p>Do you believe that the invention of the nuclear bomb was a net positive for humanity?</p>",
        "id": 390810811,
        "sender_full_name": "Jade Master",
        "timestamp": 1694642927
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390810811\">said</a>:</p>\n<blockquote>\n<p>Do you believe that the invention of the nuclear bomb was a net positive for humanity?</p>\n</blockquote>\n<p>Honestly not sure. Counterfactuals are hard (eg, how long until it gets invented anyway? does Cold War turn hot? what happens with Japan, not least if the Soviets claim a zone?) and nuclear power is a net plus on its own merits.</p>\n<p>This is the only case of tech development that I can think of that gives me pause. </p>\n<p>Dunk on me for not saying “no” outright if you like. But I think the idea that nukes never get developed without the Manhattan Project is far fetched at best and I choose not to interpret your question in what I think is an absurd way.</p>",
        "id": 390821060,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694649503
    },
    {
        "content": "<p>I will mention that I thought I was under nuclear attack briefly as a child, when a rocket fuel plant near Vegas blew up and the ceiling tiles in my school were falling as I ducked and covered.</p>",
        "id": 390821736,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1694650002
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390779827\">said</a>:</p>\n<blockquote>\n<p>Funded by DoD but hey</p>\n</blockquote>\n<p>From much earlier parts of this discussion, the majority of research in the US is funded by the DoD in one way or another, and this was a significant point of contention, so the existence of any given piece of research is pretty weak evidence for the virtuousness of the DoD...</p>",
        "id": 390869714,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694676600
    },
    {
        "content": "<p>It's an interesting question whether \"the majority of research in the US\" is funded by the DoD.   </p>\n<p>Total US medical and health research and development investment was $245.1 billion in 2020 - I picked that area because it's big.</p>\n<p>On the other hand, the DoD 2024 budget request includes $145 billion for research, development, test, and evaluation (RDT&amp;E).</p>\n<p>But that's what I was able to look up in one minute, and both those figures leave out a lot.   In  2023, the  DoD had a total budget of $2.04 trillion, which is pretty amazing.  Global investment in the low-carbon energy transition was only $1.1 trillion in 2022!</p>",
        "id": 390914182,
        "sender_full_name": "John Baez",
        "timestamp": 1694692847
    },
    {
        "content": "<p>Very good point. Imagine what we could do if we invested that 2.04 trillion of taxpayer money in the low-carbon energy transition.</p>",
        "id": 390916072,
        "sender_full_name": "Jade Master",
        "timestamp": 1694693474
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390869714\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/390779827\">said</a>:</p>\n<blockquote>\n<p>Funded by DoD but hey</p>\n</blockquote>\n<p>From much earlier parts of this discussion, the majority of research in the US is funded by the DoD in one way or another, and this was a significant point of contention, so the existence of any given piece of research is pretty weak evidence for the virtuousness of the DoD...</p>\n</blockquote>\n<p>I think maybe you meant the majority of math research? I would guess it's probably also true for computer science and physics and maybe a dozen other fields.</p>",
        "id": 390916271,
        "sender_full_name": "Jade Master",
        "timestamp": 1694693545
    },
    {
        "content": "<p>Indeed, I wasn't specific enough, thanks!</p>",
        "id": 391000736,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694717734
    },
    {
        "content": "<p>For the record, neither me nor <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> (afaik) are working on mosaic warfare or are motivated by military applications for that matter.</p>",
        "id": 392316857,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1695301259
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/392316857\">said</a>:</p>\n<blockquote>\n<p>For the record, neither me nor <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> (afaik) are working on mosaic warfare or are motivated by military applications for that matter.</p>\n</blockquote>\n<p>Of course not. But your work is certainly applicable to it. I've had multiple one-on-ones with one of the folks who coined the term.</p>",
        "id": 392334751,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695306908
    },
    {
        "content": "<p>Folks like me, we come along, we see things that are useful, and we use them.</p>",
        "id": 392334907,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695306953
    },
    {
        "content": "<p>Now if you happen to change what you work on then not much is lost for folks like me. Your work is either ready for actual applications of any sort or it isn't.</p>",
        "id": 392335582,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695307157
    },
    {
        "content": "<p>And it's not just Americans thinking about these things. <a href=\"https://doi.org/10.1049/icp.2022.2980\">https://doi.org/10.1049/icp.2022.2980</a></p>",
        "id": 392337300,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695307673
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Applied.20Categories.20and.20War/near/342634028\">said</a>:</p>\n<blockquote>\n<p>This is why I quit working on CASCADE: they began the program using an example of organizing search and rescue missions in a yacht race in the Caribbean</p>\n</blockquote>\n<p>Wait, as a Bajan I'm curious, what yacht race were they using as a case study?</p>",
        "id": 396885430,
        "sender_full_name": "Sean Gloumeau",
        "timestamp": 1697456991
    },
    {
        "content": "<p>Sorry, I forget the name of it - if you know just one famous yacht race disaster in the Caribbean it was probably that one.   I could look it up but it would take a while.</p>",
        "id": 396887190,
        "sender_full_name": "John Baez",
        "timestamp": 1697457632
    },
    {
        "content": "<p>Ahh okay, no idea what it could be. I would never have expected that to be the public motivation of a DoD-funded project though; given my understanding of those kinds of projects as an aeroastro major, there's typically some official PR motive with a universally presumed unspoken motive to apply whatever's worked on to whatever other applications the work could be useful for (the main \"other applications\" of relevance to ethics being espionage and weaponry), along with presumed obfuscation of those other applications to engineers and theoreticians working on the project that don't hold higher-ranking positions in the military. So with that context in mind,  rescuing people in the Caribbean for potential yacht race disasters as the public motive is... Well, pretty humorous to me honestly</p>",
        "id": 396892381,
        "sender_full_name": "Sean Gloumeau",
        "timestamp": 1697459483
    },
    {
        "content": "<p>Unfortunately it took me about 2 years to get the joke.</p>",
        "id": 396895217,
        "sender_full_name": "John Baez",
        "timestamp": 1697460482
    },
    {
        "content": "<p>Of course I got the idea that anything one did for DARPA would wind up helping the defense department.  But I didn't expect that the project I was working on would visibly morph from \"search and rescue\" to \"combat search and rescue\" while Joe and I were working on it.  And maybe it wasn't so smart of them to do that, since <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> quit the project and then so did I.</p>",
        "id": 396896000,
        "sender_full_name": "John Baez",
        "timestamp": 1697460767
    },
    {
        "content": "<p>I'm just glad we're able to talk openly about it. I feel like your decisions have all been very understandable.</p>",
        "id": 396896142,
        "sender_full_name": "Jade Master",
        "timestamp": 1697460821
    },
    {
        "content": "<p>Thanks!  There's an interesting new twist to this story which I'll talk about sometime soon.   (It's not really about \"Applied Categories and War\", though.)</p>",
        "id": 396897191,
        "sender_full_name": "John Baez",
        "timestamp": 1697461181
    },
    {
        "content": "<p>I agree, and would go even further to say incredibly respectable and admirable along with understandable. I've heard far too many people that I look up to advocating for nullifying those moral quandaries by dually considering the potential benefit to humanity, which is just incredibly unsatisfying to me because I feel like the realized benefit from military research is moreso happenstance or coincidence (like the internet from DARPA), while trying to apply every piece of research conducted on a DoD budget to espionage or warfare is very intentional by the institution and its leaders</p>",
        "id": 396899216,
        "sender_full_name": "Sean Gloumeau",
        "timestamp": 1697461754
    },
    {
        "content": "<p><a href=\"https://ded1.co/\">https://ded1.co/</a></p>",
        "id": 428017423,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1710969583
    },
    {
        "content": "<p>First impression:  that website is quite ugly.  Once you get past that, though, it has some interesting information.</p>",
        "id": 428021868,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1710971714
    },
    {
        "content": "<p>I was in a video call when I shared that so didn't have the bandwidth to mention that it's the website of a UK investigation into finding received by universities from military organisations.</p>",
        "id": 428074462,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711008372
    },
    {
        "content": "<p>\"finding\" <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>↦</mo></mrow><annotation encoding=\"application/x-tex\">\\mapsto</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.522em;vertical-align:-0.011em;\"></span><span class=\"mrel\">↦</span></span></span></span> \"funding\"</p>",
        "id": 428149193,
        "sender_full_name": "John Baez",
        "timestamp": 1711032919
    },
    {
        "content": "<p>I found the site uninformative until I typed a name of a university into the box, e.g. <a href=\"https://ded1.co/data/university/151\">University of Edinburgh</a>.</p>",
        "id": 428150650,
        "sender_full_name": "John Baez",
        "timestamp": 1711033282
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428021868\">said</a>:</p>\n<blockquote>\n<p>First impression:  that website is quite ugly.  Once you get past that, though, it has some interesting information.</p>\n</blockquote>\n<p>The site is quite well designed, but it looks like they intended for it to be aesthetically quite jarring.</p>",
        "id": 428151244,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1711033431
    },
    {
        "content": "<p>Interesting that EPSRC is considered part of the \"Defense industry\". I wonder what their criteria are.</p>",
        "id": 428158851,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711035423
    },
    {
        "content": "<p>Yikes!  If everything EPSRC is considered \"defense\" that's not very helpful in my opinion, since then the goal of demilitarizing means that UK universities would have to wean themselves from EPSRC funding, which is not going to happen (any more than US universities would give up NSF funding).</p>",
        "id": 428159424,
        "sender_full_name": "John Baez",
        "timestamp": 1711035590
    },
    {
        "content": "<p>I was hoping for a more detailed breakdown.</p>",
        "id": 428159533,
        "sender_full_name": "John Baez",
        "timestamp": 1711035612
    },
    {
        "content": "<p>Somewhat off-topic – I did notice there were some very well-designed elements behind the jarring colour scheme and such, but those jarring bits are not the only \"ugly\" parts my eye was drawn to – e.g. the complete lack of a gutter between the video element and the text to its right seems downright sloppy.</p>",
        "id": 428179957,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1711041424
    },
    {
        "content": "<p>More on-topic – I am not on board with the idea of zero military spending.  I expect the relationship between military spending and security to be a nonlinear one.  While a strong argument can be made that Western governments operate in a region where military spending and security are negatively correlated, I expect they are positively correlated when military spending is near zero.  In other words, the pendulum can be swung too far in both directions.</p>",
        "id": 428180023,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1711041444
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428159424\">said</a>:</p>\n<blockquote>\n<p>Yikes!  If everything EPSRC is considered \"defense\" that's not very helpful in my opinion, since then the goal of demilitarizing means that UK universities would have to wean themselves from EPSRC funding, which is not going to happen (any more than US universities would give up NSF funding).</p>\n</blockquote>\n<p>I don't think they're considering all EPSRC-funded projects as \"defense\". If you go to the tab marked Research Partnerships, there's a list of four projects, all involving EPSRC, the values of which sum to the £11million-ish associated with EPSRC in the Overview. The University of Edinburgh obviously has many many more than four projects supported by EPSRC (amounting to a lot more than £11million). Those four grants are presumably the ones the University identified as defense-related in response to the freedom of information requests listed under the FOI tab.</p>\n<p>The headline figure of £240million in \"defense industry partnerships\" is arguably a bit misleading if you have research grants in mind. The great majority of this seems to be coming from \"financial partnerships\", which I presume means investments, all of which are indirectly held. The research partnerships amount to that £11million figure. Mind you, the list of research partnerships looks to me surprisingly short...</p>\n<p>Interesting site - thanks for sharing, <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> . (Personally I quite like the graphic design.)</p>",
        "id": 428251593,
        "sender_full_name": "Emily Roff",
        "timestamp": 1711075462
    },
    {
        "content": "<p>(Actually, reading the response to the first FOI request, it becomes clear why the list of research partnerships is so short: UoE declined to provide a full list, based on the time required to compile one: <a href=\"https://ded1.co/data/foi/153\">https://ded1.co/data/foi/153</a>)</p>",
        "id": 428252222,
        "sender_full_name": "Emily Roff",
        "timestamp": 1711076017
    },
    {
        "content": "<p>My only question is: Do these people know that the world - at least here in Europe - has changed A LOT in the last couple of years? There's a saying in my language: When the sea is calm every idiot can be a sailor. I was strongly anti-military until recently. Then the war came, with Russia invading Ukraine and winning. And I'm honestly shit-scared and strongly in favor of increasing the defense expenditure. All in all: Easy to be anti-military expenses when your borders aren't in danger.</p>\n<p>I don't think this has anything to do with ACT - which is anyway not really relevant enough for defense at the moment - but yes, boosting collabs between universities and the defense sector, at the moment, is something that is needed in europe, unfortunately.</p>",
        "id": 428319390,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711110569
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428319390\">said</a>:</p>\n<blockquote>\n<p>I was strongly anti-military until recently. Then the war came</p>\n</blockquote>\n<p><a href=\"https://www.youtube.com/watch?v=qFv2dt9Rgzo\">https://www.youtube.com/watch?v=qFv2dt9Rgzo</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"qFv2dt9Rgzo\" href=\"https://www.youtube.com/watch?v=qFv2dt9Rgzo\"><img src=\"https://uploads.zulipusercontent.net/5758020d5e323d698b168ce08c212d591ca4d2f9/68747470733a2f2f692e7974696d672e636f6d2f76692f7146763264743952677a6f2f64656661756c742e6a7067\"></a></div>",
        "id": 428326326,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711112868
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428319390\">said</a>:</p>\n<blockquote>\n<p>My only question is: Do these people know that the world - at least here in Europe - has changed A LOT in the last couple of years?</p>\n</blockquote>\n<p>My baseline is definitely that a group like this is not on simulacra level 1 <a href=\"https://thezvi.substack.com/p/simulacra-levels-summary\">https://thezvi.substack.com/p/simulacra-levels-summary</a>.</p>",
        "id": 428371351,
        "sender_full_name": "Kevin Carlson (aka Arlin)",
        "timestamp": 1711126000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277066\">@Emily Roff</span> wrote:</p>\n<blockquote>\n<p>I don't think they're considering all EPSRC-funded projects as \"defense\". If you go to the tab marked Research Partnerships, there's a list of four projects, all involving EPSRC, the values of which sum to the £11million-ish associated with EPSRC in the Overview. </p>\n</blockquote>\n<p>Thanks!  I was wanting to \"drill down\" like that but I hadn't seen how.  I think it's really good to make this information easy to find regardless of what one thinks about military funding of academia.</p>\n<blockquote>\n<p>The University of Edinburgh obviously has many many more than four projects supported by EPSRC (amounting to a lot more than £11million). </p>\n</blockquote>\n<p>I realized that after my post.</p>",
        "id": 428377748,
        "sender_full_name": "John Baez",
        "timestamp": 1711128175
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428319390\">said</a>:</p>\n<blockquote>\n<p>I was strongly anti-military until recently. Then the war came, with Russia invading Ukraine and winning. And I'm honestly shit-scared and strongly in favor of increasing the defense expenditure.</p>\n<p>[...]yes, boosting collabs between universities and the defense sector, at the moment, is something that is needed in europe, unfortunately.</p>\n</blockquote>\n<p>You're conflating two points here. Being in favour of expanding defensive capabilities need not involve universities in any way. The position of this campaign, which I agree with, is that it <em>should not</em>. Military research does not need to be integrated into educational institutions.</p>",
        "id": 428382858,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711130044
    },
    {
        "content": "<p>Or to put it another way, my position is that if your work doesn't have military applications it shouldn't be funded by the military, and if it does then it shouldn't be happening in universities.</p>",
        "id": 428384633,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711130703
    },
    {
        "content": "<p>I suppose this wouldn't significantly reduce the amount of research funded by the military, at least not in the long run: it would just move it out of the universities.  So the main effect would be to disconnect universities from defense departments.   And if the military wanted to pay people to work on homotopy type theory - as they do now - those people would have to work in special military research facilities, or in industry.</p>",
        "id": 428385847,
        "sender_full_name": "John Baez",
        "timestamp": 1711131181
    },
    {
        "content": "<p>The one thing that makes me raise my eyebrows is the concept of work that \"doesn't have military applications\".   I suppose there is some math that doesn't, but a lot of work on elliptic curves or proof assistants or homotopy type theory or applied category theory, including my own work on structured and decorated cospans for system modeling, definitely has military applications - if not yet, soon enough that the US military is willing to fund it.</p>",
        "id": 428386474,
        "sender_full_name": "John Baez",
        "timestamp": 1711131400
    },
    {
        "content": "<p>I sometimes think about this a little in the context of wanting to better understand medical imaging. It's a bit uncomfortable to remember that there are <em>for sure</em> military applications that build on deeply understanding the process of figuring out what something looks like or where something is.</p>",
        "id": 428386810,
        "sender_full_name": "David Egolf",
        "timestamp": 1711131542
    },
    {
        "content": "<p>There exist military applications of almost anything sufficiently practical.</p>",
        "id": 428387137,
        "sender_full_name": "John Baez",
        "timestamp": 1711131667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428385847\">said</a>:</p>\n<blockquote>\n<p>I suppose this wouldn't significantly reduce the amount of research funded by the military, at least not in the long run: it would just move it out of the universities.  So the main effect would be to disconnect universities from defense departments.   And if the military wanted to pay people to work on homotopy type theory - as they do now - those people would have to work in special military research facilities, or in industry.</p>\n</blockquote>\n<p>I have at least heard the argument that if the military is funding your research which has no obvious military applications, then what they are buying is your network of people, in particular undergrads or early graduates who are the typical target of recruiting; so \"moving it away from universities\" would, at least, have the effect of making this harder or impossible.<br>\n(I do not know enough to know whether the argument reflects reality or not.)</p>",
        "id": 428387378,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1711131762
    },
    {
        "content": "<p>I think something like that is true: I've seen it at work, especially since I did research for DARPA for a while.  </p>\n<p>If most universities were disconnected from the military - which seems almost impossible here in the US, but it's still interesting to imagine - then the military would probably expand its own university system.   There are already <a href=\"https://en.wikipedia.org/wiki/List_of_United_States_military_schools_and_academies\">military colleges in the US</a> - for example in the Washington DC area I believe the largest mathematics department is run by the military.   But I can imagine these increasing their attempts to hire top-notch scientists and mathematicians.</p>",
        "id": 428388308,
        "sender_full_name": "John Baez",
        "timestamp": 1711132148
    },
    {
        "content": "<p>I suppose I should have said \"if your research isn't being done towards military interests\".</p>",
        "id": 428392665,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711133939
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428382858\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/428319390\">said</a>:</p>\n<blockquote>\n<p>I was strongly anti-military until recently. Then the war came, with Russia invading Ukraine and winning. And I'm honestly shit-scared and strongly in favor of increasing the defense expenditure.</p>\n<p>[...]yes, boosting collabs between universities and the defense sector, at the moment, is something that is needed in europe, unfortunately.</p>\n</blockquote>\n<p>You're conflating two points here. Being in favour of expanding defensive capabilities need not involve universities in any way. The position of this campaign, which I agree with, is that it <em>should not</em>. Military research does not need to be integrated into educational institutions.</p>\n</blockquote>\n<p>Military technology advances. For instance, Russia now has ballistic missiles that are so fast that's impossible to take them down. So heavy investment in military research is needed even just for boosting defensive capabilities. If that weren't the case, we could sleep very comfortably knowing that we still have some arquebuses left in our arsenals.</p>\n<p>Having cleared this point, I do not understand how we're supposed to expand our defensive capabilities if no one does the needed research to improve the technology we need to do so. Involving universities seems just natural to me.</p>",
        "id": 429074673,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711194955
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429074673\">said</a>:</p>\n<blockquote>\n<p>I do not understand how we're supposed to expand our defensive capabilities if no one does the needed research to improve the technology we need to do so. Involving universities seems just natural to me.</p>\n</blockquote>\n<p>Well, research is not only done in universities, right?  Here are \"evil\", \"good\" and \"neutral\" examples: the atomic bomb, some Covid vaccines like Pfizer-BioNTech or Moderna, ChatGPT.  None of these were developed in a university.  They all used research previously done in some university, and perhaps involved people whose main employer was or had been a university, but the crucial, last stages of research needed for realizing the specific technology at stake had nothing to do with a university (at least as far as I know).  So, I interpret Morgan's statement as: if you want to prove some general theorem about partial differential equations, you'll do it in a university; if you want to figure out how that theorem applies to building hypersonic ballistic missiles, you should do it somewhere else (typically, in a private company subcontracted by the military somewhere).  Maybe it's idealistic, simplistic or whatever, but I don't think it's unreasonable.</p>",
        "id": 429097054,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1711213342
    },
    {
        "content": "<p>That being said, I honestly don't know how military funding works.  Does the military actually asks an academic partner to contribute to the development of some very specific military technology, like a weapon?  Were the Russian's hypersonic missiles developed in partnership with a Russian university?  I would think that the true goal of the military is never explicitly revealed and that the final stages are developed entirely in an extra-academic context.  So academics can always say \"I was just proving theorems, I know I was being funded by the military but I had no idea that it was going to end up being used in missiles!\".  Which makes things less clear-cut in this discussion.</p>",
        "id": 429098940,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1711214900
    },
    {
        "content": "<p>I'm not sure \"where the money comes from\" and \"how the funders intend the money to be used\" and \"whether the developer is a university or not\" have, in reality, much to say about 'morality/ethics' or even 'predicting how people will actually use things'.  Not only might such intentions change over time, as John's story shows, but so many applications are accidental.  ARPA funded the internet thinking about withstanding nuclear attack, only for that to take over commerce.  Sony built game consoles, only to find their $30 controllers being used as replacements for $30,000 steering wheels in attack submarines.  From the point of view of these proposals, I can't even figure out if these historical episodes would be considered something to avoid or not.</p>",
        "id": 429102537,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1711217739
    },
    {
        "content": "<p>Military and universities? How about the NSA and high school? You would think that something like <a href=\"https://tetration.org/index.php/Main_Page\">tetration</a> wouldn't have a military or intelligence application. But then we have the following <a href=\"https://sos-vo.org/group/isef\">surprise from 2022</a>:<br>\nMorgan Holien of Superior, CO – 1st Place - $1,500 -  <a href=\"https://projectboard.world/isef/project/math017---tetration-of-non-integer-heights\">MATH017 - Tetration of Non-Integer Heights</a></p>",
        "id": 429105096,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1711219687
    },
    {
        "content": "<p>The NSA has claimed to be the largest employer of mathematicians in the US, though it seems hard to find out how many work there.  (I've seen the number 600, but I have no reason to trust that guess.)   They do a lot of work to recruit clever young mathematicians, and there are a lot of mathematicians trying to stop them, e.g. Tom Leinster, who wrote this:</p>\n<ul>\n<li><a href=\"https://slate.com/technology/2014/04/mathematicians-at-the-nsa-and-gchq-is-it-ethical-to-work-for-spy-agencies.html\">Mathematician spies</a>.</li>\n</ul>",
        "id": 429236068,
        "sender_full_name": "John Baez",
        "timestamp": 1711306079
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429236068\">said</a>:</p>\n<blockquote>\n<p>there are a lot of mathematicians trying to stop them, e.g. Tom Leinster, who wrote this:</p>\n<ul>\n<li><a href=\"https://slate.com/technology/2014/04/mathematicians-at-the-nsa-and-gchq-is-it-ethical-to-work-for-spy-agencies.html\">Mathematician spies</a>.</li>\n</ul>\n</blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/Edward_Snowden_asylum_in_Russia#2022\">https://en.wikipedia.org/wiki/Edward_Snowden_asylum_in_Russia#2022</a><br>\n<a href=\"https://www.nytimes.com/2021/09/03/world/europe/spain-catalonia-russia.html\">https://www.nytimes.com/2021/09/03/world/europe/spain-catalonia-russia.html</a></p>",
        "id": 429265071,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711326941
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/D-K3woZDPB2JHH_XqWgm7QVf/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/D-K3woZDPB2JHH_XqWgm7QVf/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/D-K3woZDPB2JHH_XqWgm7QVf/image.png\"></a></div>",
        "id": 429265538,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711327257
    },
    {
        "content": "<p>Presumably that dedication is from one of Tom Leinster's books.   He spends a lot of time in Barcelona and out in the nearby countryside, and he's learning Catalan.</p>",
        "id": 429271473,
        "sender_full_name": "John Baez",
        "timestamp": 1711332068
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/-9zVCQzAVs8-5eph5BctuzJN/IMG_4982.jpeg\">IMG_4982.jpeg</a><br>\n<a href=\"/user_uploads/21317/Y7I8pXpKJkdAXmwvBd7HWS42/IMG_4983.jpeg\">IMG_4983.jpeg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/-9zVCQzAVs8-5eph5BctuzJN/IMG_4982.jpeg\" title=\"IMG_4982.jpeg\"><img src=\"/user_uploads/21317/-9zVCQzAVs8-5eph5BctuzJN/IMG_4982.jpeg\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Y7I8pXpKJkdAXmwvBd7HWS42/IMG_4983.jpeg\" title=\"IMG_4983.jpeg\"><img src=\"/user_uploads/21317/Y7I8pXpKJkdAXmwvBd7HWS42/IMG_4983.jpeg\"></a></div>",
        "id": 429274455,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711333961
    },
    {
        "content": "<p>Obviously, both anti-surveillance and Catalonian independence are causes that have large support beyond whatever anyone thinks of Mr Snowden, Mr Puigdemont and their associates, so please let's not bring these cheap tactics into the discussion (and I would encourage moderators to intervene if it happens again).</p>",
        "id": 429292498,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1711345766
    },
    {
        "content": "<p>Actually I'd encourage <span class=\"user-mention\" data-user-id=\"684242\">@0xf00ba</span>  to come out and say what they actually think - join the discussion - instead of communicating by silently posting images.</p>",
        "id": 429292801,
        "sender_full_name": "John Baez",
        "timestamp": 1711345909
    },
    {
        "content": "<p>None of it seems very related to what we're supposedly talking about here: \"applied categories and war\".</p>",
        "id": 429293067,
        "sender_full_name": "John Baez",
        "timestamp": 1711346066
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429074673\">said</a>:</p>\n<blockquote>\n<p>Military technology advances. For instance, Russia now has ballistic missiles that are so fast that's impossible to take them down. So heavy investment in military research is needed even just for boosting defensive capabilities. </p>\n</blockquote>\n<p>I'm not completely naive so I see the point in this argument, but it should also be pointed out: I bet Russians were saying the same thing when they developed hypersonic ICBMs</p>\n<p>The problem is not defense in itself, the problem is avoid escalation... That's what makes defense a thorny issue</p>",
        "id": 429312498,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711354323
    },
    {
        "content": "<p>Sometimes I wonder if we (as a global society) haven't developed such an habit of keeping international order with arms that we think it's obvious to invest billions in developing weapon systems and not cooperation infrastructures. Peace is hard and should be studied like a technology.</p>",
        "id": 429312883,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711354453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429312883\">said</a>:</p>\n<blockquote>\n<p>Sometimes I wonder if we (as a global society) haven't developed such an habit of keeping international order with arms that we think it's obvious to invest billions in developing weapon systems and not cooperation infrastructures. Peace is hard and should be studied like a technology.</p>\n</blockquote>\n<p>Wasn't it one of the motivation behind the study of game theory?</p>",
        "id": 429313860,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1711354809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429292801\">said</a>:</p>\n<blockquote>\n<p>Actually I'd encourage <span class=\"user-mention silent\" data-user-id=\"684242\">0xf00ba</span>  to come out and say what they actually think - join the discussion - instead of communicating by silently posting images.</p>\n</blockquote>\n<p>It has turned out—more than once—that things Leinster went far out of his way to support were pawns of powers that are hostile to the UK. This is obviously relevant to the topic of his very public stance against GCHQ.</p>",
        "id": 429323710,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711357894
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"684242\">0xf00ba</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429323710\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429292801\">said</a>:</p>\n<blockquote>\n<p>Actually I'd encourage <span class=\"user-mention silent\" data-user-id=\"684242\">0xf00ba</span>  to come out and say what they actually think - join the discussion - instead of communicating by silently posting images.</p>\n</blockquote>\n<p>It has turned out—more than once—that things Leinster went far out of his way to support were pawns of powers that are hostile to the UK. This is obviously relevant to the topic of his very public stance against GCHQ.</p>\n</blockquote>\n<p>Saying a cause such a Catalonian independence or mathematicians boycotting GCHQ are \"pawns\" of other interests is flagrant whataboutism. Leinster's argument in the article John shared is sensible, but even that was only tangentially related to the discussion we were having up to this point.</p>",
        "id": 429332066,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711359840
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"619003\">Peva Blanchard</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429313860\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429312883\">said</a>:</p>\n<blockquote>\n<p>Sometimes I wonder if we (as a global society) haven't developed such an habit of keeping international order with arms that we think it's obvious to invest billions in developing weapon systems and not cooperation infrastructures. Peace is hard and should be studied like a technology.</p>\n</blockquote>\n<p>Wasn't it one of the motivation behind the study of game theory?</p>\n</blockquote>\n<p>I believe the original motivation of game theory was economics, then war, though I believe most of its development is motivated by human curiosity. Only relatively recently was cooperation studied with games. Turns out it is quite hard, which I believe why it hasn't/didn't receive as much attention as the theory of non-cooperative games.</p>",
        "id": 429332306,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711359877
    },
    {
        "content": "<p>Incidentally, AI safety is going down much of the same path: developing ways to combat/constrain an hostile agent instead of fostering the things that keep human nice to each other, eg mutual interest, sociality, empathy and affection.</p>",
        "id": 429332771,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711360014
    },
    {
        "content": "<p>I agree, it's a bit sad. For me, AI safety should be more concerned about the \"information ecosystem\". I believe it is the Achilles' tendon of our modern societies.</p>\n<p>Actually, I was lucky enough to co-author a <a href=\"https://proceedings.neurips.cc/paper/2017/hash/f4b9ec30ad9f68f89b29639786cb62ef-Abstract.html\">paper</a> in which we studied how failures could hinder the learning process (sgd-based). Here, \"failure\" can also mean polluted dataset.</p>\n<p>Since then, my colleagues went further and are now very concerned about the <a href=\"https://arxiv.org/abs/2209.15259\">security issues</a> posed by large ai models. (quick note: it is not at all about agi ...)</p>\n<p>Regarding the relation with war, I'd say that the information eco-system is clearly a battlefield; just think about the massive disinformation campaign, or billionaire's buying social networks, etc. </p>\n<p>I am more worried by the \"information-tech\" hazards than say traditional weaponry. I also feel like ACT will find applications faster in the info-tech.</p>",
        "id": 429351022,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1711363802
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429332306\">said</a>:</p>\n<blockquote>\n<p>I believe the original motivation of game theory was economics, then war, though I believe most of its development is motivated by human curiosity. Only relatively recently was cooperation studied with games. Turns out it is quite hard, which I believe why it hasn't/didn't receive as much attention as the theory of non-cooperative games.</p>\n</blockquote>\n<p>Bit more complicated than that. My understanding is that Nash was motivated by econ (as were some earlier people in the pre-history of the field like Cournot), but the focus of game theory research in the 50s was at RAND, whereas it didn't start being a really big thing in econ until the 80s</p>",
        "id": 429388728,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1711371131
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276839\">Damiano Mazza</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429097054\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429074673\">said</a>:</p>\n<blockquote>\n<p>I do not understand how we're supposed to expand our defensive capabilities if no one does the needed research to improve the technology we need to do so. Involving universities seems just natural to me.</p>\n</blockquote>\n<p>Well, research is not only done in universities, right?  Here are \"evil\", \"good\" and \"neutral\" examples: the atomic bomb, some Covid vaccines like Pfizer-BioNTech or Moderna, ChatGPT.  None of these were developed in a university.  They all used research previously done in some university, and perhaps involved people whose main employer was or had been a university, but the crucial, last stages of research needed for realizing the specific technology at stake had nothing to do with a university (at least as far as I know).  So, I interpret Morgan's statement as: if you want to prove some general theorem about partial differential equations, you'll do it in a university; if you want to figure out how that theorem applies to building hypersonic ballistic missiles, you should do it somewhere else (typically, in a private company subcontracted by the military somewhere).  Maybe it's idealistic, simplistic or whatever, but I don't think it's unreasonable.</p>\n</blockquote>\n<p>I don't know about the other two, but this is factually false for the Manhattan project, which was developed in strict synergy with many universities by selected personnel, most notably Fermi  and some selected collaborators at UChicago, which was in constant contact with Oppenheimer.</p>",
        "id": 429441020,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711380954
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429312498\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429074673\">said</a>:</p>\n<blockquote>\n<p>Military technology advances. For instance, Russia now has ballistic missiles that are so fast that's impossible to take them down. So heavy investment in military research is needed even just for boosting defensive capabilities. </p>\n</blockquote>\n<p>I'm not completely naive so I see the point in this argument, but it should also be pointed out: I bet Russians were saying the same thing when they developed hypersonic ICBMs</p>\n<p>The problem is not defense in itself, the problem is avoid escalation... That's what makes defense a thorny issue</p>\n</blockquote>\n<p>Fun fact: If you talk with almost <em>any</em> attacker, they will tell you that they acted in some form of self defense, or as a reaction to a provocation.<br>\n\"I shoot him because he was coming at me with a knife\" -&gt; \"I took out the knife because he was trying to punch me\" -&gt; \"I punched him because he insulted me\" -&gt; \"I insulted him because he looked at me badly\".</p>",
        "id": 429442138,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711381163
    },
    {
        "content": "<p>Yeah that's my point <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 429474170,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711388109
    },
    {
        "content": "<p>Yeah the problem is where one draws the line. I'm 100% in favor of doubling down our diplomatic efforts, and I think the current situation is just stupid under so many points of view.</p>\n<p>And yet, when we are faced with someone taking an overly aggressive posture, it is only wise to prepare accordingly.</p>",
        "id": 429485891,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711392095
    },
    {
        "content": "<p>Is the question here \"what should governments do about the fact that other governments and non-state actors pose military threats?\"   I thought we were talking about what applied category theorists should do.  They're both interesting questions, but they are somewhat different questions.    </p>\n<p>I don't think applied category theorists should or even can bear the main burden of figuring out the correct role of the military in geopolitics.   I guess if some mathematician is trying to \"shut down the military\" or something like that, they are taking on this burden voluntarily.   Then they need to become as knowledgeable about this subject as they are about math.    But I can imagine more modest mathematicians who just want to figure out what <em>they, themselves</em> should do.  And some slightly less modest mathematicians who just want to figure out the appropriate relation between the university system and the military.</p>",
        "id": 429532989,
        "sender_full_name": "John Baez",
        "timestamp": 1711412457
    },
    {
        "content": "<p>I think I'm in the modest camp: I mainly think about what <em>I, myself</em> will do in relation to the military, as part of the general problem of what I should be doing.    After fumbling around a bit, I decided to avoid working for the military, avoid working for big tech companies, and avoid working on AI - among other things.   In general I try to avoid making big and powerful institutions bigger and more powerful.  But more importantly I decided to take on some positive commitments: to work on global warming, to work on ecology, and to work on epidemiology.   This keeps me plenty busy.</p>",
        "id": 429533300,
        "sender_full_name": "John Baez",
        "timestamp": 1711412687
    },
    {
        "content": "<p>Why exactly do the medium-modesty folks want defense research separated from universities? It’s hard to see what that change really affects, concretely—seems like an arbitrary reorganization of the overall research ecosystem. If you’ve got a general attachment to the ideal of the university as dedicated to truth and not to fighting, well, it seems like what you want is simply a different kind of thing than a university. I didn’t see any really concrete explanation of this in the thread other than avoiding defense projects at university makes it harder for the defense people to recruit your students, which sure seems to suggest that students aren’t adult humans with the right to work for whoever they choose and the ability to decide the ethics of this for themselves.</p>",
        "id": 429552339,
        "sender_full_name": "Kevin Carlson (aka Arlin)",
        "timestamp": 1711427217
    },
    {
        "content": "<p>This argument about \"students having the right to choose\" sounds to me the same as the argument of those who suggest that \"freedom of speech\" is the same as \"everyone has a right to a platform and a loudspeaker\". Of course every individual has the right to work for whoever they choose; likewise, as mathematicians&amp;academics, we have the right to organise and change the context in which this decision is made, and make it so that the perks of certain career choices are balanced by downsides about what collaborations are available with our institutions. Which is the sort of action that Tom Leinster was advocating for re: NSA and GCHQ.</p>",
        "id": 429595700,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1711437637
    },
    {
        "content": "<p>This seems a very much one-way discourse, where 'unis and defense are and should stay separated' is the norm. Again, I think this posture is a result of  the effects of Pax Americana, at least in some places of the world. I also used to think that way since the idea of a 'peaceful Europe' has always been given for granted for me.</p>\n<p>As usual, this is  the norm (until?) now, but has never  been always this way. During WWII the question was often reversed to 'how can we, as university faculty and students, participate to the defense effort?', and indeed _many_ famous academics of the mid century where involved in defense efforts (Bletchley Park anyone?).</p>\n<p>Going further back, it is worth noting that many engineering departments were originally instituted as stemming out from the 'military genius' (the part of the army devoted to constructing bridges etc. or to coordinate sabotage and strategic demolition). So the relationship between engineering and the military was very strong.</p>\n<p>Personally, for me now question has shifted completely. I went from \"why should my work be used to propel military effort, which I find deeply unethical\" to \"how  can my work help preventing a Russian nuclear warhead falling on my head in the next n years?\" All in all, I want to reiterate once more that, at least for us Europeans, the world has changed completely since 2022, in a way that we have never known since 1945. I feel that the whole posture of this discussion is simply inadequate for the times ahead.</p>",
        "id": 429604167,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711441855
    },
    {
        "content": "<p>hey. so i didn't resist and checked what is being discussed here yesterday. and i want to say something as an old man to a group of very smart people.</p>\n<p>Smart people have a problem. They know that they are smart, so they draw their conclusions far, and confidently. And the world doesn't know that they are smart, so it goes its own way. Being smart is good for algebra, but it doesn't help you much with predicting things. So when you draw your conclusions far, you deviate from the world. You slide into an ideology of some sort of another. You become a puritan of some sort or another.</p>\n<p>You cannot predict the consequences of your own actions. You cannot avoid contributing to potential murders. If you produce a lollypop, if you make it really good, you sell it very widely, and if people use too much lollypop it becomes bad for them. If they use WAY too much it's not just that it rots their teeth, but it makes them kill each other to burn all the energy that your tasty lollypops gave them.</p>\n<p>The Google guys really honestly meant to do no evil. They even did evil even to themselves.</p>\n<p>Lawvere lived in the times of a real actual war. In the times of demonstrations. He was very radical. He became not just a communist, but a maoist. Devoted maoist, because the unjust war that he was protesting against was against maoists. All in the name of being against the wretched war. And then it turned out that there was a cultural revolution. Maoists tortured and murdered people...</p>\n<p>We shouldn't preach. It is always false. Everything becomes false when it is preached.</p>\n<p>There are good people at NSA and there are bad people at NSA. There are good people on this list, and there are bad people. Are you really sure that you can tell the difference?</p>",
        "id": 429609570,
        "sender_full_name": "dusko",
        "timestamp": 1711443893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429604167\">said</a>:</p>\n<blockquote>\n<p>This seems a very much one-way discourse, where 'unis and defense are and should stay separated' is the norm.</p>\n</blockquote>\n<p>I wish it were the norm, but it very much is not.</p>\n<blockquote>\n<p>During WWII the question was often reversed to 'how can we, as university faculty and students, participate to the defense effort?', and indeed _many_ famous academics of the mid century where involved in defense efforts (Bletchley Park anyone?).</p>\n</blockquote>\n<p>Sure. There were also many conscientious objectors. You can't pretend that everyone was on board with \"the war effort\" or that there wasn't intense social pressure to participate and sometimes even greater threats to one's life or career if one refused (cf. the red scare). It might be idealist to hope for universities to be protected from that, but it's something I am willing to put a lot of work into putting into practice.</p>\n<blockquote>\n<p>Going further back, it is worth noting that many engineering departments were originally instituted as stemming out from the 'military genius' (the part of the army devoted to constructing bridges etc. or to coordinate sabotage and strategic demolition). So the relationship between engineering and the military was very strong.</p>\n</blockquote>\n<p>Sure, the same is true of fossil fuel companies and chemical engineering departments. That doesn't actually constitute an argument against dismantling this connection.</p>\n<blockquote>\n<p>Personally, for me now question has shifted completely. I went from \"why should my work be used to propel military effort, which I find deeply unethical\" to \"how  can my work help preventing a Russian nuclear warhead falling on my head in the next n years?\"</p>\n</blockquote>\n<p>That's great! But why should that work happen at a university?</p>",
        "id": 429612540,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711444951
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429609570\">said</a>:</p>\n<blockquote>\n<p>We shouldn't preach. It is always false. Everything becomes false when it is preached.</p>\n</blockquote>\n<p>Describing participation in this discussion as \"preaching\" (if that's what you were implying) is pretty condescending <span class=\"user-mention\" data-user-id=\"294557\">@dusko</span> ...</p>",
        "id": 429614307,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711445599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429612540\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Personally, for me now question has shifted completely. I went from \"why should my work be used to propel military effort, which I find deeply unethical\" to \"how  can my work help preventing a Russian nuclear warhead falling on my head in the next n years?\"</p>\n</blockquote>\n<p>That's great! But why should that work happen at a university?</p>\n</blockquote>\n<p>Because that's where research is overwhelmingly produced, and it is the most efficient solution from a strictly logistical point of view. Using an already established research network is much easier than bootstrapping it ex-novo.</p>",
        "id": 429629841,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711450712
    },
    {
        "content": "<p>About everything else:  potato/potato (btw how the f do you write this? potaeto/potaato? wtf). Mine aren't arguments against dismantling that connection as much as yours aren't arguments against maintaining it. I'm just offering an opinion from the other side of the political spectrum, which has as much a right to exist as the mainstream one (at least according to what I read in this group) has.</p>",
        "id": 429630335,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711450903
    },
    {
        "content": "<p>Tomayto/tomahto</p>",
        "id": 429633257,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1711452107
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429604167\">said</a>:</p>\n<blockquote>\n<p>All in all, I want to reiterate once more that, at least for us Europeans, the world has changed completely since 2022, in a way that we have never known since 1945. </p>\n</blockquote>\n<p>Important point of order: I am only 34 and there has been both war and genocide in Europe within my lifetime. Everyone forgets the Yugoslav Wars for some reason</p>",
        "id": 429638030,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1711453962
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429629841\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429612540\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Personally, for me now question has shifted completely. I went from \"why should my work be used to propel military effort, which I find deeply unethical\" to \"how  can my work help preventing a Russian nuclear warhead falling on my head in the next n years?\"</p>\n</blockquote>\n<p>That's great! But why should that work happen at a university?</p>\n</blockquote>\n<p>Because that's where research is overwhelmingly produced, and it is the most efficient solution from a strictly logistical point of view. Using an already established research network is much easier than bootstrapping it ex-novo.</p>\n</blockquote>\n<ol>\n<li>Citation needed for that first point. I do not believe it to be true: private companies in manufacturing of all kinds have their own research facilities, I would be surprised to learn that university facilities outnumber these.</li>\n<li>Any research requiring any level of secrecy needs to be isolated from being publicly accessible, which undermines the logistical advantage.</li>\n<li>With that in mind, the primary advantage of leeching off universities seems to me to be easier access to intellectual resources, as Amar pointed out, or as you said \"using an already established research network\". I do not want military interests invading my research network, thank you.</li>\n</ol>",
        "id": 429655372,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711459906
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429638030\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429604167\">said</a>:</p>\n<blockquote>\n<p>All in all, I want to reiterate once more that, at least for us Europeans, the world has changed completely since 2022, in a way that we have never known since 1945. </p>\n</blockquote>\n<p>Important point of order: I am only 34 and there has been both war and genocide in Europe within my lifetime. Everyone forgets the Yugoslav Wars for some reason</p>\n</blockquote>\n<p>No, I did not forget, but this is wildly different. We're talking about a full conventional (if not nuclear) war between two (three considering the  US, four considering what China may do) superpowers. War in Yugoslavia in the early nineties was absolutely terrible, but equating that to what _this_ war may become is foolish. We're talking a (very, unfortunately) probable WWIII. There's literally nothing that compares to that since 1945.</p>",
        "id": 429675978,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711465546
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429655372\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429629841\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429612540\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Personally, for me now question has shifted completely. I went from \"why should my work be used to propel military effort, which I find deeply unethical\" to \"how  can my work help preventing a Russian nuclear warhead falling on my head in the next n years?\"</p>\n</blockquote>\n<p>That's great! But why should that work happen at a university?</p>\n</blockquote>\n<p>Because that's where research is overwhelmingly produced, and it is the most efficient solution from a strictly logistical point of view. Using an already established research network is much easier than bootstrapping it ex-novo.</p>\n</blockquote>\n<ol>\n<li>Citation needed for that first point. I do not believe it to be true: private companies in manufacturing of all kinds have their own research facilities, I would be surprised to learn that university facilities outnumber these.</li>\n<li>Any research requiring any level of secrecy needs to be isolated from being publicly accessible, which undermines the logistical advantage.</li>\n<li>With that in mind, the primary advantage of leeching off universities seems to me to be easier access to intellectual resources, as Amar pointed out, or as you said \"using an already established research network\". I do not want military interests invading my research network, thank you.</li>\n</ol>\n</blockquote>\n<p>Indeed you are right, I'm talking precisely about point 3 and if things keep going the way they are, for the sake of my own survival (and the one of my family, and of all my loved ones) I really really REALLY hope that your opinions will be minoritarian in the decades to come.</p>",
        "id": 429676440,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711465655
    },
    {
        "content": "<p>I'm sorry <span class=\"user-mention\" data-user-id=\"679887\">@Fabrizio Romano Genovese</span> , and I sincerely am not trolling you here: the only argument you gave for military research happening in universities boils down to convenience. I am not arguing against the existence of military research (although there is a more nuanced discussion to be had regarding the economic resources allocated to it relative to other social causes in certain countries). How exactly do you see military presence in universities as a matter of survival? To the contrary, I would like universities to be exclusively civilian so that there is  some international law protecting them from being justifiable military targets ((not that such laws have had much impact on decision-making by the Israeli government in recent times, mind you)).</p>",
        "id": 429679776,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711466523
    },
    {
        "content": "<p>The entire effort of war revolves around the concept of convenience, from Sun Tzu to Clausewitz. So yes, if 'convenience' means 'achieving something before your enemy does', that justifies it</p>",
        "id": 429683378,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711467488
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429532989\">said</a>:</p>\n<blockquote>\n<p>Is the question here \"what should governments do about the fact that other governments and non-state actors pose military threats?\"   I thought we were talking about what applied category theorists should do.  They're both interesting questions, but they are somewhat different questions.    </p>\n</blockquote>\n<p>Personally, my answer to the question 'is it ethical to work on military applications' is directly linked to the question 'is it ethical to develop military tech' which is directly linked to the question 'is it ethical to go to war'. So by composition... <br>\nThe point is that I'd like to avoid being like those orthodox Jews who pay someone to activate electrical devices for them on shabbat. IMO either I'm tout-court anti-military, or I must accept military apps are ethical insofar as defending oneself is.<br>\nIt's a very hard question I'm still not sure how to navigate.</p>",
        "id": 429690755,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711469432
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429690755\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429532989\">said</a>:</p>\n<blockquote>\n<p>Is the question here \"what should governments do about the fact that other governments and non-state actors pose military threats?\"   I thought we were talking about what applied category theorists should do.  They're both interesting questions, but they are somewhat different questions.    </p>\n</blockquote>\n<p>Personally, my answer to the question 'is it ethical to work on military applications' is directly linked to the question 'is it ethical to develop military tech' which is directly linked to the question 'is it ethical to go to war'. So by composition... <br>\nThe point is that I'd like to avoid being like those orthodox Jews who pay someone to activate electrical devices for them on shabbat. IMO either I'm tout-court anti-military, or I must accept military apps are ethical insofar as defending oneself is.<br>\nIt's a very hard question I'm still not sure how to navigate.</p>\n</blockquote>\n<p>It is a very hard question indeed, no doubt about it. I really think it depends on context. I do not think it is unethical to defend oneself if one feels threatened, and 'feeling threatened' is for sure a personal opinion. Personally, I've never felt as threatened as in the last year, so for me the answer is very clear cut.</p>",
        "id": 429691195,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711469559
    },
    {
        "content": "<p>As I said in the very beginning, I'd probably agree much more with Morgan if I was living on the other side of the world. I'd probably disagree with him much much more if I was living in Poland or in a Baltic state.</p>",
        "id": 429691496,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711469648
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429690755\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429532989\">said</a>:</p>\n<blockquote>\n<p>Is the question here \"what should governments do about the fact that other governments and non-state actors pose military threats?\"   I thought we were talking about what applied category theorists should do.  They're both interesting questions, but they are somewhat different questions.    </p>\n</blockquote>\n<p>Personally, my answer to the question 'is it ethical to work on military applications' is directly linked to the question 'is it ethical to develop military tech' which is directly linked to the question 'is it ethical to go to war'. So by composition... </p>\n</blockquote>\n<p>I spend a lot less time thinking about whether it's ethical or not for me to do various things than figuring out what I should actually do.   It might be ethical for me to develop military tech.  But is this what I'm best at doing?  Is this what I really enjoy?  Or is the situation so desperate that I should do it even if I'm not good at it and don't enjoy it?   I think these other questions are decisive, and their answers will vary from person to person.  If I lived in Ukraine the last one would have a different answer.</p>",
        "id": 429707915,
        "sender_full_name": "John Baez",
        "timestamp": 1711474956
    },
    {
        "content": "<p>Speaking as someone living in a Baltic state, I relate to what seems to be the mainstream position here, which is \"yes, we need to ramp up defense efforts\" but coupled with intense distrust of decision-makers. I feel this dimension is missing in what you are saying, <span class=\"user-mention\" data-user-id=\"679887\">@Fabrizio Romano Genovese</span> . Even if I agreed wholeheartedly that we need to make all possible efforts to defend ourselves from Putin, what you have in reality is a US Congress much more willing to spend money to help commit war crimes in Palestine, than to help Ukrainians. Why should one collaborate if they distrust the use people at the top will make of their collaboration?</p>",
        "id": 429709835,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1711475630
    },
    {
        "content": "<p>Oh you are preaching to the choir here, the US have been for a long time the main hindrance towards establishing a real EU army, which would come in very handy in times like these when it's clear that the US are way more inward-focused than interested in projecting geopolitical power.</p>",
        "id": 429710084,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711475705
    },
    {
        "content": "<p>A majority in the US Congress, and the president, wants to send more aid to Ukraine.  But alas that's not enough.</p>",
        "id": 429711234,
        "sender_full_name": "John Baez",
        "timestamp": 1711476098
    },
    {
        "content": "<p>This is all not unconnected to the fact that public military research funding is such a major part of the academic landscape in the US and is <em>almost</em> (but not quite) nonexistent in Europe</p>",
        "id": 429717169,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1711478324
    },
    {
        "content": "<p>Let's see... the US spent $822 billion on the military in 2022, which was 3.5% of its GDP, while the UK spent $62 billion, which was 2.2% of its GDP.  <a href=\"https://en.wikipedia.org/wiki/List_of_countries_with_highest_military_expenditures\">Other countries are listed here</a>.  Interestingly the UK now spends the 5th most of any country in the world on the military.</p>\n<p>I'm having a bit of trouble getting data on military spending <em>within</em> academia, but I bumped into <a href=\"https://historynewsnetwork.org/article/nicholas-turse-the-military-industrial-academic-co\">this</a>:</p>\n<blockquote>\n<p>In 1958, the Department of Defense spent an already impressive $91 million in support of\"academic research.\" By 1964, the sum had reached $258 million and by 1970, in the midst of the Vietnam War, $266 million. By 2003, however, any of these numbers, or even their $615 million total, was dwarfed by the Pentagon's prime contract awards to just two schools, the Massachusetts Institute of Technology and Johns Hopkins University which, together, raked in a combined total of $842,437,294.</p>\n</blockquote>",
        "id": 429729384,
        "sender_full_name": "John Baez",
        "timestamp": 1711483079
    },
    {
        "content": "<p>And this:</p>\n<blockquote>\n<p>The Association of American Universities further notes that the Department of Defense accounts for 60% of federal funding for university-based electrical engineering research, 55% for the computer sciences, 41% for metallurgy/materials engineering, and 33% for oceanography. With the DoD's budget for research and development skyrocketing, so to speak, to $66 billion for 2004 -- an increase of $7.6 billion over 2003 -- it doesn't take a rocket scientist to figure out that the Pentagon can often dictate the sorts of research that get undertaken and the sorts that don't.</p>\n</blockquote>",
        "id": 429729757,
        "sender_full_name": "John Baez",
        "timestamp": 1711483199
    },
    {
        "content": "<p>And this, which is pretty intense:</p>\n<blockquote>\n<p>However, [in 2002], thanks to a quick reinterpretation of federal law, the Pentagon found itself able to threaten Harvard with a loss of all its federal university funding, some $300 billion, if its law school denied access to military recruiters. Unable to fathom life ripped from the federal teat, Harvard caved, ushering in a new era of dwindling academic autonomy and growing military control of the university.</p>\n</blockquote>",
        "id": 429729972,
        "sender_full_name": "John Baez",
        "timestamp": 1711483257
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429729384\">said</a>:</p>\n<blockquote>\n<p>Interestingly the UK now spends the 5th most of any country in the world on the military.</p>\n</blockquote>\n<p>And yet:<br>\n<a href=\"/user_uploads/21317/MzeEISNjytpq6w3swpXZNRlk/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/MzeEISNjytpq6w3swpXZNRlk/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/MzeEISNjytpq6w3swpXZNRlk/image.png\"></a></div>",
        "id": 429833516,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711537223
    },
    {
        "content": "<p>I think people fail to see how big Russia is. Also, the fact that they can conscript people very easily is a big advantage they have. Russia's strengths in war have always been numbers and weather, since time immemorial</p>",
        "id": 429833718,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711537312
    },
    {
        "content": "<p>I think what has taken everyone by surprise is the idea of a conventional war between nuclear superpowers. This flips completely the cold war posture that war between superpowers can only be a proxy war, because a direct conflict would immediately escalate to nuclear war. At least in the West, almost no one saw this coming.</p>",
        "id": 429834116,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711537434
    },
    {
        "content": "<p>And so now we are in this ugly situation where military expenses have to be ramped up because we never took into account that we may have needed to defend ourselves against a 'traditional' invasion. Literally what a shit time to be alive, I'd like very much not to find myself in a trench 5-10yrs from now if I have to be honest.</p>",
        "id": 429834558,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1711537589
    },
    {
        "content": "<p>If only we had had a great statesman pushing the two sides to bridge their differences... <a href=\"/user_uploads/21317/Uw7J0K4ELRT6kMmU88wvAQr3/73093ce6-9f93-44d2-b367-75b2ae1b2e54.jpg\">73093ce6-9f93-44d2-b367-75b2ae1b2e54.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Uw7J0K4ELRT6kMmU88wvAQr3/73093ce6-9f93-44d2-b367-75b2ae1b2e54.jpg\" title=\"73093ce6-9f93-44d2-b367-75b2ae1b2e54.jpg\"><img src=\"/user_uploads/21317/Uw7J0K4ELRT6kMmU88wvAQr3/73093ce6-9f93-44d2-b367-75b2ae1b2e54.jpg\"></a></div>",
        "id": 429846709,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1711542048
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"679887\">Fabrizio Romano Genovese</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429834116\">said</a>:</p>\n<blockquote>\n<p>I think what has taken everyone by surprise is the idea of a conventional war between nuclear superpowers. This flips completely the cold war posture that war between superpowers can only be a proxy war, because a direct conflict would immediately escalate to nuclear war. At least in the West, almost no one saw this coming.</p>\n</blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/Red_Storm_Rising\">https://en.wikipedia.org/wiki/Red_Storm_Rising</a></p>\n<p><a href=\"/user_uploads/21317/j19I-cs-8Qq240jq24lsaYJw/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/j19I-cs-8Qq240jq24lsaYJw/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/j19I-cs-8Qq240jq24lsaYJw/image.png\"></a></div>",
        "id": 429864634,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711547713
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Applied.20Categories.20and.20War/near/429729757\">said</a>:</p>\n<blockquote>\n<p>And this:</p>\n<blockquote>\n<p>The Association of American Universities further notes that the Department of Defense accounts for 60% of federal funding for university-based electrical engineering research, 55% for the computer sciences, 41% for metallurgy/materials engineering, and 33% for oceanography. With the DoD's budget for research and development skyrocketing, so to speak, to $66 billion for 2004 -- an increase of $7.6 billion over 2003 -- it doesn't take a rocket scientist to figure out that the Pentagon can often dictate the sorts of research that get undertaken and the sorts that don't.</p>\n</blockquote>\n</blockquote>\n<p><a href=\"https://www.amazon.com/Science-Mission-Military-Funding-Shaped/dp/022673238X\">https://www.amazon.com/Science-Mission-Military-Funding-Shaped/dp/022673238X</a><br>\n<a href=\"/user_uploads/21317/TivZoTds6n40sVEybSiFpBzp/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/TivZoTds6n40sVEybSiFpBzp/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/TivZoTds6n40sVEybSiFpBzp/image.png\"></a></div>",
        "id": 429922185,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711564065
    },
    {
        "content": "<p>Here's some text from the former US Director of the National Reconnaissance Office and Assistant Secretary of the Air Force for space:</p>\n<blockquote>\n<p>The long story short is we have algorithms that are very sensitive for denoting changes in imagery. If I take a field and the forest area around it, a deploying Soviet force would put its radars right at the edge of the field, and the missile launchers, and further into the forest would be the command control and it would be camouflaged. They’d be running cables and you would see a grouping of command and control buildings, or grouping of fire control apparatus, and the launcher. We’re looking through hundreds of thousands of acres for the mobile missiles that were extant in the Cold War. We were able to find these things, and we built algorithms to help imagery analysts find these things in the proverbial shell game. </p>\n<p>We took these algorithms and turned them onto a large number of mammograms that had been given to us by Dr. Daniel Kopans at Harvard. The head radiologist at Harvard Medical provided numerous mammograms where the pathology was known and we did a blind test with algorithms. We noticed that, with not much change, the algorithms that we used to help analysts identify dispersed missiles were very useful in denoting calcifications of breast tissue ducts that tend to calcify as a precursor for understanding where cancer may result. In these interactions, I recall an interaction with Daniel Kopans, who called and said, This is really quite revolutionary. </p>\n<p>This was undertaken as a public policy in order to aid radiologists—It increasingly occurred to me that, surprisingly, the slowest adopters of technology are doctors. They’re trained, they’re really smart, they just turn out to be—They don’t go to Best Buy and buy the most radical technology. They’re just not inclined. Dr. Kopans said, If we get this technology adopted, we would reduce breast cancer deaths by— It was something like over 40 percent. It was big.</p>\n</blockquote>\n<p><a href=\"https://millercenter.org/the-presidency/presidential-oral-histories/r-james-woolsey-oral-history\">https://millercenter.org/the-presidency/presidential-oral-histories/r-james-woolsey-oral-history</a></p>",
        "id": 429925280,
        "sender_full_name": "0xf00ba",
        "timestamp": 1711565188
    }
]