[
    {
        "content": "<p>For a moment, imagine you have written an applied category theory textbook that every first year STEM student has to buy for $200.    Sounds great right?  Well, I believe that if you are a Mathematician getting or having received a PhD in math with a serious focus on category theory, you have an attitude that will never allow this to come to pass.</p>\n<p>My background is in Physics and CS.  I know what it is like to take greatly seriously your first year chemistry course and to take calculus with about a hundred other people in the same room.</p>\n<p>Every Mathematician has to prove themselves.  This is not a surprise, of course, we all have to do this to some extent or another.  For Category theorists, this means not only understanding category theory but also understanding many, many niches of mathematics and how they relate to one another.  This puts category Theorists in a particularly bad position when they have to prove themselves.  This experience, I am guessing, leaves them with a poor appreciation for the basic struggles of burgeoning Scientists who are trying just to ingrain some calculations of general value.  They feel that math is a giant arms race.</p>\n<p>I will give an example.  I just asked a question about seeing the calculation of a monad from the adjunction that generates it.  Sure, it was simple, because it was the identity monad.  Still, I was turned away coldly here, and told it was so simple, so go do it yourself. Then I went to math-stack, where people ask basic basic questions.  On that site, I don't think there is a post where someone demonstrates the calculation explicitly of a monad from an adjunction.  I was, again told this was easy so \"no\".  I had to spend 50 points and only then did someone bother.  In the reply they said that computing the unit natural transformation was as follows:</p>\n<blockquote>\n<p>The unit is also somewhat silly. We need a map from I⇒core∘ι. But this is just a map from I⇒I, and again taking the identity arrows on each component works.</p>\n</blockquote>\n<p>If I gave that sentence to 99.9999% of the population, it would sound like a cryptic math joke.  It demonstrates what I am talking about in that there is nothing silly to having an intuition about selecting an identity for a component of a natural transformation when you are just learning this stuff.</p>\n<p>So, I feel the attitude is deeply entrenched and this is just harming your own community.</p>",
        "id": 226827143,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1613662088
    },
    {
        "content": "<p>Category theory is funny in a particular way, in that you usually are forced into trying the \"easiest\" thing possible, and it turns out it's actually the best or only way in some manner. It's hard to really get this without someone who knows standing next to you saying it's ok to try the simple thing, or to guide you to a more natural choice or whatever. </p>\n<p>\"You should try doing this yourself\" is indeed deeply entrenched in mathematical culture, and has both positive and negative faces imo. It sucks that you got turned away so much. Perhaps one could argue this is a reasonable request of someone we'd usually expect to be asking such a question: an advanced math undergrad or grad student. It's a calculation that should be very easy <em>for someone who has had years of training in a particular way of thinking</em>.</p>",
        "id": 226829047,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1613662865
    },
    {
        "content": "<p>This is an important issue. Thanks for trying to make us confront it</p>\n<p>Pure maths is in general really bad for this kind of thing, and I think category theory used to be notorious even by mathematicians' standards, perhaps it still is. Answering these \"very basic\" questions nearly always amounts to unwrapping the definitions layer by layer until you get to a point where it turns into something trivially true (like something equals itself, or something implies itself). But learning to think in terms of unwrapping definitions is a skill, that has to be learned</p>\n<p>Ultimately though, our <a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> feed <em>explicitly</em> says \"No question is dumb\" in its subtitle. Which means this sort of thing <em>shouldn't happen</em>, and if it does then the community collectively screwed up</p>",
        "id": 226830723,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613663458
    },
    {
        "content": "<p>Of course there are limits. While there are (officially) no dumb questions, there <em>are</em> bad-faith questions. And it can sometimes be hard to tell the difference...</p>",
        "id": 226830983,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613663547
    },
    {
        "content": "<p>To be clear, the response in question was not in any way dismissive:<br>\n<span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Groupoids.20and.20Sets/near/225776887\">said</a>:</p>\n<blockquote>\n<p>Every adjunction induces a monad on the domain of the left adjoint, and a comonad on the codomain. These functors are very simple, so it would be a good exercise to work out what they are yourself.</p>\n</blockquote>",
        "id": 226831317,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613663662
    },
    {
        "content": "<p>Right. There's also the fact that often the most helpful answer to a question is not to directly answer it, but to guide the asker towards the answer, because then they learn more, which was (hopefully) the actual purpose of asking in the first place. Speaking as someone who's teaching 1st years right now...</p>",
        "id": 226831652,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613663768
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226827143\">said</a>:</p>\n<blockquote>\n<p>This experience, I am guessing, leaves them with a poor appreciation for the basic struggles of burgeoning Scientists who are trying just to ingrain some calculations of general value.</p>\n</blockquote>\n<p>If anyone's experience of learning science was just \"trying to ingrain some calculations of general value\", I feel very sorry for them. There time and passion has surely been wasted.</p>",
        "id": 226831770,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613663820
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226831317\">said</a>:</p>\n<blockquote>\n<p>To be clear, the response in question was not in any way dismissive:<br>\n<span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Groupoids.20and.20Sets/near/225776887\">said</a>:</p>\n<blockquote>\n<p>Every adjunction induces a monad on the domain of the left adjoint, and a comonad on the codomain. These functors are very simple, so it would be a good exercise to work out what they are yourself.<br>\n</p>\n</blockquote>\n</blockquote>\n<p>No, but honestly I wouldn't have understood this answer on my first year of PhD. It means literally nothing unless you have already seen a fair share of cats.</p>",
        "id": 226831784,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1613663826
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226831770\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226827143\">said</a>:</p>\n<blockquote>\n<p>This experience, I am guessing, leaves them with a poor appreciation for the basic struggles of burgeoning Scientists who are trying just to ingrain some calculations of general value.</p>\n</blockquote>\n<p>If anyone's experience of learning science was just \"trying to ingrain some calculations of general value\", I feel very sorry for them. There time and passion has surely been wasted.</p>\n</blockquote>\n<p>This might be something that's obvious to us, but not obvious to everyone. I can imagine wanting to learn calculus not because you give a shit about calculus, but because sometimes a problem you actually care about reduces to solving a bunch of integrals. Category theory isn't like that... it's a way of thinking, but not really a hammer that you can hit problems with</p>",
        "id": 226832179,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613663960
    },
    {
        "content": "<p><em>We</em> know that, but we haven't said it anywhere...</p>",
        "id": 226832247,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613663985
    },
    {
        "content": "<p>This is a big reason why interdisciplinary research is so hard... miscommunications that come down to something that's so deeply ingrained you don't even notice it's there</p>",
        "id": 226832495,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613664034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226832179\">said</a>:</p>\n<blockquote>\n<p>I can imagine wanting to learn calculus not because you give a shit about calculus, but because sometimes a problem you actually care about reduces to solving a bunch of integrals. </p>\n</blockquote>\n<p>But even then, you learn to do integrals by doing examples, because more likely than not the exact integral you care about will not be the one in the integral table you want (well, Wolfram alpha means that's no longer so true, but) and you need to understand the concepts involved enough to understand the answer at the other end. Being expected to do basic exercises yourself is not unreasonable when learning any subject.</p>",
        "id": 226833565,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613664249
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226831784\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226831317\">said</a>:</p>\n<blockquote>\n<p>To be clear, the response in question was not in any way dismissive:<br>\n<span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Groupoids.20and.20Sets/near/225776887\">said</a>:</p>\n<blockquote>\n<p>Every adjunction induces a monad on the domain of the left adjoint, and a comonad on the codomain. These functors are very simple, so it would be a good exercise to work out what they are yourself.<br>\n</p>\n</blockquote>\n</blockquote>\n<p>No, but honestly I wouldn't have understood this answer on my first year of PhD. It means literally nothing unless you have already seen a fair share of cats.</p>\n</blockquote>\n<p>If you're taking an interest in particular adjunctions and monads, you surely have the resources at your disposal to do this exercise. Every book introducing both adjunctions and monads explains how the latter are induced from the former.</p>",
        "id": 226833870,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613664331
    },
    {
        "content": "<p>For people on here who ask a question and get a response that feels inadequate or makes no sense...then I recommend that you press the person who you asked the question and ask them to clarify or elaborate. If they are still dismissive at this point then it's definitely not a misunderstanding and they are probably being an ass. I am guessing that most people on here are answering in good faith, but are misunderstanding what sort of explanation would be most useful to the question asker. Certainly if I ever say something which seems opaque or dismissive to you, I want you to tell me so, so I can correct the mistake and explain it in a better way.</p>",
        "id": 226834520,
        "sender_full_name": "Jade Master",
        "timestamp": 1613664477
    },
    {
        "content": "<p>I've quickly become the contrarian in this discussion, so let me at least make a point to that effect.<br>\nTo paraphrase what Jules said, category theory is not a hammer that you can immediately pick up and hit problems with. If a hammer is what you were hoping for, <span class=\"user-mention\" data-user-id=\"308261\">@Ben Sprott</span>, then you aren't the first person to be frustrated. Category theory is more like a pulley mechanism: you have to pull the rope ten times as far, but in exchange you'll have lifted ten times the weight at the end of it.</p>",
        "id": 226836017,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613664992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308261\">@Ben Sprott</span>  If you would still like a more detailed explanation of how to get a monad from an adjunction then let me know. I'd be happy to spell everything out in complete detail.</p>",
        "id": 226836092,
        "sender_full_name": "Jade Master",
        "timestamp": 1613665020
    },
    {
        "content": "<p>I agree that the best way to learning some category theory is to work out problems yourself.  I also feel that the lack of widely accepted scientific or engineering uses for category theory leaves it a bit stuck in a particular kind of world.  I just felt that an example of this calculation should be somewhere on the internet.  Also, I am guilty of just wanting to see the calculation out of a hope that it would help my thinking rather than show me how to do the calculation.</p>",
        "id": 226836939,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1613665261
    },
    {
        "content": "<p>To those in the know, it is clear that the solution would be found in any introductory category theory textbook. But I can see how a newcomer would not have that information. A better answer would say something like \"If you get stuck, check out [my favourite introduction to category theory]\"</p>",
        "id": 226837220,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613665343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> thank you for offering.  I did get a example at math-stack.  However, any help you would like to offer is most appreciated.  I am now more interested in the adjunction between Set and Groupoid where the functor takes a set, treats every element as an object, and returns a groupoid with exactly one iso between each object.  I was told that this is one of two classic ways to have an adjunction between Set and Groupoid.  How do you propose we work on this?  If we walk through it on learning questions it will get pretty gruesome as my skills are pretty bad.</p>",
        "id": 226840883,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1613666620
    },
    {
        "content": "<p>It is evidently not true that all questions are the same. I remember when I was a freshmen I could not understand the very definition of vector space, I was so far for the language of formal mathematics that strings of symbols were just inaccessible to me. </p>\n<p>People kept saying me \"What don't you understand? There is nothing to grasp\". Were they kind? Of course not, and they did not try and understand how come that I could not grasp such a triviality.</p>\n<p>Now, of course this is bad, and very often people do not realize that people can have a special background, and more generally their reasons not to understand something.</p>\n<p>Although, we should not entirely forget about individual responsibility. If absolutely everybody tells you that something is easy, and you have no reasons to believe that they are evil people, you should spend a bit of time asking yourself \"what is precisely that confuses me? and why does it happen?\".</p>\n<p>In my case, this was a very important step, which was pushed by the \"negative feedback\" of my community, and eventually led to the understanding that my pov on formal mathematics was very immature.</p>\n<p>All in all, sometimes people are ruthless, but the content of what they say might still be valuable, and one should try and analyze it. If you cannot solve such a simple exercise in category theory, what's wrong with your understanding of the basic notions? Maybe you are just lazy, or maybe you did not study well enough the very definition of functor. Maybe you should go back to the most simple exercises of Leinster's book. Maybe none of the previous, and you just had back luck with the people you spoke with, but completely ignoring their feedback just seems like missing an opportunity to me.</p>\n<p>Very often we are immersed in toxic environments, but let's just not assume that every negative feedback is an instance of a toxic behavior. Negative feedbacks are important in the learning process.</p>",
        "id": 226845345,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1613668305
    },
    {
        "content": "<blockquote>\n<p>If we walk through it on learning questions it will get pretty gruesome as my skills are pretty bad.</p>\n</blockquote>\n<p>It's not gruesome; that's exactly what <a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> is for.   Nobody who doesn't want to help you learn this will be <em>forced</em> to be pay attention.</p>",
        "id": 226846181,
        "sender_full_name": "John Baez",
        "timestamp": 1613668649
    },
    {
        "content": "<p>It's much better to do these things in public than privately, because if there's something one person doesn't understand, there are always lots of other people who also don't understand it, who would benefit from watching it being explained.</p>",
        "id": 226846383,
        "sender_full_name": "John Baez",
        "timestamp": 1613668720
    },
    {
        "content": "<p>It's easy to \"mute\" a particular discussion: just click on the three little gray dots that appear when you move your cursor near the time-of-day number at right of a given comment, and follow the instructions there.  So nobody has to watch something learn something, if doing so makes them unhappy.</p>",
        "id": 226846883,
        "sender_full_name": "John Baez",
        "timestamp": 1613668941
    },
    {
        "content": "<p>even quicker, there's this button:</p>",
        "id": 226847223,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1613669112
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/yuP-vKSb0R6-k4gf4EoSYXUH/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/yuP-vKSb0R6-k4gf4EoSYXUH/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/yuP-vKSb0R6-k4gf4EoSYXUH/image.png\"></a></div>",
        "id": 226847227,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1613669114
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226845345\">said</a>:</p>\n<blockquote>\n<p>Very often we are immersed in toxic environments, but let's just not assume that every negative feedback is an instance of a toxic behavior. Negative feedbacks are important in the learning process.</p>\n</blockquote>\n<p>Is there proof for this, I have read several books on didactics (old and new) and this doesn't make sense to me. Maybe it is because it really doesn't work with me and if anything did damage to my math education and caused all sorts of insecurities. It wasn't until I felt safe to ask whatever and <em>know</em> I am not going to be told I should know that or that it is easy that I made progress and was rather surprised myself at that. Generally, just because you overcame something it does not mean it should be the de facto response for everyone else.</p>",
        "id": 226847585,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1613669282
    },
    {
        "content": "<p>And I feel strongly about that in my teaching, personally. Not to make all things easy but to give people the opportunity to work with the more knowledgeable person to understand more without completely locking up.</p>",
        "id": 226847810,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1613669375
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226847585\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226845345\">said</a>:</p>\n<blockquote>\n<p>Very often we are immersed in toxic environments, but let's just not assume that every negative feedback is an instance of a toxic behavior. Negative feedbacks are important in the learning process.</p>\n</blockquote>\n<p>Is there proof for this, I have read several books on didactics (old and new) and this doesn't make sense to me. Maybe it is because it really doesn't work with me and if anything did damage to my math education and caused all sorts of insecurities. It wasn't until I felt safe to ask whatever and <em>know</em> I am not going to be told I should know that or that it is easy that I made progress and was rather surprised myself at that. Generally, just because you overcame something it does not mean it should be the de facto response for everyone else.</p>\n</blockquote>\n<p>Let's just not transform the law of the jungle in the tyranny of the weak.</p>",
        "id": 226848237,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1613669564
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> I don't know if I understand what you are trying to say with that, could you expand? I didn't claim that we need to reduce our standards but negative feedback is but one approach and some of us work better with people rather than with books and solitude... (we also all come from different background, I can assure you you know something I don't but it's the other way around too)</p>",
        "id": 226848551,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1613669689
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226848551\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> I don't know if I understand what you are trying to say with that, could you expand? I didn't claim that we need to reduce our standards but negative feedback is but one approach and some of us work better with people rather than with books and solitude... (we also all come from different background, I can assure you you know something I don't but it's the other way around too)</p>\n</blockquote>\n<p>I am sorry Giorgos, I honestly have the impression that you did not read my initial answer, or that you are trying to bend my words towards a kind of \"Man, you are stupid, just die. Life is hard\". I will not enter in a discussion that smells like a trap. From the content of this message it is pretty evident that you are ignoring entire portions of what I wrote.</p>\n<p>I am very worried, even terrified, by living in times when the sentence \"let's just not assume that every negative feedback is an instance of a toxic behavior\" can be targeted of such an attack, especially given the additional context of my answer.</p>",
        "id": 226849177,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1613669949
    },
    {
        "content": "<p>Sorry I was actually curious and certainly not setting up a \"trap\". I did read you message in full though but everyone decides where, how and with whom to engage.</p>",
        "id": 226849410,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1613670044
    },
    {
        "content": "<p>I think this thread isn't about to go out of control, but just in case I'm going to put my moderator hat on and look suggestively at it <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 226855780,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613672592
    },
    {
        "content": "<p>(In the course of searching for a hat emoji, I have decided that my moderator hat looks like this: <span aria-label=\"top hat\" class=\"emoji emoji-1f3a9\" role=\"img\" title=\"top hat\">:top_hat:</span>)</p>",
        "id": 226855859,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613672623
    },
    {
        "content": "<p>Cool!  Are there any other choices of hat?  I don't mind wearing a top hat though.</p>",
        "id": 226856091,
        "sender_full_name": "John Baez",
        "timestamp": 1613672709
    },
    {
        "content": "<p>Here is me with my new moderator's hat:</p>\n<p><span aria-label=\"cowboy\" class=\"emoji emoji-1f920\" role=\"img\" title=\"cowboy\">:cowboy:</span></p>",
        "id": 226856153,
        "sender_full_name": "John Baez",
        "timestamp": 1613672736
    },
    {
        "content": "<p>At least on my client the emoji box has a text search</p>",
        "id": 226856213,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613672758
    },
    {
        "content": "<p>I was actually looking for the cowboy hat, but it turns out that it doesn't match a text search for \"hat\"</p>",
        "id": 226856288,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613672776
    },
    {
        "content": "<p>I searched under \"cowboy\".   Every cowboy is equipped with a hat.</p>",
        "id": 226856354,
        "sender_full_name": "John Baez",
        "timestamp": 1613672800
    },
    {
        "content": "<p>I'm not sure cowboys would make good forum moderators. They have a deep sense of justice, but they also tend to shoot first and ask questions later</p>",
        "id": 226856475,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613672850
    },
    {
        "content": "<p>Good for wrestling questions to the ground...</p>",
        "id": 226857602,
        "sender_full_name": "John Baez",
        "timestamp": 1613673237
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226855780\">said</a>:</p>\n<blockquote>\n<p>I think this thread isn't about to go out of control, but just in case I'm going to put my moderator hat on and look suggestively at it <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>\n</blockquote>\n<p>It seems I came across more terse/annoyed/whatever than intended. I am not any of those things was just having a discussion, obviously written text makes it difficult to translate context but I still apologize if this seemed adversarial on my part.</p>",
        "id": 226858206,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1613673435
    },
    {
        "content": "<p>Re \"a question about seeing the calculation of a monad from the adjunction that generates it\":<br>\nWell, 14 years ago The Catsters (Eugenia Cheng in this case) did this very completely in under 10 minutes on Youtube.  Look it up for a very nice (and at times amusing) presentation. \"Adjunctions 4\".</p>",
        "id": 226869633,
        "sender_full_name": "Robert Seely",
        "timestamp": 1613677887
    },
    {
        "content": "<p>I've seen, and been involved in some of the exchanges <span class=\"user-mention\" data-user-id=\"308261\">@Ben Sprott</span> has had, around the traps. I've come way not liking how the interaction turned out, and part of the blame is on me, I'm sorry to say. However, I've had a think about <em>why</em> I've gotten frustrated, and want to give a fictionalised account of how someone might have viewed what was going on. I hope this helps Ben, but also others, to approach this type of questioning in a way that will lead to more fruitful outcomes.</p>",
        "id": 226893229,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613687279
    },
    {
        "content": "<p>First, I want to give what one might call a \"clean\" example of how such questions might be posed. It's not the only right way, but its one that would make me recognise more quickly what the questioner wanted.</p>\n<blockquote>\n<p>Hi, I'm trying to learn about adjunctions and monads, and to check my understanding I'd like to work through the details from a specific example. I have a background in physics, so this type of extreme abstraction is new to me. Here's my example, [...something involving groupoids and sets...]</p>\n</blockquote>",
        "id": 226894473,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613687929
    },
    {
        "content": "<p>Hey All, I just got though a proof by interacting on the learning questions.  It was very good.  I did expect that.  I have seen other teaching episodes on that section and they were quite pleasant.  I really didn't want to start a discussion about the quality of interaction here.  I think it's quite high.  I really wanted to start a discussion about a possible future for category theory where first year students are given lectures in huge halls full of people like the way calculus is now.  My belief is that this will not happen if category theory is used primarily to prove the best Mathematicians out there.  Of course, we need that great application that every student will benefit from, as they do from calculus.  I am trying to establish that, actually, as are many other people here. It's a bit of cart before the horse I am advocating for.</p>",
        "id": 226894827,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1613688142
    },
    {
        "content": "<p>I want to reiterate that Ben deserves decent treatment however he phrases his questions, and the above is an oversimplification. But I want to illustrate the sort of question that makes people wary, given their past experiences. This is a caricature, but tailored to the case at hand.</p>\n<blockquote>\n<p>HI, I'm trying to figure out a new fundamental theory of physics using information and I think monads will help me do it. I've heard that groupoids are important, so I think I should use those as well. So I want a monad on groupoids. Apparently there's one that arises from these functors [...same example as before...], so can someone show me how to work out the details?</p>\n</blockquote>",
        "id": 226895024,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613688253
    },
    {
        "content": "<p>It has always been difficult for Mathematicians online to deal with me.  I am always typing at my desk at work at some engineering job with no time and lots of resentment.  It's terrible.  I have always given those people the benefit of the doubt.</p>",
        "id": 226895220,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1613688378
    },
    {
        "content": "<p>This sort of phrasing of a question is like a big red flag, I must admit. The question itself about the monad is exactly the same. But the context is something that scares people off. And, especially, for a category theorist who is in a position to answer such a question, they know that the mileage one can get out of the monad in question is limited. So the quest stated up front is doomed to fail with the tools proposed. </p>\n<p>Matters are compounded if the question is asked in various forms with different examples, since it looks less like someone trying to learn category theory in good faith (which I don't doubt is what is happening, here), and more like a fishing expedition.</p>",
        "id": 226895249,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613688400
    },
    {
        "content": "<p>Unfortunately, I think you would benefit from some actual face-to-face discussion in front of a board, where diagrams can be drawn and concepts interrogated in real time.</p>",
        "id": 226895314,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613688441
    },
    {
        "content": "<p>Text-based discussion is difficult here, because people can read things into what is being said based on their prior experiences. We had one person at the nForum/nLab nearly a decade ago that ended up being a bit of a crank, trying to shoehorn categories into places in a way that wasn't helpful. It took a lot of energy and time to deal with the matter, and some times people are trying to avoid getting drawn into such discussions, even if they have misread the situation.</p>",
        "id": 226895558,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613688594
    },
    {
        "content": "<p>So I'm sorry, for my part, for the way your questions have been received. But these two examples I hope show how framing can really change the perception of what is going on from the point of view of people trying to answer the question. I don't doubt you can grasp this stuff, but sometimes it is difficult for people to pinpoint exactly what sort of thing will be most helpful for you, based on how they are perceiving the questions (for better or worse).</p>",
        "id": 226896018,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613688834
    },
    {
        "content": "<p>In any case, I hope you can take something useful away from this. It may be a bit raw, but in case you were mystified why your good-faith questions were received as they were, this is what I can guess was going through at least some people's minds.</p>",
        "id": 226896468,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613689071
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226836939\">said</a>:</p>\n<blockquote>\n<p>I agree that the best way to learning some category theory is to work out problems yourself.  I also feel that the lack of widely accepted scientific or engineering uses for category theory leaves it a bit stuck in a particular kind of world.  I just felt that an example of this calculation should be somewhere on the internet.  Also, I am guilty of just wanting to see the calculation out of a hope that it would help my thinking rather than show me how to do the calculation.</p>\n</blockquote>\n<p>The problem is that it takes years to learn the language in which these solutions can be expressed in all details. What we see everywhere is a mix of mathematical expressions and English, with lots of ``it is obvious that''s sprinkled in the middle. I took me ages to realize that the right language for writing the details is very close to lambda-calculus, but with some types and terms omitted...</p>",
        "id": 226920093,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1613709985
    },
    {
        "content": "<p>I had a student do their honours thesis in category theory, and I was quite frankly surprised at how long proofs of what are non-deep results became when written out in full detail, compared to how I would write them down for myself or for another mathematician. If I underestimated how long they would be, and I'm familiar with the material, I can imagine that for someone who has no or little experience with category theory there is a real danger in them picking up the wrong signal from the more experienced people about how much work is ahead of them.</p>",
        "id": 226921979,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613712185
    },
    {
        "content": "<p>If someone well-versed in category theory says \"oh, you just need to show there is a isomorphism natural in both variables...\", then until this becomes second nature, one really needs to spell out all the gory details and pay close attention to what seem like trivialities in the definitions. This is the mental exercise that allows one to become acquainted with category theory. Schanuel and Lawvere's book _Conceptual Mathematics_ is famously a bit like this: the exercises seem trivial on reading over them at the start, but if you don't do them then partway through the book the inexperience reader will suddenly realise they have no idea what is going on, but without ever noticing things slipping out of their grasp until that point. The trivialities can't be skipped, because they need to become unconscious, reflexive even, in order to \"get\" proofs in category theory.</p>",
        "id": 226922319,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613712705
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226922319\">said</a>:</p>\n<blockquote>\n<p>If someone well-versed in category theory says \"oh, you just need to show there is a isomorphism natural in both variables...\", then until this becomes second nature, one really needs to spell out all the gory details and pay close attention to what seem like trivialities in the definitions.</p>\n</blockquote>\n<p>Isn't this true of literally all of pure maths? Algebra, analysis, geometry... all have a language that you need to become fluent in for the results to make sense or even be meaningful. It has nothing to do with being \"used primarily to prove the best Mathematicians out there\" as <span class=\"user-mention\" data-user-id=\"308261\">@Ben Sprott</span> puts it.</p>\n<p>Sometimes results from these subjects can be applied without having to develop an understanding the formal concepts involved. This is how calculus comes out of analysis, for example: you can learn to integrate by parts without ever learning why integration works like that. By not learning <em>why</em> you also don't learn exactly <em>when</em> a result applies, but in practice, with calculus at least, one can put off or completely avoid worrying about such issues.<br>\nCategory theory has plenty of such results. The fact that a right adjoint preserves arbitrary limits is an example: you don't need to know how to check whether a functor has a left adjoint if you are provided with one, and then you can apply the result without worrying about why it works.<br>\nBut returning to the former example, what if you are presented with a more exotic function that you aren't sure is integrable? You might be frustrated when you can't find a good explanation of how to check for yourself whether this specific function is integrable, or you might be dissatisfied with the \"obvious\" reasons that it is or isn't so, just as you might be dissatisfied with explanations of how to check that two functors are adjoint to one another.</p>\n<p>It is unfair to say this is a failing of the people responding to you, or of the community they belong to, because it is actually a shortcoming of the mathematical education given to scientists (or broader society!) in instilling a mentality of rote learned calculation over fundamental understanding, and by extension creating an expectation that the raw calculation tools for that rote learning should be readily and effortlessly available. (The same shortcoming is extremely problematic in applications of statistics, where the constraints are a lot more subtle than in calculus.) There are whole textbooks and databases of integrals, but they didn't come out of nowhere: at some point, someone had to do the work in applying various theorems of analysis to compute them, and people have had centuries longer to do that for calculus than they have for category theory.<br>\nOne day, engineers will be able to look in a big database of adjunctions and read off their properties. There may even be a resource like Wolfram Alpha which takes them through calculations step by step. But I don't look forward to a world where people mindlessly apply CT results like they do statistics, and so I encourage you to have the patience to find the resources you need (including but not limited to interactions here on Zulip) to learn the fundamental results in enough detail to work out exercises for yourself.</p>",
        "id": 226948441,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1613732507
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226836017\">said</a>:</p>\n<blockquote>\n<p>I've quickly become the contrarian in this discussion, so let me at least make a point to that effect.<br>\nTo paraphrase what Jules said, category theory is not a hammer that you can immediately pick up and hit problems with. [...] Category theory is more like a pulley mechanism: you have to pull the rope ten times as far, but in exchange you'll have lifted ten times the weight at the end of it.</p>\n</blockquote>\n<p>This a beautiful way to describe CT. Love it.</p>",
        "id": 226951088,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1613734304
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226948441\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226922319\">said</a>:</p>\n<blockquote>\n<p>If someone well-versed in category theory says \"oh, you just need to show there is a isomorphism natural in both variables...\", then until this becomes second nature, one really needs to spell out all the gory details and pay close attention to what seem like trivialities in the definitions.</p>\n</blockquote>\n<p>Isn't this true of literally all of pure maths? </p>\n</blockquote>\n<p>Yes!   To get into pure mathematics and learn its ways of thinking seems to take most people at least 7 years of hard work.  </p>\n<p>\"Applied category theory\" is a funny thing, because the adjective \"applied\" means different things to different people, and some people may bump into this nascent subject without realizing it's still largely dominated by people who think and talk like pure mathematicians.  Someday that may change.</p>",
        "id": 227053962,
        "sender_full_name": "John Baez",
        "timestamp": 1613783586
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/226894827\">said</a>:</p>\n<blockquote>\n<p>I really wanted to start a discussion about a possible future for category theory where first year students are given lectures in huge halls full of people like the way calculus is now.  My belief is that this will not happen if category theory is used primarily to prove the best Mathematicians out there.  Of course, we need that great application that every student will benefit from, as they do from calculus.  I am trying to establish that, actually, as are many other people here. It's a bit of cart before the horse I am advocating for.</p>\n</blockquote>\n<p>It looks like nobody else took this as bait! I think I'm really surrounded on all sides by people who'll disagree with me here. To me, teaching calculus en mass to 1st years is a terrible idea, and teaching category theory en mass to 1st years is a slightly better but still overall bad idea</p>",
        "id": 227094878,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613831376
    },
    {
        "content": "<p>There's for sure some benefit to putting carts before horses when teaching abstract ideas, for example it probably makes sense to teach basic abstract algebra before Galois theory, point set topology before measure theory, etc etc. But to me giving category theory to 1st years is taking it too far</p>",
        "id": 227094981,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613831491
    },
    {
        "content": "<p>Yes I agree. This style of teaching with hundreds of students and one lecturer is far from ideal in my opinion.</p>",
        "id": 227112422,
        "sender_full_name": "Jade Master",
        "timestamp": 1613849527
    },
    {
        "content": "<p>IMO math education should be modeled on music education.  Private lessons</p>",
        "id": 227130024,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1613867596
    },
    {
        "content": "<p>This would be good in some society that doesn't aim at mass-producing a \"skilled labor force\".</p>",
        "id": 227133476,
        "sender_full_name": "John Baez",
        "timestamp": 1613871949
    },
    {
        "content": "<p>In our society people need degrees to get lots of jobs, and all STEM degrees require calculus, so universities mass-teach calculus.</p>",
        "id": 227133553,
        "sender_full_name": "John Baez",
        "timestamp": 1613872032
    },
    {
        "content": "<p>For some of these jobs knowing calculus is actually useful.  For some degrees math is used as a \"filter\" - i.e., they deliberately require people to get good grades in some courses that lots of people don't get good grades in, to limit the number of people with those degrees.   I guess med school deliberately filters out students to keep the salaries of doctors high.</p>",
        "id": 227133629,
        "sender_full_name": "John Baez",
        "timestamp": 1613872148
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/227130024\">said</a>:</p>\n<blockquote>\n<p>IMO math education should be modeled on music education.  Private lessons</p>\n</blockquote>\n<p>At least in the UK, music education is only available to people who are sufficiently privileged (by and large), and I certainly wouldn't want maths to go in this direction</p>",
        "id": 227133636,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613872157
    },
    {
        "content": "<p>I bet Joshua is (unrealistically? idealistically?) imagining a future where almost anyone who wants to can somehow get private lessons in math.</p>",
        "id": 227133703,
        "sender_full_name": "John Baez",
        "timestamp": 1613872223
    },
    {
        "content": "<p>It's probably good to separately discussing utopian ideals and ways to tweak the existing setup by some small amount delta to make it epsilon better.</p>",
        "id": 227133741,
        "sender_full_name": "John Baez",
        "timestamp": 1613872281
    },
    {
        "content": "<p>I was definitely thinking that the idea of large classes of students all taking calculus is a historical accident, and more so in the US, as far as I understand it, where people are made to take calculus who aren't studying a maths/phyisics/engineering degree. It would be much better to teach med students and people getting a liberal arts education statistics and <em>not</em> calculus. It needs to be taught well, and can be taught very badly , of course. If anything, a version of category theory in the style of what I think Eugenia Cheng teaches would be better or at least more appropriate for large undergrad classes as a general enrichment subject.</p>",
        "id": 227135147,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1613873922
    },
    {
        "content": "<p>Yes, statistics would be great in college, and basic financial math and \"household economics\" would be good in high school or middle school - so many people suffer because they don't understand how money works.</p>",
        "id": 227135701,
        "sender_full_name": "John Baez",
        "timestamp": 1613874644
    },
    {
        "content": "<p>Basic combinatorics is also a better value proposition than memorising an integral table, like what I had at school</p>",
        "id": 227137878,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613877729
    },
    {
        "content": "<p>Since I'm a mathematical physicist I always loved integrals, never had to \"memorize\" them, and I've used them a lot over the years.  But most students probably don't get their money's worth out of calculus.</p>",
        "id": 227139247,
        "sender_full_name": "John Baez",
        "timestamp": 1613879686
    },
    {
        "content": "<p>With the decline in importance of analogue circuits and the rise of importance of digital circuits, the number of engineers who need to be really good at calculus has probably dropped.</p>",
        "id": 227139515,
        "sender_full_name": "John Baez",
        "timestamp": 1613880116
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/227135701\">said</a>:</p>\n<blockquote>\n<p>Yes, statistics would be great in college, and basic financial math and \"household economics\" would be good in high school or middle school - so many people suffer because they don't understand how money works.</p>\n</blockquote>\n<p>Mildly interesting fact: in English \"economics\" started out meaning what we now call home economics, managing a household. The root word is Greek oikos <em>household</em> (same root as ecology). I think it was around the time of Adam Smith that it started to be used by analogy for managing the \"household\" that is a country. And then eventually they became fully reversed, with political economics the default</p>",
        "id": 227159762,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613904613
    },
    {
        "content": "<p>So “home economics” is “home home management”?</p>",
        "id": 227160087,
        "sender_full_name": "James Wood",
        "timestamp": 1613905040
    },
    {
        "content": "<p>Yeah, I think so</p>",
        "id": 227160102,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613905071
    },
    {
        "content": "<p>In the US there used to be courses on [home economics](</p>\n<blockquote>\n<p>Over the years, homemaking in the United States has been a foundational piece of the education system, particularly for women. These homemaking courses, called home economics, have had a prevalent presence in secondary and higher education since the 19th century. By definition, home economics is \"the art and science of home management,\" meaning that the discipline incorporates both creative and technical aspects into its teachings. Home economics courses often consist of learning how to cook, how to do taxes, and how to perform child care tasks. In the United States, home economics courses have been a key part of learning the art of taking care of a household. One of the first to champion the economics of running a home was Catherine Beecher, sister to Harriet Beecher Stowe.</p>\n<p>Since the nineteenth century, schools have been incorporating home economics courses into their education programs. In the United States, the teaching of home economics courses in higher education greatly increased with the Morrill Act of 1862. Signed by Abraham Lincoln, the Act granted land to each state or territory in America for higher educational programs in vocational arts, specifically mechanical arts, agriculture, and home economics. Such land grants allowed for people of a wider array of social classes to receive better education in important trade skills.</p>\n<p>Home economics courses mainly taught students how to cook, sew, garden, and take care of children. The vast majority of these programs were dominated by women. Home economics allowed for women to receive a better education while also preparing them for a life of settling down, doing the chores, and taking care of the children while their husbands became the breadwinners. At this time, homemaking was only accessible to middle and upper class white women whose families could afford secondary schooling.</p>\n<p>In the late 19th century, the Lake Placid Conferences took place. The conferences consisted of a group of educators working together to elevate the discipline to a legitimate profession. Originally, they wanted to call this profession \"oekology\", the science of right living. However, \"home economics\" was ultimately chosen as the official term in 1899.</p>\n</blockquote>",
        "id": 227183005,
        "sender_full_name": "John Baez",
        "timestamp": 1613929917
    },
    {
        "content": "<p>I don't know what \"home ec\" is like nowadays - when I took it I learned a bit of woodworking and metalworking, but I felt about it what Freyd felt about analysis.</p>",
        "id": 227183190,
        "sender_full_name": "John Baez",
        "timestamp": 1613930125
    },
    {
        "content": "<p>So like Freyd I'm inclined to reform the subject I didn't like in school...</p>",
        "id": 227183288,
        "sender_full_name": "John Baez",
        "timestamp": 1613930253
    },
    {
        "content": "<p>I suspect that home economics is a perfectly sensible subject whose perception was basically killed by the sexist way it was used in the education system... which might or might not have been well meaning when it was first set up, but then out stayed its welcome</p>",
        "id": 227183350,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613930324
    },
    {
        "content": "<p>I think home economics should teach about the things people tend to struggle with, and one of them is the mathematics of finance that ordinary folks should know.</p>\n<p>In reality probably few would enjoy this course... even though it would be helpful.</p>",
        "id": 227183355,
        "sender_full_name": "John Baez",
        "timestamp": 1613930341
    },
    {
        "content": "<p>My wife's high school taught home ec in an interesting way: the boys had to learn to cook and sew; the girls had to learn carpentry and such.</p>",
        "id": 227183385,
        "sender_full_name": "John Baez",
        "timestamp": 1613930384
    },
    {
        "content": "<p>She liked it!</p>",
        "id": 227183391,
        "sender_full_name": "John Baez",
        "timestamp": 1613930394
    },
    {
        "content": "<p>The closest thing we had to something like that in school was Design and Technology, where we did a bit of woodworking and learned about various aspects of manufacturing processes: what is the difference between injection molding and vacuum forming, etc.</p>",
        "id": 227183520,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613930514
    },
    {
        "content": "<p>My school did the same thing, but by that point (at the beginning of the 2000s) all of cookery, sewing, woodwork and metalwork had been rebranded together as a single subject called \"design technology\". I have no idea if that still exists or not</p>",
        "id": 227183526,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613930519
    },
    {
        "content": "<p>Cooking was a separate subject called \"Food Technology\", but I'm not sure how instructive it would've been as my school didn't offer it until I was gone</p>",
        "id": 227183583,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613930561
    },
    {
        "content": "<p>It was a massive joke, where in a typical term we spent 2 weeks cooking (which was almost always a disaster), and then the rest of the term writing marketing materials for our failed cooking</p>",
        "id": 227183586,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613930567
    },
    {
        "content": "<p>It was <em>very</em> obviously a pipeline to the advertising industry</p>",
        "id": 227183611,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613930591
    },
    {
        "content": "<p>Trying to market badly cooked food: a useful skill in Britain.</p>",
        "id": 227183637,
        "sender_full_name": "John Baez",
        "timestamp": 1613930631
    },
    {
        "content": "<p>........ you win</p>",
        "id": 227183698,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613930664
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/227183611\">said</a>:</p>\n<blockquote>\n<p>It was <em>very</em> obviously a pipeline to the advertising industry</p>\n</blockquote>\n<p>I think it's more a case that writing about doing all these things like cooking and making stuff is significantly cheaper than actually doing those things</p>",
        "id": 227183703,
        "sender_full_name": "Nick Hu",
        "timestamp": 1613930677
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Attitudes.20that.20hinder.20the.20adoption.20of.20applied.20category.20th.2E.2E.2E/near/227183637\">said</a>:</p>\n<blockquote>\n<p>Trying to market badly cooked food: a useful skill in Britain.</p>\n</blockquote>\n<p><em>shivers in haggis and jellied eels</em></p>",
        "id": 227187329,
        "sender_full_name": "José Siqueira",
        "timestamp": 1613934462
    },
    {
        "content": "<p>Recently while in my local supermarket I was a bit disturbed to learn that canned haggis is a thing that exists</p>",
        "id": 227188134,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613935289
    },
    {
        "content": "<p>I had a cooking class in highschool. It was good.</p>",
        "id": 227188368,
        "sender_full_name": "Jade Master",
        "timestamp": 1613935558
    },
    {
        "content": "<p>I wish I'd had one, but luckily my mom cooked a lot and I sort of picked it up from watching.</p>",
        "id": 227189809,
        "sender_full_name": "John Baez",
        "timestamp": 1613937043
    },
    {
        "content": "<p>I'd been hearing scary stories about haggis all my life, so when I finally had it at a campus hotel in Edinburgh where I stayed for CT2019, I was surprised by how good and unscary it was!   So then I formulated this rule: if a lot of people eat a food that sounds disgusting, it must taste pretty good or they wouldn't eat it.</p>",
        "id": 227189949,
        "sender_full_name": "John Baez",
        "timestamp": 1613937205
    },
    {
        "content": "<p>Eel pie is also great.    Of course if one is a vegetarian one is excused from liking all such things.  I can certainly get into a mood where I think <em>all</em> dead animals are disgusting to eat.</p>",
        "id": 227190042,
        "sender_full_name": "John Baez",
        "timestamp": 1613937295
    },
    {
        "content": "<p>I think the conversation is now gradually looping back to the topic \"Attitudes that hinder the adoption of applied category theory\".</p>",
        "id": 227190184,
        "sender_full_name": "John Baez",
        "timestamp": 1613937459
    },
    {
        "content": "<p>Now it's at \"things we have trouble swallowing\".</p>",
        "id": 227191438,
        "sender_full_name": "John Baez",
        "timestamp": 1613938737
    },
    {
        "content": "<p>ct zulip: from monads to eel pie</p>",
        "id": 227215836,
        "sender_full_name": "Christian Williams",
        "timestamp": 1613964864
    },
    {
        "content": "<p>I don't believe any of the schools in the area I grew up have a home ec course. I perceive it as a thing of the past.</p>",
        "id": 227304624,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614014837
    }
]