[
    {
        "content": "<p>It seems unlikely that the US government would demand that Cornell destroy the arXiv.   But the many copies of the arXiv around the world were <a href=\"https://info.arxiv.org/help/mirrors.html\">shut down on September 15, 2024</a> and it seems that now all the data resides in the US.   </p>\n<p>If anyone <em>wants</em> to back up the arXiv, they should go here:</p>\n<ul>\n<li><a href=\"https://info.arxiv.org/help/bulk_data_s3.html\">arXiv Bulk Data Access - Amazon S3</a>.</li>\n</ul>\n<p>The complete arXiv was 2.7 terabytes in March 2023, and growing at about 100 gigabytes a month.</p>\n<p>Also read this:</p>\n<ul>\n<li><a href=\"https://info.arxiv.org/help/api/index.html\">arXiv API access</a>.</li>\n</ul>",
        "id": 505547555,
        "sender_full_name": "John Baez",
        "timestamp": 1741909914
    },
    {
        "content": "<p>While it may seem likely that the US government would demand that Cornell destroy the arXiv, enough cuts to funding Cornell may result in Cornell no longer being able to afford maintaining the arXiv.</p>",
        "id": 505812820,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742016793
    },
    {
        "content": "<p>the internet seems to be saying that it costs about $100 in AWS fees to download the arxiv.  It's a user pays for download bandwidth model.</p>",
        "id": 505869230,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1742060370
    },
    {
        "content": "<p>When I raised this issue on Mastodon, <a href=\"https://mathstodon.xyz/@moritz_negwer@mstdn.science/114159102916982824\">someone did a little calculation estimating $720 for that</a>, but there is also a <a href=\"https://mathstodon.xyz/@johncarlosbaez/114157830158526572\">cheaper way</a>, it seems.</p>",
        "id": 505881127,
        "sender_full_name": "John Baez",
        "timestamp": 1742069251
    },
    {
        "content": "<p>Some outside the US have offered to set up a mirror of the arXiv, but when the system of mirror websites was taken down on Sept. 15th, the arXiv switched to using the cloud (Amazon) in a way that might make it harder to restart the mirror system - I'm not sure.</p>",
        "id": 506551333,
        "sender_full_name": "John Baez",
        "timestamp": 1742322446
    },
    {
        "content": "<p><span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span> another community resource entrusted to Amazon? <a href=\"#narrow/stream/229451-meta.3A-off-topic/topic/Amazon.20military.20services\">Eek</a>...</p>",
        "id": 506670596,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1742374874
    },
    {
        "content": "<p>Yes.  And the arXiv also has policies that make it difficult to legally copy it and distribute the articles!   <a href=\"https://info.arxiv.org/help/bulk_data_s3.html\">They write</a>:</p>\n<blockquote>\n<p><em>Note: Most articles submitted to arXiv are submitted with the <a href=\"http://arxiv.org/licenses/nonexclusive-distrib/1.0/license.html\">default arXiv license</a>, which grants arXiv a perpetual, non-exclusive license to distribute the article, but does not assign copyright to arXiv, nor grant arXiv the right to grant any specific rights to others. <strong>We are thus unable to grant others the right to distribute arXiv articles</strong>. If you build indexes or tools based on the full-text, you must link back to arXiv for downloads. A small fraction of submissions are made with <a href=\"https://info.arxiv.org/help/license/index.html\">other licenses</a> and this information is available in the OAI-PMH metadata.</em></p>\n</blockquote>\n<p>(Emphasis mine.)</p>",
        "id": 506798537,
        "sender_full_name": "John Baez",
        "timestamp": 1742408215
    },
    {
        "content": "<p>This makes it easier for bad actors to knock out the arXiv at a single location.  If this happened, the good guys might have to download the arXiv papers from the <a href=\"https://mathstodon.xyz/@johncarlosbaez/114157830158526572\">Internet Archive</a> and build a new interface.   </p>\n<p>I don't know if <a href=\"https://annas-archive.org/?trk=public_post-text\">Anna's archive</a> has copied the arXiv.   I'm becoming more and more sympathetic to this pirate organization.</p>",
        "id": 506799610,
        "sender_full_name": "John Baez",
        "timestamp": 1742408563
    },
    {
        "content": "<p>That's so disappointing, since it seems like probably an unintended consequence.</p>",
        "id": 506799646,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1742408577
    },
    {
        "content": "<p>Yes, I think that decision was based on optimistic assumptions like 1) the arXiv administration would never become corrupt and abuse their monopoly power, and 2) the US would not be taken over by science deniers who want to defund academia.   It turns out 2) happened before 1) even got a chance to happen!   Of course this doesn't imply the arXiv is doomed, but (like many things) it's looking more fragile these days.</p>",
        "id": 506800941,
        "sender_full_name": "John Baez",
        "timestamp": 1742408956
    },
    {
        "content": "<p>I don't know the actual history, but I assume that the default arXiv license is what it is for a clear reason, namely that the academic publishers traditionally take ownership of the copyright of the articles they publish and then enforce strict rules about copying and redistributing the article. arXiv has given itself the minimal rights needed to host and distribute the articles on their server. If the standard license gave arXiv more rights, then the academic publishers might object, which would in turn make researchers less likely to put their articles on arXiv since, after all, career advancement depends on publishing in journals not on preprint servers.</p>",
        "id": 506804663,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1742410126
    },
    {
        "content": "<p>So, as usual, all the blame for why academic publishing is a trainwreck lies with the commercial publishing houses :)</p>",
        "id": 506804758,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1742410168
    },
    {
        "content": "<p>For what it's worth, it's typically possible not to give away copyright to publishers, but they're often not very clear about this, and strongly encourage you to transfer copyright.</p>",
        "id": 506814328,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1742413337
    },
    {
        "content": "<p>The arXiv <em>does</em> allow authors to choose a Creative Commons copyright that makes it easy for people to use their works.  But it does not \"push\" this option... and yes, if they did there would be howls of protest from the publishers.</p>",
        "id": 506818290,
        "sender_full_name": "John Baez",
        "timestamp": 1742414744
    },
    {
        "content": "<p>if anyone does end up downloading it and is willing to copy it to SSDs sent to them, I'd be happy to keep a copy</p>",
        "id": 507114675,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1742525351
    },
    {
        "content": "<p>General point: May I recommend Hetzner as a pretty cheap N EU alternative for those concerned with amazon.  Even if you aren't storing it there but running the download, they have S3-compatible storage, so it will behave like AWS in some sense.<br>\n<a href=\"https://www.hetzner.com/storage/object-storage/\">https://www.hetzner.com/storage/object-storage/</a></p>\n<p>But if one were to do this, which of course is illegal and I am only saying this for entertainment purposes, then distributed uploading to libgen (which together with Z-library backs annas archive) is probably more effective than storing SSDs in a fallout shelter (but I mean, do what you feel called to do!)<br>\n<a href=\"https://wiki.mhut.org/content:how_to_upload\">https://wiki.mhut.org/content:how_to_upload</a><br>\nit appears libgen does <em>not</em> have a complete arxiv upload (I dont know how to see what journals Z library has)<br>\n<a href=\"https://www.libgen.is/scimag/journals/48611\">https://www.libgen.is/scimag/journals/48611</a></p>\n<p>if one were to do such a thing, then using tor and bit-torrent recommended.  </p>\n<p>If you found this entertaining and would like to engage further in mutual entertainment, you can DM me. :)</p>",
        "id": 507955045,
        "sender_full_name": "Eric M Downes",
        "timestamp": 1742891023
    },
    {
        "content": "<p>Oh and look someone has even started on this: <a href=\"https://github.com/sooper-seekrit/arxiv-to-libgen\">https://github.com/sooper-seekrit/arxiv-to-libgen</a></p>\n<p>deficient minds think alike I suppose!</p>",
        "id": 507970423,
        "sender_full_name": "Eric M Downes",
        "timestamp": 1742895160
    },
    {
        "content": "<p>My gosh!  I hope they're actually going to do it.</p>\n<p>By the way, the Azimuth Backup Project used Hetzner to temporarily store US govermment climate data back in the first Trump admimistration.  Then we moved the data to a permanent location.</p>",
        "id": 508044918,
        "sender_full_name": "John Baez",
        "timestamp": 1742914172
    }
]