[
    {
        "content": "<p>As an outsider, really enjoying this conference it is not my place to criticize. But I would really like to hear people's opinions, on how an engineer working for BAE presenting, fits with the general values of the community. In particular, since this is a panel tomorrow.</p>",
        "id": 203296166,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594228859
    },
    {
        "content": "<p>I'm really interested in your opinions. Because I did not yet myself have to decide on whether to decline certain funding or collaborations (because of moral reasons), but I think this will happen at some stage in my career.</p>",
        "id": 203296348,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594228962
    },
    {
        "content": "<p>This is independent of the science. It is not in doubt that military contractors do interesting science sometimes</p>",
        "id": 203296656,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594229123
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/BAE_Systems#Saudi_war_crimes_in_Yemen\">https://en.wikipedia.org/wiki/BAE_Systems#Saudi_war_crimes_in_Yemen</a></p>",
        "id": 203296800,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594229184
    },
    {
        "content": "<p>This should however be on the values channel, not here</p>",
        "id": 203296824,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594229200
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/243068-ACT-2020/topic/July.208.3A.20Industry.20Showcase/near/203296656\">said</a>:</p>\n<blockquote>\n<p>This is independent of the science. It is not in doubt that military contractors do interesting science sometimes</p>\n</blockquote>\n<p>Yes, they often do. That's why it's a difficult topic, the more applied one gets.</p>",
        "id": 203296930,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594229267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/243068-ACT-2020/topic/July.208.3A.20Industry.20Showcase/near/203296800\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/BAE_Systems#Saudi_war_crimes_in_Yemen\">https://en.wikipedia.org/wiki/BAE_Systems#Saudi_war_crimes_in_Yemen</a></p>\n</blockquote>\n<p>BAE: yes, they are Lockheed-level evil ..</p>",
        "id": 203296950,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594229277
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"243068\" href=\"/#narrow/stream/243068-ACT-2020/topic/July.208.3A.20Industry.20Showcase\">#ACT 2020 &gt; July 8: Industry Showcase</a> by <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span></p>",
        "id": 203298862,
        "sender_full_name": "Notification Bot",
        "timestamp": 1594230216
    },
    {
        "content": "<p>My response: <a href=\"https://twitter.com/_julesh_/status/1280918329360777224\">https://twitter.com/_julesh_/status/1280918329360777224</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/_julesh_/status/1280918329360777224\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/972424350736486401/RyVTQIgf_normal.jpg\"></a><p>I'm not live-tweeting the ACT industry session, except to say that we had a talk from BAE and I'm not ok with this, and I will fight against their presence in our community to the extent that I can <a href=\"https://t.co/MA8Swcnlp2\">https://twitter.com/_julesh_/status/1280918329360777224/photo/1</a></p><span>- julesh (@_julesh_)</span><div class=\"twitter-image\"><a href=\"https://t.co/MA8Swcnlp2\"><img src=\"https://pbs.twimg.com/media/Eca8EBCX0AIP67N.jpg:large\"></a></div></div></div>",
        "id": 203299360,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594230425
    },
    {
        "content": "<p>Thank you, Jules. Also for moving the thread.</p>",
        "id": 203302426,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594231953
    },
    {
        "content": "<p>I'm sure some people will raise this question tomorrow.   It's good to think about whether you want to ban talks from people who work at \"evil\" corporations, and if so, how \"evil\" will be determined.   </p>\n<p>For example, there was also a talk from Alberto Sperazon at Honeywell, and many talks by people who get funding from the US Defense Department.   </p>\n<p>Also: what would you think about a talk from someone who works at Facebook, or Google?</p>",
        "id": 203307802,
        "sender_full_name": "John Baez",
        "timestamp": 1594234683
    },
    {
        "content": "<p>It's interesting to know that GTRIs budget is also heavily military related, in case you wanted to use Catlab ;)</p>",
        "id": 203310367,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594235998
    },
    {
        "content": "<p>I'm not sure what is being implied here, but whatever you may think of GTRI—everyone is entitled to their own opinion—Catlab is not a product of GTRI. It is an open source project, which for most of its early history was developed by me in my spare time as a grad student. Lately it has gathered more users and contributors, for which I am grateful, and I hope that will continue. In general, open source projects do not and cannot dictate who gets to use them or why. In that respect, OSS is perfectly analogous to mathematics.</p>",
        "id": 203311817,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1594236734
    },
    {
        "content": "<p>This wasn't directed at Catlab... but if we start assigning normative claims on scientific work based on affiliation (and not context) statements like this are becoming \"easy\". That was my point.</p>\n<p>Most of my software packages started when I was on a teaching award, now I am funded by SERC, should people not use my work?</p>",
        "id": 203312067,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594236859
    },
    {
        "content": "<p>It's shades of grey, until you hit the end of the scale. BAE are literally complicit in ongoing war crimes that are well documented. You can probably find more openly evil organisations than BAE, but you'd have to search quite hard</p>",
        "id": 203312505,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594237075
    },
    {
        "content": "<p>Last year I met someone from Palantir at ACT and that made me a bit uncomfortable. BAE make Palantir look like nothing by comparison</p>",
        "id": 203312687,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594237153
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203312067\">said</a>:</p>\n<blockquote>\n<p>This wasn't directed at Catlab... but if we start assigning normative claims on scientific work based on affiliation (and not context) statements like this are becoming \"easy\". That was my point.</p>\n<p>Most of my software packages started when I was on a teaching award, now I am funded by SERC, should people not use my work?</p>\n</blockquote>\n<p>I would have found it helpful if you had said this explicitly. It's really easy for text to get misunderstood, or misused when you don't make your intentions clear. I made a pun connecting \"toothless\" regulations to the idea of regulators wanting to bite people, and even that got misconstrued. This has re-enforced my feeling that literal is normative for text.</p>\n<p>One of the things I love about this forum is that nobody hides behind plausible deniability. I know that wasn't your intention. But I only know that because ambiguous comments like these are rare, so you have de-facto credibility. While it's up to everybody how to speak, I'd like to encourage the norm of literalism.</p>",
        "id": 203313050,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594237337
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203307802\">said</a>:</p>\n<blockquote>\n<p>I'm sure some people will raise this question tomorrow.   It's good to think about whether you want to ban talks from people who work at \"evil\" corporations, and if so, how \"evil\" will be determined.   </p>\n<p>For example, there was also a talk from Alberto Sperazon at Honeywell, and many talks by people who get funding from the US Defense Department.   </p>\n<p>Also: what would you think about a talk from someone who works at Facebook, or Google?</p>\n</blockquote>\n<p>Sounds like a Sorites' paradox when you put it that way. As I understand it, this kind of paradox comes up when you pick an aspect of a situation that doesn't have enough structure to capture the distinction you are trying to draw. </p>\n<p>If I understood <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> correctly, he's particularly concerned about the company's involvement with war crimes. Maybe there's a sophisticated way to address this concern, without collapsing the details to a scale of evil (I know Dr Michael Stone, who hosts the show \"Most Evil\" and built an \"evil scale\". Even according to him, it's not a one dimensional phenomenon).</p>\n<p>While war crimes aren't completely well-defined, they are a fairly well-defined concept. Well defined enough that involvement in war crimes could be addressed with their own separate procedure from other forms of \"evil.\"</p>",
        "id": 203313314,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594237514
    },
    {
        "content": "<p>I'm with Jules here. <br>\nEverybody is entitled to their opinion, and that's why we are having the panel tomorrow. Please come and voice yours (respectfully)!</p>",
        "id": 203313787,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1594237786
    },
    {
        "content": "<p>Yes, exactly. There is lots to debate about where the line is drawn, but if anyone thinks there is a possible debate about whether the line is drawn <em>here</em> then they are living in a different ethical universe to me</p>",
        "id": 203313803,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594237793
    },
    {
        "content": "<p>I wasn't trying to claim it's impossible to draw a line.  I wasn't trying to play a \"sorites paradox\" game.   I just want to know roughly where Jules and others want to draw the line - and also what the line <em>amounts to</em>.   Is Jules saying that Steve Huntsman should not have been allowed to give a talk?   And if so, what should be the procedure for banning certain speakers?</p>\n<p>Personally I think  might actually be better to do what we're doing, which is let people who work for morally dubious companies give talks... but then have a forum where we discuss the moral issues.    For example, it'd be great if Jules (or anyone) gave a little presentation about what BAE Systems is doing.   That might accomplish more than just - perhaps rather quietly - banning speakers from this company.</p>",
        "id": 203316667,
        "sender_full_name": "John Baez",
        "timestamp": 1594239075
    },
    {
        "content": "<p>All my questions here are non-rhetorical.</p>",
        "id": 203317426,
        "sender_full_name": "John Baez",
        "timestamp": 1594239501
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203316667\">said</a>:</p>\n<blockquote>\n<p>I wasn't trying to claim it's impossible to draw a line.  I wasn't trying to play a \"sorites paradox\" game.   I just want to know roughly where Jules and others want to draw the line - and also what the line <em>amounts to</em>.   Is Jules saying that Steve Huntsman should not have been allowed to give a talk?   And if so, what should be the procedure for banning certain speakers?</p>\n<p>Personally I think  might actually be better to do what we're doing, which is let people who work for morally dubious companies give talks... but then have a forum where we discuss the moral issues.    For example, it'd be great if Jules (or anyone) gave a little presentation about what BAE Systems is doing.   That might accomplish more than just - perhaps rather quietly - banning speakers from this company.</p>\n</blockquote>\n<p>I'm sorry, I didn't mean to suggest that you were playing a \"sorites paradox game\" –– I meant to say that the idea of drawing \"a\" (singular) line at a \"level\" of evil can make thinking about the problem harder, because it draws one's attention away from other salient aspects of the issue. </p>\n<p>Asking \"how many grains of sand\" form a \"heap\" draws attention away from the contextual use of the word \"heap\" and the morphology of a three-dimensional pile, etc. </p>\n<p>Asking about \"lines\" and \"evil\" draw attention away from facets of the situation. For example <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span> raised the issue how open source projects are structured, which is highly salient to how a mathematical community receives and disseminates information. Another example is the (presumably) default view of <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> that we should not invite people from organizations affiliated with war crimes. But as an open community, that does not stop these people from learning and using our tools. How does the vitality of open communication weigh against the desire to keep it secret for fear that it will be misused? Even if we all accept the basic premise that war crimes are unequivocally evil, there is a lot left to be desired from metaphors about lines and scales. </p>\n<p>Maybe I'm wrong about this, and there may be a valid reason for thinking in terms of lines and levels of evil. I was just raising my concern.</p>",
        "id": 203318302,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594239987
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203317426\">said</a>:</p>\n<blockquote>\n<p>All my questions here are non-rhetorical.</p>\n</blockquote>\n<p>I have no doubt about that, and I like the idea of open rational discussion at this juncture. Jumping to conclusions is easy in the short term and costly in the long run.</p>",
        "id": 203319031,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594240361
    },
    {
        "content": "<p>Here's why I said what I said.   Since I'm on the steering committee for ACT conferences, I would like some concrete suggestions about what we should do in ACT2020.   Suppose we get people wanting to give talks who work at a bunch of organizations that seem morally questionable in various ways.  What should the people in charge of deciding on talks actually do?   That's what I'm really trying to get at.   </p>\n<p>If the answer is just \"they should get together and decide what to do\", that's fine but it provides them with no guidance.</p>",
        "id": 203319087,
        "sender_full_name": "John Baez",
        "timestamp": 1594240388
    },
    {
        "content": "<p>I was hoping for Jules or  you or anyone to actually make concrete suggestions.</p>",
        "id": 203319474,
        "sender_full_name": "John Baez",
        "timestamp": 1594240560
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203319087\">said</a>:</p>\n<blockquote>\n<p>Here's why I said what I said.   Since I'm on the advisory board for the ACT conferences, I would like some concrete suggestions about what we should do in ACT2020.   Suppose we get people wanting to give talks who work at a bunch of organizations that seem morally questionable in various ways.  What should the people in charge of deciding on talks actually do?   That's what I'm really trying to get at.   </p>\n<p>If the answer is just \"they should get together and decide what to do\", that's fine but it provides them with no guidance.</p>\n</blockquote>\n<p>Would you be okay with me reaching out to Michael Stone, Greg Lopez and Massimo Pigliucci  to invite them to help advise on these issues? I don't know if any of them will be interested, but maybe as experts on evil (Michael) and Stoic ethics (Greg and Massimo), they could offer some guidance. Maybe other people also know relevant experts?</p>",
        "id": 203319614,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594240614
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203319474\">said</a>:</p>\n<blockquote>\n<p>I was hoping for Jules or  you or anyone to actually make concrete suggestions.</p>\n</blockquote>\n<p>I think these things take time and finesse. I'm new to this community so I don't feel entitled to push for particular outcomes when so many others have so much more invested here. However, if this is a \"dirty job\" that people don't want, I'd be willing to help facilitate building a protocol for making these sorts of decisions.</p>",
        "id": 203319929,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594240761
    },
    {
        "content": "<p>I'm certainly fine with people getting advice from experts.   In the short term, we're going to have a discussion about this stuff tomorrow from 16:00 to 17:00 UTC, and I'm urging everyone here - everyone in the \"ACT community\" - to think about specific recommendations.</p>",
        "id": 203320091,
        "sender_full_name": "John Baez",
        "timestamp": 1594240829
    },
    {
        "content": "<p>I don't think anyone needs to be extremely shy about \"pushing for particular outcomes\": so far the problem is that nobody is suggesting anything, except maybe Jules is saying Steve Huntsman shouldn't have been allowed to speak, or maybe not allowed to display the BAE Systems logo.  (I'm not sure which.)</p>",
        "id": 203320340,
        "sender_full_name": "John Baez",
        "timestamp": 1594240947
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203320091\">said</a>:</p>\n<blockquote>\n<p>I'm certainly fine with people getting advice from experts.   In the short term, we're going to have a discussion about this stuff tomorrow from 16:00 to 17:00 UTC, and I'm urging everyone here - everyone in the \"ACT community\" - to think about specific recommendations.</p>\n</blockquote>\n<p>Okay. In that case, I'll hold off on inviting people to help until it's clearer how the community could use them, if at all.</p>",
        "id": 203320446,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594241016
    },
    {
        "content": "<p>The discussion tomorrow seems rather unlikely to end in a specific decision.</p>",
        "id": 203320558,
        "sender_full_name": "John Baez",
        "timestamp": 1594241066
    },
    {
        "content": "<p>But I think it would be nice if some people came up with some proposed policies.</p>",
        "id": 203320606,
        "sender_full_name": "John Baez",
        "timestamp": 1594241088
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203320558\">said</a>:</p>\n<blockquote>\n<p>The discussion tomorrow seems rather unlikely to end in a specific decision.</p>\n</blockquote>\n<p>Maybe one thing to think about is why it's so hard for people to decide on these issues. What is causing people to be shy? And is there a way to get people to weigh in?</p>",
        "id": 203321082,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594241321
    },
    {
        "content": "<p>I bet people will weigh in at the actual meeting.  I think people are less shy when they're actually talking instead of writing into a box.</p>",
        "id": 203321515,
        "sender_full_name": "John Baez",
        "timestamp": 1594241553
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203320606\">said</a>:</p>\n<blockquote>\n<p>But I think it would be nice if some people came up with some proposed policies.</p>\n</blockquote>\n<p>In addition to the option of banning people, banning logos, or leaving things as they are, one additional concrete option is to require that people who work for certain kinds of organizations have to explain themselves to a critical audience as a condition of participation. Let's call that the \"roast\" option. It's not a strong solution, but at least it would build a culture of reflecting on our actions––if that's what people think is important. (I see both sides of the issue. Some people might be thinking \"my god, this is a maths forum, what is all this baggage doing here?\")</p>",
        "id": 203321542,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594241574
    },
    {
        "content": "<p>My stance is that the ACT community should steer away from companies involved in war crimes like BAE, or making a business by fucking people's rights and privacy like Amazon or Facebook. I don't think it's enoguh to talk about this (even if it's good to do so). Following Ostrom, we really have to give negative incentives if we want the community to steer away from stuff like that.</p>",
        "id": 203324850,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243187
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203318302\">said</a>:</p>\n<blockquote>\n<p>[...]  Another example is the (presumably) default view of <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> that we should not invite people from organizations affiliated with war crimes.  [...]</p>\n</blockquote>\n<p>Also, I find this part of wat Oliver wrote quite puzzling. It's like saying \"We should not invite people from organizations affiliated with the KKK\". It's not a \"should\", under any plausible definition of common sense this should be a \"must\"</p>",
        "id": 203325084,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243313
    },
    {
        "content": "<p>I mean, we are not talking about philosophical nuances. <strong>This is literally a company that helps dropping bombs on the fucking red cross in Yemen.</strong> It literally takes quite an effort to imagine how we could do worse than this.</p>",
        "id": 203325295,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243426
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203325084\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203318302\">said</a>:</p>\n<blockquote>\n<p>[...]  Another example is the (presumably) default view of <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> that we should not invite people from organizations affiliated with war crimes.  [...]</p>\n</blockquote>\n<p>Also, I find this part of wat Oliver wrote quite puzzling. It's like saying \"We should not invite people from organizations affiliated with the KKK\". It's not a \"should\", under any plausible definition of common sense this should be a \"must\"</p>\n</blockquote>\n<p>In my view, \"must\" is a natural concept. Apples \"must\" fall when unencumbered. People make choices and choices are the subject of moral language such as \"should.\"</p>\n<p>If you want to use these words differently, that's fine by me. However, criticizing peoples' statements on the grounds of single word semantics is a highly error-ridden way to interact.</p>\n<p>I disagree with the antagonistic way you chose to question my vocabulary. People often have internal semantic frames that you aren't aware of.</p>",
        "id": 203325373,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594243447
    },
    {
        "content": "<p>The concept of \"categorical imperative\" is known since Kant.  \"must\" is very much a word of our moral vocabulary since the Enlightenment at least <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>",
        "id": 203325488,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203325488\">said</a>:</p>\n<blockquote>\n<p>The concept of \"categorical imperative\" is known since Kant.  \"must\" is very much a word of our moral vocabulary since the Enlightenment at least :/</p>\n</blockquote>\n<p>I'm sorry this is so upsetting to you. Can you tell me more about what's coming up for you? If you like, you can speak to me in private, although I'm fine with either format.</p>",
        "id": 203325718,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594243617
    },
    {
        "content": "<p>I'd also like to note for <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> that this interaction may be a good example of the reasons why people are not speaking up. I certainly feel less welcome to speak.</p>",
        "id": 203325880,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594243691
    },
    {
        "content": "<p>I think you guys basically agree, if the main disagreement here is between \"should\" and \"must\".</p>",
        "id": 203325888,
        "sender_full_name": "John Baez",
        "timestamp": 1594243697
    },
    {
        "content": "<p>I'm not upset, I'm just being very assertive. And the reason is that I would honestly feel \"morally dirty\" if the community I am part of decides that it's not a big deal if someone working for a company involved in war crimes gives a talk</p>",
        "id": 203325912,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243711
    },
    {
        "content": "<p>Fabrizio is a lively fellow, he curses a lot - don't be put off, Oliver.  (Of course you don't know him like I do.)</p>",
        "id": 203325955,
        "sender_full_name": "John Baez",
        "timestamp": 1594243742
    },
    {
        "content": "<p>Bob Coecke actually commented with surprise yesterday at how Fabrizio didn't cuss at all in his talk.</p>",
        "id": 203326114,
        "sender_full_name": "John Baez",
        "timestamp": 1594243816
    },
    {
        "content": "<p>You can compromise wih rational opinions. Bur morals do not necessarily follow rationality. I consider myself quite an open minded person, but then again, thinking that it's ok to have ties with companies involved in plainly deplorable activities makes me feel quite bad</p>",
        "id": 203326173,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594243853
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203325912\">said</a>:</p>\n<blockquote>\n<p>I'm not upset, I'm just being very assertive. And the reason is that I would honestly feel \"morally dirty\" if the community I am part of decides that it's not a big deal if someone working for a company involved in war crimes gives a talk</p>\n</blockquote>\n<p>I'm not saying you're necessarily upset. It sounds like some kinds of strong feelings are coming up for you though. I'm just trying to connect on a more empathetic, less logical level. I want to know more about how you're feeling if you're willing to be a little vulnerable.</p>",
        "id": 203326194,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594243868
    },
    {
        "content": "<p>And I know you said you're not upset, but I'm still sorry if I stepped on your toes in a way that could have made you upset.</p>",
        "id": 203326385,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594243974
    },
    {
        "content": "<p>Also, I can agree that military funding may be bad or not depending on the context. But I think that some things are undisputably bad, like  Nazism and their race theories, slavery, or killing people for fun. For me, things like \"bombing the red cross\" really fall under this category</p>",
        "id": 203326438,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244010
    },
    {
        "content": "<p>I mean, usually when it comes to military organizations at least there's the usual BS story of \"peace missions\" or \"we had to act in self defense\". Bus something like \"bombing the red cross\" is just openly inexcusable</p>",
        "id": 203326604,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244075
    },
    {
        "content": "<p>So, I don't think we are talking about the usual Google situation, where yes there's a company that is bad but where do you draw the line and blablabla</p>",
        "id": 203326668,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244107
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> said, we are literally talking about a company involved in some undisputably deplorable activities, which, imho, is a completely different thing</p>",
        "id": 203326741,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244151
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203326194\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203325912\">said</a>:</p>\n<blockquote>\n<p>I'm not upset, I'm just being very assertive. And the reason is that I would honestly feel \"morally dirty\" if the community I am part of decides that it's not a big deal if someone working for a company involved in war crimes gives a talk</p>\n</blockquote>\n<p>I'm not saying you're necessarily upset. It sounds like some kinds of strong feelings are coming up for you though. I'm just trying to connect on a more empathetic, less logical level. I want to know more about how you're feeling if you're willing to be a little vulnerable.</p>\n</blockquote>\n<p>Well, I told you above, the idea that such companies exist clearly disgusts me. And I'm seriously puzzled regarding why Steven works for them. I've met him, he's a nice guy. So either his moral standards are really low (but I don't think this is the case frankly) or something must have happened to lead him to choose to work for them.</p>",
        "id": 203326959,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244251
    },
    {
        "content": "<p>Hi all. I've thought about these issues a bit, and I also think that they're important, so here are my two cents. I'm less shy when writing into a box than when talking into a box <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n<p>I can see the temptation to ban certain speakers based on their affiliation, but my current tendency is to say that this would be going too far. The contemporary pervasiveness of de-platforming and blocking dissenting views seems to add to the creation of filter bubbles and to the sectioning of society into disparate parts with no understanding of each others' thinking and actions, and is in my perspective going too far. My worry is that excluding certain people would contribute to that. But given that, I'm also all in favour of voicing concerns openly as <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> has done, and if possible also discussing them with the very people who have those questionable affiliations. (I did this in personal conversation with <span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span> at last year's UCR meeting. I disagree with his personal decision, and I would personally never accept funding let alone employment from BAE, but I think that he deserves a chance to explain himself and to hear people's concerns in a respectful conversation.) So <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span>, if you know Steve personally, have you talked to him about your concerns and <em>asked</em> him why he works for BAE?</p>\n<p>On a related note, I think that there's a difference between letting someone speak and <em>endorsing</em> any of what they say or do. For example if BAE Systems was a conference sponsor, then this could already be considered much more of an endorsement, and would constitute an affiliation with the <em>entire community</em> rather than just with an individual member. I would also be very uncomfortable with that, and I strongly support <span class=\"user-mention\" data-user-id=\"277067\">@Tom Leinster</span>'s actions with regards to the conference's original sponsors. I would feel similarly about Facebook or Google.</p>",
        "id": 203327187,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1594244374
    },
    {
        "content": "<p>Yes, I am aware of the \"Han vs everything else\" issue in China. And I agree, it's bad. Still, collaborating with Chinese academics can serve a different purpose. Namely, it also is a way to take them out of their current situation. When you are a citizen of an authoritatian country often your alternatives are limited</p>",
        "id": 203327193,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244375
    },
    {
        "content": "<blockquote>\n<p>Well, I told you above, the idea that such companies exist clearly disgusts me. And I'm seriously puzzled regarding why Steven works for them. I've met him, he's a nice guy. So either his moral standards are really low (but I don't think this is the case frankly) or something must have happened to lead him to choose to work for them.</p>\n</blockquote>\n<p>It would be interesting to know.  Yes, Steve is a nice guy.  We could just ask.</p>\n<p>Here is some information on BAE Systems and the arms they've sold to Saudi Arabia:</p>\n<p><a href=\"https://www.trtworld.com/magazine/the-uk-faces-criticism-for-resuming-weapons-sales-to-saudi-arabia-37971\">https://www.trtworld.com/magazine/the-uk-faces-criticism-for-resuming-weapons-sales-to-saudi-arabia-37971</a></p>",
        "id": 203327200,
        "sender_full_name": "John Baez",
        "timestamp": 1594244382
    },
    {
        "content": "<p>I hadn't known about this; since BAE Systems is a British company there may be more talk about this in the UK.</p>",
        "id": 203327302,
        "sender_full_name": "John Baez",
        "timestamp": 1594244433
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276702\">Tobias Fritz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203327187\">said</a>:</p>\n<blockquote>\n<p>Hi all. I've thought about these issues a bit, and I also think that they're important, so here are my two cents. I'm less shy when writing into a box than when talking into a box <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n<p>I can see the temptation to ban certain speakers based on their affiliation, but my current tendency is to say that this would be going too far. The contemporary pervasiveness of de-platforming and blocking dissenting views seems to add to the creation of filter bubbles and to the sectioning of society into disparate parts with no understanding of each others' thinking and actions, and is in my perspective going too far. My worry is that excluding certain people would contribute to that. But given that, I'm also all in favour of voicing concerns openly as <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> has done, and if possible also discussing them with the very people who have those questionable affiliations. (I did this in personal conversation with <span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> at last year's UCR meeting. I disagree with his personal decision, and I would personally never accept funding let alone employment from BAE, but I think that he deserves a chance to explain himself and to hear people's concerns in a respectful conversation.) So <span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span>, if you know Steve personally, have you talked to him about your concerns and <em>asked</em> him why he works for BAE?</p>\n<p>On a related note, I think that there's a difference between letting someone speak and <em>endorsing</em> any of what they say or do. For example if BAE Systems was a conference sponsor, then this could already be considered much more of an endorsement, and would constitute an affiliation with the <em>entire community</em> rather than just with an individual member. I would also be very uncomfortable with that, and I strongly support <span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span>'s actions with regards to the conference's original sponsors. I would feel similarly about Facebook or Google.</p>\n</blockquote>\n<p>I did not talk to him, but I want to, by all means. About this, it should be made clear that I do not have anything against Steve, it's the company that represents him that's the problem</p>",
        "id": 203327391,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244500
    },
    {
        "content": "<p>So, a good compromise would be to have him give a talk, but to strip away his affiliation from the slides, or something like that</p>",
        "id": 203327478,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244534
    },
    {
        "content": "<p>My point is that I don't want the community to give space to these horrible organizations. Regarding people, I think there may be a lot of different reasons why one ends up being in some situation, so I tend to be less critic of their choices</p>",
        "id": 203327553,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244599
    },
    {
        "content": "<p>Indeed, there is a vast rift between allowing anyone to <em>promote</em> BAE and allowing someone simply affiliated with BAE to speak. Talks at a conference are much more controllable than pulpit speeches at university debate societies.</p>",
        "id": 203327790,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594244760
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203326959\">said</a>:</p>\n<blockquote>\n<p>Well, I told you above, the idea that such companies exist clearly disgusts me. And I'm seriously puzzled regarding why Steven works for them. I've met him, he's a nice guy. So either his moral standards are really low (but I don't think this is the case frankly) or something must have happened to lead him to choose to work for them.</p>\n</blockquote>\n<p>One way to think of this is that some people think of being a \"good person\" as being a person who others would want on their team, and who others wouldn't mind as an enemy (MLK, Ghandi, pacifists, etc.). Another concept of being a \"good person\" is being a person who you want on your team, and who you really do not want as an enemy (Marcus Aruleus, Roosavelt, Churchill). Still others think of being a \"good person\" as being a person who is useful to his or her group (insert famous physicist from WWII era here).</p>",
        "id": 203327842,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594244770
    },
    {
        "content": "<p>Publius Terentius Afer used to say «Homo sum, humani nihil a me alienum puto», which literally means \"I'm human. I think nothing human is alien to me\". What's sure is that I tend not to judge someone as a \"good person\" just by looking at their actions</p>",
        "id": 203328109,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594244941
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203328109\">said</a>:</p>\n<blockquote>\n<p>Publius Terentius Afer used to say «Homo sum, humani nihil a me alienum puto», which literally means \"I'm human. I think nothing human is alien to me\". What's sure is that I tend not to judge someone as a \"good person\" just by looking at their actions</p>\n</blockquote>\n<p>It's just a rubric for organizing things that I thought you might find interesting or useful in being less puzzled at why a person might take funding from the military.</p>",
        "id": 203328238,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594245009
    },
    {
        "content": "<p>I said this in an email a little while ago. My view is, like many here, that we should not give BAE space to give a talk, nor possibility to fund our conferences.<br>\nHowever, everybody has a different \"ethical line\". Especially since we meet to discuss, let's please not turn the meeting into a \"my line is better than your line\" debate. We will not convince other people this way, especially not by rational arguments. <br>\n(All these lines are arbitrary, and there is no \"transitivity\": the only perfectly consistent lines would be \"funding from all, including nazis\" and \"no research at all\". Some of you talked about degrees of separations already...) <br>\nWe won't achieve anything by just telling the others that we are right and they are wrong - except dividing the community like a political party.<br>\nAnd please, let's make sure that throughout the debate nobody feels attacked or impeeded to voice their own idea (for being \"evil\", \"inconsistent\", or anything else). Let's respect and hear everyone's opinion.</p>",
        "id": 203328336,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1594245104
    },
    {
        "content": "<p>I think no one is saying to someone else that they are right or wrong, to be honest</p>",
        "id": 203328416,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594245155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203328336\">said</a>:</p>\n<blockquote>\n<p>However, everybody has a different \"ethical line\". Especially since we meet to discuss, let's please not turn the meeting into a \"my line is better than your line\" debate. We will not convince other people this way, especially not by rational arguments. <br>\n(All these lines are arbitrary, and there is no \"transitivity\": the only perfectly consistent lines would be \"funding from all, including nazis\" and \"no research at all\". Some of you talked about degrees of separations already...) </p>\n</blockquote>\n<p>Indeed, <span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span> has quite eloquently argued that debating the placement of an ethical \"line\" is reductionist, since it erases crucial context. Yet the places where some would draw a line should certainly be places where we make the effort to think about our actions and motivation a little harder.</p>",
        "id": 203329616,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594245948
    },
    {
        "content": "<p>I think that one thing that emerged from this conversation is that all the people involved in it seem to somewhat agree that the concept of \"evil\" applies better to organizations than to people involved with them</p>",
        "id": 203329745,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275989\">@Paolo Perrone</span> If by places where people would draw lines, you mean specific concerns, then I totally agree.</p>",
        "id": 203329812,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594246067
    },
    {
        "content": "<p>This begs the question: \"why does someone choose to work for an evil organization?\", which clearly demands some context. Indeed, plausible answers could be \"Because the person in question has low moral fiber\" as well as \"because the person in question was literally starving and couldn't find any other opportunity\", which are on quite opposite ends of the spectrum</p>",
        "id": 203329936,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246130
    },
    {
        "content": "<p>And then there's the question of how relevant different aspects of a person's character are to the maths they do and their participation in this community. Some would be more relevant than others.</p>",
        "id": 203330079,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594246230
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203328336\">said</a>:</p>\n<blockquote>\n<p>And please, let's make sure that throughout the debate nobody feels attacked or impeeded to voice their own idea (for being \"evil\", \"inconsistent\", or anything else).</p>\n</blockquote>\n<p>I appreciate that your intention is to encourage respect, but the only entity that has actively been labelled as evil in this particular discussion is BAE, and if the hostility towards them is somehow news to those affiliated with them, I think we've done more good than harm by pointing it out...</p>",
        "id": 203330142,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594246301
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203330079\">said</a>:</p>\n<blockquote>\n<p>And then there's the question of how relevant different aspects of a person's character are to the maths they do and their participation in this community. Some would be more relevant than others.</p>\n</blockquote>\n<p>This is a bit less debatable tho, because there's a pretty practical principle at work here. If someone has some desplicable inclinations, many people in the commuity could feel really unconfortable in having this someone around</p>",
        "id": 203330449,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246468
    },
    {
        "content": "<p>Examples that come to mind are Teichmuller, which I don't think would be allow to speak at any venue today if he were still alive. Actually I've heard that some people are already puzzled wrt citing his work</p>",
        "id": 203330528,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246530
    },
    {
        "content": "<p>(I mean, openly being a nazi is now considered a crime in many countries, so that would for sure make the decision process easier)</p>",
        "id": 203330600,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246576
    },
    {
        "content": "<p>I agree that sometimes the lines are blurred tho. There's was a big fuss last year about having John de Goes speaking at a programming conference, for instance</p>",
        "id": 203330664,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246627
    },
    {
        "content": "<p>(all of this is really funny to me because in this conversation I'm somehow playing the part of the one sympathizing for stuff like historical revisionism, which is something I really abhor)</p>",
        "id": 203330803,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246734
    },
    {
        "content": "<p>Do you cite Gentzen?</p>",
        "id": 203330915,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594246810
    },
    {
        "content": "<p>I personally never have. The good thing with Gentzen is that his stuff is so known that you can do without a citation</p>",
        "id": 203331000,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246892
    },
    {
        "content": "<p>Do you bring up Gentzen when you teach sequent calculus?</p>",
        "id": 203331021,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594246910
    },
    {
        "content": "<p>i never thought sequent calculus</p>",
        "id": 203331027,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246921
    },
    {
        "content": "<p>But I get your point, and the list is long</p>",
        "id": 203331068,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246929
    },
    {
        "content": "<p>E.g. Heisenberg, etc etc</p>",
        "id": 203331076,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246934
    },
    {
        "content": "<p>As I said I'm not exactly in favor of historical revisionism. Also I think it doesn't matter too much when people are long dead. But asking the question about people that are very much alive is a different kind of thing</p>",
        "id": 203331142,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594246982
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span></p>\n<blockquote>\n<p>Examples that come to mind are Teichmuller, which I don't think would be allow to speak at any venue today if he were still alive. Actually I've heard that some people are already puzzled wrt citing his work</p>\n</blockquote>\n<p>One of my Ethics professors once told us a story about his advisor, who was a concentration camp survivor. He regularly taught Heiddeger and defended it on the grounds that his contributions to philosophy were very important, and it would be rewriting history to expunge his academic contributions. The open practice of citation in academia is professionally sacred in a way similar to the imperative to do no harm for doctors.</p>\n<p>Excluding people, however, is another matter. There are many cases where this makes sense. Although it should depend on context. There may not be many reformed fellons in academia, but I wish there were (in America, committing a crime is a path fixing event akin to becoming lower cast in rural India). In my opinion credibly reformed people should always be allowed to participate in the pursuit of knowledge.</p>",
        "id": 203331165,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247005
    },
    {
        "content": "<p>So, here's my opinion about this: If someone's dead, well there's nothing really we can do. All things considered it's better to act in an utilitarian way and use the work produced. If someone is alive, then the situation changes. We can ask this person for clarification, and act accordingly</p>",
        "id": 203331298,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247120
    },
    {
        "content": "<p>Yes, I added a clarification above</p>",
        "id": 203331408,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247211
    },
    {
        "content": "<p>Also, I think there's a little flaw in the \"big contributions\" argument, that I hear ad nauseam: Suppose there's some academic that is insanely good, but also a total asshole. Like, a legendary one. When evaluating the impact on the community, we shouldn't just take into account that person's accomplishments, but also how many people were actually excluded from the community because of them (e.g. people being so uncomfortable that they changed field altogether). When you factor this consideration in, things change imho, and there are very few scientists whose orverall impact would still turn out positive.</p>",
        "id": 203331440,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247235
    },
    {
        "content": "<p>That is, you may have created great maths, but you probably also destroyed a lot of potential math by making other scientists walk away. This is rarerly considered in the usual \"but he's done great things\" argument.</p>",
        "id": 203331488,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247274
    },
    {
        "content": "<p>That's a good reason to exclude a person while alive. Not a good reason not to cite their original contributions after they are dead, or after they have been booted from the community.</p>",
        "id": 203331549,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247315
    },
    {
        "content": "<p>On this, I agree</p>",
        "id": 203331564,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247333
    },
    {
        "content": "<p>Also, the utilitatian argument here is \"considering how much harm they made, at least let's try to keep the good\"</p>",
        "id": 203331578,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247353
    },
    {
        "content": "<p>But for me the main problem with dead people is that you can't really ask them why. As we were saying before, there may be countless reasons why one turns out being the way they are</p>",
        "id": 203331612,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247389
    },
    {
        "content": "<p>So it's easy to say that Heidegger and Von Braun were nazis. It's less easy to understand why, once one factors in things such as the impossibility of doing research in nazi Germany without being registered as a party supporter</p>",
        "id": 203331722,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247483
    },
    {
        "content": "<p>Here's an interesting case that I'd like to mention, mainly for fun and without wanting to suggest anything either way.</p>\n<p>Bill Lawvere worked for an intelligence think tank in 1962, and there he ended up writing the manuscript that founded categorical probability! His job there was apparently in the design of protocols for arms control—but who knows what other people there did. This story is now <a href=\"https://ncatlab.org/nlab/show/Giry+monad#history\">told on the nLab</a>, thanks to Dmitri Pavlov and others.</p>",
        "id": 203331731,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1594247495
    },
    {
        "content": "<p>I'll check it out for sure, I love this sort of folklore</p>",
        "id": 203331806,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247542
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203331722\">said</a>:</p>\n<blockquote>\n<p>So it's easy to say that Heidegger and Von Braun were nazis. It's less easy to understand why, once one factors in things such as the impossibility of doing research in nazi Germany without being registered as a party supporter</p>\n</blockquote>\n<p>Btw, I guess this is precisely the situation many Chinese academics are in today.</p>",
        "id": 203331824,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> that's fair, although Heiddeger defended bis choice and supported them after theh were overthrown. This is why he is often used in the argument for the sanctity of academic citations.</p>",
        "id": 203331933,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247663
    },
    {
        "content": "<p>As for Chinese academics, many of them completely agree with the politics of their government. And they often have the option to immigrate elsewhere, as talented people everywhere do. It is what it is.</p>",
        "id": 203332113,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247804
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203331933\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> that's fair, although Heiddeger defended bis choice and supported them after theh were overthrown. This is why he is often used in the argument for the sanctity of academic citations.</p>\n</blockquote>\n<p>I guess I'd like to read precisely what he wrote about it. He's really an increadible philospher, so I imagine his defense had some interesting conceptual insights at least</p>",
        "id": 203332151,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247844
    },
    {
        "content": "<p>On a big digression: someone had better come up with a different name for  <a href=\"https://en.wikipedia.org/wiki/Teichm%C3%BCller_space\">Teichmüller space</a> if they want us to stop mentioning Teichmüller.  It's a super-important concept in complex analysis.</p>",
        "id": 203332174,
        "sender_full_name": "John Baez",
        "timestamp": 1594247861
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332113\">said</a>:</p>\n<blockquote>\n<p>As for Chinese academics, many of them completely agree with the politics of their government. And they often have the option to immigrate elsewhere, as talented people everywhere do. It is what it is.</p>\n</blockquote>\n<p>Sure. Then again, one has also to factor in the amount of propaganda and the high level of censorship. It's easier to agree with something when alternatives are out of reach</p>",
        "id": 203332250,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247896
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332174\">said</a>:</p>\n<blockquote>\n<p>On a big digression: someone had better come up with a different name for  <a href=\"https://en.wikipedia.org/wiki/Teichm%C3%BCller_space\">Teichmüller space</a> if they want us to stop mentioning Teichmüller.  It's a super-important concept in complex analysis.</p>\n</blockquote>\n<p>One problem here is that \"Teichmuller space\" sounds increadibly badass...</p>",
        "id": 203332278,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594247924
    },
    {
        "content": "<p>Well, so would \"Hitler space\".</p>",
        "id": 203332304,
        "sender_full_name": "John Baez",
        "timestamp": 1594247942
    },
    {
        "content": "<p>I'm not touching this one, and that's a sign we're getting into very dangerous territory.</p>",
        "id": 203332347,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594247989
    },
    {
        "content": "<p>If people are nervous about that particular joke, oh well.   Can I joke about Genghis Khan?  He was just as bad as Hitler.</p>",
        "id": 203332441,
        "sender_full_name": "John Baez",
        "timestamp": 1594248068
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332304\">said</a>:</p>\n<blockquote>\n<p>Well, so would \"Hitler space\".</p>\n</blockquote>\n<p>My reaction in finding this in a paper would probably be:<br>\n<a href=\"https://i.imgur.com/3WcNeh3.jpg\">https://i.imgur.com/3WcNeh3.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"https://i.imgur.com/3WcNeh3.jpg\"><img src=\"https://i.imgur.com/3WcNeh3.jpg\"></a></div>",
        "id": 203332500,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594248119
    },
    {
        "content": "<p>Digressing even further, is there anyone alive still named Hitler?  If so I feel sorry for them.</p>",
        "id": 203332607,
        "sender_full_name": "John Baez",
        "timestamp": 1594248197
    },
    {
        "content": "<p>Or did all his relatives just change their names?  That name has been poisoned.</p>",
        "id": 203332651,
        "sender_full_name": "John Baez",
        "timestamp": 1594248234
    },
    {
        "content": "<p>Anyway, I should shut up.</p>",
        "id": 203332723,
        "sender_full_name": "John Baez",
        "timestamp": 1594248258
    },
    {
        "content": "<p>I think there was some relative still around, which changed name, but was still living a sort of inner psychological hell because of his ancestry</p>",
        "id": 203332834,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594248300
    },
    {
        "content": "<p>Bringing it back and explaining why I have such a strong reaction to this: there are already purity tests in this community. I have never had what happened to me happen at any other venue during the review process, where I was called \"coy\" for not discussing at length the possibility of UAVs being used in \"remote warfare\" because in the acknowledgments they saw my indirect funding came from Northrop and SERC. This is completely unacceptable and it shows that the community is split. If you want to do anything practical (in the US at least) you need to indirectly touch military funding.</p>",
        "id": 203332964,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594248393
    },
    {
        "content": "<p>As for Chinese academics, many of them completely agree with the politics of their government. And they often have the option to immigrate elsewhere, as talented people everywhere do. It is what it is.</p>\n<p>@Fabrizio Genovese</p>\n<blockquote>\n<p>Sure. Then again, one has also to factor in the amount of propaganda and the high level of censorship. It's easier to agree with something when alternatives are out of reach</p>\n</blockquote>\n<p>I mean... we're talking about Western educated people whose opinions get more entrenched when they go abraod... I just think that should be clear. It is what it is, and that's why it'a a good one to think about. These historical examples are easy in hindsight, but then when there's a close analogy now, it illuminates why people struggled with these issues back then and why we continue to struggle with them.</p>",
        "id": 203332990,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594248417
    },
    {
        "content": "<p>And for what it is worth I have only worked on UAV for agricultural applications (which makes that accusation VERY funny)</p>",
        "id": 203333027,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594248439
    },
    {
        "content": "<p>There you have it.  You should definitely meme your way out of it</p>",
        "id": 203333399,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594248671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275902\">@Giorgos Bakirtzis</span> I'm sorry that you've felt alienated here. I don't know the context, but I see that you're feeling unfairly accused.</p>",
        "id": 203333414,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594248682
    },
    {
        "content": "<p>So thank you for speaking up to highlight how these issues have affected you. Usually, only the \"prosecutors\" and third parties speak, which is unfortunate.</p>",
        "id": 203334060,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594249157
    },
    {
        "content": "<p>I’m afraid some of you have me at a disadvantage. I will not speak publicly on behalf of BAE except on matters that they have cleared for public release. Meanwhile I am in the midst of a hackathon that demands my time for the next two days (and that I ducked out of as briefly as I could to talk today). But I will be happy after this week to speak about my personal views privately with anyone who wants to and agrees to keep any exchange private.</p>",
        "id": 203335739,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1594250471
    },
    {
        "content": "<p>The real questions of engineering ethics are about how you design and build systems within a process that honestly and thoughtfully engages with the real-world effects of those systems on people and the environment. Auditing the funding to avoid contamination is not a substitute for considering the effects of your engineered systems.</p>\n<p>For example, my research is designed to help government scientists get accurate and reliable modeling and simulation results to inform the analyses and recommendations that they make to policy makers. I think that policy makers will be better off if they are informed by science and that science needs to be available when they need it most, which is during a public health or national security crisis. Now, as a scientist, whether the policy makers use this information to make good or bad decisions is beyond my control, but I want them to have the resources and information available to make the right decision at the time the decision needs to be made.</p>",
        "id": 203337090,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594251616
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203344337\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332113\">said</a>:</p>\n<blockquote>\n<p>As for Chinese academics, many of them completely agree with the politics of their government. <br>\n<span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span> Wow, this is so informative.</p>\n</blockquote>\n</blockquote>\n<p>it wasn't obvious to <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span>, which is why I said it.</p>\n<p>This is in the context of China's \"race science\"––that is, the Han supremicist concept of a Chinese Nation-Race––which is officially endorsed by the government and very popular in Chinese sociology. It is what motivates efforts to sterilize minorities after they've reached a quota of children, and it is what motivates government and private representatives of the nation to blackmail people who happen to be of the same race who live abroad. </p>\n<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> was saying that these scholars must be too ignorant to know better because of censorship and schooling. I was saying, no, most Chinese scholars have all the intellectual resources necessary to fully understand what is going on and many (not all) agree with it.</p>\n<p>And yes, it's quite clear that there are strong incentives to go to China for resources. The point was that those who go do so voluntarily, with full knowledge of the ideas they are enabling or endorsing.</p>",
        "id": 203345710,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594261877
    },
    {
        "content": "<p>The more general context was of pointing out how this exact situation, historically, looks black and white. Yet when it happens right here, right now, we feel confused and ambiguous about it, because there is context that makes it more nuanced.</p>",
        "id": 203345820,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594262031
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203344337\">said</a>:</p>\n<blockquote>\n<p>For the record, I'm from Singapore, born and raised, just in case anybody wants to impute anything from my name. And I'm not moving from Australia.</p>\n</blockquote>\n<p>I get how uncomfortable that part of the conversation must have felt for you. I  should hope people wouldn't assume too much about your politics from your last name (or ethnicity or national identity) but I see how talking about groups of people can lead to problematic dynamics.</p>\n<p>Maybe it's not a good topic for this forum? While I think it's important to confront the issue of collaborating with supporters of race science, I also don't want to encourage name-calling or stereotyping on the forum. What's your take on the issue?</p>",
        "id": 203346184,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594262534
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203345710\">said</a>:</p>\n<blockquote>\n<p>it wasn't obvious to <span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span>, which is why I said it.</p>\n<p>This is in the context of China's \"race science\"––that is, the Han supremicist concept of a Chinese Nation-Race––which is officially endorsed by the government and very popular in Chinese sociology. </p>\n</blockquote>\n<p>It wasn't obvious to me either, because you seemed to have gone on a tangent from Heidegger to China. This is why Fabrizio mentioned what he did.</p>\n<p>Ethno-nationalism isn't exclusive to China either. The Koreans have their own form of <a href=\"https://en.wikipedia.org/wiki/Korean_ethnic_nationalism\">racial supremacy</a>. In fact, nationalism isn't seen in Asia as the evil that it's seen to be in Europe, because nationalism there has historically been intricately linked with decolonisation and self-determination.</p>\n<p>So are you going to de-platform Korean academics because they \"agree with their government\" as well?</p>",
        "id": 203351524,
        "sender_full_name": "(=_=)",
        "timestamp": 1594271756
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span>  <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203345710\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> was saying that these scholars must be too ignorant to know better because of censorship and schooling. I was saying, no, most Chinese scholars have all the intellectual resources necessary to fully understand what is going on and many (not all) agree with it.</p>\n</blockquote>\n<p>No, he did not say that. Here's what he said in reply to your China tangent:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332250\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332113\">said</a>:</p>\n<blockquote>\n<p>As for Chinese academics, many of them completely agree with the politics of their government. And they often have the option to immigrate elsewhere, as talented people everywhere do. It is what it is.</p>\n</blockquote>\n<p>Sure. Then again, one has also to factor in the amount of propaganda and the high level of censorship. It's easier to agree with something when alternatives are out of reach</p>\n</blockquote>",
        "id": 203351682,
        "sender_full_name": "(=_=)",
        "timestamp": 1594272009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> I think that philosophies of racial supremacy are both bad science and bad ethics, no matter who is promoting them. I think that the philosophies of racial superiority that drove colonization were illegitimate, and I think that the philosophies of racial supremacy formed by victims of colonization are equally illigitmate. How is this even controversial? Of course Korean race science is just as concerning as German race science or American race science or Chinese race science. Even more so if it's officially endorsed anywhere.</p>",
        "id": 203351899,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594272457
    },
    {
        "content": "<p>What I think he meant is this: because of the level of control, as well as individual circumstances that make it difficult to immigrate elsewhere -- contrary to what you've claimed, by the way -- it's more advantageous to the individual to just go along with something, rather than oppose it.</p>\n<p>My critique is this: how do <em>you</em> know that many of them \"completely agree with the politics of their government\"? What is your definition of \"completely agree\"? Fabrizio may have raised \"amount of propaganda\" and \"high level of censorship\" as factors, but I'd cite \"level of control\", which completely devalues any information you can get out of any Chinese academic about this particular topic.</p>",
        "id": 203351902,
        "sender_full_name": "(=_=)",
        "timestamp": 1594272461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203351899\">said</a>:</p>\n<blockquote>\n<p>I think that philosophies of racial supremacy are both bad science and bad ethics, no matter who is promoting them. I think that the philosophies of racial superiority that drove colonization was illegitimate, and I think that the pbilosophies of racial supremacy formed by victims of colonization are equally illigitmate. How is this even controversial? Of course Korean race science is just as concerning as German race science or American race science or Chinese race science. Even more so if it's officially endorsed anywhere.</p>\n</blockquote>\n<p>The issue of racial supremacy and its illegitimacy was not the question. The question was this:</p>\n<blockquote>\n<p>Are you going to de-platform Korean academics because they \"agree with their government\" as well?</p>\n</blockquote>",
        "id": 203351951,
        "sender_full_name": "(=_=)",
        "timestamp": 1594272519
    },
    {
        "content": "<p>I didn't advocate for de-platforming anyone. That wasn't even the topic. </p>\n<p>The topic was, there are historical parallels between the conduct of the Chinese government and the conduct of reviled historical regimes that also used race science to justify doing harm (America included--Eugenics emerged largely in America).</p>\n<p>My point was that we see these things in black and white when we use easy historical examples but it's much harder to judge when it's our own colleages we're talking about. That was my point. That many of own colleagues are endorsing things that we consider to be historically unequivocally evil, but we don't think they're evil.</p>",
        "id": 203352119,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594272804
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352119\">said</a>:</p>\n<blockquote>\n<p>I didn't advocate for de-platforming anyone. That wasn't even the topic. </p>\n</blockquote>\n<p>How is this not the topic when the whole thread was about <em>whether or not</em> there should be someone from BAE speaking at ACT 2020 in the first place?</p>",
        "id": 203352175,
        "sender_full_name": "(=_=)",
        "timestamp": 1594272897
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352119\">said</a>:</p>\n<blockquote>\n<p>America included--Eugenics emerged largely in America.</p>\n</blockquote>\n<p>As the wiki I've linked to pointed out, Korean ethno-nationalism derived from social Darwinist ideas in Meiji-era Japan. Social Darwinism was pretty much a pandemic idea prior to WWII.</p>",
        "id": 203352237,
        "sender_full_name": "(=_=)",
        "timestamp": 1594273009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> are you defending racial science? Can you please make your stance clear? I'm very condused by this line of questioning.</p>",
        "id": 203352291,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273084
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352291\">said</a>:</p>\n<blockquote>\n<p>are you defending racial science? </p>\n</blockquote>\n<p>Good grief, no!</p>\n<blockquote>\n<p>Can you please make your stance clear? </p>\n</blockquote>\n<p>I'm asking what you mean by someone \"completely agreeing with their government\", and what you think the consequences of that agreement should be, when you disagree with that agreement.</p>",
        "id": 203352316,
        "sender_full_name": "(=_=)",
        "timestamp": 1594273159
    },
    {
        "content": "<p>\"Someone completely agreeing with their government\" in this context means beleiving in the form of racial science that this sub-discussion ia about, and policies that act on those beliefs. What else would I mean?</p>",
        "id": 203352389,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273259
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352389\">said</a>:</p>\n<blockquote>\n<p>\"Someone completely agreeing with their government\" in this context means believing in the form of racial science that this sub-discussion ia about, and policies that act on those beliefs. What else would I mean?</p>\n</blockquote>\n<p>How would I know? I can't read your mind.</p>\n<p>What would you take as evidence in \"believing in the form of racial science\" that their government subscribes to?</p>",
        "id": 203352452,
        "sender_full_name": "(=_=)",
        "timestamp": 1594273326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  I regret using the word evil now. It's too loaded.</p>\n<p>Regarding where to draw the line: yes, that is exactly why I asked the question. I do not have a good answer to this.  Funding from the defense department is hard to avoid in the US (even Chomsky lamented that he was a hypocrite in this sense). And you are right, there are many concerns with Facebook/Google as well (privacy concerns, military contracts, ..). And working with/inviting people from these companies is almost unavoidable in applied math.</p>\n<p>For me at least, a military R&amp;D company like BAE falls very much outside of 'the line'. I was very sad to see someone speak about the kind of math that we do, knowing for what it is ultimately used. We, in a relatively theoretical field, have a chance to be more selective about who to let speak (than, say, engineers). And I think we should use that chance.</p>\n<p>Banning of certain companies, in general, is I think not as controversial as you make it sound. I'm sure there is a line that you would draw somewhere as well? Would you, say, let an engineer from Marlboro speak? A logistics manager from Blackwater (now Academi)?</p>\n<p>Because this question is so hard, I'd like to see people's opinions.</p>",
        "id": 203352468,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594273379
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> I don't know what if anything the consequences should be. This was my entire point. We wax righteous about these issues when the topic is historical, but it's hard to decide what to do about it when it happens here and now.</p>\n<p>Look at the guy who deleted his account over the mere mention of well verified facts (note that I did not make any controversial claims, I stuck to the ones everybody agrees on). This was my entire point. Making moral judgements is really hard in practice.</p>",
        "id": 203352472,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273386
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352472\">said</a>:</p>\n<blockquote>\n<p>I don't know what if anything the consequences should be. This was my entire point. We wax righteous about these issues when the topic is historical, but it's hard to decide what to do about it when it happens here and now.</p>\n</blockquote>\n<p>Then it's not very desirable, is it, if you're not able to produce some clear criteria of what level of evidence should be required to satisfy such a \"purity test\" of the lack of such undesirable beliefs?</p>",
        "id": 203352627,
        "sender_full_name": "(=_=)",
        "timestamp": 1594273579
    },
    {
        "content": "<p>I'm sorry. I'll remove it. Isn't this topic making you upset though? If not, we should talk about tone management.</p>",
        "id": 203352711,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273781
    },
    {
        "content": "<p>And yes <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> my nerves are getting a little raw. I feel like you are putting words in my mouth on a permanent record and I am regretting speaking up.</p>",
        "id": 203352763,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273860
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352711\">said</a>:</p>\n<blockquote>\n<p>Isn't this topic making you upset though? </p>\n</blockquote>\n<p>It's making a lot of people upset, because the direction this thread is taking is plainly exclusionary.</p>",
        "id": 203352819,
        "sender_full_name": "(=_=)",
        "timestamp": 1594273927
    },
    {
        "content": "<p>For example, I am not and never was advocating for a purity test. Just the opposite. I was pointing out how complicated these issues are when we are dealing with our very own friends and colleagues.</p>",
        "id": 203352822,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594273935
    },
    {
        "content": "<p>The observation that there are \"purity tests\" in this community was brought up by Giorgos.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203332964\">said</a>:</p>\n<blockquote>\n<p>Bringing it back and explaining why I have such a strong reaction to this: there are already purity tests in this community.</p>\n</blockquote>",
        "id": 203352838,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274009
    },
    {
        "content": "<p>It sounds like maybe we should talk about how to contend exclusionary rhetoric.</p>",
        "id": 203352995,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274275
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352995\">said</a>:</p>\n<blockquote>\n<p>It sounds like maybe we should talk about how to contend exclusionary rhetoric.</p>\n</blockquote>\n<p>That ship has sailed a long time ago. There are already people who've left this community because they felt it was being exclusionary. You've just <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203352472\">mentioned one</a>:</p>\n<blockquote>\n<p>Look at the guy who deleted his account over the mere mention of well verified facts</p>\n</blockquote>",
        "id": 203353063,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274364
    },
    {
        "content": "<p>Today, or more generally?</p>",
        "id": 203353123,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274414
    },
    {
        "content": "<p>Today. I was away while the conversation happened, because I came back and saw nothing.</p>",
        "id": 203353152,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274495
    },
    {
        "content": "<p>How many people left?</p>",
        "id": 203353206,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274529
    },
    {
        "content": "<p>Today? Just this one, I guess.</p>",
        "id": 203353219,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274569
    },
    {
        "content": "<p>Ok, so this is an ongoing trend?</p>",
        "id": 203353223,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274586
    },
    {
        "content": "<p>Can you remember other examples?</p>",
        "id": 203353229,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274596
    },
    {
        "content": "<p>I thought this was a special conference topic, and that it was important to flesh out issues about how to manage conflicts of interest in ACT. I didn't realize this was an ongoing dynamic. Do you remember other threads?</p>",
        "id": 203353315,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274701
    },
    {
        "content": "<p>Daniel Geisler was close to leaving at one point.</p>",
        "id": 203353407,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274877
    },
    {
        "content": "<p>I remember that. I don't think it was about ethical conflicts of interest.</p>",
        "id": 203353460,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594274916
    },
    {
        "content": "<p>Yup, but I talked things out.</p>",
        "id": 203353464,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1594274927
    },
    {
        "content": "<p>Yeah, and I guess some people don't feel like they could talk things out.</p>",
        "id": 203353483,
        "sender_full_name": "(=_=)",
        "timestamp": 1594274980
    },
    {
        "content": "<p>I remember reading, in some comments by Marx, that the 19 century German social democratic party had a policy of effacing all class distinctions <em>within</em> the party itself.</p>",
        "id": 203353556,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275074
    },
    {
        "content": "<p>Science in some ways is like a party, but not a political one.</p>",
        "id": 203353613,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275131
    },
    {
        "content": "<p>To my mind, that's not the essence of it.   It is the pursuit of truth, by rational, empirical methods.</p>",
        "id": 203353701,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275254
    },
    {
        "content": "<p>Well, in any case, we're kind of like a party here, and I would make a call for unity.</p>",
        "id": 203353785,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275394
    },
    {
        "content": "<p>The needs for progress - for social progress, to be aided by science -- are urgent.</p>",
        "id": 203353790,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275420
    },
    {
        "content": "<p>It would be a true loss for us to get consumed by infighting.</p>",
        "id": 203353809,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275468
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> </p>\n<blockquote>\n<p>It's making a lot of people upset, because the direction this thread is taking is plainly exclusionary.</p>\n</blockquote>\n<p>I think this raises a really important concern.</p>\n<p>On the one hand, we want to be able to openly discuss moral concerns about how the community's work gets used, insofar as this is controllable.</p>\n<p>On the other hand, we don't want to alienate people, (unless there is a strong <em>rational</em> consensus that in a particular case, we do). We want people to join and do maths. But we don't want to brush ethics aside.</p>\n<p>How do we get satisfy both desires?</p>",
        "id": 203353811,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594275475
    },
    {
        "content": "<p>So I propose that we take an inclusionary stance with respect to <em>contributions</em> to our science.</p>",
        "id": 203353870,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275543
    },
    {
        "content": "<p>While at the same time redoubling our efforts and focus on seeking progressive applications.</p>",
        "id": 203353924,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275610
    },
    {
        "content": "<p>In principle, this can include <em>social</em> sciences - learning more about the truth of society, its problems, and possible resolutions.</p>",
        "id": 203354007,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594275767
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span> I'm leaning in favor of this stance as well, but people will raise issues such as:</p>\n<p>(1) should we accept contributions from military scientists who support governments that commit war crimes? That is, should these people be allowed to contribute, given that they will also bennefit from the network and may use the group's resources for weapons reseaech?</p>\n<p>(2) Same question for engineers of race projects (for example, machine learning engineers who use this ACT to help with eugenics projects)</p>\n<p>Etc.</p>\n<p>How do you respond to these issues when they come up?</p>",
        "id": 203354025,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594275817
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span> I think you took the first step by enunciating  the major concerns and an enlightened approach to dealing with people. My spiritual name is Prashanta - Dynamic Peace, and much of my work is internally and then externally processing the dichotomy between being a protector and also looking after other people's rights.<br>\nProcessing this stuff is difficult work as the court systems of the world have shown.</p>",
        "id": 203354108,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1594275942
    },
    {
        "content": "<p>Not sure what you mean by accepting contributions <em>to</em> military scientists.   I was talking about taking an inclusionary stance towards accepting useful mathematical ideas, without focusing on the personal circumstances of the author.</p>",
        "id": 203354190,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594276051
    },
    {
        "content": "<p>Not that this is a deciding argument, but I find the comparison to be evocative:</p>",
        "id": 203354204,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594276079
    },
    {
        "content": "<p>Sorry, typographical error</p>",
        "id": 203354241,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594276084
    },
    {
        "content": "<p>The issue that was originally raised is that accepting participation (rather than just citing papers) from people wbo work for these sorts of organizations bennefits their work, too.</p>",
        "id": 203354269,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594276178
    },
    {
        "content": "<p>With the German social democrats, the point was that if someone was sincere in working towards socialism, it was to be effaced whether they themselves were a capitalist or not.</p>",
        "id": 203354276,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594276186
    },
    {
        "content": "<p>I see. So you're advocating for a form of professional ethics that says we must accept contributions from anyone who makes them, as long as they don't harm the community of mathematicians itself.</p>",
        "id": 203354416,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594276329
    },
    {
        "content": "<p>So in this form of professional ethics, we take a \"politics blind\" approach so that the whole community can build a better future, even if members contribute to harm.</p>",
        "id": 203354465,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594276420
    },
    {
        "content": "<p>Am I understanding you correctly?</p>",
        "id": 203354471,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594276431
    },
    {
        "content": "<p>These are very complex questions, and I don't have a formulaic answer.</p>",
        "id": 203354672,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594276683
    },
    {
        "content": "<p>I raised the comparison only as an evocative analogy.</p>",
        "id": 203354712,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594276747
    },
    {
        "content": "<p>To me, trying to come up with a decision procedure for what is \"too evil\" is a losing game.   What about all the people who's tax dollars fund military projects, etc.  It's a philosophical morass.</p>",
        "id": 203355103,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594277324
    },
    {
        "content": "<p>Let's set goals to identify essential problems with the environment and society, and work towards change.   We need all the science we can get for this.</p>",
        "id": 203355137,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594277394
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276143\">David Tanzer</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203354007\">said</a>:</p>\n<blockquote>\n<p>In principle, this can include <em>social</em> sciences - learning more about the truth of society, its problems, and possible resolutions.</p>\n</blockquote>\n<p>I think this can be in practice as well. I think I've seen quite a few philosophers here. Since societies are complex systems, we should be able to think about them using the tools we have to study complex systems. It may well help us to hone those tools too.</p>",
        "id": 203355206,
        "sender_full_name": "(=_=)",
        "timestamp": 1594277468
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203354025\">said</a>:</p>\n<blockquote>\n<p>Same question for engineers of race projects (for example, machine learning engineers who use this ACT to help with eugenics projects)</p>\n</blockquote>\n<p>This is actually science that you can justifiably call \"bad\". Because neural networks are functions parametrised by data, their outputs are influenced by the shape of the data, which has all sorts of biases. So yes, we can exclude them on the basis of the poor quality of the science. In fact, we should study, and people have studied, why the poor quality of the data leads to poor outcomes from these ML projects.</p>",
        "id": 203356092,
        "sender_full_name": "(=_=)",
        "timestamp": 1594278417
    },
    {
        "content": "<p>To recap, I do advocate for a \"unity party\" approach to science.   We need this to even be able to approach the pressing and daunting emergencies now faced by the human race.   That is the first-order consideration.</p>",
        "id": 203356955,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594279298
    },
    {
        "content": "<p>There is an optimization involved here.</p>",
        "id": 203357494,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594279849
    },
    {
        "content": "<p>As part of this optimization, I could see an exception being made for would-be contributors who themselves publicly espouse ideas that are offensive to basic community values, such as one who writes supremacist propaganda.   There would  be consensus here about that, so it would not be a divisive decision.</p>",
        "id": 203358348,
        "sender_full_name": "David Tanzer",
        "timestamp": 1594280712
    },
    {
        "content": "<p>with respect to the original BAE thing, my thoughts are (I think) very similar to Jules’: you don’t need to be able to define when exactly a pile of sand becomes a heap to be able to say that there’s a lot of sand in the Sahara. I know that lots of people seem to feel very strongly about no-platforming as something anti-democratic or whatever, but, to me, the situation is now that BAE can unequivocally say “oh look, we’re part of the ACT community”, and this makes me very reluctant to identify as a member of the community myself. I’m not going to pretend that the community would be missing out on anything if I left, but I guess it boils down to this: is the pursuit of pure mathematical knowledge more important to this community than the human element of the community (and the world at large)?</p>",
        "id": 203358682,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594281035
    },
    {
        "content": "<p>and, to me, the “worst” case scenario of trying very hard to avoid associations with things like BAE is that category theory research gets set back by 20 years or whatever because we exclude some great minds, all “just” to try to make this community seem as compassionate as possible</p>",
        "id": 203362650,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594284322
    },
    {
        "content": "<p>but, to me, the “just” part of the above is so much more important. if you want to be purely utilitarian, think (as previously alluded to) how many more great minds would come to the field at the “cost” of cutting out war-crime companies. on a much more human level, is category theory research progress really worth more than our moral and ethical responsibilities towards other human beings?</p>",
        "id": 203362818,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594284476
    },
    {
        "content": "<p>I think that’s all I have to add. It might seem overly idealistic and “hippy” as an attitude, but, from personal experience, these debates between mathematicians usually lack somewhat these sorts of opinions, and tend more towards “let’s be rational logicians”, so hopefully this might resonate somewhat with some people</p>",
        "id": 203363030,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594284608
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203358682\">said</a>:</p>\n<blockquote>\n<p>is the pursuit of pure mathematical knowledge more important to this community than the human element of the community (and the world at large)?</p>\n</blockquote>\n<p>If the pursuit of pure mathematical knowledge is more important, then we can just get rid of the A in ACT, because that's what pure maths does: it no-platforms everything that isn't pure mathematical knowledge.</p>",
        "id": 203363039,
        "sender_full_name": "(=_=)",
        "timestamp": 1594284619
    },
    {
        "content": "<p>This was basically Grothendieck's point of view: IHES was damned in his eyes because it took money from the French ministry of defence. I mean, it's great now that IHES has no military sources of funding, but maths lost the input of Grothendieck along the way.</p>",
        "id": 203363237,
        "sender_full_name": "(=_=)",
        "timestamp": 1594284800
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203358682\">said</a>:</p>\n<blockquote>\n<p>I know that lots of people seem to feel very strongly about no-platforming as something anti-democratic or whatever</p>\n</blockquote>\n<p>Oh no, no no no, no-platforming is VERY democratic. It is just anti-discourse.</p>",
        "id": 203363422,
        "sender_full_name": "(=_=)",
        "timestamp": 1594284928
    },
    {
        "content": "<p>I think that characterising BAE as being amongst a collection “industry players that has done something useful” is incredibly dishonest. I agree that, because of his views, we “lost” Grothendieck, but... so what? Is mathematics currently suffering in a way that we can directly pinpoint on Grothendieck’s departure? I don’t think so. I would have loved for him to have continued being a part of the mathematical community, but I appreciate that he decides that some things are more important than algebraic geometry</p>",
        "id": 203363903,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285260
    },
    {
        "content": "<p>To me, if the progress of ACT is so heavily dependent on “necessary” association with evil companies, then I don’t particularly want it to advance very much</p>",
        "id": 203364029,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285334
    },
    {
        "content": "<p>Having weapons companies present is not pro-discourse per se. Because the discourse at a math conference is usually focussed on math. What would be pro-discourse is the suggestion by <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> to give people the (scheduled) chance to discuss  <em>from non-mathematical a perspective</em> about companies that are given publicity at the conference.</p>",
        "id": 203364134,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594285422
    },
    {
        "content": "<p>people who write off a community for choosing to not associate with immoral activities (to put it lightly) aren’t really the sort of people who would make a particularly moral community, as i see it</p>",
        "id": 203364194,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285444
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203363903\">said</a>:</p>\n<blockquote>\n<p>I agree that, because of his views, we “lost” Grothendieck, but... so what? Is mathematics currently suffering in a way that we can directly pinpoint on Grothendieck’s departure? </p>\n</blockquote>\n<p>Yes. His <em>Esquisse</em> was disregarded for many years before people started to pick up the pieces. Arguably, a lot of algebraic geometry and homotopy theory could have been done if he had not broken up with the mathematics community.</p>\n<blockquote>\n<p>I appreciate that he decides that some things are more important than algebraic geometry</p>\n</blockquote>\n<p>I appreciate that you've demonstrated that, like Grothendieck, you don't really care about the maths.</p>",
        "id": 203364432,
        "sender_full_name": "(=_=)",
        "timestamp": 1594285641
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364134\">said</a>:</p>\n<blockquote>\n<p>Having weapons companies present is not pro-discourse per se. </p>\n</blockquote>\n<p>Tim was arguing that having someone from BAE signals that BAE is part of the ACT community, which Tim finds distasteful. I find that an anti-discourse stance. I get that it'd be great morally not to allow anyone with affiliations to weapons companies to participate, but it's still stifling discourse nonetheless.</p>",
        "id": 203364703,
        "sender_full_name": "(=_=)",
        "timestamp": 1594285816
    },
    {
        "content": "<p>Sure, I don't really care about maths  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span><br>\nI don't really understand the point you're trying to make here, since it feels more just like you're trying to find logical holes in how I feel about this. Feel free to do that, but I find it tiring and pointless, so I think I'll leave this debate here.</p>",
        "id": 203364709,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285821
    },
    {
        "content": "<p>not all discourse deserves to be had</p>",
        "id": 203364735,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364709\">said</a>:</p>\n<blockquote>\n<p>I don't really understand the point you're trying to make here</p>\n</blockquote>\n<p>I was reacting to Oliver's point about \"Chinese academics agreeing with their governments\".</p>",
        "id": 203364809,
        "sender_full_name": "(=_=)",
        "timestamp": 1594285897
    },
    {
        "content": "<p>(I read the entire thread)</p>",
        "id": 203364863,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594285923
    },
    {
        "content": "<p>Then you'd know that this thread had moved on beyond BAE, particularly in the interactions between Fabrizio and Oliver.</p>",
        "id": 203365033,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286050
    },
    {
        "content": "<p>I was objecting to something Oliver had said. In that context, according to Oliver, it was about bad science, although Fabrizio and I had clearly read his comment differently.</p>",
        "id": 203365135,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203363903\">said</a>:</p>\n<blockquote>\n<p>I think that characterising BAE as being amongst a collection “industry players that has done something useful” is incredibly dishonest. </p>\n</blockquote>\n<p>There are people who do pure maths who effectively conceive of \"industry\" as such a collection. Perhaps they are mistaken. I certainly think so.</p>",
        "id": 203365510,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286408
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364709\">said</a>:</p>\n<blockquote>\n<p>it feels more just like you're trying to find logical holes in how I feel about this. Feel free to do that, but I find it tiring and pointless, so I think I'll leave this debate here.</p>\n</blockquote>\n<p>Your words are not gospel that I have to take on faith.</p>",
        "id": 203365776,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364735\">said</a>:</p>\n<blockquote>\n<p>not all discourse deserves to be had</p>\n</blockquote>\n<p>You're free to hold this view, but I'll still call it an \"anti-discourse\" view.</p>",
        "id": 203365812,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286638
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364703\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364134\">said</a>:</p>\n<blockquote>\n<p>Having weapons companies present is not pro-discourse per se. </p>\n</blockquote>\n<p>Tim was arguing that having someone from BAE signals that BAE is part of the ACT community, which TIm finds distasteful. I find that an anti-discourse stance. I get that it'd be morally wonderful not to allow anyone with affiliations to weapons companies to participate, but it's still stifling discourse nonetheless.</p>\n</blockquote>\n<p>It would be an anti-discourse stance if we were at a, say, a conference about 'Ethics in engineering', to disallow BAE to participate. We are at a math conference, and unless the issue is brought up (as is in this thread, which is fantastic I think) there is no discourse. BAE gets to associate with ACT (for the outside world), and to advertise working with them (to the participants).</p>",
        "id": 203366077,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594286778
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364134\">said</a>:</p>\n<blockquote>\n<p>What would be pro-discourse is the suggestion by <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> to give people the (scheduled) chance to discuss  <em>from non-mathematical a perspective</em> about companies that are given publicity at the conference.</p>\n</blockquote>\n<p>Sure, but according to Tim, that's not good enough. According to him, those companies should never have been given a chance to show up at the conference in the first place. That's why I called that view \"anti-discourse\".</p>",
        "id": 203366108,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286802
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203366077\">said</a>:</p>\n<blockquote>\n<p>BAE gets to associate with ACT (for the outside world), and to advertise working with them (to the participants).</p>\n</blockquote>\n<p>And clearly that's something Tim finds distasteful.</p>",
        "id": 203366177,
        "sender_full_name": "(=_=)",
        "timestamp": 1594286870
    },
    {
        "content": "<p>Yes, I completely agree with Tim on that. I was arguing against your point that it is anti-discourse to <em>not</em> want this to happen.</p>",
        "id": 203366532,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594287096
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203366532\">said</a>:</p>\n<blockquote>\n<p>Yes, I completely agree with Tim on that. I was arguing against your point that it is anti-discourse to <em>not</em> want this to happen.</p>\n</blockquote>\n<p>I did not say that. <br>\nTim said no-platforming was anti-democratic. I disagreed and argued that it's actually anti-discourse. <br>\nWhat <em>you</em> are now saying is to give BAE a platform but allow others to have a discourse about why it's undesirable. <br>\nThat is <em>not</em> no-platforming: no-platforming means BAE should never have been here in the first place. That was what Tim was arguing should have happened.</p>",
        "id": 203366905,
        "sender_full_name": "(=_=)",
        "timestamp": 1594287328
    },
    {
        "content": "<p>And sure, if the community decides it is going to no-platform anyone who works for any objectionable company, for a community-decided value of \"objectionable\", go for it. But it is still an anti-discourse stance. It is also VERY democratic.</p>",
        "id": 203367084,
        "sender_full_name": "(=_=)",
        "timestamp": 1594287429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203366905\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203366532\">said</a>:</p>\n<blockquote>\n<p>Yes, I completely agree with Tim on that. I was arguing against your point that it is anti-discourse to <em>not</em> want this to happen.</p>\n</blockquote>\n<p>I did not say that. Tim said no-platforming was anti-democratic.</p>\n</blockquote>\n<p>No. I am not taking part in this discussion anymore, but please don't start misquoting me. I said that \"lots of people seem to feel very strongly about no-platforming as anti-democratic or whatever\".</p>",
        "id": 203367291,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594287561
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203367291\">said</a>:</p>\n<blockquote>\n<p>No. I am not taking part in this discussion anymore, but please don't start misquoting me. I said that \"lots of people seem to feel very strongly about no-platforming as anti-democratic or whatever\".</p>\n</blockquote>\n<p>Then please don't misquote \"lots of people\" either. <em>Nobody in this thread</em> ever said that no-platforming was anti-democratic, not even me.</p>",
        "id": 203367438,
        "sender_full_name": "(=_=)",
        "timestamp": 1594287661
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203367438\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203367291\">said</a>:</p>\n<blockquote>\n<p>No. I am not taking part in this discussion anymore, but please don't start misquoting me. I said that \"lots of people seem to feel very strongly about no-platforming as anti-democratic or whatever\".</p>\n</blockquote>\n<p>Then please don't misquote \"lots of people\". <em>Nobody</em> ever said that no-platforming was anti-democratic. Certainly <em>not</em> me either.</p>\n</blockquote>\n<p>I think that \"lots of people _seem to think_\" is pretty clearly not a statement equivalent to \"lots of people _definitely think, and I have statistical evidence_\". I never (intentionally) implied that you thought it was anti-democratic. However, \"<em>nobody</em> ever said that no-platforming is anti-democratic\" seems an odd take... it's a view I've come across quite a lot. <br>\n<a href=\"/user_uploads/21317/1s6o8Q1AdznXt_F0tNok7Vpl/Screenshot-2020-07-09-at-11.41.30.png\">Screenshot-2020-07-09-at-11.41.30.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/1s6o8Q1AdznXt_F0tNok7Vpl/Screenshot-2020-07-09-at-11.41.30.png\" title=\"Screenshot-2020-07-09-at-11.41.30.png\"><img src=\"/user_uploads/21317/1s6o8Q1AdznXt_F0tNok7Vpl/Screenshot-2020-07-09-at-11.41.30.png\"></a></div>",
        "id": 203367637,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594287825
    },
    {
        "content": "<p>Well, woke up this morning to nearly 200 posts on this thread. Thank you to <span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span> for chiming in. Since I partly started this thread I want to be clear I have nothing against you personally (and your talk was great). However I also stand without heasitation with what I said before: BAE-the-organisation should not have been given a slot in the industry session. The fact that there is any debate about this <em>at all</em> makes me very, very doubtful that there is anything much salvageable in this community's collective \"values\" that we can agree on</p>",
        "id": 203367681,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594287844
    },
    {
        "content": "<p>I really don't want to continue this conversation though, and apologise for getting sucked back in. It really has diverged from the original point.</p>",
        "id": 203367789,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594287950
    },
    {
        "content": "<p>About half of 200 messages I just scanned through appear to be people trying to logically rationalise a defence of an organisation that is complicit in ongoing war crimes</p>",
        "id": 203367863,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594287989
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203367681\">said</a>:</p>\n<blockquote>\n<p>Well, woke up this morning to nearly 200 posts on this thread. Thank you to <span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> for chiming in. Since I partly started this thread I want to be clear I have nothing against you personally (and your talk was great). However I also stand without heasitation with what I said before: BAE-the-organisation should not have been given a slot in the industry session. The fact that there is any debate about this <em>at all</em> makes me very, very doubtful that there is anything much salvageable in this community's collective \"values\" that we can agree on</p>\n</blockquote>\n<p>I think this says what I would like to say much more concisely than I could achieve</p>",
        "id": 203367864,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594287989
    },
    {
        "content": "<p>Additional: I'm muting this thread now, there is nothing left to say on the matter</p>",
        "id": 203367936,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594288064
    },
    {
        "content": "<p>didn't realise you could do that on Zulip, thanks for the heads up! ditto</p>",
        "id": 203368049,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1594288134
    },
    {
        "content": "<p>You may want to check some comments on <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> twitter tread on how we got here, and the local organisers well-intended inclusion to enable people to attend that otherwise couldn't via sponsorship.  So it was all about being inclusive towards those who would have a hard time doing so pre-COVID.</p>",
        "id": 203385454,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1594301644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203352468\">said</a>:</p>\n<blockquote>\n<p>Banning of certain companies, in general, is I think not as controversial as you make it sound.</p>\n</blockquote>\n<p>I wasn't trying to make it sound controversial.  When I asked \"would you ban X, Y and Z?\" it's because I wanted to actually know people's answers to those questions - it wasn't a rhetorical ploy.  I haven't gotten many responses.</p>",
        "id": 203421827,
        "sender_full_name": "John Baez",
        "timestamp": 1594319228
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203367863\">said</a>:</p>\n<blockquote>\n<p>About half of 200 messages I just scanned through appear to be people trying to logically rationalise a defence of an organisation that is complicit in ongoing war crimes</p>\n</blockquote>\n<p>I don't see that going on here.</p>",
        "id": 203425526,
        "sender_full_name": "John Baez",
        "timestamp": 1594321229
    },
    {
        "content": "<p>I want to hear about military applications of ACT because it will help me understand ACT as it actually exists in the world.  I don't sympathize with the position that we will reduce ACT's military application simply by not hearing about it in our conferences.  Seems kind of like a \"shoot the messenger\" type argument.  Sure, it does help BAE to have them at our conference.  But the evil we do by helping them in this way is negligible compared to the evil BAE is doing in the world in its material operations.  And it also helps us understand the state of ACT as it is exists in the world, rather than a sterilized version where we get to pretend that it isn't going to be applied to anything evil.</p>",
        "id": 203425975,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1594321440
    },
    {
        "content": "<p>We need to focus on diminishing evil in the world, not selfishly diminishing our share of that evil.</p>",
        "id": 203426104,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1594321501
    },
    {
        "content": "<p>I agree with Joshua that \"keeping all the nasty organizations out\" has disadvantages as well as advantages.   It means that the nasty organizations (who by the way have lots more money and resources than us) will read our papers, build on them, but never talk to us - so they'll do their own work never encountering criticism from us.    </p>\n<p>If instead we had a public session where we discussed the ethical issues raised by the various talks at ACT, \"nasty organizations\" will get to hear scholars saying they're doing nasty things.</p>",
        "id": 203427001,
        "sender_full_name": "John Baez",
        "timestamp": 1594321979
    },
    {
        "content": "<p>The good publicity they get from speaking at the conference would be negated by the bad publicity of a YouTube video where scholars discuss their evil deeds.</p>\n<p>Of course it'd be tricky to carry this out successfully - it might be impractical.</p>",
        "id": 203427186,
        "sender_full_name": "John Baez",
        "timestamp": 1594322084
    },
    {
        "content": "<p>I'm talking about talks now.   This is separate from corporate sponsorships: I think it makes a lot of sense to prevent \"nasty organizations\" (however they get defined) from being able to display their logo on the ACT conference webpage.</p>",
        "id": 203427406,
        "sender_full_name": "John Baez",
        "timestamp": 1594322215
    },
    {
        "content": "<p>Yes I agree about corporate sponsorships.</p>",
        "id": 203428090,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1594322615
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203425975\">said</a>:</p>\n<blockquote>\n<p>I want to hear about military applications of ACT because it will help me understand ACT as it actually exists in the world.  I don't sympathize with the position that we will reduce ACT's military application simply by not hearing about it in our conferences.  Seems kind of like a \"shoot the messenger\" type argument.  Sure, it does help BAE to have them at our conference.  But the evil we do by helping them in this way is negligible compared to the evil BAE is doing in the world in its material operations.  And it also helps us understand the state of ACT as it is exists in the world, rather than a sterilized version where we get to pretend that it isn't going to be applied to anything evil.</p>\n</blockquote>\n<p>Look at the affiliations of the UMAP authors</p>",
        "id": 203430824,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1594323968
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203421827\">said</a>:</p>\n<blockquote>\n<p>I wasn't trying to make it sound controversial.  When I asked \"would you ban X, Y and Z?\" it's because I wanted to actually know people's answers to those questions - it wasn't a rhetorical ploy.  I haven't gotten many responses.</p>\n</blockquote>\n<p>Sorry, misinterpreted that. So, to give a concrete answer: yes, at the beginning of the thread I was of the opinion that banning talks from weapons manufacturers is a good first start. This was under the assumption that these talks would happen in a vacuum, and not be accompanied by a thorough discussion (as we are seeing the beginnings of, in this thread).<br>\nI think your suggestion to give people the chance to give a short \"context talk\" for <em>any</em> corporate talk would be fantastic. This would result in an effective ban of companies like BAE though, I think. They probably would not want a spotlight put on their company's history, scandals, and general business ethic.</p>",
        "id": 203433651,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594325342
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203430824\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203425975\">said</a>:</p>\n<blockquote>\n<p>I want to hear about military applications of ACT because it will help me understand ACT as it actually exists in the world.  I don't sympathize with the position that we will reduce ACT's military application simply by not hearing about it in our conferences.  Seems kind of like a \"shoot the messenger\" type argument.  Sure, it does help BAE to have them at our conference.  But the evil we do by helping them in this way is negligible compared to the evil BAE is doing in the world in its material operations.  And it also helps us understand the state of ACT as it is exists in the world, rather than a sterilized version where we get to pretend that it isn't going to be applied to anything evil.</p>\n</blockquote>\n<p>Look at the affiliations of the UMAP authors</p>\n</blockquote>\n<p>What about them?</p>",
        "id": 203435614,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1594326322
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/Tutte_Institute_for_Mathematics_and_Computing\">https://en.wikipedia.org/wiki/Tutte_Institute_for_Mathematics_and_Computing</a></p>",
        "id": 203435669,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1594326353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span> Regarding the suggestion by <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> : would you have agreed to give a talk, if you knew that people were given the opportunity to give \"context talks\" on any corporation whose employees give a presentation?</p>",
        "id": 203436060,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594326545
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"303393\">Joscha Diehl</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203436060\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> Regarding the suggestion by <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> : would you have agreed to give a talk, if you knew that people were given the opportunity to give \"context talks\" on any corporation whose employees give a presentation?</p>\n</blockquote>\n<p>In such a situation I would naturally be obligated to include that information in my public release request. I don't think I would bother _submitting_ a technical talk. If _invited_ under those auspices I would make the request.</p>",
        "id": 203443610,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1594330364
    },
    {
        "content": "<p>I think we can take an automata approach to the values. In essence, there are some initial carefully selected behavior assertions from which certain desired outcomes are made inevitable. From an organizational analysis standpoint, those organizations which are stagnant and lacking integrity have one key quality—a high trust sparsity and, consequently, a low transparency. By simply asserting that people must take actions to foster and maintain a <strong>trust-dense</strong> environment, we get rid of an entire class of degenerate organizational states. And things like a code of conduct naturally, implicitly fall out of that. If a person does something to harm another person, this reduces trust density, and thus violates the positive assertion. </p>\n<p>Another quality is that of making <strong>room for excellence</strong> in all of its forms. An innovative knowledge-based organization/community will always find a place for talent. If excellent or potential for excellence is turned away, then this is a sign of degeneracy. With some way to gain a sense of whether such individuals do in fact make their way into the community and are allowed to contribute, this is a sign of health.</p>\n<p>A final thing to note is that efficient organizations take a <strong>fractal structure</strong>. Since this community has at its core the use of category theory as a tool for extracting patterns from wherever they are and incorporating them into a larger theory, we should see this behavior in how we engage with the physical world as well, to include people. After all, mathematics is a mental tool used by our mental processes, and we are also those mental processes coupled together. </p>\n<p>In short, the organization as an automaton can allow for thinking about a minimal set of positive assertions from which desired behavior and monitoring of degeneracy can manifest. Two major ones are to take actions to foster trust density and to assimilate excellence in all of its forms. The efficient organization has a fractal structure, so let these mathematical tools be a guide on how to build, maintain, and navigate the world as a community.</p>",
        "id": 203444130,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594330630
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319212\">Xavier</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203444130\">said</a>:</p>\n<blockquote>\n<p>I think we can take an automata approach to the values. In essence, there are some initial carefully selected behavior assertions from which certain desired outcomes are made inevitable. From an organizational analysis standpoint, those organizations which are stagnant and lacking integrity have one key quality—a high trust sparsity and, consequently, a low transparency. By simply asserting that people must take actions to foster and maintain a <strong>trust-dense</strong> environment, we get rid of an entire class of degenerate organizational states. And things like a code of conduct naturally, implicitly fall out of that. If a person does something to harm another person, this reduces trust density, and thus violates the positive assertion. </p>\n<p>Another quality is that of making <strong>room for excellence</strong> in all of its forms. An innovative knowledge-based organization/community will always find a place for talent. If excellent or potential for excellence is turned away, then this is a sign of degeneracy. With some way to gain a sense of whether such individuals do in fact make their way into the community and are allowed to contribute, this is a sign of health.</p>\n<p>A final thing to note is that efficient organizations take a <strong>fractal structure</strong>. Since this community has at its core the use of category theory as a tool for extracting patterns from wherever they are and incorporating them into a larger theory, we should see this behavior in how we engage with the physical world as well, to include people. After all, mathematics is a mental tool used by our mental processes, and we are also those mental processes coupled together. </p>\n<p>In short, the organization as an automaton can allow for thinking about a minimal set of positive assertions from which desired behavior and monitoring of degeneracy can manifest. Two major ones are to take actions to foster trust density and to assimilate excellence in all of its forms. The efficient organization has a fractal structure, so let these mathematical tools be a guide on how to build, maintain, and navigate the world as a community.</p>\n</blockquote>\n<p>I really like this approach! It's simple, yet principled, and doesn't let out of sight something very important: Without common sense, any CoC, law or policy turns very rapidly into a perversion that does more harm than good. So we should indeed act to mantan trust and build a culture of applying common sense wherever possible.</p>",
        "id": 203448625,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594333035
    },
    {
        "content": "<p>Perhaps there can be a categorical characterization of \"evil\" that reflects the values. Just to utilize the expertise that the people here already have. Something like \"In the category of people and interactions, quotient objects are considered illegal\".</p>",
        "id": 203449678,
        "sender_full_name": "Esa Pulkkinen",
        "timestamp": 1594333644
    },
    {
        "content": "<p>The simplest definition of <em>evil</em> is really that it tends to be characterized by <strong>zero-sum</strong> behavior. So again, by simply requiring positive-sum behavior, you also get rid of many degenerate cases. This one has less obviously general utility than the others because sometimes things actually are zero-sum and one must act according to that. Even so, zero-sum behavior is a warning sign.</p>",
        "id": 203450015,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594333815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203443610\">said</a>:</p>\n<blockquote>\n<p>In such a situation I would naturally be obligated to include that information in my public release request. I don't think I would bother _submitting_ a technical talk. If _invited_ under those auspices I would make the request.</p>\n</blockquote>\n<p>Thanks for clarifying.</p>",
        "id": 203472397,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1594361336
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203425526\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203367863\">said</a>:</p>\n<blockquote>\n<p>About half of 200 messages I just scanned through appear to be people trying to logically rationalise a defence of an organisation that is complicit in ongoing war crimes</p>\n</blockquote>\n<p>I don't see that going on here.</p>\n</blockquote>\n<p>Exactly.</p>",
        "id": 203475580,
        "sender_full_name": "(=_=)",
        "timestamp": 1594365108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203365812\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE/near/203364735\">said</a>:</p>\n<blockquote>\n<p>not all discourse deserves to be had</p>\n</blockquote>\n<p>You're free to hold this view, but I'll still call it an \"anti-discourse\" view.</p>\n</blockquote>\n<p>Picking holes in and throwing sarcastic retorts at legitimate opinions until someone loses the will or emotional energy to argue back seems pretty anti-discourse to me, <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>. This is a platform for a whole community, not an arena where everyone is required to meet your personal standards of argumentative rigour in order for their opinion to be heard. Whom does a personal, and imo unfounded, attack like </p>\n<blockquote>\n<p>I appreciate that you've demonstrated that, like Grothendieck, you don't really care about the maths.</p>\n</blockquote>\n<p>benefit, exactly? When you have a point to make, by all means make it, but I'm tired of seeing the fallout of you apparently being argumentative for the sake of it.</p>",
        "id": 203487853,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594374249
    },
    {
        "content": "<p>I appreciate that these comments aren't the most timely, but I couldn't bare to see this happening <em>again</em> and not comment.</p>",
        "id": 203488011,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594374335
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203487853\">said</a>:</p>\n<blockquote>\n<p>Picking holes in and throwing sarcastic retorts at legitimate opinions until someone loses the will or emotional energy to argue back seems pretty anti-discourse to me</p>\n</blockquote>\n<p>And your so-called moderation isn't anti-discourse? </p>\n<p>I'm frankly quite sick of your heavy-handed interventions as well. Didn't <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> say to use a light touch? Why are YOU constantly blaming ME for tantrums that other people are throwing because THEY disagree with me?</p>\n<p>People disagree with each other, often vigorously, all the time on online forums. People have left conversations because they don't want to engage. It's THEIR choice.</p>\n<p>And if you wanted to police that, why did you not go after <span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> after his comments led to someone deactivating their account? Oliver <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203352472\">laughed about that</a>. I got a PM from that guy saying the discussion was \"unreadable\": it was. </p>\n<p>Why did you not go after Oliver for having literally caused a former member of the community to head for the exit? He and I literally discussed that on here yesterday. </p>\n<p>Isn't that a double standard on YOUR part? Because it sure as heck is looking like that to me right now.</p>",
        "id": 203492966,
        "sender_full_name": "(=_=)",
        "timestamp": 1594378054
    },
    {
        "content": "<p>Can I maybe suggest to calm down and working your differences through a private conversation?</p>",
        "id": 203494684,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594379666
    },
    {
        "content": "<p>I don't want to pick sides here, moreover I believe that an escalating conversation is not really beneficial for the community <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 203494726,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594379719
    },
    {
        "content": "<p>Related to this discussion, an article about a letter that urges to cut ties with police, which will be published by the AMS Notices: <a href=\"https://www.insidehighered.com/news/2020/06/24/mathematicians-urge-cutting-ties-police\">https://www.insidehighered.com/news/2020/06/24/mathematicians-urge-cutting-ties-police</a></p>",
        "id": 203497012,
        "sender_full_name": "Nina Otter",
        "timestamp": 1594381775
    },
    {
        "content": "<p>I signed this some time ago, and I think that you can still sign if you want to.</p>",
        "id": 203497123,
        "sender_full_name": "Nina Otter",
        "timestamp": 1594381858
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> I did not laugh about that, and this is another instance where, to me, it feels like you are misquoting me. I have noticed that others such as <span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span> have also felt that you misquoted them, and that you have felt misquoted by him. As far as I can tell, you are the only person who regularly gets into these sorts of misquotation conflicts with people.</p>\n<p>I want to put that here in the public record, because misleading comments can dammage peoples' reputations. I get that what I said felt exclusionary to you, and I've been thinking on my own time about what went wrong and how I can improve my conduct in the future. If you had reached out to me with receptive intentions (publicly or privately), you would already know that. </p>\n<p>I would also like to note that someone had already reached out to me early on in the conversation (when it was just me and <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> ). In response, I clarified what I had intended for the comment to mean privately (and this satisfied the concerned person). Then I attempted to delete my comment (which really amounts to minimizing it) so that the concerning comment could be left aside. I felt that if it could be concerning to people, it was appropriate to take it down.</p>\n<p>However <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>, you excavated the comment and quoted me, so I restored and tried to clarify the comment. I feel that this sort of baiting was unnecessary, and provocative. The deletion should have been an indication that I felt the comment was unnecessary.</p>\n<p>I regret that I wasn't able to de-escalate the conversation after that. I felt caught between publicly defending myself and wanting to empathize with you <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>. Perhaps I ended up failing at both by trying to split the difference. </p>\n<p>This is the last thing I will say publicly on the subject, except to defend myself from these sorts of comments. If you have an honest interest in helping this community become more welcoming, while still retaining its moral backbone, please reach out to me privately to discuss. I am more than happy collaboratively resolve this conflict if you are willing.</p>\n<p>And if anyone also felt concerned about my comments or <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span>,  <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>and my conversation, I would appreciate your private constructive feedback as well.</p>",
        "id": 203519908,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594394477
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/BAE.20and.20other.20exclusions/near/203492966\">said</a>:</p>\n<blockquote>\n<p>I'm frankly quite sick of your heavy-handed interventions as well. Didn't <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> say to use a light touch?</p>\n</blockquote>\n<p>Yes, but a light touch hasn't worked.   You keep becoming aggressive - your comments now are a great example.    </p>\n<p>The moderators will have to figure out what to do here.    So far we'd been able to avoid the need for serious moderation.</p>",
        "id": 203557382,
        "sender_full_name": "John Baez",
        "timestamp": 1594414891
    },
    {
        "content": "<p>Back to the original discussion, I have also expressed my personal opinion to some people, but here it is also publicly: I believe that any individual is of course free to be employed or be funded by some company or other organization (I have myself been indirectly funded by US military, and my personal thoughts about that are, I believe, not relevant to this discussion). But when it comes to community actions of endorsement, be it as receiving sponsorship for the ACT conference and exhibiting a logo or provide a public slot which serves, at least partly, as advertising, we need to be extra careful (and yes, personally I am happy with the decision to take down the logo and I would also suggest not allowing BAE in the industry showcase. On the other hand, a researcher of BAE could potentially submit a talk to the ACT conference!). Of course as discussed above, this has to do with each person's individual lines, and we <em>ought</em> to be more informed about the involvements of companies in suspicious matters (this is a criticism to myself as well, as I was not aware of the company or its military engagements before the issue arised) and then open our doubts to the community in a respectful discussion. Since there might be a wide range of opinions on such matters, I am also `happy' to leave the final say to the local committee - since a decision needs to be taken.</p>",
        "id": 203689841,
        "sender_full_name": "Christina Vasilakopoulou",
        "timestamp": 1594629306
    },
    {
        "content": "<p>I like this.  I hadn't thought about it much until now, but the phrase \"industry showcase\" suggests that the speakers are <em>exemplary</em> in some way, and that may set a higher bar than just a typical talk.</p>",
        "id": 203772665,
        "sender_full_name": "John Baez",
        "timestamp": 1594675071
    },
    {
        "content": "<p>I don’t think that’s what industry showcase implies. To me having been to engineering venues where they have booths from bae and raethon and Grumman it only showed that hey these are some people in industry that are interested in category theory. Logos and such should probably stay for the sponsors however</p>",
        "id": 203773326,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594675389
    },
    {
        "content": "<p>And I certainly do not think act should be sponsored by a defense contractor</p>",
        "id": 203773358,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594675406
    },
    {
        "content": "<p>My expectation is that the industry showcase would show how they used category theory to solve some problem of theirs that they traditionally used other methods for. Less of a technique showcase as some of the talks were, and more of a \"what was accomplished\". At least for the larger (more traditional) companies.</p>",
        "id": 203782143,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594681516
    },
    {
        "content": "<p>The industry showcase talks certainly didn't have time, in 8 minutes, to go into any technical details.  I think the goal was mainly to notify us of the existence of these companies...   and perhaps the opportunity to work with them?</p>",
        "id": 203783057,
        "sender_full_name": "John Baez",
        "timestamp": 1594682365
    },
    {
        "content": "<p>Yes, I got the sense of the \"opportunity to work with them\" aspect. That did come through the presentations. </p>\n<p>I'm looking through my notes now. I'd say they did do what I expected based on the notes I took. The talks went so fast, it was a blur (that's why I take notes!).  I do remember feeling the final talk given was a bit low level for what I was expecting. But it did show how they began the process of integrating category theory into the tooling pipeline.</p>",
        "id": 203783403,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594682678
    }
]