[
    {
        "content": "<p>I wrote a <a href=\"https://golem.ph.utexas.edu/category/2018/04/what_is_an_ntheory.html\">blog post</a> about <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-theories too!  (-:O</p>",
        "id": 420078840,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707235060
    },
    {
        "content": "<p>Yes, and you writing these very <em>whimsy-whomsy</em> blog posts is the reason why younger people have problems writing actual papers about these topics.  This practice should really be discouraged and shamed. It's not scientific, it feeds the folkore state of our community, it is de facto a form of scientific bullying... I have no clue where to start bashing it.</p>",
        "id": 420080665,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707235547
    },
    {
        "content": "<p>Please could you clarify what exactly \"This practice\" refers to <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> ? What is it about Mike's post that you're pointing at? Is it different in some way to other posts on the nCatCafe, or is that platform the target of your criticism? At any rate, accusations of \"scientific bullying\" are pretty serious and should be presented with more care.</p>",
        "id": 420082488,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707236048
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Overview.20of.20Syntax-Semantics.20Duality/near/420082488\">said</a>:</p>\n<blockquote>\n<p>Please could you clarify what exactly \"This practice\" refers to <span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> ? What is it about Mike's post that you're pointing at? Is it different in some way to other posts on the nCatCafe, or is that platform the target of your criticism? At any rate, accusations of \"scientific bullying\" are pretty serious and should be presented with more care.</p>\n</blockquote>\n<p>I said \"de facto\", by which in this context I mean that it is not intentional. This conversation also has a very long prequel, which Mike may or may not remember, where I think I explained what I am talking about.</p>\n<p><a href=\"#narrow/stream/274877-community.3A-our-work/topic/thoughts.20on.20sharing.20ideas/near/224322986\">https://categorytheory.zulipchat.com/#narrow/stream/274877-community.3A-our-work/topic/thoughts.20on.20sharing.20ideas/near/224322986</a></p>\n<p>Even more importantly in this case.</p>\n<p><a href=\"#narrow/stream/274877-community.3A-our-work/topic/thoughts.20on.20sharing.20ideas/near/224335713\">https://categorytheory.zulipchat.com/#narrow/stream/274877-community.3A-our-work/topic/thoughts.20on.20sharing.20ideas/near/224335713</a></p>",
        "id": 420087133,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707237287
    },
    {
        "content": "<p>The blog post Mike linked is (as is explicitly stated there) based on papers that Mike has coauthored and work in progress that he has already presented publicly. It's not outlandish flag-planting, he really is doing this work, and this is a less formal, more accessible exposition of it. What are the standards you would hold him to?</p>",
        "id": 420090393,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707238207
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Overview.20of.20Syntax-Semantics.20Duality/near/420090393\">said</a>:</p>\n<blockquote>\n<p>The blog post Mike linked is (as is explicitly stated there) based on papers that Mike has coauthored and work in progress that he has already presented publicly. It's not outlandish flag-planting, he really is doing this work, and this is a less formal, more accessible exposition of it. What are the standards you would hold him to?</p>\n</blockquote>\n<p>This is highly not true! He describes a very broad program (see the title of the post!) (and on which some people, including me, are working now), in which some of his papers do fit (actually quite loosely). Check more precisely the papers, and the content of the post. And indeed, when Mike says \"I wrote a blog post about it\" above, he is referring precisely to the broad program and not to the content of his papers.</p>\n<p>PS. Differently from Mike's use of this terminology, when <em>I</em> say \"working on now\", I mean that you can <em>already</em> find stuff on the arXiv <span aria-label=\"heart kiss\" class=\"emoji emoji-1f618\" role=\"img\" title=\"heart kiss\">:heart_kiss:</span> .</p>",
        "id": 420091090,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707238389
    },
    {
        "content": "<p>People present broad research programmes in various forms all the time (habilitation theses in France require a very open scope, for instance), and large areas of mathematical research are justified by the pursuit of such programmes. It is true that the larger such programmes sometimes get referenced by the names of mathematicians that articulated them. Is your concern that someone might end up describing the quest for formalizing n-theories the \"Shulman programme\" and that this will somehow eclipse the work you're doing? Do you want Mike to be citing more/other people in his blog posts to make them more representative? Do you want him to be presenting this programme more formally; would that actually help?</p>",
        "id": 420103854,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707242348
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Overview.20of.20Syntax-Semantics.20Duality/near/420103854\">said</a>:</p>\n<blockquote>\n<p>People present broad research programmes in various forms all the time (habilitation theses in France require a very open scope, for instance), and large areas of mathematical research are justified by the pursuit of such programmes. It is true that the larger such programmes sometimes get referenced by the names of mathematicians that articulated them. Is your concern that someone might end up describing the quest for formalizing n-theories the \"Shulman programme\" and that this will somehow eclipse the work you're doing? Do you want Mike to be citing more/other people in his blog posts to make them more representative? Do you want him to be presenting this programme more formally; would that actually help?</p>\n</blockquote>\n<p>All you say is true, and yet does not change the truth values of any of my criticisms, which one can find in the two linked answers. I think sometimes people forget that choices have trade-offs and the fact that what you claim is true does not make what I said suddenly false.</p>\n<p>It remains a fact that at the moment there is no general theory of 2-theories (!), and I find out of place the propaganda that Mike is doing advertising his post from ages ago. Making the program more explicit would only be worse, by the way.</p>\n<p>Anyhow, I think this is a broad discussion, and I won't develop it any further.</p>\n<p>PS an habilitation thesis is a quotable object of 200 pages, on which you invest years of work. Of course it deserves to be cited, and you deserve to be listed among the contributors. This is such a bad example. That blog post, instead, is super \"label dropping\" and \"superficial\".</p>\n<p>PPS <span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span> Notice how, from reading the post, <strong>even you</strong> thought that not only the general theory of n-theories already existed, but had even been developed in the papers Mike posts! This is <em>precisely</em> the risks we are talking about.</p>",
        "id": 420105365,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707242867
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Overview.20of.20Syntax-Semantics.20Duality/near/420103854\">said</a>:</p>\n<blockquote>\n<p>Is your concern that someone might end up describing the quest for formalizing n-theories the \"Shulman programme\" and that this will somehow eclipse the work you're doing? </p>\n</blockquote>\n<p>I am sorry but this question really shows that either you haven't read, or you don't remember, the links I have posted above.</p>",
        "id": 420105974,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707243088
    },
    {
        "content": "<p>I'm trying to be constructive here. I was not trying to undermine your criticism (or \"make it false\"), although I find the tone of it unnecessarily hostile towards Mike, I was trying to understand in precise terms what you are objecting to and what action might be taken to improve the situation.</p>",
        "id": 420106984,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707243440
    },
    {
        "content": "<p>I do not think there is any way to improve the situation. It's very important though to clarify that such theory does not exist (!) at the moment (which is what I am doing) and that it is at best in the process of being developed.</p>",
        "id": 420107160,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707243502
    },
    {
        "content": "<p>For what it's worth, this discussion is essentially an extension of the one you have linked to and Mike <a href=\"#narrow/stream/274877-community.3A-our-work/topic/thoughts.20on.20sharing.20ideas/near/224363449\">agreed with you</a> there, but that reinforces my feeling that the hostility was unwarranted, and you could have simply made your last clarification instead.</p>",
        "id": 420108695,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707244070
    },
    {
        "content": "<p>12 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions/topic/Overview.20of.20Syntax-Semantics.20Duality\">#learning: questions &gt; Overview of Syntax-Semantics Duality</a> by <span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span>.</p>",
        "id": 420109735,
        "sender_full_name": "Notification Bot",
        "timestamp": 1707244398
    },
    {
        "content": "<p>How is this any different from the situation in theoretical physics when string theorists and science journalists write hype articles about string theory and M-theory when there is no well-defined string theory or M-theory yet?</p>",
        "id": 420129999,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1707251378
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420080665\">said</a>:</p>\n<blockquote>\n<p>Yes, and you writing these very <em>whimsy-whomsy</em> blog posts is the reason why younger people have problems writing actual papers about these topics.  This practice should really be discouraged and shamed. It's not scientific, it feeds the folkore state of our community, it is de facto a form of scientific bullying... I have no clue where to start bashing it.</p>\n</blockquote>\n<p>Well, I think <em>you</em> should be shamed for writing such a rude message.</p>\n<p>What right do you have to prohibit people from sharing their ideas in form of a blog post?<br>\nAfter all, this doesn't prevent you from writing your own paper. If you want to make precise some things that remain informal in the blog post, why don't you communicate exactly that in the introduction of your paper? For instance:</p>\n<blockquote>\n<p>The present paper aims at developing a general theory of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-theories. Such a theory has already been sketched by Shulman <a href=\"https://golem.ph.utexas.edu/category/2018/04/what_is_an_ntheory.html\">[1]</a>. However, to the best of the author's knowledge precise definitions and proofs have not appeared in the literature.</p>\n</blockquote>\n<p>Now, if then somebody says your work isn't original (since it was already worked out in <a href=\"https://golem.ph.utexas.edu/category/2018/04/what_is_an_ntheory.html\">[1]</a>), <em>this behaviour</em> should be discouraged, but not the writing of the blog post itself.</p>",
        "id": 420131428,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1707251880
    },
    {
        "content": "<p>Anyway clearly this blog post situation is already much superior to the old situation where the \"folklore\" in question was an unrecorded talk 20 years ago or the dreaded \"personal communication\".</p>",
        "id": 420132649,
        "sender_full_name": "James Deikun",
        "timestamp": 1707252360
    },
    {
        "content": "<p>Whew, what a conversation to miss most of.  Ivan, I must say I find the tone of your messages here somewhat unfriendly.  I do recall the earlier conversation, which I found more collegial and constructive than this one.</p>",
        "id": 420134785,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253241
    },
    {
        "content": "<p>In general, I think there is a balance to be struck between, on one hand, contributing dynamically to a community of scientists, in a way that is possible today and wasn't a decade or two ago, and on the other hand, not \"laying claim\" to results one hasn't proven.  I happen to believe that part of that balance should involve everyone being more aware that work-in-progress doesn't always get completed, for many reasons, and that if some time passes and nothing appears, someone interested in the subject should just reach out and ask whether work is still ongoing and whether they can contribute to it or pick it up themselves.</p>",
        "id": 420134941,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253294
    },
    {
        "content": "<p>But it's also true that I have made mistakes in promising work that I never delivered (I was also reminded of that recently in the context of generalized multicategories), and the previous conversation contributed to my realizing the extent of those mistakes.  I am striving to do better, but even in published papers there is a balance, as giving <em>some</em> indication of the potential for future work and the general programme into which the present work fits is one of the best ways to explain its importance and relevance.</p>",
        "id": 420134965,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253301
    },
    {
        "content": "<p>Regarding the blog post in question (which was written a few years before the previous zulip conversation, for whatever that's worth), I believe it is fully explicit about what parts of the picture we <em>have</em> already done, and published, versus what parts were a merely informal description of the bigger picture we were imagining and working on at the time.  In this way it's different from my pages on 2-categorical logic, the subject of the previous discussion, which contain new material but were never formally published, and also from traditional \"folklore\" which attributes <em>results</em> to someone who never even made them publicly available.</p>",
        "id": 420134995,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253312
    },
    {
        "content": "<p>The reason I mentioned the blog post in the discussion that this branched off from was because I believe it gives a nice picture of what the world of n-theories <em>should</em> look like, which Jon Onstead was wondering about.  I stand corrected that I should have clarified in my Zulip post that our current published work only makes this precise for certain classes of 2-theories, and that others are working on improving the situation, but I don't think it was out of line to post the link, or to write the blog post in the first place.</p>",
        "id": 420135083,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253328
    },
    {
        "content": "<p>However, one thing that could be done is to <em>add</em> information to the blog post about the present state of the art (as of now, of course, with a date).  What I would think of adding is some links to the general modal dependent type theories due to Gratzer and his coauthors that have since appeared, and mentioning that have largely replaced the work we had in mind at the time on the \"3-theory of dependent type 2-theories\", although strictly speaking they are less general than what we originally intended since they don't include the substructural case.  <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span>, are there other references you think I should also add?</p>",
        "id": 420135570,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707253528
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420134785\">said</a>:</p>\n<blockquote>\n<p>Whew, what a conversation to miss most of.  Ivan, I must say I find the tone of your messages here somewhat unfriendly.  I do recall the earlier conversation, which I found more collegial and constructive than this one.</p>\n</blockquote>\n<p>It is indeed true that my message was abrasive in tone, and I should apologize for that. It has happened a number of times that people have told me that 2-theories and 2-topoi have already been largely developed by you (in the sense of done), and I think that I am now easily triggered by anything that could sound like a propagation of this false fact and false attribution. It is not a coincidence that I was less constructive than in my previous message, precisely because this happened again, despite our previous conversation. This said, I over-snapped.</p>\n<p>On this note, let me stress the fact that even Morgan, who is a categorical logician, came to this conclusion with a, possibly superficial, reading of your post.</p>",
        "id": 420137048,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707254121
    },
    {
        "content": "<p>I also agree to a reasonable extent with each one of your messages.</p>",
        "id": 420137226,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707254190
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420135570\">said</a>:</p>\n<blockquote>\n<p>However, one thing that could be done is to <em>add</em> information to the blog post about the present state of the art (as of now, of course, with a date).  What I would think of adding is some links to the general modal dependent type theories due to Gratzer and his coauthors that have since appeared, and mentioning that have largely replaced the work we had in mind at the time on the \"3-theory of dependent type 2-theories\", although strictly speaking they are less general than what we originally intended since they don't include the substructural case.  <span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span>, are there other references you think I should also add?</p>\n</blockquote>\n<p>If you are ok with waiting a couple of days, I would be happy to send you an email about this, and maybe this could be a good time to have a zoom call.</p>",
        "id": 420138003,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707254524
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420137048\">said</a>:</p>\n<blockquote>\n<p>On this note, let me stress the fact that even Morgan, who is a categorical logician, came to this conclusion with a, possibly superficial, reading of your post.</p>\n</blockquote>\n<p>That's not how I read Morgan's message.  Perhaps Morgan could clarify?</p>",
        "id": 420141405,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707256022
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420138003\">said</a>:</p>\n<blockquote>\n<p>I would be happy to send you an email about this, and maybe this could be a good time to have a zoom call.</p>\n</blockquote>\n<p>Sure, ping me whenever you like.</p>",
        "id": 420141502,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707256064
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420141405\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420137048\">said</a>:</p>\n<blockquote>\n<p>On this note, let me stress the fact that even Morgan, who is a categorical logician, came to this conclusion with a, possibly superficial, reading of your post.</p>\n</blockquote>\n<p>That's not how I read Morgan's message.  Perhaps Morgan could clarify?</p>\n</blockquote>\n<p>I did indeed interpret the post as saying 'here is a sketch of what n-theories should be and here [work with Dan Licata and others] is where we have started doing it', but as Ivan pointed out, whatever contributions to formalizing n-theories exist in those papers are less transparent than the blog post led me to believe. I haven't read any of these sources in enough detail to hold strongly to either my initial reading or this second take, though.</p>",
        "id": 420199920,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707294000
    },
    {
        "content": "<p>In my view, \"here is a sketch of what n-theories should be and here is where we have started doing it\" is the correct interpretation.  Maybe I'm confused about what this conversation is about.  Is it just that the <em>connection</em> between the expected-but-unproven general picture of n-theories and what's achieved in my papers with Dan and Mitchell isn't <em>explained</em> clearly enough in the blog post or in the papers themselves?</p>",
        "id": 420288334,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707322369
    },
    {
        "content": "<p>Yes, that is the issue. The language of the blog post is not reflected in the papers and vice versa. You do mention modal logics at the end of the blog post, but you say \"modal logics are particular 2-theories, to which our framework applies\", which gives the impression that what you did in the work with Dan and Mitchell is actually less general than the bullet points in the blog post say, but again this is not completely clear.<br>\nThe difference in language means that the blog post is really a re-interpretation of those papers. That potentially leaves unproven a lot more of the formal details involved in the blog post than the blog post itself admits. Again I say potentially because determining how much of the blog post's content is firmly established would require a close reading of your papers through the lens of n-theories, and I don't have time for that right now.</p>",
        "id": 420299093,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707325095
    },
    {
        "content": "<p>This whole discussion could have been avoided if Ivan just wrote a comment under Mike's blog post saying \"Hey, I think your blog post might give some people a wrong impression as to which parts of the general picture you sketched are fully developed in your papers. Can you please edit the blog post to make it more clear? Here are some suggestions: (...)\".<br>\nI'm pretty sure Mike would have been happy to do so. It's really no big deal!<br>\nI think it's quite absurd to make such a huge deal out of it and accuse Mike of \"not being scientific\", \"feeding the folklore state\", and \"scientific bullying\". Also, although it is certainly desirable that blog posts are written in a way that avoids misinterpretations, Mike can't be made responsible for anyone who misinterprets his blog post as \"the theory of 2-theories has been fully developed\". Ivan, next time stay calm, tell them that this is not the case, and write a nice comment.</p>",
        "id": 420310577,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1707328784
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"408864\">Leopold Schlicht</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420310577\">said</a>:</p>\n<blockquote>\n<p>This whole discussion could have been avoided if Ivan just wrote a comment under Mike's blog post saying \"Hey, I think your blog post might give some people a wrong impression as to which parts of the general picture you sketched are fully developed in your papers. Can you please edit the blog post to make it more clear? Here are some suggestions: (...)\".<br>\nI'm pretty sure Mike would have been happy to do so. It's really no big deal!</p>\n</blockquote>\n<p>I agree that this is what I should have done.</p>",
        "id": 420311175,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707328976
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"408864\">Leopold Schlicht</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420310577\">said</a>:</p>\n<blockquote>\n<p>I think it's quite absurd to make such a huge deal out of it and accuse Mike of \"not being scientific\", \"feeding the folklore state\", and \"scientific bullying\". Also, although it is certainly desirable that blog posts are written in a way that avoids misinterpretations, Mike can't be made responsible for anyone who misinterprets his blog post as \"the theory of 2-theories has been fully developed\". Ivan, next time stay calm, tell them that this is not the case, and write a nice comment.</p>\n</blockquote>\n<p>I think this part of the message gives the wrong impression about what happened. I do stand for the fact, and I have argued, that blog posting can be a form of scientific bullying, and it can serve to flag-plant your contribution to something in ways that I find ethically debatable (btw, Mike agreed with this statement). I do not think it is \"rude\" to claim this. It is just what I think happens all the time with a specific form of disseminating ideas in their early stages.</p>\n<p>The fact that this behavior is a version of the folklore problem on steroids, or at least on a very similar level, seems completely evident to me. And once we agree on this fact, it shocks me that this community does not see any problem with it. Notice that, exactly like the folklore problem, this is often done with good intentions, and yet...</p>\n<p>Can we make a concrete example of this situation (Notice, this is just an example, so many variants of this exists and happen)? Say that (A) and (B) are working simultaneously on the same thing, and they happened to start at the same moment, with the same idea. Say also that this is a very big project, so it takes months, or years, to develop the project. Now, if (A) just drops the general plan at the beginning, what is (B) supposed to do? Sure, tell me that they can contact (A) and work together, but this (1) puts (A) in a position of power over (B), and (2) what if (A) is a big name?! This can just crush the whole career of a young PhD student. Also notice how a big name will always be in a stronger position to do this, because they have a platform, and they have a reputation, so bold claims do not need to be baked.  Versions of what I just described actually happens relatively often, and you do not hear much about the people to whom it happens because their career is -- tautologically -- over now.</p>\n<p>Concerning the last sentence, on which I agree after all, I will stress that this conversation had a prequel.</p>",
        "id": 420312078,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707329282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>, thanks for that explanation.  My intent was that the bullet points mentioning the papers express fully precisely how the results of those papers relate to the general picture described in the blog post:</p>\n<blockquote>\n<p>The first paper by Dan and myself dealt with the 3-theory of (totally unstructured) 2-categories. Syntactically, this corresponds to “unary type (2-)theories” with judgments such as x:A⊢b:B with exactly one type to both the left and the right of the turnstile.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>The second paper, with Dan and Mitchell, dealt with the 3-theory of cartesian monoidal 2-categories (actually, for technical reasons we used cartesian 2-multicategories). Syntactically, this corresponds to “simple type (2-)theories” with judgments such as x:A,y:B,z:C⊢d:D with a finite list of types to the left but exactly one type to the right, and no dependent types.</p>\n</blockquote>\n<p>While admittedly quite concise, it still seems to me that these phrases express correctly and precisely exactly what the published papers achieve, in terms of the general informal terminology introduced in the blog post.  The phrase \"dealt with\" could in general be vague, but the paragraph two before that one describes pretty precisely exactly what those papers do for the 3-theories they consider:</p>\n<blockquote>\n<p>Given a particular 3-theory, we aim to describe a particular deductive system for syntactic 2-theories in that 3-theory, and associate to any such syntactic 2-theory D a specific deductive system for syntactic 1-theories in D, such that the latter (1) indeed has the correct semantics, i.e. it presents the correct semantic 1-theories, and (2) has the good meta-theoretic properties that type theorists want, such as cut-elimination, normalization, and canonicity. For a particular syntactic 1-theory, the deductive system that we get is not usually identical to any existing deductive system for that 1-theory, but it is almost always related to it by a fairly direct translation (in general, rules of the existing system tend to translate into the successive applications of two or more “more basic” rules in our system).</p>\n</blockquote>\n<p>In the phrase \"modal logics are particular 2-theories, to which our framework applies\", \"our framework\" was intended to refer to the <em>precise</em> frameworks developed in the papers.  Thus, what it's saying is that what's done in the papers is <em>more</em> general than modal logic.  I can see that that might be a bit ambiguous, though.</p>",
        "id": 420330178,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707335203
    },
    {
        "content": "<p>In general, I think it is better to avoid overanalyzing blog posts.  A blog post is not supposed to be a polished thing where you take a long time obsessing over getting the wording exactly right; it's part of the messy process of doing work that the Internet allows us to share with each other more dynamically and then (for better or for worse) records for eternity.</p>",
        "id": 420330465,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707335340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420312078\">said</a>:</p>\n<blockquote>\n<p>Say that (A) and (B) are working simultaneously on the same thing, and they happened to start at the same moment, with the same idea. Say also that this is a very big project, so it takes months, or years, to develop the project. Now, if (A) just drops the general plan at the beginning, what is (B) supposed to do? Sure, tell me that they can contact (A) and work together, but this (1) puts (A) in a position of power over (B), and (2) what if (A) is a big name?! This can just crush the whole career of a young PhD student.</p>\n</blockquote>\n<p>This is absolutely a bad thing that can happen.  But other bad things can also happen.  For instance, suppose (A) <em>doesn't</em> announce the plan publicly at the beginning.  But if (A) is a big name and (B) is a young PhD student, (A) is likely to be able to work out the details quicker than (B).  Then (A)'s paper appears on the arXiv just as (B) is getting close to finishing their PhD, and (B) finds out that their entire thesis is scooped.  Whereas, if (A) lets people know what they're working on, then (B) has a chance to find out earlier, with more of a chance to either work together with (A) or find a different thesis problem.</p>\n<p>(B) should also, of course, have the help of an advisor, which makes possible a third option: (B)'s advisor contacts (A) privately to discuss the situation, and (A) either decides to stop work on the problem and let (B) take it over (a more senior mathematician is likely to have many other projects to pick up instead), or they work out a division of the subject so that (A) and (B) can do different but complementary things without stepping on each other's toes too much.  In fact this has happened all the time for years: an advisor helping a student choose a thesis topic tries to be aware of what other people in the field are working on, and may even ask them privately \"are you working on X?\", to try to avoid giving their student a problem that will be scooped.  So in this sense, more transparency about work-in-progress also has advantages.</p>",
        "id": 420333186,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707336370
    },
    {
        "content": "<p>I don't think there is a one-size-fits-all solution to problems like this.  The best we can do is raise awareness about all the bad things that <em>can</em> happen and do our best to avoid causing or exacerbating them.  So in particular, we should be <em>careful</em> when publicly sharing about work in progress, but I don't think we can or should anathematize it completely.</p>",
        "id": 420333587,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707336515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420333587\">said</a>:</p>\n<blockquote>\n<p>I don't think there is a one-size-fits-all solution to problems like this.  The best we can do is raise awareness about all the bad things that <em>can</em> happen and do our best to avoid causing or exacerbating them.  So in particular, we should be <em>careful</em> when publicly sharing about work in progress, but I don't think we can or should anathematize it completely.</p>\n</blockquote>\n<p>I agree with this statement, yet I cannot accept this non-commital phrasing, considering the number of downvotes that I am taking, and the number of stars and upvotes that you are getting in this conversation.</p>\n<p>(1) I was the one raising awareness.<br>\n(2) You were the one <em>largely</em> uncareful.</p>",
        "id": 420346448,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707341566
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420333186\">said</a>:</p>\n<blockquote>\n<p>This is absolutely a bad thing that can happen.  But other bad things can also happen.  For instance, suppose (A) <em>doesn't</em> announce the plan publicly at the beginning.  But if (A) is a big name and (B) is a young PhD student, (A) is likely to be able to work out the details quicker than (B).  Then (A)'s paper appears on the arXiv just as (B) is getting close to finishing their PhD, and (B) finds out that their entire thesis is scooped.  Whereas, if (A) lets people know what they're working on, then (B) has a chance to find out earlier, with more of a chance to either work together with (A) or find a different thesis problem.</p>\n</blockquote>\n<p>In this scenario (A) has at least done the job! I am sorry but this makes a whole difference to me. I am not saying it's not unfortunate, but at least it's not unfair.</p>\n<p>Besides this, as I have mentioned, my example has a core/essence that admits several different incarnations where \"a supervisor\" figure would not exist, I do not think that it makes sense to continue arguing the specifics of the example.</p>",
        "id": 420347454,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707341951
    },
    {
        "content": "<p>Perhaps the up- and down-votes indicate that not everyone shares your view of what's fair and what's careful.  Although at that, there are really only a very few people participating in this conversation anyway.  Probably there's not much to be gained by continuing it further at all.</p>",
        "id": 420352618,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707344196
    },
    {
        "content": "<p>I would like to try and give a different kind of food for thought. </p>\n<p>Although I agree with Ivan's point (at least as long as his points are stated politely, or the rage is laser-focused on something I'm also mad at <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> ) I have a rather orthogonal attitude towards expositions of half-baked ideas of mine. I talk a lot about what I am in the process of doing, but it's never a form of gatekeeping meant to prevent other people from working on something that is mine (in Italian we say that \"I pissed on this pole\", perhaps more colorful than \"flag planting\"...); quite the opposite, I am <em>damn scared</em> to be doing something completely trivial, well-known, that other people can probably solve in a one-liner. Hence my desire to bench-test my ideas against the hive mind of other mathematicians.</p>\n<p>Done in this way, I don't think there's something wrong about the practice and the attitude of disseminating ideas that we have; more than an active hindrance to others' careers, it's a testament to our incurable imposter syndrome. </p>\n<p>Done in this way, I'd write a blog post a week, if only I had the time -especially because as the community of (pure and applied) category theory grows superlinearly bigger and bigger, I have more and more project that I open, enthusiastically work on for a while, and then never see the light. </p>\n<p>It's how things go, on one side; I'd happily share what I know, big or small draft, and let's start from there. I would feel dishonest turning these ideas (most of them are just a title and an abstract -and good luck to me remembering what they were meant to hint at) into stuff that other people can't touch, because it's mine. But this is just me, how my moral compass is tuned, and I think one aspect of the situation Ivan was raising awareness on is that </p>\n<blockquote>\n<p>we [=the community] have no effective ways to prevent Prof. John Doe, emeritus at Foobar University, who worked 45 years on widget theory, from maliciously scheming to force the whole community of widget theorists to start calling \"Doe's general theory of ultrawidgets\" a 15 lines series of remarks -then found to be true, and extended, by Tauno Tavallinen, a 25 years old Ph.D. student in Rovaniemi- left in the widget theory mailing list.</p>\n</blockquote>\n<p>Life's cruel cogs force then Tauno to leave academia, while prof. Doe's brilliant insight will always be remarked, books will be written about \"Doe's theory\" and \"Doe's ultrawidget trick, later refined by Tavallinen\".</p>\n<p>This is <em>not</em> what Mike did, nor I have <em>even just once</em> seen this particular dynamics unravel in my whole career as student, Ph.D, postdoc, until now. But if we want to keep the conversation open, in a constructive way, trying to address the elephant in the room, I'd say let's try to do this: how do we activate ways to sanction the behaviour described above, were a John Doe appear in the background?</p>",
        "id": 420355847,
        "sender_full_name": "fosco",
        "timestamp": 1707345825
    },
    {
        "content": "<p>Note that this is a huge gray area with blurred contours. Certainly Doe is responsible for <em>something</em>. Certainly the majority of merit should go to Tavallinen. Settling for \"Doe-Tavallinen's theory of ultrawidgets\" credits both, but after 5 years and Tavallinen's series of failed attempts to get even a temporary academic position... what currency can academic recognition ever be?</p>",
        "id": 420356099,
        "sender_full_name": "fosco",
        "timestamp": 1707345947
    },
    {
        "content": "<p>Now two more foods for thought.</p>\n<ol>\n<li>I owe the best part of my (very limited) ability to think big to the fact that when I was a very young student, incapable to really understand even part of the technicalities, I was avidly reading the ncafe and nforum discussions. I think the tool in itself is very precious and a way to show what real mathematical practice is like (how was life when the other side of the globe wasn't reachable in a fraction of a second? I can't even remember). The pros and cons are inextricably linked to the age we live: ultraconnected, 24h online, strangulated by the publish or perish, riddled with occupational hazards (the aforementioned imposter syndrome)...</li>\n</ol>",
        "id": 420357067,
        "sender_full_name": "fosco",
        "timestamp": 1707346480
    },
    {
        "content": "<ol start=\"2\">\n<li>Precisely because I was reading the ncafé and nforum so much, I had a completely skewed perception of the state of the art. When you're a young student, it really seems that few brilliant minds did all the work, and now all that can be done is gloss the Masters. After all, all category theory is a corollary of yoneda lemma, right? I am slowly and painfully unlearning this Pavlovian reflex on the quality and novelty of my work; older people should <em>not</em> underestimate how the profoundness of their speculations is scary (literally scary) for younglings: if Mike Shulman had all this remarkable ideas, <em>what's there to do for me</em>? It really seems all theory is written down, somewhere, and having a good idea, and struggling to make it precise and elegant, is impossible. Everything is moving too fast. I will never manage to find something that is worth publishing, let alone earn me a doctorate...</li>\n</ol>\n<p>I know for a fact that the sense of gnawing inadequacy that can stem from this thought can become unbearable. Intrusive thoughts to question one's own abilities <em>eat many of us alive</em>. It's easy to imagine how unprivileged people, forced to study in isolated places, already struggling with insecurity for different reasons, might be put off by this.</p>\n<p>And yet, we adults know that the collection of what's-there-to-do is a proper class! Here I think the problem is that it is difficult for a young student to understand the unwritten rules of academic progress, how new mathematics is developed confusedly, and yet strives for timeless clarity, how the attribution of results is -to say the least- often a delicate matter... it's easy to believe that if a theorem is scribbled on a blog post <em>it's there, done</em> and same for a theory sketched in its main parts, but not fully developed. <br>\nMathematical dissemination focuses very little on the grunt work and the tedious parts of our work, on who just elegantly present results that are already known (or even on the people who actually do the hard dirty work of endless checking that something is true/false); it favors the description of how enormous overarching theories are built out of thin air, the adventurous story of the misunderstood genius who creates multiversal, anabelian widgets.</p>",
        "id": 420358442,
        "sender_full_name": "fosco",
        "timestamp": 1707347250
    },
    {
        "content": "<p>It is an undeniable fact, proven by how history went, that category theory suffers from this problem way more than other parts of mathematics. See <a href=\"https://images.math.cnrs.fr/Esquisse-d-un-portrait-de-Jean-Benabou-categoricien\">here</a>, if you know French, and in particular this paragraph:</p>\n<blockquote>\n<p>Amener à l’état de mathématiques achevées ne serait-ce que deux ou trois des développements prévus dans le plan de bataille, aurait demandé beaucoup de temps. Mais surtout, là est le cœur du problème, aurait arrêté, une fois conduit jusqu’au bout, le mouvement de recherche, d’avancée, de défrichage du territoire catégorique. C’est cet arrêt sur un état de la recherche, en lui donnant une forme qui sera rendue publique et signée de son nom qui représente le nœud gordien que Jean ne parvient presque jamais à trancher. Et il se renoue sans cesse après chaque coup d‘épée : un nœud gordien en forme d’hydre de Lerne [7], en somme. Gertrude Stein a dit un jour :</p>\n<p>If it can be done, why do it ? [8]</p>\n<p>Si l’état d’une réflexion sur un objet catégorique, de préférence neuf, a été jugé tel qu’il est possible de lui donner une forme écrite publiée, une insatisfaction en résulte aussitôt. Car il est évident, aux yeux de Jean, qu’on peut aller beaucoup plus loin, qu’on peut faire beaucoup mieux. Entre l’instant de l’écriture et celui, parfois éloigné, de la publication, il serait allé beaucoup plus loin, il aurait fait beaucoup mieux. Syndrome de la perfectibilité infinie. Arrêter en publiant, c’est ‘déperfectionner’.</p>\n</blockquote>\n<p>&lt;&lt;If a reflection on a categorical object, preferably new, has been judged such that it is possible to give it a published written form, some dissatisfaction immediately ensues. Because it is obvious, in Jean's eyes, that we can go much further, that we can do much better. Between the moment of writing and the sometimes distant moment of publication, he would have gone much further, he would have done much better. A \"Syndrome of endless perfectibility\": to stop something by publishing it, is to make it less perfect.&gt;&gt;</p>",
        "id": 420359693,
        "sender_full_name": "fosco",
        "timestamp": 1707347990
    },
    {
        "content": "<blockquote>\n<p>I talk a lot about what I am in the process of doing, but it's never a form of gatekeeping meant to prevent other people from working on something that is mine</p>\n</blockquote>\n<p>Just to clarify, in case it is necessary, nothing that I've ever said publicly was <em>meant</em> as gatekeeping, nor did I think Ivan claimed that it was, only that it can have that unintended <em>effect</em>.</p>",
        "id": 420364725,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707350849
    },
    {
        "content": "<p>I definitely agree that the problem of students not understanding how mathematics is developed is a big one, and I see your point that n-style discussions can exacerbate it.  Unfortunately, it's a lot more difficult to present the nitty-gritty reality in a blog post.</p>",
        "id": 420365375,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707351205
    },
    {
        "content": "<p>As someone learning category theory who is not a mathematician, I wanted to share my perspective and how I've found this discussion very enlightening, as I have learned a lot about how math is done. While I spent most of my time on \"Category Theory in Context\" and \"Working Mathematician\" when first learning category theory, I admit most of my recent learning has been on sources like the nlab and n-cat cafe, as well as related blog sites. After all, it's a large jump in density and complexity of language and ideas from textbooks to research papers, and so posts like these make the material more accessible. Still, I always just assumed that any post on these sites was entirely backed by some paper somewhere, and so I guess I admit that I had taken what I read on these site at face value. Even if this assumption is not always necessarily true, I still find the blogs useful, I will just make sure to exercise the necessary caution!</p>",
        "id": 420369703,
        "sender_full_name": "John Onstead",
        "timestamp": 1707354114
    },
    {
        "content": "<p>I hope that this discussion has not conveyed the impression that n-Cafe posts present conjectures as facts.  As far as I know, all of my blog posts, and all of the others that I've read, are as careful as any mathematician ever was about distinguishing between what is known and what is unknown.  (And I would be happy to have counterexamples pointed out so that I can fix them!)  My understanding is that the discussion is just about the amount of time spent in blog posts <em>talking about</em> conjectures and things that one hopes to prove in the future, while still of course being clear that they are still conjectures and hopes.</p>",
        "id": 420371603,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707355445
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420364725\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>I talk a lot about what I am in the process of doing, but it's never a form of gatekeeping meant to prevent other people from working on something that is mine</p>\n</blockquote>\n<p>Just to clarify, in case it is necessary, nothing that I've ever said publicly was <em>meant</em> as gatekeeping, nor did I think Ivan claimed that it was, only that it can have that unintended <em>effect</em>.</p>\n</blockquote>\n<p>Oh, of course, absolutely.</p>",
        "id": 420406888,
        "sender_full_name": "fosco",
        "timestamp": 1707380391
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"673117\">John Onstead</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420369703\">said</a>:</p>\n<blockquote>\n<p>As someone learning category theory who is not a mathematician, I wanted to share my perspective and how I've found this discussion very enlightening, as I have learned a lot about how math is done. While I spent most of my time on \"Category Theory in Context\" and \"Working Mathematician\" when first learning category theory, I admit most of my recent learning has been on sources like the nlab and n-cat cafe, as well as related blog sites. After all, it's a large jump in density and complexity of language and ideas from textbooks to research papers, and so posts like these make the material more accessible. Still, I always just assumed that any post on these sites was entirely backed by some paper somewhere, and so I guess I admit that I had taken what I read on these site at face value. Even if this assumption is not always necessarily true, I still find the blogs useful, I will just make sure to exercise the necessary caution!</p>\n</blockquote>\n<p>That's exactly the point I was trying to make: it's a lot more nuanced than that, and it has been a surprise for me to discover it.</p>",
        "id": 420407180,
        "sender_full_name": "fosco",
        "timestamp": 1707380511
    },
    {
        "content": "<p>Just as a data point: I got pretty much from the first that some blog posts were purely expository and others more speculative.  (I would never have realized that anybody <em>didn't</em> get this right away if it weren't for the discussion here.)</p>",
        "id": 420430428,
        "sender_full_name": "James Deikun",
        "timestamp": 1707389148
    },
    {
        "content": "<p>Certainly in the early days of the n-Café (when Urs was active there, for instance), say pre-2010-ish, nearly all the posts were work in progress, fresh research that continued in the comments. The reason the nLab was started was because so much material was being created on the fly that there was a risk it would get misplaced and forgotten (and hard to find if not organised and hyperlinked and referenced) as things moved so fast. Urs would post links to drafts of sketchy paper ideas, for instance, that were clearly unfinished, sometimes only a few pages long. There was no worry of being scooped, anyone could pitch in and contribute and there were sketchy notes being made public with peoples names attached left, right and centre (since the state of displaying maths on webpages back then was much less ubiquitous and developed, that was pretty much the way it had to be done). Hence appeals like this: <a href=\"https://golem.ph.utexas.edu/category/2009/07/nlab_how_to_get_started.html\">https://golem.ph.utexas.edu/category/2009/07/nlab_how_to_get_started.html</a></p>\n<p>Only now that people who were not probably even born when the n-Café started are reading it, does it look like a stately establishment, there to advertise completed papers, and host things like the Kan Extension seminar guest posts.</p>",
        "id": 420433254,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1707390182
    },
    {
        "content": "<p>In August this year, the n-Category Café will be legally an adult, celebrating its 18th birthday. Gosh, I remember when it started, and me a fresh-faced naive PhD student on the other side of the world, that blog my only access to anyone who did category theory.</p>",
        "id": 420433540,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1707390279
    },
    {
        "content": "<p>My presence in the academic world was pretty much announced in an article by <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> about the n-Café: <a href=\"https://golem.ph.utexas.edu/category/2009/09/what_do_mathematicians_need_to_1.html\">https://golem.ph.utexas.edu/category/2009/09/what_do_mathematicians_need_to_1.html</a>, mentioning precisely this last fact.</p>",
        "id": 420434094,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1707390464
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420433254\">said</a>:</p>\n<blockquote>\n<p>There was no worry of being scooped, anyone could pitch in and contribute and there were sketchy notes being made public </p>\n</blockquote>\n<p>I think this is a good point of reflection. As I said I have never seen a \"scooping\" happen in reality, besides unintentional (X didn't know that Y was trying to write on the same thing). And that's also pretty rare, because we all know each other, and first thing I'd do if I had an idea/problem in topos theory is, I'd ask a categorical logician/topos theorist. </p>\n<p>But. <em>Does scooping happen?</em> Has it ever happened to anyone of us?</p>",
        "id": 420441125,
        "sender_full_name": "fosco",
        "timestamp": 1707393356
    },
    {
        "content": "<p>I think it's useful to speak up and demystify ideas like this (that I believe are also propelled by bad popularization of mathematics): god forbid I speak about an unfinished project or someone will steal my idea! -While we all know things go quite the opposite: we're already too busy with <em>our</em> problems, how can someone possibly think I have time or headspace to solve <em>theirs</em>?!</p>",
        "id": 420442004,
        "sender_full_name": "fosco",
        "timestamp": 1707393696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420441125\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420433254\">said</a>:</p>\n<blockquote>\n<p>There was no worry of being scooped, anyone could pitch in and contribute and there were sketchy notes being made public </p>\n</blockquote>\n<p>I think this is a good point of reflection. As I said I have never seen a \"scooping\" happen in reality, besides unintentional (X didn't know that Y was trying to write on the same thing). And that's also pretty rare, because we all know each other, and first thing I'd do if I had an idea/problem in topos theory is, I'd ask a categorical logician/topos theorist. </p>\n<p>But. <em>Does scooping happen?</em> Has it ever happened to anyone of us?</p>\n</blockquote>\n<p>I think the notion of scooping is a very delicate one, let me give an operative definition of it. </p>\n<p>I say that (A) was scooped when they provided an insight, which the community will have eventually absorbed, and yet they get no credit for it, despite their will to be associated with that result. </p>\n<p>This is a weaker form than the one we hear about in the song Lobachevsky by Tom Lehrer, but I think it's a very reasonable definition of scooping, in the sense that it leads to the very same conclusion.</p>\n<p>An important phenomenon that this form of scooping allows for and that stronger forms of scooping do not allow for is what I would call \"soft scooping\" or \"cultural scooping\", or \"osmotic scooping\". Notice that this form of scooping may not have the feature of having a one-person-culprit, if not identifiable with classes of individuals or, even more vaguely, with social phenomena.  <em>The locale of culprits may have no points.</em></p>\n<p>I am now ready to answer your question. <em>Yes</em>, scooping happens, and you have been a victim of it.  I would not publicly disclose the example, as your collaborator may prefer not to.</p>",
        "id": 420447097,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1707395700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Blog.20Posts.20and.20Attribution/near/420441125\">said</a>:</p>\n<blockquote>\n<p><em>Does scooping happen?</em> Has it ever happened to anyone of us?</p>\n</blockquote>\n<p>I've seen it happen to someone I did my my undergrad with, in dynamical systems rather than CT. He ended up having to turn his work into a jointly authored paper with someone that he did not at all enjoy working with.</p>",
        "id": 420516966,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1707416658
    },
    {
        "content": "<p>I have been told at least once about a rumor or suspicion of scooping in a particular instance, but I don't think I have first-hand knowledge of any case.  I do suspect that anyone who does will probably be reluctant to make public accusations.</p>",
        "id": 420518258,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1707417099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"673117\">@John Onstead</span> wrote:</p>\n<blockquote>\n<p>Still, I always just assumed that any post on these sites was entirely backed by some paper somewhere, </p>\n</blockquote>\n<p>Don't do that, especially for the n-Category Cafe!   You have to pay careful attention to what people actually write.  For example, in <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>'s blog post he write:</p>\n<blockquote>\n<p>What kind of 2-categorical structure will semantic 2-theories have? Well, that depends on the 3-theory in which they live. (-: (-: (-:</p>\n</blockquote>\n<p>It's evident to me from this that he's exploring ideas that haven't been worked out. </p>\n<ul>\n<li>\n<p>A key indicator is the future tense in \"will\".   If he'd said \"do\", that would me incline more to think he's explaining some known stuff.  The \"will\" strongly hints that there's work left to do.   </p>\n</li>\n<li>\n<p>The smileys also indicate that we're in a space of exploration: we see that to understand 2-theories well enough to really be completeyl sure what the 2-category of \"semantic 2-theories\" is, it would help a lot to understand 3-theories - which could be an even harder job.      This \"infinite ascent problem\", where to understand an n-thing it helps to understand (n+1)-things, is typical of n-category theory.</p>\n</li>\n</ul>",
        "id": 420529846,
        "sender_full_name": "John Baez",
        "timestamp": 1707421547
    },
    {
        "content": "<p>The next sentence is another indication that Mike is tentatively exploring ideas:</p>\n<ul>\n<li>The simplest thing to do would be to categorify our running example.</li>\n</ul>\n<p>The subjective \"would\" is a hint here.</p>",
        "id": 420530125,
        "sender_full_name": "John Baez",
        "timestamp": 1707421670
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"673117\">@John Onstead</span>, I'm just saying that to read blog articles and the nLab correctly requires new skills beyond those you practice when reading textbooks and papers, which <em>usually</em> - though not always!!! - avoid material that's not fully worked out.</p>",
        "id": 420530375,
        "sender_full_name": "John Baez",
        "timestamp": 1707421773
    },
    {
        "content": "<p>Urs Schreiber and David Corfield and I started the n-Category Cafe in 2006 largely to talk to each other and explore the huge <em>terra incognita</em> of n-categories, not to explain known stuff.   It's changed a lot since then - but it retains a lot of this exploratory quality, and I hope it always does.</p>",
        "id": 420530945,
        "sender_full_name": "John Baez",
        "timestamp": 1707421972
    },
    {
        "content": "<p>Here's a blog post featuring some conjectures about cartesian vs. symmetric monoidal categories:</p>\n<ul>\n<li><a href=\"https://golem.ph.utexas.edu/category/2024/02/from_cartesian_to_symmetric_mo.html\">Cartesian versus symmetric monoidal</a>.</li>\n</ul>\n<p>Instead of trying to claim credit for results I haven't proved yet, I'm explicitly asking for someone else to prove them.</p>",
        "id": 421513378,
        "sender_full_name": "John Baez",
        "timestamp": 1707937697
    },
    {
        "content": "<p>Since it's a lot easier to generate conjectures than prove them, I think it's better to share conjectures if one is pretty sure one will never get around to proving them -  at least if they're pretty and likely to be true.</p>",
        "id": 421513689,
        "sender_full_name": "John Baez",
        "timestamp": 1707937810
    }
]