[
    {
        "content": "<p>I think the way citations should be written has many rules which are all intended for publishing in a journal. I was wondering what people think of citations that refer to blogs, nLab or wikipedia. Often when you write some article to blog, to documentation for your software or some other less formal arena, and naturally refer to many things you see on the web, it would still be preferable to write proper citations. </p>\n<p>But somehow referring to the online resources from citation seems either excessively hard or is not recommended at all because the web page you refer to may suddenly disappear without explanation, rendering the citation invalid at least with respect to the URL.  There are various HTML metadata tags from e.g. <a href=\"http://schema.org\">schema.org</a> that can sometimes be used to indicate to search engines what to cite and/or what's part of citation, but I'm not sure what's the preferred approach for handling this. I think the explosion of the web publishing should have somehow changed how these are thought, but it's not obvious to me if there are any conclusion on the matter.</p>",
        "id": 203253412,
        "sender_full_name": "Esa Pulkkinen",
        "timestamp": 1594205323
    },
    {
        "content": "<p>You can always put url's into the wayback machine... I just noticed yesterday that mathoverflow will happily create some bibtex for you if you click the \"cite\" link. Although I haven't yet mastered the art of putting hyperlinks into tex/bibtex.</p>",
        "id": 203261790,
        "sender_full_name": "Simon Burton",
        "timestamp": 1594211868
    },
    {
        "content": "<p>Sooner or later I'm definitely going to have to cite a tweet, and I'm very unsure what to do when that day comes</p>",
        "id": 203269465,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594216324
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203273256\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203269465\">said</a>:</p>\n<blockquote>\n<p>Sooner or later I'm definitely going to have to cite a tweet, and I'm very unsure what to do when that day comes</p>\n</blockquote>\n<p>Just cite it? Since it's short enough, maybe quote it and reference the URL?</p>\n<p>Seriously, as I've said above, people cite unpublished manuscripts all the time. Some of these manuscripts have disappeared for all intents and purposes, and for all sorts of reasons. It's fine.</p>\n</blockquote>\n<p>Just quoting the entire tweet with the link is still shorter then some of the bibliography entries for conference proceedings that include the editor, the location, the date, etc. so I'm sure this is fine :P</p>",
        "id": 203283075,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1594222677
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203273426\">said</a>:</p>\n<blockquote>\n<p>Of course, you could \"blockchain\" all the things. That should work, right?</p>\n</blockquote>\n<p>I have more faith in the arxiv staying online for a long time, then some random blockchain being still accessible: you would still need to have the instructions to get into the blockchain, you still need to be able to download the chain from somewhere, so why bother. Just have a good working website instead</p>",
        "id": 203284342,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1594223241
    },
    {
        "content": "<p>Also, I could imagine if a major repository of data like arxiv were to go down, then the data would probably get stored somewhere else so that it would still be available, just under a different url. The only thing needed then for business as usual, is to get a browser extension that automatically converts an arxiv url to the new format.</p>",
        "id": 203284556,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1594223348
    },
    {
        "content": "<p>Yup. While it would be nice to \"trust but verify\" everything anyone cites, ultimately, we often have to trust authors to cite responsibly and truthfully. That's why it's extremely important to have a strong ethos of academic integrity.</p>",
        "id": 203292760,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594227076
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/mjXVGTmURwJWVSQR9fNHJ-Xd/dream.jpg\">how to cite a tweet</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/mjXVGTmURwJWVSQR9fNHJ-Xd/dream.jpg\" title=\"how to cite a tweet\"><img src=\"/user_uploads/21317/mjXVGTmURwJWVSQR9fNHJ-Xd/dream.jpg\"></a></div>",
        "id": 203293118,
        "sender_full_name": "Eigil Rischel",
        "timestamp": 1594227276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203293628\">said</a>:</p>\n<blockquote>\n<p>In practice, everything is impermanent. Even journal articles can become inaccessible [...]</p>\n</blockquote>\n<p>I think this is true. I guess the best one could do is to continuously transfer to new media etc.  Regarding more ephemeral sources (tweets, blog posts), would including them as annexes be a good compromise? (provided there are no copyright issues).</p>",
        "id": 203295883,
        "sender_full_name": "Filip Buric",
        "timestamp": 1594228686
    },
    {
        "content": "<p>Ah, indeed. I guess making the author of said posts anonymous might help with this? So, (as a default?) the annex would include an anonymous copy. Then, optionally (in accordance with the poster's wishes), a link to the original post might also be given? So if the post is taken down, all is left is the content in the annex. I guess any scheme like this can get tricky...</p>",
        "id": 203296891,
        "sender_full_name": "Filip Buric",
        "timestamp": 1594229242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203297744\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"279226\">Filip Buric</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Citations/near/203296891\">said</a>:</p>\n<blockquote>\n<p>Ah, indeed. I guess making the author of said posts anonymous might help with this? </p>\n</blockquote>\n<p>Citation is a means to attribute credit.</p>\n</blockquote>\n<p>Hmm, while I agree, I tend to see that as incidental. To me, one major purpose is to add weight/justification to statements by referring to previous work. (Interesting, wasn't aware of the history around this.)</p>",
        "id": 203299260,
        "sender_full_name": "Filip Buric",
        "timestamp": 1594230381
    },
    {
        "content": "<p>Right, yeah. Tricky indeed..</p>",
        "id": 203311707,
        "sender_full_name": "Filip Buric",
        "timestamp": 1594236684
    }
]