[
    {
        "content": "<p>This could be a reason not to hold conferences (like ACT) in the United States.  From the <em><a href=\"https://archive.is/ueP6u#selection-333.0-407.74\">Washington Post</a></em>:</p>\n<blockquote>\n<h1>U.S. plans to ask visitors to disclose 5 years of social media history</h1>\n</blockquote>\n<blockquote>\n<p>The proposal would affect travelers from countries on the visa waiver program, including Australia, Britain, France, Germany, Israel, Japan and South Korea.</p>\n</blockquote>\n<blockquote>\n<p>The United States could begin requiring visitors from countries on the visa waiver program to provide up to five years of their social media history, according to a U.S. Customs and Border Protection proposal <a href=\"https://archive.is/o/ueP6u/https://www.federalregister.gov/public-inspection/2025-22461/agency-information-collection-activities-proposals-submissions-and-approvals-arrival-and-departure\">posted</a> to the Federal Register to be officially published Wednesday.</p>\n</blockquote>\n<blockquote>\n<p>There are dozens of countries on the visa waiver program <a href=\"https://archive.is/o/ueP6u/https://travel.state.gov/content/travel/en/us-visas/tourism-visit/visa-waiver-program.html\">list</a>, including many European nations, Australia, New Zealand, South Korea, Japan, Brunei, Singapore, Qatar, Israel and Chile.</p>\n</blockquote>\n<blockquote>\n<p>The proposal suggests adding social media as a “mandatory data element” for an Electronic System for Travel Authorization (ESTA) application.</p>\n</blockquote>\n<blockquote>\n<p>Applicants would also have to provide additional information “when feasible,” according to the proposal. The list includes telephone numbers used in the last five years, email addresses used in the last 10 years, IP addresses and metadata from electronically submitted photos, and biometrics, including facial, fingerprint, DNA and iris data.</p>\n</blockquote>\n<blockquote>\n<p>It would also require applicants to provide information about their family members, including names, telephone numbers, dates of birth, places of birth and residences.</p>\n</blockquote>\n<blockquote>\n<p>According to CBP, the proposal is open for a 60-day public comment period.</p>\n</blockquote>",
        "id": 562989413,
        "sender_full_name": "John Baez",
        "timestamp": 1765382046
    },
    {
        "content": "<p>Is anyone here aware of efforts to move the ICM so that it doesn't take place in the US?  Currently the <a href=\"https://www.mathunion.org/icm/icm-2026\">International Congress of Mathematicians (ICM)</a> is going to be held in Philadelphia, 23–30 July 2026.   You'll recall that when Russia invaded Ukraine, the 2022 ICM was moved out of St. Petersburg <a href=\"https://www.math.columbia.edu/~woit/wordpress/?p=12717\">after some heel dragging</a>.</p>\n<p>All I've seen about this is <a href=\"https://www.math.columbia.edu/~woit/wordpress/?p=14386\">Peter Woit's column</a> where he wrote:</p>\n<blockquote>\n<p>In 2022 the St. Petersburg ICM was canceled due to the Russian military entering Ukraine and attempting to take over the country by force. The US has threatened to do the same thing to Greenland and to Panama. Will the Philadelphia ICM be canceled if this happens?</p>\n</blockquote>",
        "id": 567403497,
        "sender_full_name": "John Baez",
        "timestamp": 1768151377
    },
    {
        "content": "<p>Depends whom and where the organisers are, no doubt.</p>",
        "id": 567472144,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1768209106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/conferences.20in.20the.20US/near/567472144\">said</a>:</p>\n<blockquote>\n<p>Depends whom and where the organisers are, no doubt.</p>\n</blockquote>\n<p>I would imagine that in general there are more influential people in the American sphere of influence, rather than the Russian sphere of influence. If you recall, LiCS was in Israel not too long ago, and there was not much pushback at all.</p>",
        "id": 567543305,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1768226857
    },
    {
        "content": "<p>It may also depend on whether the US invades Greenland before July 23rd.</p>",
        "id": 567681824,
        "sender_full_name": "John Baez",
        "timestamp": 1768277910
    },
    {
        "content": "<p>The French Mathematical Society is <a href=\"https://bsky.app/profile/socmathfrance.bsky.social/post/3mddapn6mo22n\">not coming</a> to the International Conference of Mathematician in Philadelphia in 2026:</p>\n<blockquote>\n<p>La SMF ne tiendra pas de stand au Congrès International des Mathématiciens (ICM) de Philadelphie en 2026. </p>\n<p>(Motion du Conseil d'Administration du 16 janvier 2026)</p>\n<p>En effet ni la délivrance de visas par le pays hôte, ni sa sécurité intérieure alors qu'y est régulièrement évoquée la loi martiale, ne semblent garanties.</p>\n<p>Par ailleurs la SMF reste fondamentalement attachée à l'héritage de Benjamin Franklin, inséparable de la pensée rationnelle, et condamne la défiance envers la science et toute atteinte aux libertés académiques.</p>\n</blockquote>",
        "id": 570199324,
        "sender_full_name": "John Baez",
        "timestamp": 1769466127
    },
    {
        "content": "<p>Or for those of us who can barely read French:</p>\n<p>The French Mathematical Society (SMF) will not have a booth at the International Congress of Mathematicians (ICM) in Philadelphia in 2026. </p>\n<p>(Motion of the Board of Directors, January 16, 2026) </p>\n<p>Indeed, neither the issuance of visas by the host country nor its internal security, given the frequent discussions of martial law, seem guaranteed. Furthermore, the SMF remains fundamentally committed to the legacy of Benjamin Franklin, which is inseparable from rational thought, and condemns the distrust of science and any infringement on academic freedom.</p>",
        "id": 570199442,
        "sender_full_name": "John Baez",
        "timestamp": 1769466186
    },
    {
        "content": "<p>If I understand this correctly, it might reduce attendance at all conferences in the US:</p>\n<p>Yesterday the Trump Administration announced a proposed big change in policy for people traveling to the US under the Visa Waiver Program.   I believe the Visa Waiver Program covers people traveling to the US for short-term business (B-1) or tourism (B-2) from certain countries.</p>\n<p>The new change would affect ESTA, an automated system that determines the eligibility of visitors to travel to the US under that program:</p>\n<p><a href=\"https://www.govinfo.gov/content/pkg/FR-2025-12-10/pdf/2025-22461.pdf\">https://www.govinfo.gov/content/pkg/FR-2025-12-10/pdf/2025-22461.pdf</a></p>\n<p>If the proposed changes are adopted after the 60-day consultation, then people traveling to the U.S. will be forced to use a U.S. government mobile phone app, submit their social media from the last five years, and submit email addresses used in the last ten years, including of family members. They’re also proposing the collection of DNA.</p>\n<p>More details here:</p>\n<p><a href=\"https://privacyinternational.org/news-analysis/5713/trump-administration-wants-your-dna-and-social-media\">https://privacyinternational.org/news-analysis/5713/trump-administration-wants-your-dna-and-social-media</a></p>",
        "id": 572956738,
        "sender_full_name": "John Baez",
        "timestamp": 1770706246
    },
    {
        "content": "<p>I believe this was actually announced December 10, so the comment period is over. Perhaps the Privacy International post was new yesterday as the comment period was ending? I can’t open it now, site seems to be down, but I don’t see any other new reports indicating any update. I hope they got a lot of convincing comments.</p>",
        "id": 573108193,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1770745201
    },
    {
        "content": "<p>Yes, the Privacy International post showed up yesterday right when the comment period ended.  Sorry not to make that clear.  </p>\n<p>I guess we'll have to wait to hear news about whether this policy actually gets implemented.   It will be somewhat difficult to implement, though I suppose the government can implement it selectively and use it to punish anyone they want - by checking to see if that person gave them every email address they used in the last 10 years, and all social media posts from the last 5 years.</p>",
        "id": 573147095,
        "sender_full_name": "John Baez",
        "timestamp": 1770756596
    },
    {
        "content": "<p>Ah, yeah, I think saying Trump announced it yesterday made it sound like you were reading the comment period as having just begun. </p>\n<p>Well, <em>implementing</em> it, in the sense of telling everyone they have to include this information, would be easy and would probably cause pretty notable damage to international tourism and business travel, even if they hardly ever try to actually <em>enforce</em> it. It does seem it would be impossible to find all the email addresses and socials anybody used over x time, but it's hard to know exactly <em>which</em> of those things the government might have in their files. I saw in some other link some official claiming that all they'd be asking for was social media handles, to check against intelligence files, rather than demanding visitors make their social media profiles public for CBP's perusal upon entry, which I think they've been either floating or actually implemented for student visas.</p>",
        "id": 573174928,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1770768878
    }
]