[
    {
        "content": "<p>On Mastodon, <a href=\"https://mathstodon.xyz/@kangmeister/113106573979177442\">Ross Kang</a> writes:</p>\n<blockquote>\n<p>On behalf of MathOA, we are excited to open a call for proposals for a new startup fund, intended to stimulate the founding of new high-quality Diamond OA mathematics journals:</p>\n<p><a href=\"https://www.mathoa.org/diamond-open-access-stimulus-fund/\">https://www.mathoa.org/diamond-open-access-stimulus-fund/</a></p>\n<p>(And a pdf version: <a href=\"https://staff.fnwi.uva.nl/j.r.kang/MathOA_stimulus.pdf\">https://staff.fnwi.uva.nl/j.r.kang/MathOA_stimulus.pdf</a>)</p>\n<p>Please don't hesitate to circulate this call to any potentially interested contacts/colleagues.</p>\n</blockquote>\n<p>In case you don't know, <a href=\"https://en.wikipedia.org/wiki/Diamond_open_access\">diamond open access</a> journals are free to publish in and free to read.  We category theorists are lucky that <em>Theory and Applications of Categories</em> and <em>Compositionality</em> are diamond open access journals.  So, if you want to support diamond open access you can also volunteer to help those journals, like many of us here have done.</p>",
        "id": 468782036,
        "sender_full_name": "John Baez",
        "timestamp": 1725885374
    },
    {
        "content": "<p>Don't forget <a href=\"https://cahierstgdc.com/\">Cahiers de topologie et géométrie différentielle catégoriques</a>! It's perhaps a bit less visible, since it's not so new and up-to-date on the modern tech stack, but it's still plugging away quietly now it's no longer a subscription journal.</p>",
        "id": 468943437,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725927382
    },
    {
        "content": "<p>Good point!</p>",
        "id": 468944201,
        "sender_full_name": "John Baez",
        "timestamp": 1725927785
    },
    {
        "content": "<p>And <a href=\"https://higher-structures.math.cas.cz/\">Higher Structures</a></p>",
        "id": 468973780,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1725940087
    },
    {
        "content": "<p>Apart from Applied Categorical Structures, a Springer journal, and <a href=\"https://cgasa.sbu.ac.ir/\">Categories and General Algebraic Structures with Applications</a>, a diamond OA journal run out of a university in Iran, I think most or all the other journals that category theorists frequent are not really specifically intended for CT, even though it might be heavily represented. (eg those that also cover algebraic topology in equal measure with CT, but clearly there's no hard boundary)</p>\n<p>I think it rather wonderful that category theorists seem to have the taste for OA journals, certainly it has been helped by the early vision of the founders of TAC, and proponents of OA like John B.</p>",
        "id": 469003557,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725952027
    }
]