[
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2210.03522\">https://arxiv.org/abs/2210.03522</a></p>\n<p>I think this would be good for us to discuss here. I haven’t read it all yet, but it is discussing something very important. It is examining (with data!) the phenomenon of privileged people avoiding action even if they want things to change.</p>",
        "id": 303357280,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1665461650
    },
    {
        "content": "<p>This starts very strong, I'll be keen to discuss too!</p>",
        "id": 303382574,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665477514
    },
    {
        "content": "<p>It seems to be quite the same story that inaction towards climate change <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 303384838,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1665478427
    },
    {
        "content": "<p>I have read to the end of the introduction, which concludes with the following summary: (sorry for the long quote)</p>\n<blockquote>\n<p>The research record clearly indicates that people who hold privileged identities are essential to disrupting inequality. They are able to speak up and work for change without the risks and with the benefits of being listened to and taken more seriously than those who hold oppressed<br>\nidentities. Notably, white men are able to have a greater impact, not because they hold more knowledge or ideas, but because other white men, who hold most of the positions of power, listen to white men more than other groups. Sexism and racism ironically leads to white men having an ability to be heard as they confront sexism and racism.</p>\n<p>While white men have an extra ability to confront sexism and racism, their good intentions are insufficient. Having an impact requires them to extend significant effort to understand the role they currently play in maintaining sexism and racism. It will also require them to work along with people of color and women and not recenter their own experiences. It is important that white men not take charge, but rather support the work of others.</p>\n<p>Although many people of privilege are well-intentioned and are motivated to work for change, they frequently lack an understanding of inequity and their own complicity in maintaining it. We therefore strive to illuminate the ways this lack of understanding shows up, in order to provide insights into ways to disrupt it. Specifically we use interview data and critical discourse analysis to explore an important question.</p>\n</blockquote>\n<p>Just as during the mobilization that I witnessed during BLM two years ago, I'm frustrated that the only specific action proposed is self-education. This is an analysis of discourse, so I guess that's to be expected, but I feel the same frustration described by Ryan in the opening quote: it's very well to stress that my privilege puts me in a better position to act against sexism and racism, but if my workplace is saturated with people sharing one or more categories of privilege with me, then my contact with instances of discrimination is limited and I'm rarely going to encounter opportunities to apply the leverage I have. Moreover, I am <em>not</em> yet in a position to have a significant impact on the system by which the my peers are selected, and I'm certainly not inclined to put pressure on my peers who have experience oppression to continue in an academic setting (outside my sphere of influence) where they have experienced oppression or other factors which discouraged them from continuing. The authors of the paper say `this powerlessness is perplexing', but none of their suggestions have any obvious potential to empower someone in Ryan's position who has already put the work in to get the education regarding inequity that they highlight is lacking in more senior academics that they interview.</p>",
        "id": 303388114,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665479800
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303357280\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://arxiv.org/abs/2210.03522\">https://arxiv.org/abs/2210.03522</a></p>\n<p>I think this would be good for us to discuss here. I haven’t read it all yet, but it is discussing something very important. It is examining (with data!) the phenomenon of privileged people avoiding action even if they want things to change.</p>\n</blockquote>\n<p>As a relatively privileged person (though not, e.g., tall or especially attractive or richer/better connected than the people who have more money/better connections than me, which are also privileges that folks seem never to want to talk about in the same sort of vein as this, but that's just me dangling a red cape in front of y'all) who would like social change, I will mention that in my experience much of the advocacy for such change takes the form of passive-aggressive complaints that come off poorly to those in relative power. (I say this as someone that is \"active-aggressive,\" and that can afford it relatively easily by virtue of my social position.) Though it is correct to be dissatisfied with the fact that the world is not fair, and justified to try to make it more fair, the world will in the end remain (perhaps less) unfair. Many (most? all? of us) know that we should \"be the change we want to see\" and listen to those who have challenges that we don't. Directly and forthrightly explaining to folks like the scientists in that paper (or me, for all I know) how they are relatively privileged and how others are less so <em>in relation to a specific context</em> is IMO the main thing to do, but it requires courage--more so if one is relatively disadvantaged already. Consideration and any further action is IMO an exercise for the interlocutor.</p>",
        "id": 303502229,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665515291
    },
    {
        "content": "<p>And yes I get that folks in relative power should try to find out for themselves how their privilege affects others. But this is not straightforward in practice--IMO the authors of that paper are \"Monday-morning quarterbacking\" and would find fault in a well-intentioned act that went poorly, or in a well-intentioned nonaction.</p>",
        "id": 303503946,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665515908
    },
    {
        "content": "<p>Here is a scenario given in the interview questionnaire.</p>\n<blockquote>\n<p>One day, I walked into a huge lecture hall and saw, down at the front, one of my informants,<br>\nZina, a tall, dark-skinned African American woman. She was sitting in an aisle seat; the rest of<br>\nthe row she sat in was empty. I sat through class with her, and at the end of class she told me<br>\nthat whatever row she sits in, she clears it out—no one will sit within five or six seats of her. She<br>\nexplained that she used to sit in the sixth row, all by herself. Recently she had moved up to the<br>\nfourth row, which had previously had habitual occupants. Now, as I saw for myself when I<br>\nlooked around, the sixth row held a number of students and the fourth row was empty.</p>\n</blockquote>\n<p>I'm curious to hear what other people think would be an appropriate response here?</p>",
        "id": 303516560,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1665520839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278008\">Spencer Breiner</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303516560\">said</a>:</p>\n<blockquote>\n<p>I'm curious to hear what other people think would be an appropriate response here?</p>\n</blockquote>\n<p>I was struck that the authors appeared to have very definite ideas about what an appropriate response would be that I could imagine being harmful to everybody involved.</p>",
        "id": 303519512,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665522106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278008\">Spencer Breiner</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303516560\">said</a>:</p>\n<blockquote>\n<p>I'm curious to hear what other people think would be an appropriate response here?</p>\n</blockquote>\n<p>As the prof? Openly ask what the deal was during class, prefaced with an apology for putting Zina on the spot; beyond that it would really depend on the students' reactions (this is probably too vague to be a satisfying response in an interview, though). I don't know how you could not notice that kind of behaviour for long enough to have to be told about it?</p>",
        "id": 303519703,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665522176
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303519703\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"278008\">Spencer Breiner</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303516560\">said</a>:</p>\n<blockquote>\n<p>I'm curious to hear what other people think would be an appropriate response here?</p>\n</blockquote>\n<p>As the prof? Openly ask what the deal was during class, prefaced with an apology for putting Zina on the spot; beyond that it would really depend on the students' reactions (this is probably too vague to be a satisfying response in an interview, though). I don't know how you could not notice that kind of behaviour for long enough to have to be told about it?</p>\n</blockquote>\n<p>I can easily imagine (a different) Zina feeling that she had been inappropriately singled out by the prof and all manner of bad things happening after that. I imagine the authors would consider the idea of privately approaching her after the class as inadequate also, and even this could be fraught.</p>",
        "id": 303520345,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665522462
    },
    {
        "content": "<p>Having found this part in the text, I see that they ask what the interviewee would do in various roles relative to Zina. If I were another student in the class I would have the same reaction, although I can't claim that I would have had the confidence to act on it as a first year undergrad. On what basis could Zina claim that the singling out was inappropriate?</p>",
        "id": 303520734,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665522618
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303520734\">said</a>:</p>\n<blockquote>\n<p>Having found this part in the text, I see that they ask what the interviewee would do in various roles relative to Zina. If I were another student in the class I would have the same reaction, although I can't claim that I would have had the confidence to act on it as a first year undergrad. On what basis could Zina claim that the singling out was inappropriate?</p>\n</blockquote>\n<p>Well if it subjects her to unwanted attention (maybe it does, maybe it does the exact opposite, depending on the instantiation of Zina) then it's inappropriate as far as I'm concerned.</p>",
        "id": 303521057,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665522768
    },
    {
        "content": "<p>The authors seem to think that \"I don’t want to create further harm to those who experience sexism and racism\" is not a valid reason for inaction--indeed, they use this as a section header. But I find such reasoning troubling.</p>",
        "id": 303521108,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665522801
    },
    {
        "content": "<p>Especially when action carries a nontrivial potential for backfiring on everybody.</p>",
        "id": 303521330,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665522898
    },
    {
        "content": "<p>How are you supposed to even acknowledge racism or sexism happening without \"singling someone out\"? Seems like a boundary that necessarily leads to inaction.</p>",
        "id": 303521516,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665522969
    },
    {
        "content": "<p>There are lots of implicit assumptions here: first, that the behavior is racist or sexist (maybe Zina has annoyed other folks outside of class; maybe she has a distracting habit; etc); second, that the supposed behavior needs to be acknowledged in light of this ambiguity; third, that it needs to be acknowledged without considering potential harm; etc. In my experience it is not uncommon for some people (especially those entering the full flowering of their social consciousness at university) to assume the worst of others and thereby alienate people who intended no harm.</p>",
        "id": 303522311,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665523336
    },
    {
        "content": "<p>I'm certainly guilty of assuming the worst at times and it is not a good thing.</p>",
        "id": 303522380,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665523374
    },
    {
        "content": "<p>\"Assuming\" is at the heart of prejudice. People are bad Bayesians.</p>",
        "id": 303522759,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1665523551
    },
    {
        "content": "<p>But asking why an obviously unusual thing is happening doesn't assume anything?</p>",
        "id": 303522925,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665523633
    },
    {
        "content": "<p>I have to agree with Steve that it would be best to communicate with the student before bringing the issue up with the class.</p>\n<p>I had basically settled on (i) downgrading my opinions of other students in the class and (ii) asking Zina if she would prefer a public response (in class), private (e.g., via email) or drop it.</p>",
        "id": 303522966,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1665523656
    },
    {
        "content": "<p>Though I wouldn't have been able to come up with that on the spot in an interview.</p>",
        "id": 303523072,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1665523708
    },
    {
        "content": "<p>So put the responsibility on the student as to whether you, the person in a position of power (say) take any action to address this behaviour? Isn't the student in that scenario under pressure to decline your efforts for the exact reasons that you're pointing out? At least if you take the initiative the other students have less ammunition for \"blaming\" the victim. But with that said what consequences are you actually imagining here that will be worse than the student's existing isolation from having to sit on their own during class?</p>",
        "id": 303523784,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665524047
    },
    {
        "content": "<p>I would frame it as agency, but YMMV</p>",
        "id": 303547730,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1665539263
    },
    {
        "content": "<p>My own advice: if you notice someone you work with or teach is being discriminated against do your best to empathize with their situation, listen to what they say, and act in their best interest.</p>",
        "id": 303593877,
        "sender_full_name": "Jade Master",
        "timestamp": 1665568486
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Inaction.20of.20well-intentioned.20white.20male.20physicists/near/303520734\">said</a>:</p>\n<blockquote>\n<p>Having found this part in the text, I see that they ask what the interviewee would do in various roles relative to Zina. If I were another student in the class I would have the same reaction, although I can't claim that I would have had the confidence to act on it as a first year undergrad. </p>\n</blockquote>\n<p>I haven't read the article.   If I saw this as a student, my immediate reaction would be to sit sort of near Zina.  Did they mention this option?</p>\n<p>I'm not suggesting this is a complete solution to the problem, just a thing I'd do.</p>",
        "id": 303789457,
        "sender_full_name": "John Baez",
        "timestamp": 1665653430
    },
    {
        "content": "<p>Okay, they address that:</p>\n<blockquote>\n<p>If the respondent said they’d sit next to the student, tell them that didn’t happen for this student, despite the fact that many people give this response. Probe (using their language as much as possible) for why this might be.</p>\n</blockquote>",
        "id": 303790480,
        "sender_full_name": "John Baez",
        "timestamp": 1665653805
    },
    {
        "content": "<p>It's easy to imagine why this might be.</p>",
        "id": 303790536,
        "sender_full_name": "John Baez",
        "timestamp": 1665653834
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/inaction.20of.20well-intentioned.20white.20male.20physicists/near/303523784\">said</a>:</p>\n<blockquote>\n<p>So put the responsibility on the student as to whether you, the person in a position of power (say) take any action to address this behaviour? Isn't the student in that scenario under pressure to decline your efforts for the exact reasons that you're pointing out? At least if you take the initiative the other students have less ammunition for \"blaming\" the victim. But with that said what consequences are you actually imagining here that will be worse than the student's existing isolation from having to sit on their own during class?</p>\n</blockquote>\n<p>I think whether you are putting the responsibility on the student depends very much on how you approach them and which language you use. I think you should make it clear that you are absolutely happy to take action and want to, but that you want her blessing first</p>",
        "id": 304245191,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1665869156
    }
]