[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/.F0.9F.93.9AThe.20Stacks.20Project.20.28Pedagogy.29/near/576166496\">said</a>:</p>\n<blockquote>\n<p>Btw, I'm enjoying the conversation a lot more now. There's a difference between using LLMs to help you think about math vs using it to chat with us about it. I think there's a tension that enters my body when I get the sensation that I'm reading the thoughts of someone's LLM, rather than their thoughts perhaps aided by an LLM.</p>\n</blockquote>\n<p>I am not a native English speaker. Indeed, English is my third language, after French, my second language and Spanish, my first language. Therefore, I need to use LLMs with the following prompt: \"Write the following text as a native English speaker\".</p>\n<p>Concerning my citation of Valerie Solanas, that was not an AI hallucination, but a fascination for problematic authors. Nevertheless, I have my limits: if an author is antisemitic, like Julius Evola, that is a big no-no for me to use it as reference, because his work has been poisoned. Nevertheless, Solanas's work is satirical, his enemy is the \"patriarchy\" is a concept rather than concrete people. It is true that Solanas did murder a man named Maurice Girodias, but she was diagnosed with paranoid schizophrenia. In other words, this murder was not the result of her intention, but of a mental handicap and people who are handicapped should not be discriminated against. This is the reason why I give Solanas a pass: she was mentally ill, not evil. People who were really evil and advocated for violence unapologetically: Adolf Hitler (yimakh shemo), Karl Marx, Martin Heidegger (specially in the Black Notebooks).</p>\n<p>Now, I could ask the question: Is Kanye West evil like Hitler or just mentally ill like Solanas? I don't know Kanye, but I'm sure Nick Fuentes is pure evil and shouldn't have a platform.</p>",
        "id": 576175876,
        "sender_full_name": "José",
        "timestamp": 1772166130
    },
    {
        "content": "<p>This is a series of lectures and debates on what to do with Heidegger, who was a great philosopher but also an advocate of genocide. Should we continue citing Heidegger? I think that is an interesting question.<br>\n<a href=\"https://youtube.com/playlist?list=PLe6t95Ix9FhyW2EXbVuEQUHmeaw5l5mho&amp;si=av76hSDp-wbcc-mR\">Colloque «Heidegger et \"les juifs\"»</a></p>",
        "id": 576178104,
        "sender_full_name": "José",
        "timestamp": 1772167158
    },
    {
        "content": "<p>Example relevant for category theory (Heidegger in nLab): <a href=\"https://ncatlab.org/nlab/show/Heidegger%27s+topology\">Heidegger's topology</a></p>",
        "id": 576178261,
        "sender_full_name": "José",
        "timestamp": 1772167279
    },
    {
        "content": "<p>I generally deny that the distinction between \"mentally ill\" and \"evil\" is sharp, though in rare cases like Tourette's syndrome one might entirely escape culpability for an otherwise evil act. Solanas managed to write a whole manifesto calling for violent resistance to the patriarchy, and then acted on her prescriptions. She was both mentally ill and evil.</p>",
        "id": 576329195,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1772218167
    },
    {
        "content": "<p>My goal is to argue that automation is a crucial tool in dismantling the patriarchy. I initially drew on the work of Valerie Solanas, who advanced a radical critique of patriarchal society. However, if her position proves too controversial or problematic for my purposes, I can instead turn to Laboria Cuboniks, the collective behind <a href=\"https://laboriacuboniks.net/manifesto/xenofeminism-a-politics-for-alienation/\">Xenofeminism</a>.</p>\n<p>This morning, a friend, who is a mathematician, shared this news with me: <a href=\"https://www.israelnationalnews.com/news/423079\">https://www.israelnationalnews.com/news/423079</a></p>\n<p>My reply were the attached slides in which I apply the techniques of xenofeminism to fight contemporary antisemitism. Yes, I used AI to produce it, but it is not spam, the slides really reflect my ideas about technological activism. Of course, this is just brainstorming.<br>\n<a href=\"/user_uploads/21317/FRDSnOpKkIYbalFxt-Dhe7zt/XF_SYSTEM_DEBUG.pdf\">XF_SYSTEM_DEBUG.pdf</a></p>",
        "id": 576352950,
        "sender_full_name": "José",
        "timestamp": 1772228045
    },
    {
        "content": "<p>The initiative to use technology to combat antisemitism arises from the <a href=\"https://www.theadirchallenge.com/\">Adir Challenge</a>.</p>",
        "id": 576353306,
        "sender_full_name": "José",
        "timestamp": 1772228195
    },
    {
        "content": "<p>I'm not at all likely to read an AI-produced slide deck about the applications of xenofeminism to combatting antisemitism. It's remarkable that you don't seem to be willing to make any of your own arguments, though you claim that your goal is to \"argue...\"</p>",
        "id": 576365538,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1772234915
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Problematic.20authors/near/576365538\">said</a>:</p>\n<blockquote>\n<p>It's remarkable that you don't seem to be willing to make any of your own arguments</p>\n</blockquote>\n<p>If that was true, how did the AI knew that these two ideas (xenofeminism and combating antisemitism) can be combined? The process of generation of AI-enhanced content starts by telling the AI my arguments and then asking it to develop slides illustrating my ideas.</p>\n<p>My main argument is that teaching advanced critical theory (critical race theory, gender studies, postcolonial theory, etc.) to people without enough reasoning skills was catastrophic. As a consequence of that, a significant part of the \"woke\" movement became antisemitic, because antisemitism is the easy (and wrong) answer to complex questions.</p>\n<p>Xenofeminism is an alternative to the \"woke\", aiming to solve the same social problems, but it is grounded on logic and critical thinking. So, if the woke is generating antisemitism, a good idea could be to replace it with xenofeminism. Indeed, unlike the woke that is obsessed with hating people who they consider to be \"privileged\", xenofeminism promotes inclusion of everyone.</p>",
        "id": 576369256,
        "sender_full_name": "José",
        "timestamp": 1772237839
    },
    {
        "content": "<p>Well, playing devil’s advocate, so far you haven’t said anything that would prefer xenofeminism over, say, liberalism, which is also, or claims to be, based on logic, critical thinking, and inclusion of everyone. Indeed it’s a rare school of thought in the enlightenment heritage that denies critical thinking and inclusion, though a few deny logic!</p>",
        "id": 576370982,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1772239240
    },
    {
        "content": "<p>Kevin Carlson <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Problematic.20authors/near/576370982\">said</a>:</p>\n<blockquote>\n<p>Well, playing devil’s advocate, so far you haven’t said anything that would prefer xenofeminism over, say, liberalism</p>\n</blockquote>\n<p>I would prefer xenofeminism over the \"woke ideology\", because xenofeminism is anti-essentialist, whereas the woke is obsessed with identity (for example, gender identity, racial identity, religious identity, etc.). Some references: <a href=\"https://soundcloud.com/joshuacitarella/xenofeminism-w-helen-hester\">https://soundcloud.com/joshuacitarella/xenofeminism-w-helen-hester</a></p>",
        "id": 576378206,
        "sender_full_name": "José",
        "timestamp": 1772243309
    },
    {
        "content": "<table>\n<thead>\n<tr>\n<th>Aspect</th>\n<th>Xenofeminism</th>\n<th>\"Woke Ideology\" (Critical Social Justice)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Core Philosophy</strong></td>\n<td>Technomaterialist, anti-naturalist, and gender-abolitionist framework embracing alienation and reason to dismantle biological, physical, and social constraints.</td>\n<td>Broad socio-political framework focused on heightened awareness of systemic inequalities, intersectionality, critical theory, and dismantling historical power structures.</td>\n</tr>\n<tr>\n<td><strong>View on Identity</strong></td>\n<td>Promotes gender abolitionism and radical universalism; views fixed identity categories as limitations to be technologically and socially transcended.</td>\n<td>Highly identity-centric; focuses on recognizing, affirming, and analyzing marginalized identities and how overlapping categories (race, class, gender) interact.</td>\n</tr>\n<tr>\n<td><strong>Nature &amp; Technology</strong></td>\n<td>Anti-naturalist (\"If nature is unjust, change nature\"); views technology, science, and medical intervention as essential emancipatory tools to hack biological realities.</td>\n<td>Approaches technology with skepticism, frequently highlighting how algorithms, AI, and scientific institutions can reproduce and amplify existing systemic biases.</td>\n</tr>\n<tr>\n<td><strong>Epistemology</strong></td>\n<td>Values rationalism, scale, and abstraction; seeks to reclaim reason from patriarchal histories, prioritizing systemic structural intervention over individual subjectivity.</td>\n<td>Relies heavily on standpoint epistemology—the idea that knowledge is situated and the lived experience of marginalized groups is the primary lens for understanding truth.</td>\n</tr>\n<tr>\n<td><strong>Antisemitism</strong></td>\n<td>Not a primary focal point in foundational texts; implicitly opposed through a broader commitment to radical universalism and dismantling all exclusionary classifications.</td>\n<td>Highly debated; advocates argue intersectionality inherently opposes antisemitism, while critics argue rigid \"oppressor vs. oppressed\" matrices can mischaracterize Jewish populations, leading to blind spots.</td>\n</tr>\n</tbody>\n</table>",
        "id": 576378612,
        "sender_full_name": "José",
        "timestamp": 1772243640
    },
    {
        "content": "<p>I think if you have a point, you can make it a lot faster than that.</p>",
        "id": 576379537,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1772244488
    },
    {
        "content": "<p>Thank you! I’m still getting up to speed on xenofeminism, as it’s a field I’ve only just started exploring.</p>\n<p>I’ve been conducting statistical research on contemporary antisemitism, and I’ve come across a nontrivial result: <strong>the spike in antisemitism in Canada didn't actually begin as a reaction to the Israeli military response following the October 7th attacks (2023). Instead, the data shows the increase began during the COVID-19 vaccination campaign (2021).</strong> My interpretation is that people were heavily indoctrinated through online spaces during the pandemic.</p>\n<p>Professor Henry Abramson mentions my work around the 10-minute mark of this video: <a href=\"https://youtu.be/oMhr8KJjL-M?si=33Z1f9NU3sXOMlSK&amp;t=607\">https://youtu.be/oMhr8KJjL-M?si=33Z1f9NU3sXOMlSK&amp;t=607</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"oMhr8KJjL-M\" href=\"https://youtu.be/oMhr8KJjL-M?si=33Z1f9NU3sXOMlSK&amp;t=607\"><img src=\"https://uploads.zulipusercontent.net/464765d6bb8b251c4c0d6444a039b0c4d4bd90bd/68747470733a2f2f692e7974696d672e636f6d2f76692f6f4d6872384b4a6a4c2d4d2f6d7164656661756c742e6a7067\"></a></div>",
        "id": 576388793,
        "sender_full_name": "José",
        "timestamp": 1772253052
    },
    {
        "content": "<p>Speaking of problematic authors, Wolfram is also one, as he is known to take credit for the ideas and work of his employees and erase their contributions.</p>",
        "id": 576402733,
        "sender_full_name": "James Deikun",
        "timestamp": 1772266618
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1030017\">@José</span> I feel like your table just depicts the \"woke ideology\" as the analysis of the current state of affairs, and \"xenophemism\" as a potential solution (whose faith in technosolutionism is debatable, but whose point otherwise is shared by any rational \"woke ideologist\" anyway…)</p>",
        "id": 576405231,
        "sender_full_name": "Vincent R.B. Blazy",
        "timestamp": 1772268747
    }
]