[
    {
        "content": "<p>There's an idea I've been kicking around for a few weeks that I guess I should air out here and now. I would like to organize a sort of seminar to happen during this summer to be recorded and put on YouTube, where people take turns giving an excellent introduction/lesson on some topic in CT.</p>",
        "id": 199665485,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212705
    },
    {
        "content": "<p>I think it would be great to get people involved that are known for giving great explanations of things.</p>",
        "id": 199665695,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212790
    },
    {
        "content": "<p>I guess I'd have to hear interest in such an event to get the energy to put it together though.</p>",
        "id": 199665794,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212836
    },
    {
        "content": "<p>That's a great idea.   I will be glad to advertise it, and I'd be glad to give one talk, but only if other people actually run it.</p>\n<p>It would be good to decide on a \"level\".</p>",
        "id": 199665844,
        "sender_full_name": "John Baez",
        "timestamp": 1591212844
    },
    {
        "content": "<p>I would recommend very basic CT.</p>",
        "id": 199665874,
        "sender_full_name": "John Baez",
        "timestamp": 1591212860
    },
    {
        "content": "<p>That way a lot of good people could quite easily prepare talks, and <strong>LOTS</strong> more people could benefit than if you did something at a higher level.</p>",
        "id": 199665935,
        "sender_full_name": "John Baez",
        "timestamp": 1591212902
    },
    {
        "content": "<p>I think there could be various levels, but definitely skewed towards basic CT</p>",
        "id": 199665947,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212908
    },
    {
        "content": "<p>Right, this is precisely what I was thinking.</p>",
        "id": 199665983,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212931
    },
    {
        "content": "<p>I think it would work best if people of a given level could understand all the talks, not just some.   It's discouraging to hit a talk that's a lot harder than the last one.</p>",
        "id": 199666022,
        "sender_full_name": "John Baez",
        "timestamp": 1591212957
    },
    {
        "content": "<p>So, I'm recommending that you choose a level and choose speakers who understand the concept of explaining things to people who know X and Y but not Z or W.</p>",
        "id": 199666171,
        "sender_full_name": "John Baez",
        "timestamp": 1591213018
    },
    {
        "content": "<p>Yes, I guess what I meant by various levels is that I could imagine a lesson about something which is considered medium/advanced, but which starts at the basic level and works up to the advanced ideas.</p>",
        "id": 199666204,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213033
    },
    {
        "content": "<p>You could probably get the original Catsters to contribute talks.</p>",
        "id": 199666227,
        "sender_full_name": "John Baez",
        "timestamp": 1591213044
    },
    {
        "content": "<p>Anyway, I think you'll either need to run the show yourself or get a committed partner to help you run it.  Either way, if you did it right you'd become \"famous\" in a useful way.</p>",
        "id": 199666363,
        "sender_full_name": "John Baez",
        "timestamp": 1591213101
    },
    {
        "content": "<p>What about getting ambitious and try a series of CT for high-schoolers. Aimed at students who liked math at school, but did not have done university level math.</p>",
        "id": 199666389,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213113
    },
    {
        "content": "<p>Accessible to, say, last year of high-school, but useful also to early undergraduates.</p>",
        "id": 199666498,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213164
    },
    {
        "content": "<p>That is ambitious, but maybe possible.</p>",
        "id": 199666505,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213168
    },
    {
        "content": "<p>I did include this here since we were just talking about teaching CT.</p>",
        "id": 199666627,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213211
    },
    {
        "content": "<p>I agree, I am not sure it is possible. But imagine young maths students starting their university already knowing about category theory ... that could be a real booth ...</p>",
        "id": 199666637,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213216
    },
    {
        "content": "<p>Also remember standards in schools vary pretty widely around the world. At least where I am, most school graduates don't have a clear idea of what a set or a function is for example</p>",
        "id": 199666727,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591213265
    },
    {
        "content": "<p>Jules, I agree, we couldnt assume knowledge about sets and functions</p>",
        "id": 199666837,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213293
    },
    {
        "content": "<p>Perhaps an ideal we could shoot for is like the first third should be understandable by HS students, the middle by undergrads, and the end by grads.</p>",
        "id": 199666851,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213306
    },
    {
        "content": "<p>You can probably get some mileage by just replacing the phrase \"a set of X\" with \"a bunch of X\"</p>",
        "id": 199666951,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591213343
    },
    {
        "content": "<p>yes, we dont need to be too formal ...</p>",
        "id": 199666991,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213362
    },
    {
        "content": "<p>Right, the aim should be that a person who is <em>trying to learn some math by watching youtube videos</em> could learn something.</p>",
        "id": 199667101,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213407
    },
    {
        "content": "<p>Joe, yes, a sequence would be good, but I would start with HS without committing to the other stages to do in the same summer ... alternatively we could start with grads and work backwards ...</p>",
        "id": 199667316,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213506
    },
    {
        "content": "<p>Oh, I meant within a single video.</p>",
        "id": 199667347,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213531
    },
    {
        "content": "<p>but watching a video is not enough ... if you like the video you want something to work on as well ... could we integrate some exercises and research projects as well?</p>",
        "id": 199667450,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213572
    },
    {
        "content": "<p>Alternatively, videos could be organized by advancedness via playlists once they get to youtube.</p>",
        "id": 199667455,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213575
    },
    {
        "content": "<p>yes, that would be very cool.</p>",
        "id": 199667474,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591213588
    },
    {
        "content": "<p>I also like to make students think as if they did do research. Instead of lecturing them on a topic, start with a research problem and make them discover the maths on the journey. A problem with this is that this format does not translate well into videos, afaik.</p>",
        "id": 199668048,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591213847
    },
    {
        "content": "<p><a href=\"https://www.youtube.com/watch?v=ppWPuXsnf1Q&amp;list=PLZHQObOWTQDP5CVelJJ1bNDouqrAhVPev\">3blue1Brown</a> had a cool series of videos of similar kind recently. Of course, resources available to a YT channel with ~3M subscribers are way out of reach, but there may be some things to learn there.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ppWPuXsnf1Q\" href=\"https://www.youtube.com/watch?v=ppWPuXsnf1Q&amp;list=PLZHQObOWTQDP5CVelJJ1bNDouqrAhVPev\"><img src=\"https://i.ytimg.com/vi/ppWPuXsnf1Q/default.jpg\"></a></div>",
        "id": 199669699,
        "sender_full_name": "Tomáš Gonda",
        "timestamp": 1591214577
    },
    {
        "content": "<p>Yes, 3Blue1Brown is great ... but no way I could do this, not sure how much he takes to make 1 video, but I know that I dont have this amount of time. And if I tried this I would probably need 10x as much time as it takes him.</p>",
        "id": 199672048,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591215850
    },
    {
        "content": "<p>This is partially why I would want to distribute the lessons across several people.</p>",
        "id": 199672397,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591216038
    },
    {
        "content": "<p>I can't pay someone what they deserve to teach a university course <span aria-label=\"laughter tears\" class=\"emoji emoji-1f602\" role=\"img\" title=\"laughter tears\">:laughter_tears:</span></p>",
        "id": 199672456,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591216080
    },
    {
        "content": "<p>The other part is that getting a variety of perspectives would be helpful to people learning the ropes.</p>",
        "id": 199672559,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591216128
    },
    {
        "content": "<p>I think you can get a bunch of good people to each give one stand-alone short lecture, like less than an hour, just out of the goodness of their heart.</p>",
        "id": 199672576,
        "sender_full_name": "John Baez",
        "timestamp": 1591216147
    },
    {
        "content": "<p>About teaching basic CT to highschoolers: I used to help organize an annual math summer camp for (the Danish equivalent of ) high school students. A few years ago we did a basic CT course. I would have to dig a bit to find the material (which is written in Danish, anyways), but as I recall we managed to cover categories, functors, products and coproducts (and maybe some other stuff - it's been a while)</p>\n<p>The hardest thing was probably to come up with a large stock of examples, since most of the \"basic\" examples we take for granted (groups, rings, linear algebra, topological things) are things people usually don't meet until university.</p>\n<p>I think they managed to absorb quite a bit of the material. They weren't exactly median highschoolers (they had to apply to go to a math camp, and then choose the category theory course over another course), but I don't think they were exceptional, as a class, either. And I think even some of the weaker students managed to get something out of it.</p>",
        "id": 201943932,
        "sender_full_name": "Eigil Rischel",
        "timestamp": 1593074149
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276165\">Eigil Rischel</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Summer.20CT.20course.2Fseminar/near/201943932\">said</a>:</p>\n<blockquote>\n<p>I would have to dig a bit to find the material (which is written in Danish, anyways)</p>\n</blockquote>\n<p>Sounds great! These days, Google Translate works fine for a quick skim, and I wouldn't mind a linguistic challenge.</p>\n<blockquote>\n<p>The hardest thing was probably to come up with a large stock of examples, since most of the \"basic\" examples we take for granted (groups, rings, linear algebra, topological things) are things people usually don't meet until university.</p>\n</blockquote>\n<p>I think that's probably the most valuable part of the material.</p>",
        "id": 201945791,
        "sender_full_name": "(=_=)",
        "timestamp": 1593075493
    },
    {
        "content": "<p>Sounds great. Where do I sign up?</p>",
        "id": 202962075,
        "sender_full_name": "Todd Schmid (he/they)",
        "timestamp": 1594022254
    }
]