[
    {
        "content": "<p>In case it needs to be said explicitly, don't forget we are <em>category theorists</em>, we do some of the most genuinely abstract academic theory that exists, this is not something that just anyone can pick up. The very best we can possibly hope for is to not put up any <em>additional</em> barriers. In the end, by the time a person has enough intellectual development to have a chance with categories, they have already been at the mercy of society for 20 years</p>",
        "id": 199660822,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591210413
    },
    {
        "content": "<p>I know what you mean, Jules, but I'm not sure I totally buy it. There's no objective scale of \"abstraction\" (whatever that means) and even if there is, it certainly doesn't correlate to a scale of difficulty.  Most (not all) of us probably find category theory much easier than the supposedly more concrete theory of PDEs, for example.  I don't think we should accept that category theory needs to be any more difficult or mysterious than other branches of maths.</p>",
        "id": 199661175,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591210606
    },
    {
        "content": "<p>One way to increase diversity might be to try the crazy thing I think we've all thought of trying: teaching category theory to younger students who don't already know tons of other math.</p>",
        "id": 199661446,
        "sender_full_name": "John Baez",
        "timestamp": 1591210765
    },
    {
        "content": "<p>There are all sorts of risks here, but maybe also rewards.</p>",
        "id": 199661466,
        "sender_full_name": "John Baez",
        "timestamp": 1591210779
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199661175\">said</a>:</p>\n<blockquote>\n<p>I know what you mean, Jules, but I'm not sure I totally buy it. There's no objective scale of \"abstraction\" (whatever that means) and even if there is, it certainly doesn't correlate to a scale of difficulty.  Most (not all) of us probably find category theory much easier than the supposedly more concrete theory of PDEs, for example.  I don't think we should accept that category theory needs to be any more difficult or mysterious than other branches of maths.</p>\n</blockquote>\n<p>I guess what I mean is, (as far as I know) there's no chance for someone who just graduated high school to learn much category theory. It has prerequisites which are themselves undergrad-level subjects</p>",
        "id": 199661579,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591210829
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199661446\">said</a>:</p>\n<blockquote>\n<p>One way to increase diversity might be to try the crazy thing I think we've all thought of trying: teaching category theory to younger students who don't already know tons of other math.</p>\n</blockquote>\n<p>About this: there were actually two high school students present today, who approached me some weeks ago because they would like to get some hands on experience in research. They wanted to work on some theoretical problem in TDA, and I kindly redirected them to ACT, as I do think that the abstractness of CT makes the entry point easier, in some way</p>",
        "id": 199661662,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591210872
    },
    {
        "content": "<p>I really want to share this beautiful world with kids before they're beaten down by the school system.</p>",
        "id": 199661844,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591210970
    },
    {
        "content": "<p>That's great, so did they join here or what? Are you going to work with them?</p>",
        "id": 199661876,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591210996
    },
    {
        "content": "<p>@ Jules: We can make the ACT community more diverse by broadening the base. This is how I understood what Nina said about not doing positive discrimination and what Jade said against merit based access. Of course, you are right that we can't make math really easy to everybody. Math is fun also because it is hard. But we can improve how we include more who would and could be part of mathematics.</p>",
        "id": 199662138,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591211126
    },
    {
        "content": "<p>I think we have a lot of work to do in finding ways to present CT at a lower level.  Lawvere and Schanuel's book was a really bold attempt at that (CT for high schoolers); some people like it, others don't. But we're slowly figuring out how to teach CT meaningfully without lots of undergrad courses as prerequisites.  E.g. fifteen years ago there weren't many decent intros to CT (for meathematicians) other than Mac Lane's, which is often seen as rather demanding in terms of  prerequisites. Now there are a whole bunch that assume much less of the reader. It's a gradual process, and everything has to be classroom-tested and tinkered with and tested again, but there's definite progress being made.</p>",
        "id": 199662142,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591211127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199661876\">said</a>:</p>\n<blockquote>\n<p>That's great, so did they join here or what? Are you going to work with them?</p>\n</blockquote>\n<p>I see  at least one of them here, I hope they don't mind me calling them out:  <span class=\"user-mention\" data-user-id=\"308790\">@Merrick Hua</span>  would you like to introduce yourself?</p>",
        "id": 199662560,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591211369
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199662142\">said</a>:</p>\n<blockquote>\n<p>I think we have a lot of work to do in finding ways to present CT at a lower level.  Lawvere and Schanuel's book was a really bold attempt at that (CT for high schoolers); some people like it, others don't. But we're slowly figuring out how to teach CT meaningfully without lots of undergrad courses as prerequisites.  E.g. fifteen years ago there weren't many decent intros to CT (for meathematicians) other than Mac Lane's, which is often seen as rather demanding in terms of  prerequisites. Now there are a whole bunch that assume much less of the reader. It's a gradual process, and everything has to be classroom-tested and tinkered with and tested again, but there's definite progress being made.</p>\n</blockquote>\n<p>I tried teaching category theory to some (students including) undergrads last year in Germany, and I have to say it went pretty well. I wrote the lecture notes almost together with the students (<a href=\"https://arxiv.org/abs/1912.10642\">https://arxiv.org/abs/1912.10642</a>), and I think I've learned at least as much as they have. I would be very happy to discuss and compare the experiences with everyone else who has tried :)</p>",
        "id": 199663153,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591211555
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199661579\">said</a>:</p>\n<blockquote>\n<p>I guess what I mean is, (as far as I know) there's no chance for someone who just graduated high school to learn much category theory. It has prerequisites which are themselves undergrad-level subjects</p>\n</blockquote>\n<p>I could teach it without those prerequisites, e.g. by starting with lots of categories that are either easy to draw or come from everyday life.   But I would need to spend a lot of my time on it, because no books for that approach exist yet.    I also don't have much practice teaching people who just came out of high school.... <em>except</em> for teaching them calculus, where I have the advantage that the poor students <em>need</em> to take the course, and it's easy to be better than the other professors.</p>",
        "id": 199663278,
        "sender_full_name": "John Baez",
        "timestamp": 1591211631
    },
    {
        "content": "<p>So this would be an interesting use of time but also quite demanding.</p>",
        "id": 199663352,
        "sender_full_name": "John Baez",
        "timestamp": 1591211659
    },
    {
        "content": "<p>Hello! I am one of the aforementioned high schoolers! Personally, I find that the abstract nature of category theory is actually what draws me to it, but I do agree that the prerequisites necessary for getting a good grasp of category theory are rather inaccessible to most high schoolers. I've had the privilege of being able to access a lot more mathematical resources and receive a lot more guidance than the typical high schooler does, and one of my priorities is finding ways to help make sure more kids, especially those from underrepresented groups, have access to quality math resources to guide their learning. I'm very interested in the conversations about mentorship in this stream, and I would love to talk about that!</p>\n<p>(Sorry for taking so long to send this, I am completely new to Zulip and I'm still figuring things out.)</p>",
        "id": 199663440,
        "sender_full_name": "Merrick Hua",
        "timestamp": 1591211709
    },
    {
        "content": "<p>@ Tom Leinster<br>\nI am teaching high-school math to my teenage kids now. I try to approach it as if it were research. I get a sense that some topics are more difficult than others. Easier: Combinatorics, Geometry, Algebra, Programming. Difficult: Calculus, Logic. This is a very small sample and it is not clear to me whether there are general lessons to learn from this. But it didn't occur to me to teach them Category Theory ... I would think it is even more on the difficult side. But I am not sure, have to think about it ...</p>",
        "id": 199663480,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591211731
    },
    {
        "content": "<p>When I think of category theory for high school students, I think stuff like: tic-tac-toe is a category where the morphisms are moves, so is a Rubik's cube but this is a groupoid, etc.</p>",
        "id": 199663618,
        "sender_full_name": "John Baez",
        "timestamp": 1591211788
    },
    {
        "content": "<p>Getting around on a subway system is a category, with some morphisms invertible and others not, etc.</p>",
        "id": 199663698,
        "sender_full_name": "John Baez",
        "timestamp": 1591211822
    },
    {
        "content": "<p>I found Lawvere and Schanuel's book very inspiring. I understood it as an attempt to teach CT at  a high school level.  How successful it is is another question, but it's really audacious and throws up a lot of ideas.</p>",
        "id": 199663710,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591211830
    },
    {
        "content": "<p>I wouldn't at all try to do a \"conventional\" approach to category theory.   I'd do a unified very elementary course on groups, groupoids, monoids, posets, equivalence relations and other stuff, mainly based on examples!</p>",
        "id": 199663854,
        "sender_full_name": "John Baez",
        "timestamp": 1591211895
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199663618\">said</a>:</p>\n<blockquote>\n<p>When I think of category theory for high school students, I think stuff like: tic-tac-toe is a category where the morphisms are moves, so is a Rubik's cube but this is a groupoid, etc.</p>\n</blockquote>\n<p>But how do you show them that category theory does sth for you? That is what makes combinatorics, programming and even algebra easy to teach.</p>",
        "id": 199663886,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591211911
    },
    {
        "content": "<p>I don't think trying to get math to \"do something for you\" is particularly helpful at lower levels.  Apparently calculus helps you if you're a farmer trying to make an efficient fence... but does that make people interested in calculus?  Some, maybe, but not because it's truly helpful.</p>",
        "id": 199663989,
        "sender_full_name": "John Baez",
        "timestamp": 1591211969
    },
    {
        "content": "<p>Speaking for myself, I have a hard time even convincing people with advanced degrees that category theory \"does something for you\". (I mean, I know it does, but I have a hard time convincing them).</p>",
        "id": 199664110,
        "sender_full_name": "Gershom",
        "timestamp": 1591212026
    },
    {
        "content": "<p>Calculus is useful for being easy to write exam papers for?</p>",
        "id": 199664119,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591212030
    },
    {
        "content": "<p>I think students are much more willing to engage in formal games than we give them credit for: and let's face it, all those integration rules are just a formal game.</p>",
        "id": 199664122,
        "sender_full_name": "John Baez",
        "timestamp": 1591212031
    },
    {
        "content": "<p>\"does sth for you\" can be inside of mathematics ... algebra does geometry for you, combinatorics computes probability, programming can be used to find all fields of size 4, ...etc ... what mathematical problem does CT solve?</p>",
        "id": 199664193,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212075
    },
    {
        "content": "<p>Honestly I think \"answers how to organize knowledge\" matters a lot more to people that are still accumulating a lot of basic knowledge.</p>",
        "id": 199664212,
        "sender_full_name": "Gershom",
        "timestamp": 1591212088
    },
    {
        "content": "<p>\"What mathematical problem does CT solve?\" - I really don't like that attitude at all.</p>",
        "id": 199664243,
        "sender_full_name": "John Baez",
        "timestamp": 1591212106
    },
    {
        "content": "<p>It's more important to expand ones thinking than get a tool that solves problems you already want to solve.</p>",
        "id": 199664308,
        "sender_full_name": "John Baez",
        "timestamp": 1591212135
    },
    {
        "content": "<p>To understand that there are posets all over the place, for example... and groupoids....</p>\n<p>Of course you need to be excited about this to get students excited about it.</p>",
        "id": 199664384,
        "sender_full_name": "John Baez",
        "timestamp": 1591212184
    },
    {
        "content": "<p>Gershom, what knowledge would you want to organise to motivate CT to high-school students?</p>",
        "id": 199664424,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212213
    },
    {
        "content": "<p>My own 2 cents: I am currently working through Brendan Fong and David Spivak's 7 Sketches in Compositionality, and Tai-Danae Bradley's What is Applied Category Theory? I find them to be relatively accessible, and I think they do a pretty great job of showing what category theory can do for you.</p>",
        "id": 199664517,
        "sender_full_name": "Merrick Hua",
        "timestamp": 1591212254
    },
    {
        "content": "<p>Children can be surprisingly resistant to have their knowledge expanded.</p>",
        "id": 199664521,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212257
    },
    {
        "content": "<p>Thanks, Merrick, I will look at those.</p>",
        "id": 199664638,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212337
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199664384\">said</a>:</p>\n<blockquote>\n<p>To understand that there are posets all over the place, for example... and groupoids....</p>\n<p>Of course you need to be excited about this to get students excited about it.</p>\n</blockquote>\n<p>Honestly just getting the idea that there are posets, that is that there are things which are not linearly ordered, into the minds of the general population would probably do a lot of (very long-term) good in the world.</p>",
        "id": 199664748,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591212374
    },
    {
        "content": "<p>I'm very optimistic about children.... and I didn't say expanding their <em>knowledge</em>, I said expanding their <em>thinking</em>.</p>",
        "id": 199664857,
        "sender_full_name": "John Baez",
        "timestamp": 1591212445
    },
    {
        "content": "<p>I guess I would try to organize the class so that it included a lot of games.</p>",
        "id": 199665008,
        "sender_full_name": "John Baez",
        "timestamp": 1591212505
    },
    {
        "content": "<p>Anyway, I should try it sometime.</p>",
        "id": 199665049,
        "sender_full_name": "John Baez",
        "timestamp": 1591212523
    },
    {
        "content": "<p>I am, too, optimistic ... but to get them thinking you need pick them up where they are ... and then you need to engage them in work they can do. I just dont see how to do this with posets or CT ... probably my own limitations here ...</p>",
        "id": 199665076,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212533
    },
    {
        "content": "<p>Well you might start with universal properties, and show why a variety of different sorts of \"multiplication\" are the same, etc. You can talk about faithful functors and explain how to organize the fact that naturals embed into integers embed into rationals, etc. Groups, monoids, etc. as John says. Universal algebra. Assuming a bit more background, one can do a simple  version of the category of vector spaces.</p>",
        "id": 199665098,
        "sender_full_name": "Gershom",
        "timestamp": 1591212541
    },
    {
        "content": "<p>Gershom is talking about a lot more advanced stuff than I was talking about.</p>",
        "id": 199665148,
        "sender_full_name": "John Baez",
        "timestamp": 1591212566
    },
    {
        "content": "<p>I was imagining kids right out of high school, and I was mainly imagining showing them that the world is made of categories... using lots of examples.  But yes, it would be good to get into some functors, like embedding the integers into the rationals, or embedding a small subway system into a bigger one.</p>",
        "id": 199665297,
        "sender_full_name": "John Baez",
        "timestamp": 1591212611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199665098\">said</a>:</p>\n<blockquote>\n<p>Well you might start with universal properties, and show why a variety of different sorts of \"multiplication\" are the same</p>\n</blockquote>\n<p>\"same\" is already difficult ... when do two multiplication tables represent isomorphic groups ... how do you prepare the mind of a student so that when they see the concept of isomorphism they go \"Heureka, that is the concept that I was missing!\"</p>",
        "id": 199665377,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212658
    },
    {
        "content": "<p>if you don't have the narrative that prepares their minds, they will just look at you and not learn anything</p>",
        "id": 199665481,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212704
    },
    {
        "content": "<p>That's true.</p>",
        "id": 199665617,
        "sender_full_name": "John Baez",
        "timestamp": 1591212742
    },
    {
        "content": "<p>I teach my CS undergrads a bit of category theory. But universal algebra is really hard for them. Not because it is objectively hard, but because they don't have the landscape in mind where they can hang up the abstract concepts.</p>",
        "id": 199665786,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591212832
    },
    {
        "content": "<p>I would never try universal algebra to students just out of high school, because this only makes sense if you already know and love a bunch of varieties.</p>",
        "id": 199666461,
        "sender_full_name": "John Baez",
        "timestamp": 1591213145
    },
    {
        "content": "<p>I'd be more inclined to explain very basic group theory, poset theory, groupoid theory and equivalence relation theory from the perspective that it's all category theory... based on real-world examples.</p>",
        "id": 199666629,
        "sender_full_name": "John Baez",
        "timestamp": 1591213213
    },
    {
        "content": "<p>And when I say \"very basic group theory\" I mean things like \"what's a group\" and then maybe \"what does it mean for two groups to be isomorphic?\"   The latter could be done like this: I've got a 4x4 addition table, but it's written in code.  Could it secretly be the same as addition mod 4?</p>",
        "id": 199666819,
        "sender_full_name": "John Baez",
        "timestamp": 1591213286
    },
    {
        "content": "<p>fair enough, i think i was adjusted more to 3rd year undergrad -- its hard to remember just how little you get just out of HS!</p>",
        "id": 199666835,
        "sender_full_name": "Gershom",
        "timestamp": 1591213292
    },
    {
        "content": "<p>In the US some students get almost a negative amount.</p>",
        "id": 199666863,
        "sender_full_name": "John Baez",
        "timestamp": 1591213313
    },
    {
        "content": "<p>arguably a lot of lawvere and schanuel's appeal is \"we're just going to tell you about Set, but using some basic categorical tools that capture some universality of these constructions\"</p>",
        "id": 199667064,
        "sender_full_name": "Gershom",
        "timestamp": 1591213395
    },
    {
        "content": "<p>Do you really mean Lawvere &amp; Schanuel (_Conceptual Mathematics_) as opposed to Lawvere &amp; Rosebrugh (_Sets for Mathematics_)?</p>",
        "id": 199667954,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591213809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199666819\">said</a>:</p>\n<blockquote>\n<p>And when I say \"very basic group theory\" I mean things like \"what's a group\" and then maybe \"what does it mean for two groups to be isomorphic?\"   The latter could be done like this: I've got a 4x4 addition table, but it's written in code.  Could it secretly be the same as addition mod 4?</p>\n</blockquote>\n<p>I try this right now with my kids ... i will know in a couple of weeks how that worked ...</p>",
        "id": 199679706,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591220019
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199666461\">said</a>:</p>\n<blockquote>\n<p>I would never try universal algebra to students just out of high school, because this only makes sense if you already know and love a bunch of varieties.</p>\n</blockquote>\n<p>universal algebra makes sense for CS students for two reasons: algebras are data types and as long as you dont have name binding rewriting is equational reasoning in UA ... in particular, the rules of congruence and substitutions are pattern matching ... of course, one can explain rewriting without  UA, but if you also want to talk about the semantics (which makes sense in CS) you dont gain much by not talking about UA.</p>",
        "id": 199680180,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591220260
    },
    {
        "content": "<p>what CS students find difficult in this context is the notion of equivalence (or congruence) relation and that providing semantics is taking a quotient ... but these concepts are important in programming languages, so I do insist ...</p>",
        "id": 199680536,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591220453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199664243\">said</a>:</p>\n<blockquote>\n<p>\"What mathematical problem does CT solve?\" - I really don't like that attitude at all.</p>\n</blockquote>\n<p>Maybe I can reformulate: What question does CT answer? ... And I am interested here in questions that can be motivated at high-school level.</p>",
        "id": 199680701,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591220545
    },
    {
        "content": "<p>Fundamentally I don't think CT answers a question.  I think it blows your mind and makes you able to ask a lot of questions.</p>",
        "id": 199681239,
        "sender_full_name": "John Baez",
        "timestamp": 1591220866
    },
    {
        "content": "<p>Of course there are lots of ways to teach category theory, and your way sounds more \"pragmatic\" than mine.</p>",
        "id": 199681448,
        "sender_full_name": "John Baez",
        "timestamp": 1591220992
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199681239\">said</a>:</p>\n<blockquote>\n<p>Fundamentally I don't think CT answers a question.  I think it blows your mind and makes you able to ask a lot of questions.</p>\n</blockquote>\n<p>That is where it is very close to (great) philosophy.</p>",
        "id": 199681533,
        "sender_full_name": "Henry Story",
        "timestamp": 1591221025
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199661579\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/stream.20events/near/199661175\">said</a>:</p>\n<blockquote>\n<p>I know what you mean, Jules, but I'm not sure I totally buy it. There's no objective scale of \"abstraction\" (whatever that means) and even if there is, it certainly doesn't correlate to a scale of difficulty.  Most (not all) of us probably find category theory much easier than the supposedly more concrete theory of PDEs, for example.  I don't think we should accept that category theory needs to be any more difficult or mysterious than other branches of maths.</p>\n</blockquote>\n<p>I guess what I mean is, (as far as I know) there's no chance for someone who just graduated high school to learn much category theory. It has prerequisites which are themselves undergrad-level subjects</p>\n</blockquote>\n<p>I totally disagree with this. Personally, I've successfully thaught CT to people that didn't have any background in math. Actually that's what <a href=\"http://training.statebox.org\">training.statebox.org</a> is for.</p>",
        "id": 199681581,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221071
    },
    {
        "content": "<p>So, our approach is mainly focused at businesses and not at kids, but the idea is similar: We take people from any background and teach them CT. In our particular case, I've developed the following points that people might find useful:</p>",
        "id": 199681700,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221142
    },
    {
        "content": "<p>Teaching a semester course in academia and teaching to \"random people\" are two very different beasts. And it's not a matter of prerequisites, it's the fact that people have a life and a job and most often than not they cannot be consistent in learning. Simply put, you cannot ask someone with a job to dedicate several days of their week to learn CT.</p>",
        "id": 199681775,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221205
    },
    {
        "content": "<p>For this we developed a crash course approach. It's literally 4 days, roughly 9 hours a day, in which we do the equivalent of a whole semester. It is not easy at all (not for the students, not for me), but the idea of having a \"category theory horror camp\" someone keeps people motivated. It's like a sprint, you know you have to resist 4 days and things will be easier afterwards.</p>",
        "id": 199681924,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221279
    },
    {
        "content": "<p>Also, I don't think books are a great tool to teach, at least not to the people that come to us. This is because, again, book require consistency.</p>",
        "id": 199681966,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221303
    },
    {
        "content": "<p>So what we do is: very little canned material, and just do things socratically, stimulating a constant conversation with the students.</p>",
        "id": 199682002,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221327
    },
    {
        "content": "<p>Also, this is the ONLY way to remember so much material in so little time. You remember it if you attach emotional value to it, if you build the theory by yourself as you progress.</p>",
        "id": 199682048,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221354
    },
    {
        "content": "<p>Importantly, for this approach to work we set a limit of 10ppl per course. I literally cannot manage a group bigger than that.</p>",
        "id": 199682121,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221375
    },
    {
        "content": "<p>Now, if me, a total no one with barely a \"real\" CT experience can teach CT to random people without a mathematics background, I am 100% sure that everyone else can. And, most importantly, I am 100% sure that everyone else can learn.</p>",
        "id": 199682195,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221427
    },
    {
        "content": "<p>There are also some very important subtleties worth mentioning: I like to act like a \"random guy that knows a bit of CT\" when I teach. I really DO NOT like to inspire any sort of reverence in my students. Reverence is something that makes people afraid to ask questions, cos they don't want to look stupid. If the atmosphere is instead super friendly, people won't be ashamed to say \"sorry I didn't understand shit\"</p>",
        "id": 199682353,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221514
    },
    {
        "content": "<p>So, I think the real way to \"diffuse\" CT is to adopt an approach like this. Crash courses, enable people to consult a CT book without going mad if they need to. That's my 2cents. I can go more in detail if someone has more questions about \"how's like to teach CT to random people\" xD</p>",
        "id": 199682608,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221656
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199681239\">said</a>:</p>\n<blockquote>\n<p>Fundamentally I don't think CT answers a question.  I think it blows your mind and makes you able to ask a lot of questions.</p>\n</blockquote>\n<p>But you need to create a landscape, a view, expectations before CT (or anything for that matter) can blow the students′ mind. How as a teacher do you create this without asking questions?</p>",
        "id": 199682631,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591221671
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199681911\">said</a>:</p>\n<blockquote>\n<p>To add to that, I've noticed there are people here who are more philosophically inclined. Another approach, which may appeal to those who have developed an aversion to \"mathematics\", is perhaps to mine this connection with philosophy.</p>\n</blockquote>\n<p>There is of course <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> who knows his way around philosophy and CT very well.<br>\nHe is also very interested (as are many) in Robert Brandom's work on Analytic Pragmatism (mentioning that since <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> is talking about pragmatic approaches)</p>",
        "id": 199682645,
        "sender_full_name": "Henry Story",
        "timestamp": 1591221684
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199682002\">said</a>:</p>\n<blockquote>\n<p>So what we do is: very little canned material, and just do things socratically, stimulating a constant conversation with the students.</p>\n</blockquote>\n<p>I think I get this ... socratically means asking questions, right?</p>",
        "id": 199682731,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591221725
    },
    {
        "content": "<p>So, for instance: Give the motivation for category. Then give some examples of categories. Then ask the people \"give me two examples of categories\".</p>",
        "id": 199682740,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221732
    },
    {
        "content": "<p>Yes, that's what I mean</p>",
        "id": 199682749,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221742
    },
    {
        "content": "<p>Fabrizio, if you adapted this to high-school students, how would you start?</p>",
        "id": 199682798,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591221783
    },
    {
        "content": "<p>Also: Give the definition of product in Sets. Explain that you want to abstract this and give the definition of product categorically. Then ask: Can we do the same with disjoint unions? Work out with the students towards the definition</p>",
        "id": 199682805,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221787
    },
    {
        "content": "<p>Then abstract further, ask: Do you see the similarities? And slowly work towards the categorical definition of limit and colimit</p>",
        "id": 199682861,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221824
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199682798\">said</a>:</p>\n<blockquote>\n<p>Fabrizio, if you adapted this to high-school students, how would you start?</p>\n</blockquote>\n<p>I think the most important things with high school students is understanding what they care about</p>",
        "id": 199682922,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221844
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span> has a nice take on this when he explains string diagrams as \"plugging guitar amps together\"</p>",
        "id": 199682946,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221872
    },
    {
        "content": "<p>So you could be like: Do you know guitars? Cool, you have wires and pedals and stuff, right? And you use this to \"present\" the definition of category. And this will naturally beg the question \"yes but how do I connect things in parallel?\" and then you'll be ready to introduce monoidal categories automagically.</p>",
        "id": 199683015,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221931
    },
    {
        "content": "<p>You CREATED the motivation to introduce them. Then you may ask \"but what if I want a CANONICAL way to connect things?\" Boom, you get limits and colimits.</p>",
        "id": 199683045,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221960
    },
    {
        "content": "<p>I think the best way to explain things is by introducing a problem. As soon as there's a problem, interested people will try to devise ways to fix it. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 199683129,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591221996
    },
    {
        "content": "<p>E.g. \"monoidal categories are cool, but what if I want to copy stuff around? What if I want to discard stuff?\"</p>",
        "id": 199683155,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222024
    },
    {
        "content": "<p>Thanks, Fabrizio. But then you also need to go on to things they can do with this. You use legos to build sth. How do you get on to this?</p>",
        "id": 199683173,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591222044
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683141\">said</a>:</p>\n<blockquote>\n<p>But what if I hate guitars? What if I only play the piano?</p>\n</blockquote>\n<p>Then you talk about synths, maybe playing some Giorgio Moroder in the background. :D</p>",
        "id": 199683178,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222052
    },
    {
        "content": "<p>You know those synths with a lot of wires and stuff? BTW this is how Jelle got interested in CT...</p>",
        "id": 199683206,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222073
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683173\">said</a>:</p>\n<blockquote>\n<p>Thanks, Fabrizio. But then you also need to go on to things they can do with this. You use legos to build sth. How do you get on to this?</p>\n</blockquote>\n<p>Well as soon as they are deep enough into CT the motivation can be CT itself. So pretty soon you can drop the \"real life examples\", and actually work the other way around: You introduce new CT concepts and then show some applications</p>",
        "id": 199683333,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222159
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683296\">said</a>:</p>\n<blockquote>\n<p>It's baroque or bust.</p>\n</blockquote>\n<p>I am a classical pianist myself, but lately I dropped even the baroque to listen to Antonio de Cabezon and 16th century music :P At some point I went all the way back to Kassa, wonderful 9th century Bizantine stuff :D</p>",
        "id": 199683418,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222206
    },
    {
        "content": "<p>I just remembered Dan Ghica's SYCO 5 talk about his experience teaching categorically-inclined knot theory to <em>primary</em> school children. There should be a video of that around somewhere</p>",
        "id": 199683486,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591222271
    },
    {
        "content": "<p>In any case, I think that the real difference when your group of students is small is that to teach well you have to do a lot of improvisation. In small groups the feedback you get is way clearer I think, there's less \"noise\", and this can be really a great thing if you are flexible enough to adapt</p>",
        "id": 199683490,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222274
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683206\">said</a>:</p>\n<blockquote>\n<p>You know those synths with a lot of wires and stuff? BTW this is how Jelle got interested in CT...</p>\n</blockquote>\n<p>I get that part ... my son recently started composing with a DAW (FL Studio) and it was really nice to see how much structure there is ... but while I can easily see that much of this structure can be modelled with CT, I wouldn't see how CT could be actually useful to compose music ...</p>",
        "id": 199683536,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591222314
    },
    {
        "content": "<p>semi-tangential to this, I think it would be really cool to \"discover\" group theory in a CT course by looking at one-object categories, one-object groupoids, asking about the structure of this category, using ct ideas to study it, ???, Yoneda-Cayley, and eventually somehow the Sylow theorems.</p>",
        "id": 199683545,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591222319
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683536\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683206\">said</a>:</p>\n<blockquote>\n<p>You know those synths with a lot of wires and stuff? BTW this is how Jelle got interested in CT...</p>\n</blockquote>\n<p>I get that part ... my son recently started composing with a DAW (FL Studio) and it was really nice to see how much structure there is ... but while I can easily see that much of this structure can be modelled with CT, I wouldn't see how CT could be actually useful to compose music ...</p>\n</blockquote>\n<p>I don't know if the best approach is trying to make CT look useful in this context. It's more like, you can use Fruity Loops as an example of process, and abstracting from there ask \"Doesn't this make the idea of 'process' interesting per sé?\"</p>",
        "id": 199683693,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222405
    },
    {
        "content": "<p>Anyway, we're having another course in June, which I made techinically more intense. We go from 0 to showing that presheaf categories have exponential objects, which I think it's a very nice kind of proof. I'll let you all know how it goes <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 199683920,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222549
    },
    {
        "content": "<p>(Along the way we do a lot of stuff. Monads, monoidal categories, optics, wiring diagrams, limits, colimits, adjunctions, etc )</p>",
        "id": 199684005,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222590
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683545\">said</a>:</p>\n<blockquote>\n<p>semi-tangential to this, I think it would be really cool to \"discover\" group theory in a CT course by looking at one-object categories, one-object groupoids, asking about the structure of this category, using ct ideas to study it, ???, Yoneda-Cayley, and eventually somehow the Sylow theorems.</p>\n</blockquote>\n<p>How do you get from studying objects to studying their automorphisms? I am sure it can be done, but is not easy to find a good story. Solving the rubik cube is a classic. But to actually develop this example in some credible detail takes a lot of work. Of course, if you are teaching maths undergrads you don't need a story, you can always just go on with the material ...  and leave the rubik cube as an exercise ...</p>",
        "id": 199684009,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591222595
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199684000\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683536\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199683206\">said</a>:</p>\n<blockquote>\n<p>You know those synths with a lot of wires and stuff? BTW this is how Jelle got interested in CT...</p>\n</blockquote>\n<p>I wouldn't see how CT could be actually useful to compose music ...</p>\n</blockquote>\n<p>Guerino Mazzola has actually written a book about that.</p>\n</blockquote>\n<p>I know ... but do you think this book could help to teach CT?</p>",
        "id": 199684173,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591222708
    },
    {
        "content": "<p>If you can motivate isomorphisms, I think it's a short jump to get to automorphisms.</p>",
        "id": 199684174,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591222709
    },
    {
        "content": "<p>Though isomorphisms seem more practical initially: they make it legal to substitute something that has a nicer form even though its the same thing basically.</p>",
        "id": 199684378,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591222825
    },
    {
        "content": "<p>Another REAL cool thing, I think, is too just point out how learning some CT literally increases your cognitive abilities. Best example of this: Say you teach Yoneda. Clearly no one understands anything. I mean they do maybe but then they are \"but why?\" Then you start doing stuff like the exponentials in presheaf categories, or other theorems where you heavily use Yoneda to get your definitions. At that point it clicks. People start understanding that \"wait, so this thing is like a sort of magical oracle! I postulate properties and it spits out candidates to satisfy that property?!\"</p>",
        "id": 199684636,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591222995
    },
    {
        "content": "<p>At that point you really want to stop. You just say \"stop for a second. Now that you get it, think for a second about how f*ing dope this is. You didn't just learn a theorem, you learnt a completely new perspective to view life.\"</p>",
        "id": 199684751,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591223053
    },
    {
        "content": "<p>That is the time when people realize that through CT they really broadened their cognitive abilities. They gained the ability to think relatively to other objects. When people realize this you really want them to stop and realize that they realized. :D</p>",
        "id": 199684837,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591223111
    },
    {
        "content": "<p>I like to think of CT as an axiomatic theory of structure preserving maps. (Of course, it is more than that, but also that.) A nice beginners example is the clock, which is a structure preserving morphism from the integers to Z/12. Structure preservation means that the clock is neither fast nor late. In your experience of teaching CT, when does this idea of CT as an axiomatic theory of structure show up?</p>",
        "id": 199701202,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1591240549
    },
    {
        "content": "<p>Maybe CT can also be seen as a theory in which objects interact in a \"nice\" way. I think that in teaching CT to beginners the greatest challenge is to make them think categorically and appreciate the categorical way of thinking.</p>",
        "id": 199708002,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1591250303
    },
    {
        "content": "<p>Hello all, I'm the other aforementioned high schooler. Sorry I'm a little late to the conversation, but I'm in Hong Kong, so I went to bed immediately after the seminar ended and I just saw all this activity on Zulip. <br>\nFirst of all, I'd like to say that I'm truly humbled to have the opportunity to join this conversation, and it makes me really encouraged to see not only my fellow classmates around me but also older students and adults in this community talking about these issues of access and equity, especially for underprivileged students. <br>\nSecond, I think it's worthwhile to reiterate what <span class=\"user-mention\" data-user-id=\"308790\">@Merrick Hua</span>  said earlier; the two of us are definitely not representative of a typical high schooler, and the two of us have been incredibly privileged in terms of support, guidance, and access to opportunities to learn advanced mathematics. I myself am lucky enough to be attending an amazing high school with tons of resources and guidance for its students (I attend a private boarding school on the East coast), and if anything, the fact that I'm now invited to a conversation with academics in category theory is definitely another marker of that privilege. Recently, I've been thinking a lot about how I can use my own privilege to listen to and raise the voices of those who have had their voices silenced or diminished, and I'd be open to any insights or ideas about what I can do, if anything, to promote inclusion and diversity in the category theory community and the mathematics community as a whole. <br>\nI suppose this naturally leads me to a question that I've been thinking about, which I hope might spur some discussion. Many of the anecdotes and examples of actions we can <em>do</em> to promote inclusivity and equity of access to opportunities to study mathematics have been from people who have the power to take actions that can lead to real change, be it through running a research group for minorities in ACT, or canceling class as a gesture of solidarity. But, what are ways that younger students such as myself could push for change? I've been reading a lot and trying to educate myself, but I'm curious to see if any of you in the mathematics community have any insights. <br>\nThis got a lot longer than I originally meant for an introduction (oops), but I hope that we can keep talking about this.</p>",
        "id": 199714672,
        "sender_full_name": "Andrew Lee",
        "timestamp": 1591257052
    },
    {
        "content": "<p>Eugenia Cheng has done a lot of general-public-accessible category theory, through her books (which include some of the examples that have been discussed above, developed from first principles), and through public lectures.<br>\nI would like to draw attention to <a href=\"https://media.ed.ac.uk/media/Category+Theory+July+2019+Eugenia+Cheng+Public+Lecture/1_5hy0j4ne/51612401\">her talk from last year</a>, which a bunch of the people here attended, due to it happening during the Category Theory 2019 conference.<br>\nThere are some valuable teaching lessons in there, since she discusses her teaching of category theory (and maths more generally) to arts students. There is also a <strong>great</strong> categorical explanation of relative privilege and intersectionality which feels very relevant right now. Finally, there is some original and relevant discussion of two contrasting attitudes/approaches to the practice of mathematics, teaching and research. I highly recommend.</p>",
        "id": 199732438,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591269502
    },
    {
        "content": "<p>Here is an example of how you can teach categories to very young children.   Look how much fun she's having!!!</p>",
        "id": 199772268,
        "sender_full_name": "John Baez",
        "timestamp": 1591287679
    },
    {
        "content": "<p><a href=\"https://twitter.com/dodecahedra/status/1268342653143441411\">https://twitter.com/dodecahedra/status/1268342653143441411</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/dodecahedra/status/1268342653143441411\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/3232494514/760c72bca0af20fac2cd61bcec557e7a_normal.jpeg\"></a><p>This finite state machine accepts all strings with an “aa” or “bb” substring. <a href=\"https://t.co/7O6dKDBB75\">https://twitter.com/dodecahedra/status/1268342653143441411/video/1</a></p><span>- William Rose (@dodecahedra)</span></div></div>",
        "id": 199772274,
        "sender_full_name": "John Baez",
        "timestamp": 1591287683
    },
    {
        "content": "<p>Note, she is not asking what problems this will help her solve.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 199772492,
        "sender_full_name": "John Baez",
        "timestamp": 1591287770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199679706\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199666819\">said</a>:</p>\n<blockquote>\n<p>And when I say \"very basic group theory\" I mean things like \"what's a group\" and then maybe \"what does it mean for two groups to be isomorphic?\"   The latter could be done like this: I've got a 4x4 addition table, but it's written in code.  Could it secretly be the same as addition mod 4?</p>\n</blockquote>\n<p>I try this right now with my kids ... i will know in a couple of weeks how that worked ...</p>\n</blockquote>\n<p>In Oxford I did a few public lectures/interactive classes for primary school students in an outreach program run by Marcus du Sautoy: <a href=\"https://www.oxfordsparks.ox.ac.uk/content/marcus-marvellous-mathemagicians\">https://www.oxfordsparks.ox.ac.uk/content/marcus-marvellous-mathemagicians</a></p>\n<p>They had a bunch of great examples along these lines (ie. enlightening isomorphisms between elementary groups/posets/categories) that students (and I) really enjoyed. One example recalling John's tic-tac-toe comment above is as follows: consider the 2-player game in which players take turns naming a number between 1 and 9 (inclusive). No number can be named twice. The first player to name three numbers that add to 15 wins. </p>\n<p>Students often found this game novel, and difficult to analyse. But an isomorphism can be constructed with tic-tac-toe, at which point many (perhaps from previous experience) found the game easy. I really enjoyed discovering this, and I think the students did too. It's a nice example of the power of a well-chosen isomorphism.</p>\n<p>I'm not sure whether the teaching materials for the program are available anywhere (I no longer have copies) but they seem to have a YouTube channel, and I think more of these sorts of games can be found there.</p>",
        "id": 199792927,
        "sender_full_name": "Brendan Fong",
        "timestamp": 1591297211
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276053\">Brendan Fong</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199792927\">said</a>:</p>\n<blockquote>\n<p>... consider the 2-player game in which players take turns naming a number between 1 and 9 (inclusive). No number can be named twice. The first player to name three numbers that add to 15 wins. </p>\n<p>Students often found this game novel, and difficult to analyse. But an isomorphism can be constructed with tic-tac-toe, at which point many (perhaps from previous experience) found the game easy. I really enjoyed discovering this, and I think the students did too. It's a nice example of the power of a well-chosen isomorphism.</p>\n</blockquote>\n<p>That's great!  Even if you'd never played tic-tac-toe, I think it's a lot easier to detect all ways for a set of X's in a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mn>3</mn><mo>×</mo><mn>3</mn></mrow><annotation encoding=\"application/x-tex\">3\\times 3</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.72777em;vertical-align:-0.08333em;\"></span><span class=\"mord\">3</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">×</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">3</span></span></span></span> grid to be extended to a line than to detect all ways for a subset of {1,...,9} to be extended to a subset containing a triple that sums to 15.</p>",
        "id": 199793658,
        "sender_full_name": "John Baez",
        "timestamp": 1591297622
    },
    {
        "content": "<p>The human visual system has a lot of powerful computing ability that doesn't require verbal reasoning.</p>",
        "id": 199793878,
        "sender_full_name": "John Baez",
        "timestamp": 1591297732
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199662142\">said</a>:</p>\n<blockquote>\n<p>I think we have a lot of work to do in finding ways to present CT at a lower level.  Lawvere and Schanuel's book was a really bold attempt at that (CT for high schoolers); some people like it, others don't. But we're slowly figuring out how to teach CT meaningfully without lots of undergrad courses as prerequisites.  E.g. fifteen years ago there weren't many decent intros to CT (for meathematicians) other than Mac Lane's, which is often seen as rather demanding in terms of  prerequisites. Now there are a whole bunch that assume much less of the reader. It's a gradual process, and everything has to be classroom-tested and tinkered with and tested again, but there's definite progress being made.</p>\n</blockquote>\n<p>Yes. I hope Seven Sketches has been a step in this direction. I think CT is definitely accessible to high schoolers, and I think a number have enjoyed Seven Sketches. Indeed, from our experience with Seven Sketches, it seems to me many without a university-level maths background can appreciate an introduction along the lines John suggests: an example-driven, play-filled introduction to groupoids, monoids, posets, and so on. I'm sure -- with a suitable amount of classroom-testing and refinement, as Tom already notes is critically important -- a really fun and accessible course could be developed along these lines.</p>",
        "id": 199794207,
        "sender_full_name": "Brendan Fong",
        "timestamp": 1591297906
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276053\">@Brendan Fong</span> I am definitely one of the high schoolers who has enjoyed Seven Sketches <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> !  In particular, I love that there are many motivating examples in the book to guide my learning (the lemon meringue pie example is an especially enjoyable one). If you or <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> or anyone else ends up developing a CT course for younger students, I'd love to help test that out! I run a math circle program that regularly teaches elementary and middle school students in my community, and I would definitely be interested in teaching them some basic CT concepts.</p>",
        "id": 199798991,
        "sender_full_name": "Merrick Hua",
        "timestamp": 1591299665
    },
    {
        "content": "<p>Brendan wrote: \"consider the 2-player game in which players take turns naming a number between 1 and 9 (inclusive). No number can be named twice. The first player to name three numbers that add to 15 wins. Students often found this game novel, and difficult to analyse. But an isomorphism can be constructed with tic-tac-toe.\"</p>\n<p>That's a fantastic example of an isomorphism. If I understand correctly, it depends on two things: (i) there exists a 3x3 magic square with entries 1, ..., 9 (in fact, up to symmetry, there's only one such square), and (ii) in that  square, the <em>only</em> triples that sum to 15 are the tic-tac-toe lines.  I hadn't realized that (ii) was true, not that I'm any kind of magic square expert.</p>",
        "id": 199805086,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591302909
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277067\">Tom Leinster</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199805086\">said</a>:</p>\n<blockquote>\n<p>Brendan wrote: \"consider the 2-player game in which players take turns naming a number between 1 and 9 (inclusive). No number can be named twice. The first player to name three numbers that add to 15 wins. Students often found this game novel, and difficult to analyse. But an isomorphism can be constructed with tic-tac-toe.\"</p>\n<p>That's a fantastic example of an isomorphism. If I understand correctly, it depends on two things: (i) there exists a 3x3 magic square with entries 1, ..., 9 (in fact, up to symmetry, there's only one such square), and (ii) in that  square, the <em>only</em> triples that sum to 15 are the tic-tac-toe lines.  I hadn't realized that (ii) was true, not that I'm any kind of magic square expert.</p>\n</blockquote>\n<p>Yes! My math teacher used this example when we started talking about isomorphisms in our little intro to abstract algebra unit. We also learned a little about knot polynomials, which was pretty cool.</p>",
        "id": 199838196,
        "sender_full_name": "Andrew Lee",
        "timestamp": 1591336213
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Here's an MRI of Temple Grandin's brain for an example of visual processing.<br>\n<a href=\"/user_uploads/21317/PNORnUcYne3o6RmPAxvtAgcp/autistic_brain.png\">autistic_brain.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/PNORnUcYne3o6RmPAxvtAgcp/autistic_brain.png\" title=\"autistic_brain.png\"><img src=\"/user_uploads/21317/PNORnUcYne3o6RmPAxvtAgcp/autistic_brain.png\"></a></div>",
        "id": 199960477,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1591427452
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/199661446\">said</a>:</p>\n<blockquote>\n<p>One way to increase diversity might be to try the crazy thing I think we've all thought of trying: teaching category theory to younger students who don't already know tons of other math.</p>\n</blockquote>\n<p>It might not be as problematic as you'd think, if it's done in the context of logic / critical thinking. There is a growing school of thought in psychology that developed out of behaviorism called Relational Frame Theory. This school of thought lends support to the view that <em>basic</em> categorical thinking is quite natural, and can probably be learned early––not as a replacement for early math education but as logic training. According to this theory, humans learn language, critical thinking and many other skills by developing increasingly sophisticated relational associations among stimuli. The two relations that researchers have focused on so far are (1) opposites and equivalences and (2) orders (transitive antisymmetric relations such as taxonomies, implications, etc). For example, at a young age, a child might speciously hypothesize that a man is the opposite of a woman, but then develop a more sophisticated relational frame for gender as counter-examples accumulate. At a later age, a child can learn to parse increasingly byzantine arguments by developing the skill of wrangling the admissible and inadmissible transitivities among material implications. (read, compositionality in arguments)</p>\n<p>Research results in the field are still settling, but Relational Frame Theory has found applications in Clinical Behavior Analysis (used for special education students with communication difficulties), Acceptance and Commitment Therapy (a form of cognitive behavioral therapy) and in cognitive psychology more broadly. There are even psychologists who have developed Relational Skills Training methods that teach students to parse elaborate sets of predicates consisting of opposites / equivalences or orders using nonsense words to stand in for variables. These psychologists claim that the intervention can substantially increase a person's verbal IQ, which is considered to be the harder subset to train. However, the studies on this are usually sponsored by scientists with a stake in selling their techniques, so a grain of skepticism is appropriate.</p>\n<p>In my view, much of basic Category Theory is––in part––the study of these and more sophisticated relational frames per se (in isolation). I am so confident of this that one of my medium term research projects is to develop more sophisticated relational skills training methods based on the gamut of basic categorical concepts ranging from idempotence to adjunctions. Maybe I'm wrong about this, but it seems like––at the very least––teaching kids to explicitly think about compositionality, commutativity and perhaps even functoriality, naturality, universality, etc. is both within reach and potentially highly beneficial. The catch is, you'd have to pitch it as \"logic\" training rather than as \"math\" because parents would ask \"Where are the numbers? Where's the 'rhithmatic?\" It could be posed as laying the foundations for computer science and programming skills.</p>",
        "id": 200042583,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1591564386
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/200042583\">said</a>:</p>\n<blockquote>\n<p>The catch is, you'd have to pitch it as \"logic\" training rather than as \"math\" because parents would ask \"Where are the numbers? Where's the 'rhithmatic?\" It could be posed as laying the foundations for computer science and programming skills.</p>\n</blockquote>\n<p>Discrete maths can still come under maths, and that's what some aspects of category theory can look like to the outside observer. Also, there's nothing stopping numbers from appearing; indeed, I feel no shame in putting in a second recommendation for <a href=\"https://media.ed.ac.uk/media/Category+Theory+July+2019+Eugenia+Cheng+Public+Lecture/1_5hy0j4ne/51612401\">Eugenia Cheng's talk</a>, which features the lattice of divisors of 30 as a lovely example of how category theory can lend geometric intuition to number theory.</p>",
        "id": 200077387,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591610334
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/200077387\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/teaching.20CT/near/200042583\">said</a>:</p>\n<blockquote>\n<p>The catch is, you'd have to pitch it as \"logic\" training rather than as \"math\" because parents would ask \"Where are the numbers? Where's the 'rhithmatic?\" It could be posed as laying the foundations for computer science and programming skills.</p>\n</blockquote>\n<p>Discrete maths can still come under maths, and that's what some aspects of category theory can look like to the outside observer. Also, there's nothing stopping numbers from appearing; indeed, I feel no shame in putting in a second recommendation for <a href=\"https://media.ed.ac.uk/media/Category+Theory+July+2019+Eugenia+Cheng+Public+Lecture/1_5hy0j4ne/51612401\">Eugenia Cheng's talk</a>, which features the lattice of divisors of 30 as a lovely example of how category theory can lend geometric intuition to number theory.</p>\n</blockquote>\n<p>Sure. If it works, it works!</p>",
        "id": 200090664,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1591619708
    },
    {
        "content": "<p>Hi all! In the context of <a href=\"http://act2020.mit.edu\">ACT 2020</a> we will have a <a href=\"http://act2020.mit.edu/#tutorialday\">tutorial day</a> where four of us will give introductory talks about topics in category theory. In particular:</p>\n<ul>\n<li>David Spivak - Categorical data: introducing sets, categories, and functors. <a href=\"#narrow/stream/243068-ACT-2020/topic/Tutorial.3A.20Categorical.20Data.20(David.20Spivak)\">Abstract and dedicated thread here</a>.</li>\n<li>Fabrizio Genovese - An introduction to string diagrams. <a href=\"#narrow/stream/243068-ACT-2020/topic/Tutorial.3A.20String.20Diagrams.20(Fabrizio.20Genovese)\">Abstract and dedicated thread here</a>.</li>\n<li>Emily Riehl - The Yoneda lemma in the category of matrices. <a href=\"#narrow/stream/243068-ACT-2020/topic/Tutorial.3A.20Yoneda.20Lemma.20and.20Matrices.20(Emily.20Riehl)\">Abstract and dedicated thread here</a>.</li>\n<li>Paolo Perrone - Monads and comonads. <a href=\"#narrow/stream/243068-ACT-2020/topic/Tutorial.3A.20Monads.20and.20Comonads.20(Paolo.20Perrone)\">Abstract and dedicated thread here</a>.</li>\n</ul>\n<p>More information will be available soon.</p>",
        "id": 201019669,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1592316307
    },
    {
        "content": "<p>Howdy folks, I just spoke with my best friend about what we are doing to promote early mathematical education by teaching CT. My friend is a senior analyst at the Dept of Ed who deals with vocational education. Rarely do our purposes align so that we can do a project together, but CT education seems to be an exception. <br>\nNOTE: the armed services are very interested in vocational training and have large amounts of money  to devote. If we are to do something collectively we should be comfortable with our partners. FYI - I was in the Air Force and worked as a consultant for a number of governmental departments, particularly the State Dept.</p>",
        "id": 201064766,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1592336766
    }
]