[
    {
        "content": "<p>Some folks like <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span> and <span class=\"user-mention\" data-user-id=\"318832\">@Nathaniel Osgood</span> were talking about how much harder it is for students to get programming jobs these days, and I was wondering about the reasons.  This article has a theory about that which is more technical than the obvious ones.  Of course there were big tech layoffs starting roughly around COVID.   But why?</p>\n<ul>\n<li>Professor Axelrod, <a href=\"https://www.professoraxelrod.com/p/the-tech-job-meltdown\">The Tech Job Meltdown</a>.</li>\n</ul>\n<blockquote>\n<p>But, the Tax Cuts and Jobs Act (TCJA) of 2017 amended Section 174, effective for tax years beginning after December 31, 2021.  Starting in 2022, R&amp;D expenditures must be capitalized and amortized over 5 years for domestic research <em>(and 15 years for foreign research… which is pretty untenable.)</em> This change eliminated the option to immediately deduct R&amp;D costs, increasing tax liability for companies with significant research budgets in the short term.  [....]   Anyway, the impact of this tax strategy turned out to be: <strong><em>layoffs of U.S.-based engineers</em></strong> while companies restructured operations abroad.    [....] </p>\n</blockquote>\n<blockquote>\n<p>Basically, as long as spending counted as R&amp;D, companies could report losses to investors while owing almost nothing to the IRS. In short, <strong><em>it costs a lot to invent - and market - the future. Building a better tomorrow can be expensive!</em></strong> Investors generally bought into this, gave them <strong><em>another round of venture capital, and let them defer a public offering</em></strong>. <em>(This is actually another problem with this model - companies have stayed private far too long - but I’ll address that at some other point.)</em></p>\n</blockquote>\n<blockquote>\n<p>But the Section 174 tax change absolutely cratered that model.</p>\n</blockquote>",
        "id": 524054569,
        "sender_full_name": "John Baez",
        "timestamp": 1749895595
    },
    {
        "content": "<p>What evidence do we have that this article makes a correct evaluation? I see a lot of claims. No analysis or proof, not even a graph...</p>",
        "id": 524121313,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1749983769
    },
    {
        "content": "<p>Also, who is the <em>person</em> behind prof. Axelrod?</p>",
        "id": 524121446,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1749983894
    }
]