[
    {
        "content": "<p>I wrote three posts on politics:</p>\n<ul>\n<li><a href=\"https://mathstodon.xyz/@johncarlosbaez/114067322222050216\">The Dark Enlightenment</a>.</li>\n</ul>\n<p>Lots of good comments.</p>",
        "id": 502139113,
        "sender_full_name": "John Baez",
        "timestamp": 1740602018
    },
    {
        "content": "<p>Yarvin's whole theory of an archipelago of unlimitedly sovereign presumably-authoritarian states with an absolute right to exit is very rapidly self-defeating--who enforces the right to exit? At some point he was raving about having a space UN with big lasers to enforce that the terrestrial states couldn't break those foundational rules, or something; it's a deeply silly defense mechanism against admitting that illiberal regimes, by definition, can control what their citizens do, and there's no way to have a clean escape valve from that.</p>",
        "id": 502152412,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740607295
    },
    {
        "content": "<p>His thoughts on politics looked like childish ravings to me the moment I saw them, but I hadn't seen his idea of an (obviously incorruptible) \"space UN\" enforcing laws with lasers from on high.</p>",
        "id": 502160753,
        "sender_full_name": "John Baez",
        "timestamp": 1740610922
    },
    {
        "content": "<p>I think they’re inherently incorruptible because they’re immeasurably more powerful than the earthlings <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 502161054,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740611038
    },
    {
        "content": "<p>The idea that there would be collusion between the powerful gov-corps so they they support each other's oppression was immediate to me. I live in a place where you can't go to another country without a nontrivial amount of money (I never went to another country until I was in my 20s), all of which are overseas and the easiest way to go is to fly. The land is generally so sparsely populated and/or inhospitable that if you lived in, say, the Perth gov-corp, and it was a despotic outfit, you could very easily be held there without much recourse to leave.</p>",
        "id": 502162591,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1740611668
    },
    {
        "content": "<p>Also, didn't he just re-invent the concept of the Italian city-states system?</p>",
        "id": 502162673,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1740611706
    },
    {
        "content": "<p>Indeed, my reaction was \"been there, done that!\"  The idea of authoritarian city-states was extensively tested from the middle ages on to the Renaissance and beyond, so we know a lot about what kind of things happen.  That's why I said</p>\n<blockquote>\n<p>Remember, Bach was jailed by the Duke of Saxe-Weimar for trying to leave town for a different job.</p>\n</blockquote>\n<p>In his day you often couldn't quit your job, leave a town and work somewhere else unless you got your lord's permission!</p>",
        "id": 502167069,
        "sender_full_name": "John Baez",
        "timestamp": 1740613958
    },
    {
        "content": "<p>Bach eventually did persuade the duke to let him take a job somewhere else.  But many rights we take for granted, like the right to quit our job and move somewhere else, were presumably hard-fought.  (I don't know the history of how that happened.)</p>",
        "id": 502167720,
        "sender_full_name": "John Baez",
        "timestamp": 1740614346
    },
    {
        "content": "<p>I used to read Yarvin's blog when I was in undergrad, must have been 2011 or so, so hopefully my thoughts on it were not tainted with hindsight about what the alt-right would be up to in the following years. I thought there were interesting things in it, some of which have been \"mainstreamed\" since and do not look particularly original now, but at the time were not so commonly discussed; this is to say that its appeal doesn't seem unreasonable to me. Of course it was mixed with some inane stuff and some downright morally despicable stuff.</p>",
        "id": 502211359,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740640724
    },
    {
        "content": "<p>I thought the \"formalist\" international order was one of the interesting things, if anything as a thought experiment.<br>\nI don't recall the \"space UN with lasers\"; my recollection is that the proposal was a system not unlike the one we have now, simply founded on a different set of \"common values\".<br>\nEssentially, whereas the current international order is based on the idea of \"universal human rights\" that must be enforced—which Yarvin sees as a dangerous crypto-Christian ideology, mutated from certain American branches of protestantism—the formalist international order would pretty much only hold the \"right to exit\" as universal. So, in the same way that currently the UN can (in principle) use sanctions, economic pressure, and eventually the threat of an international military intervention to \"police\" violations of human rights, the same instruments could be used to police the violations of the right to exit; but no sanction should exist for any \"internal matters\".<br>\nThis doesn't guarantee efficacy but the point is, it's not <em>less effective</em> in principle than the system we have (or at least used to have).</p>",
        "id": 502212347,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740641194
    },
    {
        "content": "<p>The other point on which Yarvin was somewhat \"ahead of his time\" is the one I just briefly mentioned, that is, the claim that \"liberal values\" (including the stuff which now gets put under the name of \"woke\") are essentially a memetic mutation of Christian values. He used this in polemic with the \"new atheists\" such as Dawkins: as in, you cannot see that the \"rationalist\" values that you hold are actually a minor rearrangement of the particular religious mindset that you claim to be against.<br>\nIt's interesting that, in fact, since then, Dawkins and a bunch of \"new atheists\" have made the same extra step, and are now militant against \"wokeism\" on the same side as Yarvin and the new right-wingers.</p>",
        "id": 502213405,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740641625
    },
    {
        "content": "<p>I think the inane and despicable stuff was, in fact, precisely in what puts the \"Enlightenment\" into \"dark Enlightenment\" (and which is why I think the word is quite tainted and would discourage John from using it), that is, a particular reading of \"rationalism\" which translates into stuff like scientific racism or gender determinism.<br>\n(I note that scientific racism was basically invented by the original-generation Enlightenment thinkers, so this is indeed a development in the spirit of Enlightenment)</p>",
        "id": 502214475,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740642070
    },
    {
        "content": "<p>Basically, the idea that \"reason\", \"science\" and \"facts\" put us in front of certain \"hard truths\", which may be at odds with [choose whether \"woke\" or \"religious\"] moralism, and that in order to progress as a society we need to take a \"scientific\" approach which makes these part of the calculation.</p>",
        "id": 502214860,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740642228
    },
    {
        "content": "<p>Usually (surprise!) these \"facts\" are things like \"black people are simply incapable of making it on their own, the data says it<span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span>\"</p>",
        "id": 502215407,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740642423
    },
    {
        "content": "<p>Or \"women just cannot reach the heights of genius that men can<span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span>\"</p>",
        "id": 502215556,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740642476
    },
    {
        "content": "<p>By the way, this stuff, and its \"lite\" version like the obsession with IQ and intelligence metrics, is pretty transversal, which is what I think makes it particularly dangerous. In fact I would say it is the one thing I have noticed unites most self-proclaimed \"pro-Enlightenment\" people both on the right and the (centre-)left [in my experience actual leftists are usually free of this particular sin, although you never know].</p>",
        "id": 502216681,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740642861
    },
    {
        "content": "<p>I'm thinking of how e.g. Scott Aaronson in his blog often claims to hold \"normal Enlightenment values\", which he obviously considers to include forms of sexism and scientific racism, despite being a \"hardcore anti-Trump rationalist liberal\".</p>",
        "id": 502217904,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740643240
    },
    {
        "content": "<p>Also <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> , returning to \"O.G.\" Enlightenment, it should not be underappreciated how much it loved autocrats! Voltaire thought that Peter and Catherine the Great were the best thing since sliced bread. I think one could make the argument that a \"free-rein\" autocrat like Trump reshaping society with the \"enlightened\" counsel of the \"aristocrat of thought\" Elon Musk is quite close to Voltaire's ideal model of government.</p>",
        "id": 502223588,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740645023
    },
    {
        "content": "<p>If the Enlightenment loved autocrats, I guess the people running the French Revolution missed the memo when they guillotined Louis the Sixteenth.</p>",
        "id": 502349971,
        "sender_full_name": "John Baez",
        "timestamp": 1740680674
    },
    {
        "content": "<p>Seriously, the Enlightenment was a long-running activity with many phases in many countries, so it's hard to generalize..  From Wikipedia:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Age_of_Enlightenment\">Age of Enlightenment</a>, period in Western intellectual history from the late 17th to late 18th century, centered in France but also encompassing (alphabetically by country or culture):<ul>\n<li>Arab Enlightenment or <a href=\"https://en.wikipedia.org/wiki/Nahda\">Nahda</a>, late 19th to early 20th century</li>\n<li>England: <a href=\"https://en.wikipedia.org/wiki/Midlands_Enlightenment\">Midlands Enlightenment</a>, period in 18th-century England</li>\n<li>Greece: <a href=\"https://en.wikipedia.org/wiki/Modern_Greek_Enlightenment\">Modern Greek Enlightenment</a>, an 18th-century national revival and educational movement in Greece</li>\n<li>Italy: <a href=\"https://en.wikipedia.org/wiki/Italian_Enlightenment\">Italian Enlightenment</a>, period in 18th-century Italy</li>\n<li>Jewish: <a href=\"https://en.wikipedia.org/wiki/Haskalah\">Haskalah</a>, Jewish Enlightenment, movement among European Jews in the late 18th century</li>\n<li>Poland: <a href=\"https://en.wikipedia.org/wiki/Enlightenment_in_Poland\">Enlightenment in Poland</a>, ideas of the Age of Enlightenment in Poland</li>\n<li>Russia: <a href=\"https://en.wikipedia.org/wiki/Russian_Enlightenment\">Russian Enlightenment</a>, 18th-century period of active government encouragement of proliferation of arts and sciences in Russia</li>\n<li>Scotland: <a href=\"https://en.wikipedia.org/wiki/Scottish_Enlightenment\">Scottish Enlightenment</a>, period in 18th-century Scotland</li>\n<li>Spain: <a href=\"https://en.wikipedia.org/wiki/Enlightenment_in_Spain\">Enlightenment in Spain</a>, came to Spain with a new dynasty, the Bourbons, subsequent reform and 'enlightened despotism'</li>\n<li>USA: <a href=\"https://en.wikipedia.org/wiki/American_Enlightenment\">American Enlightenment</a>, intellectual culture of the British North American colonies and the early United States</li>\n</ul>\n</li>\n</ul>",
        "id": 502350302,
        "sender_full_name": "John Baez",
        "timestamp": 1740680764
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/502212347\">said</a>:</p>\n<blockquote>\n<p>Essentially, whereas the current international order is based on the idea of \"universal human rights\" that must be enforced—which Yarvin sees as a dangerous crypto-Christian ideology, mutated from certain American branches of protestantism—the formalist international order would pretty much only hold the \"right to exit\" as universal. </p>\n</blockquote>\n<p>Did he mention any corresponding \"right to enter\"?  Without the right to enter, the right to exit is not much use.   Or did he imagine that there's a bunch of unowned land and people should just go there?    Did he discuss this issue at all: where you go when you \"exit\"?</p>",
        "id": 502375948,
        "sender_full_name": "John Baez",
        "timestamp": 1740689946
    },
    {
        "content": "<blockquote>\n<p>I think the inane and despicable stuff was, in fact, precisely in what puts the \"Enlightenment\" into \"dark Enlightenment\" (and which is why I think the word is quite tainted and would discourage John from using it).</p>\n</blockquote>\n<p>I was never planning to use that term for <em>my</em> goals - indeed in the blog articles I linked to here, I wrote</p>\n<blockquote>\n<p>This Dark Enlightenment crap is pretty much exactly the <em>opposite</em> of what I'm hoping for.</p>\n</blockquote>",
        "id": 502376248,
        "sender_full_name": "John Baez",
        "timestamp": 1740690052
    },
    {
        "content": "<blockquote>\n<p>I'm thinking of how e.g. Scott Aaronson in his blog often claims to hold \"normal Enlightenment values\", which he obviously considers to include forms of sexism and scientific racism, despite being a \"hardcore anti-Trump rationalist liberal\".</p>\n</blockquote>\n<p>Why do you say Aaronson \"obviously\" considers that these values include forms of sexism and scientific racism?   I read his blog a lot and I don't recall evidence of this.  </p>\n<p>(Certainly the history of \"normal Enlightenment values\" from the late 1600s on includes these things, but that doesn't imply Aaronson believes they do.)</p>",
        "id": 502377164,
        "sender_full_name": "John Baez",
        "timestamp": 1740690391
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/274877-community.3A-our-work/topic/John.20Baez/near/502349971\">said</a>:</p>\n<blockquote>\n<p>If the Enlightenment loved autocrats, I guess the people running the French Revolution missed the memo when they guillotined Louis the Sixteenth.</p>\n</blockquote>\n<p>I think 1789 is a canonical Enlightenment moment but 1792, not so much. (“We come not to judge the king, but to kill him”, or whatever Danton said!) 1776 is even more Enlightenment, though, and of course the American revolutionaries were not so much fans of enlightened despots—though even Washington could have had a crown if he’d wanted one. Every central Enlightenment figure I’m familiar with is at least very shy of democracy (as opposed to republicanism) which I think distinguishes the bourgeois/Enlightened revolutions from the populist/proletarian/democratic ones more or less neatly.</p>",
        "id": 502384608,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740692942
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/502375948\">said</a>:</p>\n<blockquote>\n<p>Did he mention any corresponding \"right to enter\"?  Without the right to enter, the right to exit is not much use.   Or did he imagine that there's a bunch of unowned land and people should just go there?    Did he discuss this issue at all: where you go when you \"exit\"?</p>\n</blockquote>\n<p>If I recall correctly, the system would essentially be “open borders” (so both right to enter and right to exit), with a belief that evolutionary/market dynamics would eventually take care of bottlenecks or local overpopulation etc.</p>",
        "id": 502387922,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740693130
    },
    {
        "content": "<p>By the way I think it should be noted that this stuff came as a fringe movement within the right <em>against the mainstream right</em> which was at the time neo-conservative; the “formalist” system is an “alternative right-wing”, or... alt-right response to the disaster of “exporting democracy to the middle east”...</p>",
        "id": 502391460,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740693306
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/502376248\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>I think the inane and despicable stuff was, in fact, precisely in what puts the \"Enlightenment\" into \"dark Enlightenment\" (and which is why I think the word is quite tainted and would discourage John from using it).</p>\n</blockquote>\n<p>I was never planning to use that term for <em>my</em> goals - indeed in the blog articles I linked to here, I wrote</p>\n<blockquote>\n<p>This Dark Enlightenment crap is pretty much exactly the <em>opposite</em> of what I'm hoping for.</p>\n</blockquote>\n</blockquote>\n<p>Yes, sorry, I didn't mean that you were hoping for anything like the “dark Enlightenment” stuff; just that I think that even liberal proponents of “Enlightenment values” have a disturbing tendency to accept some of its worst presuppositions, to the point that nowadays I find the use of the word a red flag, whatever “side” it is coming from.</p>",
        "id": 502401575,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740693739
    },
    {
        "content": "<p>I don't really want to discuss Aaronson in detail and perhaps I shouldn't have brought him up (he came to my mind because he <em>very often</em> speaks of himself as “having normal Enlightenment values”), but I do find many of his ideas disturbing and the “flip side” of those of Yarvin et al. He has several times written of the Jewish people as a people uniquely genetically gifted with high IQ, mirroring scientific racism, and does not hide his support for a society that is separated in different pathways based on innate intellectual abilities. And he has already received enough criticism for his writings on nerdy men as a special social category whose romantic and sexual needs should be catered for.</p>",
        "id": 502416021,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740694320
    },
    {
        "content": "<p>In general, being openly “pro-Enlightenment” for anyone who states so usually comes with</p>\n<ul>\n<li>considering themselves as being one of the enlightened,</li>\n<li>believing that the enlightened (i.e. themselves) deserve a place high in the hierarchy...</li>\n</ul>",
        "id": 502421493,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740694524
    },
    {
        "content": "<p>Of course my saying “Enlightenment loved autocrats” was a hyperbole. But I do find it not at all incompatible that someone may have <em>genuine</em> Enlightenment values, <em>correctly labelled as such</em>, and be enthusiastic about the Trump + Musk combo!</p>",
        "id": 502435294,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740695087
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/502416021\">said</a>:</p>\n<blockquote>\n<p>He has several times written of the Jewish people as a people uniquely genetically gifted with high IQ, mirroring scientific racism,</p>\n</blockquote>\n<p>This is kind of semi-true?  But he's never claimed it for the \"typical\" Jewish person afaict, just that there were historically some high-IQ clusters of people in<br>\ncertain Jewish communities.</p>\n<blockquote>\n<p>and does not hide his support for a society that is separated in different pathways based on innate intellectual abilities.</p>\n</blockquote>\n<p>Tracking and magnet schools are just the same thing we do in post-secondary education, and we won't be able to get rid of \"different pathways\" at the primary and secondary level unless private schools and tutors are banned entirely.  I don't think this deserves this level of melodrama.</p>\n<blockquote>\n<p>And he has already received enough criticism for his writings on nerdy men as a special social category whose romantic and sexual needs should be catered for.</p>\n</blockquote>\n<p>More than enough criticism since he didn't write that!  He said their <em>psychosexual development</em> should be catered for since certain \"nerdy\" types don't do well with moral frameworks that are honored mainly in the breach.  He would have the same reaction to the Conservative Baptist teachings I grew up with than the feminist line he grew up with, for the same reason: they make successful psychological development during childhood and adolescence dependent on trial and error while overriding the morals you believe in with your instincts.  What he wants is not women to sleep with men they don't want to, but for these men to be able to get effective therapy after which there wouldn't even be any point to specifically \"catering for\" their \"romantic and sexual needs\", and for organized political and religious constituencies to quit committing this kind of child abuse in the future.</p>",
        "id": 502460141,
        "sender_full_name": "James Deikun",
        "timestamp": 1740698610
    },
    {
        "content": "<p>(I'll admit that it might not be as easy as that to make the \"stop doing this in the future\" work at a societal level, because if a moral framework around sexuality were reworked into its actual, practical form, neurotypical people who were raised on it would end up doing something rather different from that!  But that doesn't make it okay to just simply sacrifice non-neurotypical children on the altar of neurotypical people being unable to remember their morals when they're horny.)</p>",
        "id": 502461232,
        "sender_full_name": "James Deikun",
        "timestamp": 1740699217
    },
    {
        "content": "<p>(And this is probably the wrong thread for this whole discussion, it should go somewhere in off-topic.)</p>",
        "id": 502461466,
        "sender_full_name": "James Deikun",
        "timestamp": 1740699357
    },
    {
        "content": "<p>I haven't minded this discussion being here, mainly since everyone is being nice to each other so far, which is really unusual for this sort of topic.   If people start arguing and getting angry I will ask for the discussion to go elsewhere.</p>",
        "id": 502470984,
        "sender_full_name": "John Baez",
        "timestamp": 1740704550
    },
    {
        "content": "<p>I'm sure my summary was not completely true to the letter of what Aaronson writes, which is compounded by the \"list of criticisms\" format. What I am trying to say is that I think that the choice itself of \"categories that are worth considering in rational debate\" is revelatory of a certain ideology. I think e.g. that the fact itself of considering \"the distribution of IQ in a particular ethnic group\" as something that is not only worth considering more than, e.g., the distribution of ectoplasm in my basement, but <em>worth considering in the context of a moral judgment</em>, is essentially conceding the argument to scientific racism.</p>",
        "id": 502510531,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740727393
    },
    {
        "content": "<p>This by the way is maybe my main issue with most \"rationalists\", that ideology is hidden inside the ontology as well as the resource allocation of rational debate...</p>",
        "id": 502510925,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740727571
    },
    {
        "content": "<p>Very easy to game when your goal is to stall &amp; divert resources to keep the debate of your choice going on and on. And again, I think Aaronson has in many occasions been either conniving or a \"useful idiot\" in this game, for example in lending credibility to the obvious grift of the \"University of Austin\".</p>",
        "id": 502511841,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740728010
    },
    {
        "content": "<p>I should add that despite feeling like I have profound ideological differences, I respect Aaronson for being outspoken and having faced the ire of all sorts of people, which I believe takes courage.</p>",
        "id": 502513257,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740728623
    },
    {
        "content": "<p>Returning to the main topic of discussion, I guess what I feel is that in a certain sense, and despite appearances, at least the <em>ideology</em> of scientific rationalism is completely hegemonic at the moment, and <em>not</em> what we need more of...</p>",
        "id": 502513883,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740728862
    },
    {
        "content": "<p>The right-wingers see their work as against irrational \"woke fanaticism\", like the Enlightenment thinkers went against religious fanaticism. They see universities as taken over by pseudoscience and doublespeak, and they are \"telling it like it is\". They believe in the Enlightenment ideas that there is such a thing as objective progress and that some cultures are better and more advanced than others.</p>",
        "id": 502514454,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740729097
    },
    {
        "content": "<p>(This is not to mention the whole \"business school\" science of cutting costs etc. which to be fair transcends liberal/conservative sides nowadays)</p>",
        "id": 502515213,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740729295
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/502470984\">said</a>:</p>\n<blockquote>\n<p>I haven't minded this discussion being here, mainly since everyone is being nice to each other so far, which is really unusual for this sort of topic.</p>\n</blockquote>\n<p>While it was initiated by a mathstodon post you wrote and linked to, which could formally be considered your work, this is certainly off-topic for most of the CT Zulip, so I have moved it to <a class=\"stream\" data-stream-id=\"241990\" href=\"/#narrow/channel/241990-community.3A-discussion\">#community: discussion</a> .</p>",
        "id": 502556374,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1740742257
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Dark.20Enlightenment/near/502510531\">said</a>:</p>\n<blockquote>\n<p>I'm sure my summary was not completely true to the letter of what Aaronson writes, which is compounded by the \"list of criticisms\" format. What I am trying to say is that I think that the choice itself of \"categories that are worth considering in rational debate\" is revelatory of a certain ideology. I think e.g. that the fact itself of considering \"the distribution of IQ in a particular ethnic group\" as something that is not only worth considering more than, e.g., the distribution of ectoplasm in my basement, but <em>worth considering in the context of a moral judgment</em>, is essentially conceding the argument to scientific racism.</p>\n</blockquote>\n<p>Yeah this is not my favorite side of the guy.  I excuse it to some extent because of the existence and typical rhetorical form of anti-Semetism, but it's also influenced by the same sort of entitlement that white people (for example) tend to feel in things that are arguably not the direct result of privilege but are still profoundly causally influenced by privilege.</p>",
        "id": 502571462,
        "sender_full_name": "James Deikun",
        "timestamp": 1740747190
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Dark.20Enlightenment/near/502514454\">said</a>:</p>\n<blockquote>\n<p>They believe in the Enlightenment ideas that there is such a thing as objective progress and that some cultures are better and more advanced than others.</p>\n</blockquote>\n<p>You're calling out people for having the idea that \"some cultures are better than others\" while in the same breath saying that accepting the ideology of scientific rationalism makes cultures worse ... which is it?</p>",
        "id": 502572108,
        "sender_full_name": "James Deikun",
        "timestamp": 1740747398
    },
    {
        "content": "<p>I can see how it may have come across as that, but I honestly was not “calling out” anyone; I was trying to portray these opinions in a way that those holding them could subscribe.</p>",
        "id": 502583150,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740750703
    },
    {
        "content": "<p>If it needs to be said, I don't uniformly reject “Enlightenment values”... earlier I was even mildly positive about some “dark Enlightenment” ideas.</p>",
        "id": 502584072,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740750966
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Dark.20Enlightenment/near/502212347\">said</a>:</p>\n<blockquote>\n<p>I thought the \"formalist\" international order was one of the interesting things, if anything as a thought experiment.<br>\n[...]<br>\nThis doesn't guarantee efficacy but the point is, it's not <em>less effective</em> in principle than the system we have (or at least used to have).</p>\n</blockquote>\n<p>Indeed it's an interesting thought experiment, but when it comes to <em>actual</em> experiments we've seen that right-of-exit isn't even an effective deterrent to abusing a community on <em>websites</em> due to the inability to coordinate our way around network effects, and various other forms of stickiness.  How is it supposed to work better when you also have to physically pick up and move house?</p>",
        "id": 502639464,
        "sender_full_name": "James Deikun",
        "timestamp": 1740766783
    },
    {
        "content": "<p>Of course the system we have has no right to <em>enter</em> other countries, and widespread attempts to do that are serving as the main issue for right-wing parties.</p>\n<p>In China you're not even supposed to move freely within the country, due to the <a href=\"https://en.wikipedia.org/wiki/Hukou\">hukou system</a>.   Here comes a long and digressive quote, just because I find this interesting:</p>\n<blockquote>\n<p>Children of rural workers who do migrate with their parents also face challenges. Without a local, non-agricultural hukou, migrant children have limited access to public social infrastructure. For example, urban students' educational opportunities are far superior to that of their migrant student counterparts.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> The central government reformed the education system in 1986 and then again in 1993, yielding greater autonomy to local governments in the regulation of their education system.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> Limited space and the desire to protect local interests in turn induced local governments to avoid enrolling migrant children in their public schools.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> Furthermore, because the central government subsidized public schools based on enrolment rates of children with local hukous, migrant children were required to pay higher fees if they wanted to attend.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> Consequentially, many migrant families elect instead to send their children to private schools that specifically cater to migrants.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> However, to lower enrolment and attendance fees, these institutions must cut spending in other areas, resulting in a lower quality of education.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> School facilities are often in poor condition, and many teachers are unqualified.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a></p>\n<p>In subsequent years, the central government has enacted a number of reforms, with limited impact. In 2001, it asserted that public schools should be the primary form of education for the nation's children, but did not specify how it would financially support schools in enrolling more migrant children, resulting in little change.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a>[<em><a href=\"https://en.wikipedia.org/wiki/Wikipedia:Citing_sources\">page needed</a></em>] Similarly, in 2003, the government called for lower fees for migrant children, but again failed to detail how it would help schools pay for this.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a>[<em><a href=\"https://en.wikipedia.org/wiki/Wikipedia:Citing_sources\">page needed</a></em>] And in 2006, the government created the New Compulsory Education Act which asserted equal rights to education and ceded responsibility for enrolling migrant children to provincial governments.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a>[<em><a href=\"https://en.wikipedia.org/wiki/Wikipedia:Citing_sources\">page needed</a></em>] However, this too failed to improve the lot of migrant children. Students with non-local hukou had to pay inflated admission fees of 3,000 – 5,000 yuan – out of an average annual household income of 10,000 yuan – and are required to take <a href=\"https://en.wikipedia.org/wiki/The_National_College_Entrance_Examination\">The National College Entrance Examination</a> (<em>Gaokao</em>) at their hukou locality, where it is often harder to get into college.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a>[<em><a href=\"https://en.wikipedia.org/wiki/Wikipedia:Citing_sources\">page needed</a></em>] Since 2012, some regions began to relax the requirements and allow some children of migrants to take College Entrance Exam in the regions. By 2016, Guangdong's policies are the most relaxed. A child of migrants can take Entrance Exam in Guangdong if he or she has attended 3 years of high school in the province, and if the parent(s) have legal jobs and have paid for 3 years of social insurance in the province.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-43\">[42]</a></p>\n<p>The difficulties faced by migrant children cause many to drop out, and this is particularly common in the middle school years: in 2010, only 30% of migrant children were enrolled in secondary education.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> Migrant children also disproportionately deal with mental health issues – 36% versus 22% among their local hukou counterparts – and 70% experience academic anxiety.<a href=\"https://en.wikipedia.org/wiki/Hukou#cite_note-:8-42\">[41]</a> They frequently face stigmatization and discrimination based on differences in how they dress and speak, and have difficulty interacting with other students</p>\n</blockquote>",
        "id": 502666691,
        "sender_full_name": "John Baez",
        "timestamp": 1740776819
    },
    {
        "content": "<p>It seems a bit excessive to cite the same source at the end of 13 different sentences <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 502673074,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1740779589
    },
    {
        "content": "<p>But wow that system sounds punishing to anyone that has to travel to work <span aria-label=\"shock\" class=\"emoji emoji-1f628\" role=\"img\" title=\"shock\">:shock:</span></p>",
        "id": 502673462,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1740779766
    },
    {
        "content": "<p>The Chinese government is, among other things, trying to prevent their already huge 'megacities' from being flooded with people fleeing the poverty of the countryside.   So they have taken many measures to make it difficult or unpleasant to enter the cities if you don't have an official permit called a '<a href=\"https://en.wikipedia.org/wiki/Hukou\">hukou</a>'.</p>\n<blockquote>\n<p>As of 2023, the five largest cities in China by population are <a href=\"https://en.wikipedia.org/wiki/Chongqing\">Chongqing</a> (31.91 million), <a href=\"https://en.wikipedia.org/wiki/Shanghai\">Shanghai</a> (24.87 million), <a href=\"https://en.wikipedia.org/wiki/Beijing\">Beijing</a> (21.86 million), <a href=\"https://en.wikipedia.org/wiki/Chengdu\">Chengdu</a> (21.403 million) and <a href=\"https://en.wikipedia.org/wiki/Guangzhou\">Guangzhou</a> (18.827 million).  As of 2021, there are 17 <a href=\"https://en.wikipedia.org/wiki/Megacity\">megacities</a> (cities with a population of over 10 million), including <a href=\"https://en.wikipedia.org/wiki/Chongqing\">Chongqing</a>, <a href=\"https://en.wikipedia.org/wiki/Shanghai\">Shanghai</a>, <a href=\"https://en.wikipedia.org/wiki/Beijing\">Beijing</a>, <a href=\"https://en.wikipedia.org/wiki/Chengdu\">Chengdu</a>, <a href=\"https://en.wikipedia.org/wiki/Guangzhou\">Guangzhou</a>, <a href=\"https://en.wikipedia.org/wiki/Shenzhen\">Shenzhen</a>, <a href=\"https://en.wikipedia.org/wiki/Tianjin\">Tianjin</a>, <a href=\"https://en.wikipedia.org/wiki/Xi%27an\">Xi'an</a>, <a href=\"https://en.wikipedia.org/wiki/Suzhou\">Suzhou</a>, <a href=\"https://en.wikipedia.org/wiki/Zhengzhou\">Zhengzhou</a>, <a href=\"https://en.wikipedia.org/wiki/Wuhan\">Wuhan</a>, <a href=\"https://en.wikipedia.org/wiki/Hangzhou\">Hangzhou</a>, <a href=\"https://en.wikipedia.org/wiki/Linyi\">Linyi</a>, <a href=\"https://en.wikipedia.org/wiki/Shijiazhuang\">Shijiazhuang</a>, <a href=\"https://en.wikipedia.org/wiki/Dongguan\">Dongguan</a>, <a href=\"https://en.wikipedia.org/wiki/Qingdao\">Qingdao</a> and <a href=\"https://en.wikipedia.org/wiki/Changsha\">Changsha</a>.</p>\n</blockquote>",
        "id": 502674853,
        "sender_full_name": "John Baez",
        "timestamp": 1740780326
    },
    {
        "content": "<p>My understanding is that the Chinese system would still be in compliance with \"right to exit/enter\" in the formalist system. It is not supposed to be a guarantee of equal rights or equal treatment; how each government treats its population would be a topic that is not for international debate.</p>",
        "id": 502717115,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740810578
    },
    {
        "content": "<p>I would see the \"right to exit/enter\" as a last-resort protection mechanism. If you are happy in the state you live in, nobody can remove you, and if you are unhappy, you can always leave.</p>",
        "id": 502717254,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740810698
    },
    {
        "content": "<p>In \"The dawn of everything\", Graeber and Wengrow (who are definitely very far politically from Yarvin...) speak quite a bit about the \"right to leave\", and how it is a right that has been taken for granted throughout most of human history, partly because of lack of technology for keeping a population \"prisoner\" in a country (except with e.g. island nations)</p>",
        "id": 502717500,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740810933
    },
    {
        "content": "<p>So its denial is both</p>\n<ul>\n<li>a very modern phenomenon, </li>\n<li>something that we have collectively \"decided\" was not a fundamental right on par with others;</li>\n</ul>\n<p>presumably because advocating for the right to leave also requires a universal right to enter <em>at least somewhere</em>, and most of the world is opposed to it...</p>",
        "id": 502717732,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740811152
    },
    {
        "content": "<p>For most of history there were more fairly wild stretches of land, \"wild\" meaning weakly governed, where people could slink off.   But they've been shrinking throughout most of history (except for various \"dark ages\" and the Black Death).</p>",
        "id": 502717832,
        "sender_full_name": "John Baez",
        "timestamp": 1740811244
    },
    {
        "content": "<p>Graeber has also written about the denial of the \"right to exit\" as a fundamental component of the bullying dynamic (which in his analysis is a \"ternary\" dynamic, involving the bully, the bullied, and the institution which constrains them).</p>",
        "id": 502717980,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740811400
    },
    {
        "content": "<p>In Thailand I came fairly close to the Golden Triangle, which is home to many \"<a href=\"https://en.wikipedia.org/wiki/Hill_tribe_(Thailand)\">hill tribes</a>\" like the Yao and Hmong.  They're \"hill tribes\" not because they like hills, but because they're the ethnic groups that were pushed into the hills by the Chinese, Thai, etc.   This is a somewhat wild area, with a scary reputation for opium production and lawlessness, but at least formerly full of interesting cultures that didn't fit into the big empires.  For example among the <a href=\"https://en.wikipedia.org/wiki/Yao_people\">Yao</a> every adult male was initiated as a Taoist.  Some of this still persists... though almost everyone I saw had a cell phone!</p>",
        "id": 502718058,
        "sender_full_name": "John Baez",
        "timestamp": 1740811466
    },
    {
        "content": "<p>James C Scott’s “the art of not being governed” is substantially about such “hill tribes” of many places and times! Of course we had our own in the United States right up until around when old Franklin D decided to push electricity and sanitation on the people of the highland south…It’s a very new situation indeed that there’s no “away” to go to for the great majority of folks around the world today.</p>",
        "id": 502723107,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740816112
    },
    {
        "content": "<p>My two cents on the matter: Like Amar, I've been reading Moldbug since a long time ago. I also think that - besides being sometimes completely deranged - he's also one of the few interesting writers to read nowadays. Many of his thoughts are shocking but hey, challenging the intellectual status-quo is precisely what characterizes intellectual progress.</p>\n<p>Now, on the things I personally like, there is his constant stress on government inertia. This is a very true thing, and one of the main reasons that makes democracy inefficient. Clearly, in contrast with Moldbug, I do believe that this inefficiency can be fixed. Moldbug on the other hand thinks this is enough reason to discard democracy completely.</p>\n<p>It is true that authoritarian systems are often much more effective in carrying out executive decisions. Clearly the price to pay - freedom - is very high. For me, this is unjustifiable; for him, it is. </p>\n<p>As for the right to exit/right to enter discussion, the point is rather easy: Everyone should have the right to enter. Any city state should have the right to deny entry.<br>\nThen you may say \"so how are people's right guaranteed\"? Well, in his vision, they aren't. He envision a very competitive society where if you are valuable another gov-corp will let you in. If you aren't valuable, no one will let you in, and you will live a miserable life that - in a way pretty much aligned with his neo-reactionary world-view - you evidently deserved. Yes, this is among the things I radically disagree with him on.</p>",
        "id": 502728188,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1740820862
    },
    {
        "content": "<p>Now I do not believe that 'competition at all levels' characterizes a healthy society. Indeed I know a lot of very valuable people that perform MUCH better in a non-competitive, cooperative, relaxed environment. So I think that going all the way with a Randian style of competition will set us backwards, not forwards.</p>\n<p>Another thing worth noticing tho is the following: Yarvin has a huge following among very powerful people. Many of these ideas will become increasingly more mainstream as time goes by. This is obviously problematic. To draw a paragon, Italian futurism was also intellectually very interesting. It also caused great harm when it became mainstream.</p>\n<p>In any case, on a broader sense, I think Moldbug is street-smart more than anything else: He clearly envisioned how big tech was amassing more and more power, and how the nation-states were basically lagging behind. Then he made a bet: I thought that it was just a matter of time before the 'natural order' of his time would be reverted. I also think that he thought that, when that happens, it would be much better for him to be in a good position: If you cannot be the new Roi Soleil, maybe you can be his best advisor. He kinda managed to do this with Thiel, and clearly the more powerful Thiel becomes, the better it is for him.</p>",
        "id": 502728602,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1740821215
    },
    {
        "content": "<p>In any case, if there is one thing that I really blame progressives for is the failure of not only addressing government inertia, but even to acknowledge that it exists. When many, many people have a feeling that \"things don't move\" and that \"nothing ever changes\", then it's just a matter of time before they will start blaming the very own concept of democracy for this, and start looking for alternatives. This is precisely what is happening now in the US, in my opinion. And it would have been preventable if the American political class wasn't so silly.</p>",
        "id": 502728751,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1740821337
    },
    {
        "content": "<p>The United States is in an almost uniquely bad position to do anything about government inertia, because our system of government forces there to be effectively only two parties at all times, maximizing swings in desired policy direction between administrations.  It's only government inertia that has been effective at keeping this system from actually presenting an unstable \"split personality\" to its own citizens and the world.</p>",
        "id": 502742911,
        "sender_full_name": "James Deikun",
        "timestamp": 1740833200
    },
    {
        "content": "<p>Good point. Things are certainly changing now, but surely this kind of beginning to an administration couldn’t possibly be sustained for very many party switches in succession.</p>",
        "id": 502777010,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740856131
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Dark.20Enlightenment/near/502717732\">said</a>:</p>\n<blockquote>\n<p>presumably because advocating for the right to leave also requires a universal right to enter <em>at least somewhere</em>, and most of the world is opposed to it...</p>\n</blockquote>\n<p>Not always: \"<a href=\"https://en.wikipedia.org/wiki/Mehran_Karimi_Nasseri\">Mehran Karimi Nasseri (Persian: مهران کریمی ناصری, pronounced [mehˈrɒn kæriˈmi nɒseˈri]; 1945 – 12 November 2022)</a>, also known as Sir Alfred Mehran, was an Iranian refugee who lived in the departure lounge of Terminal 1 in Charles de Gaulle Airport from 26 August 1988 until July 2006, when he was hospitalized.\"</p>",
        "id": 503086908,
        "sender_full_name": "JR",
        "timestamp": 1741023812
    }
]