[
    {
        "content": "<p>In 1983 I has hired to work with violent developmentally disabled adults as a result of the <a href=\"https://en.wikipedia.org/wiki/Deinstitutionalisation\">deinstitutionalization movement</a>. My first client was 6' 4\" and didn't telegraph punches. So I was powerfully hit in the head several times a week. After half a year one day I was hit with a powerful punch to the head. I was exacerbated and said without thinking, \"I love you and I'm not going anywhere\". My client broke down into heart broken crying and was a different and much more non-violent person afterwards. This was someone locked up in an institution because their IQ wasn't high enough. <br>\nSo, who are we helping and who doesn't get our help. Do we always have to wait till something terrible happens before we act?</p>",
        "id": 199856206,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1591351394
    },
    {
        "content": "<p>Indifference and ignorance are the default state. It might be a poor excuse for inaction, but no one acts on a problem they aren't aware of or haven't been made to care about, and very few people go out of their way to seek upsetting situations. The result is that without a (usually terrible) triggering event, people will not automatically act.<br>\nSo to answer your question: if we're active, we're helping the people we have been shown that need help. Which ultimately means that the causes with the most media coverage get the most support in raw people-numbers, if not financially.</p>",
        "id": 199857210,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591352096
    },
    {
        "content": "<p>That sounded super cynical, but it's not necessarily a bad thing: the social media connectivity of the Western world is what has allowed the horrific instances of a week ago to gain and maintain activist momentum. Annoyingly it's also what makes the existence of a new suspect in a ridiculously overfunded investigation into a missing minor case from thirteen years ago somehow make national news here in the UK <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span> .</p>",
        "id": 199857506,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591352381
    },
    {
        "content": "<p>In a Universe shy of silver bullets, education is THE silver bullet. So I strongly support this movement for educational opportunities. My sister, with a PhD in Education, talks about the difficulties of people from families that have had poor educational and  financial opportunities for multiple generations. I'm someone who desperately wanted to be a part of academia, but being autistic, bipolar with parents that only finished freshman high school and came from families of extreme poverty, I had little chance to do what I feel I was born to do. But maybe I was wrong about what I was born to do. So please sign me up for any program that will help others.</p>",
        "id": 199912216,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1591379861
    },
    {
        "content": "<p>Daniel, I can relate. I'm a disabled, queer, transgenderqueer woman, with partners who also have chronic health issues. My disabilities mean academia is a pipe dream for me - for a start, anything that requires me to gain qualifications via exams rather than course work is a no-go. So I instead try to do volunteer work in support of broadening access to knowledge and learning (hence my volunteering to work on the tech side of the nLab).</p>",
        "id": 199948656,
        "sender_full_name": "Alexis Hazell",
        "timestamp": 1591404532
    }
]