[
    {
        "content": "<p>As I write this, over 40 civilian vessels are sailing within 200km of the coast of Gaza carrying people from dozens of different countries. They are the <a href=\"https://globalsumudflotilla.org/\">Global Sumud Flotilla</a>, carrying humanitarian relief by sea in the hope of breaking the 18 year blockade on Gaza by Israel and open a humanitarian corridor---a route by which further aid can arrive in future.<br>\nBased on their experiences in future missions, they are likely to he intercepted and kidnapped by the Israeli military. Already this morning several Israeli vessels have been sighted.</p>\n<p>Israel has maintained its impunity for its previous kidnappings by smearing the activists involved. The more people are watching the events unfold, the more difficult it becomes for them to get away with that. The US and other interested western governments continue to defend and fund the genocide Israel is committing; whatever happens to this flotilla from now on, it must be leveraged against the continued support of Israel. Whatever channels you have to speak out, please use them.</p>",
        "id": 542444609,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759309821
    },
    {
        "content": "<p>Can you please put these sorts of screeds that have no conceivable connection to the category theory community into <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a> ?</p>",
        "id": 542532826,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1759334500
    },
    {
        "content": "<p>I agree on the placement in <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a> since unlike the previous action (returning IMO medals) this one doesn't have any prominent connection to the mathematical community.  However throwing around words like \"screeds\" at long-time, productive community members does more harm to the community on this server than the occasional misplaced topic.</p>",
        "id": 542537479,
        "sender_full_name": "James Deikun",
        "timestamp": 1759335876
    },
    {
        "content": "<p>The first sentence of the description of this channel is \"What do we stand for?\" I would prefer to be part of a community that stand against genocide. If you feel this has nothing to do with you <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>, as your message clearly implies, I'll let that message speak for itself.</p>",
        "id": 542577474,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759350745
    },
    {
        "content": "<p>As expected, the flotilla has been intercepted. Here's <a href=\"https://youtube.com/shorts/HiiJnxhk0I4?si=1AzQAIkfz6w76VWr\">a video</a> from one of the participants. If you are in a country where there will be mobilisation in response to this, I encourage you to find out how you can participate.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"HiiJnxhk0I4\" href=\"https://youtube.com/shorts/HiiJnxhk0I4?si=1AzQAIkfz6w76VWr\"><img src=\"https://uploads.zulipusercontent.net/caadd2856cfb4397347a6ba22983b712095a3b0c/68747470733a2f2f692e7974696d672e636f6d2f76692f4869694a6e78686b3049342f6d7164656661756c742e6a7067\"></a></div>",
        "id": 542578044,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759351009
    },
    {
        "content": "<p>Speaking for myself, I would prefer to be part of a community that does not throw around words like \"genocide\" inappropriately, which in my view is what you are doing.  If you wanted to have a <em>conversation</em> about that, then there might be an argument for putting it in community:discussion.  I would still argue that it is not the role of the category theory community to take any stand at all on political issues that have nothing to do with category theory or even with mathematics; but at least an open-minded invitation to dialogue about a controversial subject would not make category theorists feel unwelcome based on their political views.</p>\n<p>However, the post that opened this thread is not an invitation to dialogue, but rather states debatable propositions as if they were established facts, and implicitly assumes that anyone reading must agree with the author.  This is not taking \"What do we stand for?\" as a discussion question, but rather presuming to answer it not only for yourself but for the whole community.  That is what does damage to the community, by alienating anyone who disagrees with it, especially when it is posted by an otherwise highly respected community member.  (And I think it would still be harmful in meta:off-topic, just less harmful.)  Even a simple qualifier at the start like \"if you believe X, then ...\" could go a long way towards maintaining more inclusivity of the community when posting something like this.</p>",
        "id": 542619385,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1759355653
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Global.20Sumud.20Flotilla/near/542577474\">said</a>:</p>\n<blockquote>\n<p>The first sentence of the description of this channel is \"What do we stand for?\" I would prefer to be part of a community that stand against genocide. If you feel this has nothing to do with you <span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span>, as your message clearly implies, I'll let that message speak for itself.</p>\n</blockquote>\n<p>This kind of response is not very helpful either.  A world where every reasonable person had the time and emotional and other resources to be involved in every important cause would unfortunately be a far kinder and healthier world than the one we actually live in.  And anyway, trying to cast shame on people for not participating is only a good recruitment tool if your words are finely tuned enough to actually make them <em>feel</em> shame, and I've seen no sign of anything in the last thread or this one that shows you're able to be that convincing.</p>",
        "id": 542619664,
        "sender_full_name": "James Deikun",
        "timestamp": 1759355786
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Global.20Sumud.20Flotilla/near/542619385\">said</a>:</p>\n<blockquote>\n<p>Speaking for myself, I would prefer to be part of a community that does not throw around words like \"genocide\" inappropriately, which in my view is what you are doing.</p>\n</blockquote>\n<p>I think you're very wrong on the facts here, but it is the case that a lot of propaganda has been flying around (from both sides of the issue) and hence it's presumptuous for anyone to come at the issue as if anyone who's not on their side on it is personally stupid, gullible or evil.</p>\n<p>I'd be much happier if this thread were focused on updates on the flotilla and accompanying actions rather than being sidetracked into debates about whether there is a Palestinian genocide or to what degree the mathematical community <em>as a collective</em> should be involved in issues like genocide versus pursuing such issues as individuals or members of our other intersecting communities.  There's a place for such debates, but we have topics for a reason.</p>",
        "id": 542621842,
        "sender_full_name": "James Deikun",
        "timestamp": 1759356730
    },
    {
        "content": "<p>According to <a href=\"https://www.reuters.com/world/europe/strike-called-italy-protests-flare-over-interception-gaza-aid-ships-2025-10-01/\">https://www.reuters.com/world/europe/strike-called-italy-protests-flare-over-interception-gaza-aid-ships-2025-10-01/</a> there is a strong response in Italy but I have yet to hear about anything in the US.</p>",
        "id": 542622562,
        "sender_full_name": "James Deikun",
        "timestamp": 1759357121
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 542679919,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759392837
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/The.20Global.20Sumud.20Flotilla/near/542621842\">said</a>:</p>\n<blockquote>\n<p>I'd be much happier if this thread were focused on updates on the flotilla and accompanying actions rather than being sidetracked into debates about whether there is a Palestinian genocide or to what degree the mathematical community <em>as a collective</em> should be involved in issues like genocide versus pursuing such issues as individuals or members of our other intersecting communities.  There's a place for such debates, but we have topics for a reason.</p>\n</blockquote>\n<p>I can get behind that. Thanks for the input <span class=\"user-mention\" data-user-id=\"438995\">@James Deikun</span>, you're right that reacting to Mike as I did won't get us very far.</p>\n<p>After the interception above, there was significant reaction in the form of gatherings in Paris and a number of cities in Italy in spite of the late hour. According to the satellite tracker several of the boats made it through the Israeli blockade; it seems that the main priority for the interception was to detain the activists who have been drawing the most media attention (esp. journalists) to reduce the chance of live coverage continuing when they land.</p>",
        "id": 542681688,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759393329
    },
    {
        "content": "<p>Can we please also move it to <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a> ?</p>",
        "id": 542793501,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1759425281
    },
    {
        "content": "<p>No, thanks. You are welcome to mute the topic <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> .</p>",
        "id": 542820515,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759434874
    },
    {
        "content": "<p>By now, all of the boats in the flotilla have been intercepted. That means hundreds of peaceful activists illegally detained. The fact that they got so close to Gaza makes this all the more frustrating. </p>\n<p>If you want to send a message to your local representative(s), but are unsure what exactly to say, <a href=\"https://globalsumudflotilla.org/sos/\">this page</a> has videos from all of the participants explaining who they are, that they have been illegally detained and asking for their immediate release. If you participate in any protests, given that police violence is becoming more and more prevalent, it's a good idea to make contact in advance with others that are participating so that you know you'll not be alone.</p>",
        "id": 542822399,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759435543
    },
    {
        "content": "<p>I will now do that.  But I just want it on record that of the three people who have spoken in this topic, two of us supported moving it to <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a>, and James's message supporting such a move had three thumbs-ups (although some or all of those might have been only for the other sentence in it).</p>",
        "id": 542831098,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1759439057
    },
    {
        "content": "<p>In case you wanted confirmation that this attempt to break Israel's siege is affecting them, here is what you may see when you search \"sumud flotilla\" on Google as I did just now:<br>\n<a href=\"/user_uploads/21317/tqPhCv2JFYLASZwAnKeLRGkC/Screenshot_20251003-180939_Chrome.jpg\">Screenshot_20251003-180939_Chrome.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/tqPhCv2JFYLASZwAnKeLRGkC/Screenshot_20251003-180939_Chrome.jpg\" title=\"Screenshot_20251003-180939_Chrome.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"720x1480\" src=\"/user_uploads/thumbnail/21317/tqPhCv2JFYLASZwAnKeLRGkC/Screenshot_20251003-180939_Chrome.jpg/840x560.webp\"></a></div><p>To be clear, that's Israel-sponsored disinformation. It's also evidence that Google is getting ad revenue from spreading that disinformation (in case you were curious about Google's ethical policies).</p>\n<p>For the purposes of discussion and action, I propose that this makes it all the more important that we tell people what has happened to these activists...</p>",
        "id": 542981196,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759508335
    },
    {
        "content": "<p>Does it still do that?  I just tried (on my laptop) and I get a bunch of news stories, then the first three actual results of the search are</p>\n<ul>\n<li>the flotilla <a href=\"https://globalsumudflotilla.org/tracker/\">tracker</a></li>\n<li>the <a href=\"https://globalsumudflotilla.org/\">main page</a> of the flotilla website</li>\n<li>the <a href=\"https://en.wikipedia.org/wiki/Global_Sumud_Flotilla\">English Wikipedia page on the flotilla</a></li>\n</ul>\n<p>I did visit all three before, so probably Google remembers my searches.  Anyway, I see none of the links shown in your search, not even on page 2 or 3.  Google must have \"fixed\" it.  I wonder what happened exactly.</p>",
        "id": 543073495,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1759570017
    },
    {
        "content": "<p>It's plausible that it could be targeted based on other factors. I'm glad to hear they can't afford to have those ads displaying whenever anyone searches for information about this.</p>",
        "id": 543078704,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759575336
    },
    {
        "content": "<p>I posted about it because I was just searching for updates yesterday and was quite shocked to see this ahead of the results!</p>",
        "id": 543078740,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759575378
    },
    {
        "content": "<p>James pointed out a few days ago that a lot of propaganda has been flying around. A major reason that propaganda from Israel has had such a large influence is that it tends to be parroted without adequate scrutiny by legacy media outlets. Here is a <a href=\"https://pca.st/episode/0a0d3785-3593-4577-8b78-aa6f34fee934\">podcast episode</a> examining the UK media coverage of the Sumud Flotilla in particular, featuring a journalist (Mathilda Mallinson) who was on board one of the ships until an engine failure meant that she could no longer adequately report on the mission in situ.</p>",
        "id": 543154225,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759661884
    },
    {
        "content": "<p>Just to clarify, my thumb-up to James' first comment was indeed intended to apply to both its prongs. I find it quite distasteful for a moderator of this forum to unilaterally refuse a change of channel which seems to me self-evidently correct (if this is on-topic, nothing is off-topic; I do not believe you will find any other thread in this channel with no exoteric connection to category theory).</p>",
        "id": 543400227,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1759781481
    },
    {
        "content": "<p>The description of this channel does say \"politics permitted\". Doesn't this fit that description?</p>",
        "id": 543417853,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1759789930
    },
    {
        "content": "<p>Did people ask for \"Returning a medal, freeing a people\" to be moved to off-topic? I don't remember, but it seems similar.</p>",
        "id": 543418073,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1759790083
    },
    {
        "content": "<p>I think there's an essential difference, in that \"Returning a medal, freeing a people\" was specifically about actions taken by mathematicians, in their capacity as mathematicians, in protest of a policy adopted by an organization that is an organ of the mathematical community.  This topic, meanwhile, doesn't seem to have more connection to the mathematical community than to any other community, professional or otherwise.</p>\n<p>Thus, while I'm personally glad to see this topic on the Zulip, I think it belongs in off-topic.</p>",
        "id": 543421717,
        "sender_full_name": "James Deikun",
        "timestamp": 1759792721
    },
    {
        "content": "<p>Thanks, Joe. I hadn't widened my window enough to see that. I wasn't here when the descriptions were written, but I would want to read \"politics permitted\" to have an implicit \"...insofar as certain discussions about what we stand for, as the CT community, what we like, and what we shall do, intersect with politics.\" For this to be on-topic, it seems that we would have to be (1) agreeing <em>as a community</em> that Israel is currently committing a genocide, or war crimes, or whatever is the minimal proposition on which Morgan's entreaty relies and (2) discussing what we want to do <em>as a community</em> against these crime. Even if you were to take the overbold assumption that the community is in consensus around (1), this post has no relation to (2), since it is merely a call for us to individually take actions that any citizen might take. I suggest in summary that promotion of political actions by members of this community <em>qua</em> general citizens, as opposed to CT community members, cannot in fact be on-topic here.</p>",
        "id": 543589544,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1759858854
    },
    {
        "content": "<p>Ideally, besides the topic itself being in <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a> , the discussion of whether it belongs in <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/channel/229451-meta.3A-off-topic\">#meta: off-topic</a> or <a class=\"stream\" data-stream-id=\"241990\" href=\"/#narrow/channel/241990-community.3A-discussion\">#community: discussion</a> should go in <a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/channel/229122-meta.3A-meta\">#meta: meta</a> as it's now grown as large as the substantive content of the thread, but unfortunately it feels like there are too many messages that touch on both substantive and meta content to cut it cleanly.</p>",
        "id": 543590795,
        "sender_full_name": "James Deikun",
        "timestamp": 1759859295
    },
    {
        "content": "<p>It's a fair point. Although I don't agree that we should agree as a community on something before discussing next steps. That's a recipe for doing nothing ever. </p>\n<p>I think chopping up this discussion might be more work than it's worth.</p>",
        "id": 543599311,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1759862319
    },
    {
        "content": "<p>Thanks for the input, Kevin and James, but there has at no point been a particular rule that a topic in this channel is required to satisfy any particular constraints of the kind you're suggesting. I started this topic because I know from private (online and in person) conversations that many people in this community think what's happening in Gaza and the efforts to stop it should be <em>discussed</em>. Unfortunately any good faith engagement has been stalled by the repeated critique of choice of channel. Ironically Mike's opinion has resulted in a <em>discussion</em> in #off-topic (the moderator policy clearly says that constructive political discussion will be moved to #community:discussion)...</p>",
        "id": 543671136,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1759906342
    },
    {
        "content": "<p>What/where is the moderator policy? In any case, I see nothing stopping anyone from ignoring the meta discussion and responding to your original comments. But no one really has, and I really fail to see how they’re the kind of comments that could open a <em>discussion</em>.</p>",
        "id": 543796224,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1759942931
    }
]