[
    {
        "content": "<p>A bit ago the following podcast was posted with Urs Schreiber, wanted to post to notify anyone who might be interested in Urs' work:<br>\n<a href=\"https://www.youtube.com/watch?v=1KUhLHlgG2Q&amp;ab_channel=CurtJaimungal\">https://www.youtube.com/watch?v=1KUhLHlgG2Q&amp;ab_channel=CurtJaimungal</a><br>\nUrs wrote a summary on the nlab that he follows through the discussion: <a href=\"https://ncatlab.org/schreiber/show/Per%C3%AC+Panthe%C5%8Dr%C3%ADas\">https://ncatlab.org/schreiber/show/Per%C3%AC+Panthe%C5%8Dr%C3%ADas</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"1KUhLHlgG2Q\" href=\"https://www.youtube.com/watch?v=1KUhLHlgG2Q&amp;ab_channel=CurtJaimungal\"><img src=\"https://uploads.zulipusercontent.net/e4118bd3b75ff17cd64ab4120563f48cf1515e6d/68747470733a2f2f692e7974696d672e636f6d2f76692f314b55684c486c674732512f6d7164656661756c742e6a7067\"></a></div>",
        "id": 506951116,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471580
    },
    {
        "content": "<p>This podcast was on Theories of Everything/Curt Jaimungal, which has apparently grown to a large following on Youtube. His channel was brought to my attention a few months ago when someone notified me that Curt had an interest in category theory. Apparently he wants to use it to study how to unify different \"theories of everything\". That would be hard since the \"theories of everything\" presented on the podcast range from established ones like string theory and loop quantum gravity to \"consciousness causes everything\" type \"theories\". I'm not sure how any of those have any common ground, on either a conceptual and mathematical level.</p>",
        "id": 506951696,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471700
    },
    {
        "content": "<p>Oh also, I might be a bit biased since I'm not a major fan of Curt in general after having watched some of his stuff and read some of his material. I can only hope I'm not the only one who feels that way, given how overenthusiastic all his comments generally are about him and his work!</p>\n<p>In any case, apparently he has a podcast episode coming up with Emily Riehl, who is also a well established category theorist. I am really curious about what that conversation will be about, and if Curt will reveal more about his category theoretic knowledge and ambitions in that discussion. Regardless I'll try to post it on here when it comes out!</p>",
        "id": 506951979,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471760
    },
    {
        "content": "<p>The host aside, I found the discussion and Urs' material interesting. Apparently he is able to derive stuff like supergravity and quantum logic from \"nothing\" (or, more accurately, a form of modal logic). But I wasn't too terribly convinced of this ability to derive those things from \"pure logic\", as it doesn't seem at all like a unique thing. If I was really sold on a particular (and completely different) theory of everything, I bet I could come up with some logical system and/or surrounding framework such that my theory would be derivable purely from it, hence from \"pure logic\". There's so many logical systems, and so many categories one can choose as a starting point for such a derivation!</p>",
        "id": 506952317,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471820
    },
    {
        "content": "<p>I'm also wary of the whole program to \"use mathematics as a metaphysical microscope\". Math can certainly help in formalizing ideas from metaphysics, as it does for formalizing all sorts of other concepts (like \"distance\" via metric spaces, or \"symmetry\" through groups/groupoids). But as such, math can be used to formalize ideas from <em>any</em> metaphysical theory, and most metaphysical theories contradict one another. Which means that math alone cannot give preference or valuation of one metaphysical theory over another.</p>",
        "id": 506952539,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471880
    },
    {
        "content": "<p>In addition, the same object might have multiple different interpretations. For instance, Schreiber views the initial object, in some sense, as the \"embodiment of nothing\", and uses claims about initial objects to argue for certain things \"emerging from nothing\". But I could also just as easily think of an initial object as a \"fundamental common structure\" (hence why a \"walking morphism\" is also called the \"initial morphism\", since it is initial in the category of categories equipped with a specified morphism), which is far from \"nothing\". So I'm not too sold on how a particular way of looking at and manipulating mathematical structures should say anything about reality. </p>\n<p>But anyways these are just my thoughts. I'm not an expert and could be gravely misunderstanding things, so take it with a grain of salt!</p>",
        "id": 506952774,
        "sender_full_name": "John Onstead",
        "timestamp": 1742471940
    },
    {
        "content": "<p>My own take on aspects of the program is in this <a href=\"https://www.cs.ox.ac.uk/seminars/2733.html\">OASIS talk</a>. Slides are <a href=\"https://ncatlab.org/davidcorfield/show/HomePage#OxLHoTT\">here</a>. I don't know if they intend to post the recording.</p>",
        "id": 506955686,
        "sender_full_name": "David Corfield",
        "timestamp": 1742472695
    },
    {
        "content": "<p>I watched for 20 minutes and I had to stop because the video was honestly painful. I genuinely cannot understand (a) why Urs went there and (b) why he decided to give such a presentation. </p>\n<p>I do understand this comment will sound overly sour to many and that this space is thought to be nice, and inclusive, and <em>sweet</em> but I think that this kind of video is (a) damaging Urs' perception among serious scientists, (b) damaging the perception of CT among serious scientists and (c) ultimately damaging science. Hence, I believe understating the sense of confusion I feel by watching it would not communicate faithfully how dangerous and detrimental I feel it is.</p>\n<p>Now, do I really need to elaborate on why I feel like this? It seems completely clear to me. Urs comes across as completely whimsical,  hosted by a guy who clearly has no clue what mathematics is, and talks about things that none understands and that none has understood any better by the time the video is over...</p>\n<p>When I see this kind of video -- and there are many -- it truly does not shock me at all that so many serious people have such a deep antipathy for category theory and that -- in complete opposition -- so many clowns love it.</p>",
        "id": 506972040,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1742477032
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/506972040\">said</a>:</p>\n<blockquote>\n<p>When I see this kind of video -- and there are many -- it truly does not shock me at all that so many serious people have such a deep antipathy for category theory</p>\n</blockquote>\n<p>Just to air the flip side of this, what is it in the minds of so many that it takes so little for them to feel such deep antipathy so readily? I mean, how long did it take people here to realise something important was going on with CT? For me, it was a matter of a few months back in my 20s. </p>\n<p>I've struggled for over 30 years to get philosophers interested. You get told \"It's far too difficult,\" \"It can all be done in set theory,\" \"show me what it can achieve.\" </p>\n<p>It's pleasant to be approached by someone willing to hear when you spend so much time amongst the deaf, even if that person can't really hear.</p>",
        "id": 506976376,
        "sender_full_name": "David Corfield",
        "timestamp": 1742478098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"673117\">@John Onstead</span> your skepticism seems healthy and justified to me.</p>",
        "id": 506982974,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1742479557
    },
    {
        "content": "<p>For better or worse, it seems to me that Urs has never played the \"reputation game\"; his \"proper\" academic career seems far from enviable, yet he has exerted astonishing influence on the popularisation of higher-categorical ideas through the nLab. Participating in this kind of podcast seems perfectly consistent with his ethos so far.</p>",
        "id": 506988000,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742480653
    },
    {
        "content": "<p>Any serious scientist who will see their prejudices against CT confirmed by this video will eventually give way to a bunch of serious scientists who were raised on a diet of nLab pages written by Urs.</p>",
        "id": 506989841,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742481033
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/506982974\">said</a>:</p>\n<blockquote>\n<p>your skepticism seems healthy and justified to me.</p>\n</blockquote>\n<p>If it's deriving merely from listening to a podcast, I disagree. Dig into the <a href=\"https://scholar.google.com/citations?hl=en&amp;user=bDfHFDcAAAAJ&amp;view_op=list_works&amp;sortby=pubdate\">literature</a>. There's plenty of it.</p>",
        "id": 507001994,
        "sender_full_name": "David Corfield",
        "timestamp": 1742483670
    },
    {
        "content": "<p>Curt has thrice asked to interview me about category theory or Grothendieck's work on motives. but each time, after consideration I've had to say no.  He seems like a serious guy in <em>some</em> ways, but he also has videos with titles like \"THEY ARE LYING TO YOU: physicist debunks particle superposition\" and \"THE TRUE NATURE OF CHRIST: symbols reveal hidden dimensions of reality\", and I just can't stomach the idea of my thoughts being found in that company.    I think there's something about trying to make a living on YouTube videos that pushes people into sensational nonsense.   The decline of Sabine Hossenfelder into raving that \"most academic research is bullshit\" and academia should be defunded, complete with approving video clips of Elon Musk and Peter Thiel, is one of the most disturbing examples, because I used to like her work.  </p>\n<p>Luckily it <em>might</em> be true that Jaimungal is getting better rather than worse.   But I've decided to completely absent myself from the \"math and physics celebrities talking on YouTube channels\" scene.   It seems degrading, since it features a mixture of serious thinkers and complete frauds,  putting them on a more or less equal footing as far as the audience goes.   And it seems to be very hard to get into the level of detail required to give the audience something substantial to take home - something precise enough that the difference between serious thought and fraud becomes crystal clear.</p>\n<p>Sorry for changing the subject in this way... the whole business of science popularization on YouTube has very little to do with Urs' ideas on \"emergence from the superpoint\".   I just couldn't resist changing the subject, because it makes me feel sad to be left sitting on the sidelines when popular YouTubers are getting hundreds of thousands of views.   I just realized that if I joined the YouTube game, it would be all-consuming and I'd wind up spending a lot of time thinking about nonsense.</p>\n<p>I've sometimes thought of spending time explaining the flaws of various theories of quantum gravity, \"theories of everything\", etc.   I don't think many people are in a decent position to evaluate them, so it could be a useful service.  But I decided that it would just bring more attention to a field I consider stuck and deserving of <em>less</em> attention!  So instead I like to give a <a href=\"https://math.ucr.edu/home/baez/theoretical/\">talk to physics grad students</a> where I warn them away from this whole area, and point them to subjects that seem more lively and interesting.</p>",
        "id": 507011444,
        "sender_full_name": "John Baez",
        "timestamp": 1742485893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507001994\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/506982974\">said</a>:</p>\n<blockquote>\n<p>your skepticism seems healthy and justified to me.</p>\n</blockquote>\n<p>If it's deriving merely from listening to a podcast, I disagree. Dig into the <a href=\"https://scholar.google.com/citations?hl=en&amp;user=bDfHFDcAAAAJ&amp;view_op=list_works&amp;sortby=pubdate\">literature</a>. There's plenty of it.</p>\n</blockquote>\n<p>Given that the skepticism is of the actual content of the podcast and the fact that he chose to lend his credibility to that podcast by appearing on it, I disagree. In my opinion Urs' capacity to produce serious research should make him act more responsibly.</p>",
        "id": 507034961,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1742491443
    },
    {
        "content": "<p>I think that it does matter who the podcast is actually for! I appreciate the ethics and aesthetics of nuanced, rigorous mathematical thought as much as anyone, but I do think that it is learnt through practice and needs dedication to a certain path; and that <em>what leads one to take such a path</em> is ultimately irrelevant, and may as well be totally pseudoscientific! <br>\nI know at least two mathematicians who enrolled into maths because they fantasised about making Asimov's psychohistory a reality; then they ended up doing representation theory or algebraic geometry. A lot of stuff that I am ashamed to mention was part of me going into physics, from which then I switched to mathematics.</p>",
        "id": 507039288,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742492648
    },
    {
        "content": "<p>I understand that some people, by virtue of some particular role they have in a community, may have more responsibility with respect to what image they project of their scientific field. For example if someone holds some prestigious chair at a prestigious university, or has won some major prize, or chairs some professional organisations, so their words are seen as representative of some wider community.</p>",
        "id": 507039915,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742492847
    },
    {
        "content": "<p>But as I said, it doesn't seem to me that Urs should bear any such “burden”... He has been treading his own path, he seems to have accepted the impact of this path on his “proper” academic career, so I think he can do all the silly podcasts he wants to do.</p>",
        "id": 507040882,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742493093
    },
    {
        "content": "<p>And I think he may well be right that the “systemic” effect of him talking about \"emergence from the superpoint\" on such a platform will outweigh any short-term effect this may have on anyone's reputation within the current scientific community. That there will be at least a few young people who will be lured by the lurid stuff, watch his video, then go into physics to figure out what it's all about.</p>",
        "id": 507042138,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742493475
    },
    {
        "content": "<p>especially because it seems to me that Urs shies away from making too silly claims; the only silly claims come from the other guy. \"Wait... Are you going to derive spacetime from logic?\"</p>",
        "id": 507043010,
        "sender_full_name": "fosco",
        "timestamp": 1742493708
    },
    {
        "content": "<p>(I mean \"only silly claims\" in the first 20 minutes. I will go on watching, but I don't see what <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> saw, so I'd like him to explain as I'm curious whether I missed any horrendously false claim about category theory). Urs doesn't sound too whimsical to me... which probably means I've heard him say worse stuff <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 507043405,
        "sender_full_name": "fosco",
        "timestamp": 1742493814
    },
    {
        "content": "<p>also, the fanbase of the channel isn't helpful to the whole image of said channel (like the commenter who said something o the lines of \"I, too, struggle to create a mathematical model of this oroboric creation concept\") but I feel this is not too impactful on Urs' (or ct's) public image... he's a competent guy, in my opinion, and the progress he made in learning actual math during the years can only be defined as impressive. Or so it seems to me.</p>\n<p>Probably he has an aesthetics that displeases purists, and there are aspects of his way of working that in my opinion make it difficult to share ideas and (for example) work together on an idea.</p>",
        "id": 507044962,
        "sender_full_name": "fosco",
        "timestamp": 1742494341
    },
    {
        "content": "<p>the people who have deep antipathy for category theory, and the clowns who love it, will probably not see this podcast ever. Instead, dome overly enthusiastic physicist who will open a real category theory book, or a young student of whatever, that we can lure to the bright side of the categorical moon... so yeah, I think I agree more with Amar.</p>",
        "id": 507045331,
        "sender_full_name": "fosco",
        "timestamp": 1742494460
    },
    {
        "content": "<p>Not that my opinion counts anything in particular. I'm just curious to know what the people who dislike this see that I missed...</p>",
        "id": 507045452,
        "sender_full_name": "fosco",
        "timestamp": 1742494500
    },
    {
        "content": "<p>Lured by the lurid, later led to Lurie.</p>",
        "id": 507050653,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742496206
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507011444\">said</a>:</p>\n<blockquote>\n<p>Curt has thrice asked to interview me about category theory or Grothendieck's work on motives</p>\n</blockquote>\n<p>Interesting! </p>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507011444\">said</a>:</p>\n<blockquote>\n<p>It seems degrading, since it features a mixture of serious thinkers and complete frauds,  putting them on a more or less equal footing as far as the audience goes.   And it seems to be very hard to get into the level of detail required to give the audience something substantial to take home - something precise enough that the difference between serious thought and fraud becomes crystal clear.</p>\n</blockquote>\n<p>Exactly my thoughts on the channel! I don't think I could have put it into better words myself.</p>",
        "id": 507050826,
        "sender_full_name": "John Onstead",
        "timestamp": 1742496258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507043405\">said</a>:</p>\n<blockquote>\n<p>I'm curious whether I missed any horrendously false claim about category theory). Urs doesn't sound too whimsical to me... which probably means I've heard him say worse stuff</p>\n</blockquote>\n<p>I don't think Urs made any false claims about the math itself in the video (at least, from what I can tell with my limited understanding). My main concerns were over the philosophy, but even there I felt that Urs was being at least somewhat cautious. I know a lot of other people who go onto Curt's podcast and aren't cautious at all in making big claims!</p>",
        "id": 507051531,
        "sender_full_name": "John Onstead",
        "timestamp": 1742496495
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507044962\">said</a>:</p>\n<blockquote>\n<p>also, the fanbase of the channel isn't helpful to the whole image of said channel (like the commenter who said something o the lines of \"I, too, struggle to create a mathematical model of this oroboric creation concept\")</p>\n</blockquote>\n<p>I find this very interesting. Curt often indicates that his audience consists of people working in these fields, since the videos (and his written works which I found on his substack) assume a large amount of prerequisite knowledge. (I've been studying category theory for 2 years now and I still wasn't able to fully understand everything in this video.) But from the comments I'm not too sure this is the case. Still, maybe introducing things at this technical of a level is helpful to inspire people who don't know about the subject to go and learn about it!</p>",
        "id": 507052454,
        "sender_full_name": "John Onstead",
        "timestamp": 1742496818
    },
    {
        "content": "<p>Perhaps I've been biased by Peter Woit's blog, but I've always seen Curt as one of the big figures in science media pushing back on string theory when most of the mainstream science media still views string theory uncritically.</p>",
        "id": 507053559,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742497134
    },
    {
        "content": "<p>The big problem with string theory and quantum gravity more generally is that without any experimental or observational evidence from the real world either way whether strings exist or not or whether gravity is quantum or not, all the work that is currently going into those theories aren't really science, but rather some kind of heavily mathematical metaphysics. And this is kind of my problem with Urs Schreiber's program. He's made it clear throughout the nLab and in his papers that he is motivated by the search for rigourous mathematical foundations for M-theory. And if he succeeds at the foundations for M-theory, that's great, but M-theory is kind of useless to science if we can't detect strings and branes due to technological limitations or funding cuts to experiments or because the experiment collapses into a black hole before it can detect strings or whatever.</p>",
        "id": 507055684,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742497791
    },
    {
        "content": "<p>I wonder if there are any direct applications of the rheonomic, fermionic, and bosonic modalities in supergeometry to non-supersymmetric quantum mechanics and quantum field theory, without having to pass through string theory. Only in that case might I find those upper modalities interesting, since it seems that differential cohesion suffices for most of the rest of physics.</p>",
        "id": 507057539,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742498437
    },
    {
        "content": "<p>I think Peter Woit's main critique to string theory is in fact that it has not coalesced into any precise mathematical-physical theory that could even in principle yield predictions, but is instead a nebulous cloud of ideas and techniques which can <em>always</em> be adjusted in a way that accommodates any new data; I see this as the sense of the “not even wrong” critique. <br>\nEssentially it is saying that <em>in form</em> string theory or M-theory have never become a physical theory in the same sense as e.g. general relativity or quantum electrodynamics, which is something that comes before any consideration of what experimental evidence exists or can be feasibly obtained. One could have similar “non-theories” even for things for which data is readily obtainable; I guess some forms of “the Ptolemaic system with arbitrarily many epicycles” would fit the description.</p>",
        "id": 507059664,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742499201
    },
    {
        "content": "<p>From this point of view, Urs's goal of “a rigorous foundation of M-theory” is, I think, compatible with Woit's suggestions. <br>\nI think the main difference between Schreiber and Woit is that Woit would say that string theory literature has gotten so byzantine and inward-looking that it is hopeless to look for any more clues there, and that we should “return to the basics” and start with a clean slate; whereas Urs is such a voracious learner that he has the inclination and willingness to <em>go through it all</em>.</p>",
        "id": 507060199,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742499393
    },
    {
        "content": "<p>Woit's critique is in some ways antithetical to Hossenfelder's critique, which instead is directed at the idea itself that “mathematical aesthetics” should play any role in the search of physical theories (this is the “lost in math” critique). I do not find Hossenfelder's perspective at all truthful or insightful.</p>",
        "id": 507060560,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742499537
    },
    {
        "content": "<p>But then that's what most pure-ish mathematicians would think.</p>",
        "id": 507060917,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742499668
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507060199\">said</a>:</p>\n<blockquote>\n<p>From this point of view, Urs's goal of “a rigorous foundation of M-theory” is, I think, compatible with Woit's suggestions. <br>\nI think the main difference between Schreiber and Woit is that Woit would say that string theory literature has gotten so byzantine and inward-looking that it is hopeless to look for any more clues there, and that we should “return to the basics” and start with a clean slate; whereas Urs is such a voracious learner that he has the inclination and willingness to <em>go through it all</em>.</p>\n</blockquote>\n<p>I remember a discussion on Woit's blog between him and David Roberts about Urs Schreiber's work, and Peter Woit said something along the lines that most mainstream string theorists don't really accept Urs Schreiber as one of them because his mathematics is too alien to the string theorists. Most string theorists seem content to just continue working on phenomenology in perturbative string theory or the AdS/CFT duality. Peter Woit also said in that discussion that Urs Schreiber is doing good work and his arguments against string theory aren't targeted at Urs Schreiber.</p>",
        "id": 507062629,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742500277
    },
    {
        "content": "<p>Would be nice to hear directly from <span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> on this :)</p>",
        "id": 507063208,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742500490
    },
    {
        "content": "<p>I just disagree with both Peter Woit and Urs Schreiber whether it is even worth it in science to search for a theory of everything, for reasons I gave above about not being any experimental evidence for or against unification right now, nor the capabilities to get such evidence any time soon. (On the other hand I would no longer have any problems with any of the figures involved or their work if they rebranded themselves as mathematical natural philosophers.)</p>",
        "id": 507065952,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742501491
    },
    {
        "content": "<p>As for Sabine Hossenfelder, she misdiagnoses the problem and incorrectly blames the use of too much mathematics and aesthetics. Mathematics is just a tool and aesthetics is subjective; the problem is that the field of theoretical high energy physics / quantum gravity has significantly outpaced experiment and so is now in a position where it has more in common with other fields of philosophy and with physics before the scientific revolution than with the other sciences, filled with speculation with no scientific evidence to back or disprove the claims.</p>",
        "id": 507067585,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742502086
    },
    {
        "content": "<p>But maybe that's the future of fundamental physics - we've hit the limits of where the scientific method can take us and the only thing left for those who want to stay in the field and push forwards is to behave like a philosopher and speculate on the nature of gravity or the eventual unified force.</p>",
        "id": 507071423,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742503541
    },
    {
        "content": "<p>8 messages were moved from this topic to <a class=\"stream-topic\" data-stream-id=\"229134\" href=\"/#narrow/channel/229134-theory.3A-philosophy/topic/Based.20in.20science.20vs.20metaphysics/with/507068826\">#theory: philosophy &gt; Based in science vs metaphysics</a> by <span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span>.</p>",
        "id": 507093114,
        "sender_full_name": "Notification Bot",
        "timestamp": 1742513390
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507057539\">said</a>:</p>\n<blockquote>\n<p>I wonder if there are any direct applications of the rheonomic, fermionic, and bosonic modalities in supergeometry to non-supersymmetric quantum mechanics and quantum field theory, without having to pass through string theory. Only in that case might I find those upper modalities interesting, since it seems that differential cohesion suffices for most of the rest of physics.</p>\n</blockquote>\n<p>When I asked the question on the nLab, Urs Schreiber says the following:</p>\n<blockquote>\n<p>Oh, many: any QFT with fermions! Such as, yes, QED (with its electrons) and QCD (with its quarks).</p>\n<p>Namely, what (mostly in mathematics) is called “supergeometry” is much more general than what (mostly in physics) is called “supersymmetry”:</p>\n<p>The phase space of a field theory is a “superspace” the moment that there are any fermions (reflecting their <a href=\"https://ncatlab.org/nlab/show/Pauli%20exclusion%20principle\">Pauli exclusion principle</a>), independent of whether there is any supersymmetry!</p>\n<p>In particular the phase space of the standard model of particle physics, with its fermionic particles, hence of the physics that is experimentally observed ever since <a href=\"https://ncatlab.org/nlab/show/Stern-Gerlach%20experiment\">Stern and Gerlach 1920s</a>, is supergeometric:</p>\n<p>The standard kinetic Lagrangian density of a fermionic field <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϕ</mi></mrow><annotation encoding=\"application/x-tex\">\\phi</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">ϕ</span></span></span></span>, namely the Dirac term, schematically <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext> </mtext><mi>ϕ</mi><mi>D</mi><mi>ϕ</mi></mrow><annotation encoding=\"application/x-tex\">~ \\phi D \\phi</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mspace nobreak\"> </span><span class=\"mord mathnormal\">ϕ</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mord mathnormal\">ϕ</span></span></span></span>, would disappear if <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϕ</mi></mrow><annotation encoding=\"application/x-tex\">\\phi</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">ϕ</span></span></span></span> were not an odd-graded function on phase space (because for an ordinary function we’d have that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϕ</mi><mi>D</mi><mi>ϕ</mi><mo>=</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><mi>D</mi><mo stretchy=\"false\">(</mo><msup><mi>ϕ</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\phi D \\phi = \\frac{1}{2}D(\\phi^2)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">ϕ</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mord mathnormal\">ϕ</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1.1901em;vertical-align:-0.345em;\"></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8451em;\"><span style=\"top:-2.655em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">2</span></span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.394em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">1</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.345em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mopen\">(</span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span><span class=\"mclose\">)</span></span></span></span> is a total derivative and hence ∼zero as a Lagrangian density).</p>\n<p>This is “well-known”, as one says, even if the different (but completely standard) use of “super”-terminology is bound to be misleading. The physicist’s “super” is really shorthand for something more specific, namely for “super-Poincaré symmetry” or “super conformal symmetry”. But a phase space may be supergeometric without admitting super-Poincaré-symmetry.</p>\n<p>In more recent exposition, this point is highlighted for instance in introduction and outlook of <a href=\"https://ncatlab.org/nlab/show/smooth+set#GiotopoulosSati23\">Sati &amp; Giotopoulos 2025</a> and in the respective section of <a href=\"https://ncatlab.org/schreiber/show/Higher%20Topos%20Theory%20in%20Physics\">Higher Topos Theory in Physics</a>.</p>\n</blockquote>\n<p><a href=\"https://nforum.ncatlab.org/discussion/19018/applications-of-graded-differential-cohesion-to-nonsupersymmetric-quantum-field-theories/?Focus=121284#Comment_121284\">https://nforum.ncatlab.org/discussion/19018/applications-of-graded-differential-cohesion-to-nonsupersymmetric-quantum-field-theories/?Focus=121284#Comment_121284</a></p>",
        "id": 507123830,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742530873
    },
    {
        "content": "<p>So at this point, I think that Urs Schreiber's work is probably going to be more useful at finding good mathematical foundations for non-perturbative quantum field theories and especially the standard model.</p>",
        "id": 507125704,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742531978
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507055684\">said</a>:</p>\n<blockquote>\n<p>The big problem with string theory and quantum gravity more generally is that without any experimental or observational evidence from the real world either way whether strings exist or not or whether gravity is quantum or not, all the work that is currently going into those theories aren't really science, but rather some kind of heavily mathematical metaphysics</p>\n</blockquote>\n<p>That's unfortunately the case for all physics concerning energy scales higher than what's currently probeable in a lab. I wouldn't say it's a waste of time though, since we hope eventually to get there &amp; surely QFT/GR are not complete theories, so QG could help clarifying what's going on e.g. in the non-perturbative regime. Amazingly, lots of conformal field theory gets applied to condensed matter nowadays (afaik), so it's not even premature to investigate.<br>\nI'd say what gave string theory bad rep is promising too much and delivering too little in terms of a consistent mathematical theory, and it is my understanding of Urs (and Sati, and more)'s work that they are trying to at least give good foundations to the kind of advanced mathematical physics required by QG theories, specifically string theory.</p>",
        "id": 507235884,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1742551515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"673117\">John Onstead</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/506951116\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://www.youtube.com/watch?v=1KUhLHlgG2Q&amp;ab_channel=CurtJaimungal\">https://www.youtube.com/watch?v=1KUhLHlgG2Q&amp;ab_channel=CurtJaimungal</a></p>\n</blockquote>\n<p>ah, yes, the famous UNEDA lemma (from the timestamp descriptions)</p>",
        "id": 507236064,
        "sender_full_name": "Josselin Poiret",
        "timestamp": 1742551564
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284453\">Josselin Poiret</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507236064\">said</a>:</p>\n<blockquote>\n<p>the famous UNEDA lemma</p>\n</blockquote>\n<p>the famous 'u need a' lemma <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 507236697,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1742551798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507235884\">said</a>:</p>\n<blockquote>\n<p>That's unfortunately the case for all physics concerning energy scales higher than what's currently probeable in a lab. I wouldn't say it's a waste of time though, since we hope eventually to get there &amp; surely QFT/GR are not complete theories, so QG could help clarifying what's going on e.g. in the non-perturbative regime. </p>\n</blockquote>\n<p>That's one of the points I'm trying to make here. We've reached the limits of the scientific method in this field, so that the only way to make progress is via unscientific methods, such as putting the theories in a rigourous mathematical foundation, which is mathematical / logical rather than scientific.</p>",
        "id": 507262098,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742559321
    },
    {
        "content": "<p>Also, hoping to eventually get to energy scales higher than what's currently probeable in a lab is a complex scientific, technological, economic, and political issue. </p>\n<p>Is it possible to probe energy levels at the quantum gravity / string theory scale without i.e. the apparatus collapsing into a black hole? Is it sufficient to construct such an apparatus on Earth, or do we have to go build a Jupiter or red giant sized detector in order to do so? Can humanity afford to build such an apparatus or do the costs dwarf our world's economy by orders of magnitude? Are the world's politicians and voter bases willing to fund such an apparatus or would they prefer to use the money to fund healthcare or vaccine research? Etc. </p>\n<p>It isn't clear whether any of those obstacles are surmountable any time in the future, and you kind of need all of them to be surmountable in order to scientifically test the theories. We already have a hard time convincing people to fund the next successor to the LHC, and the next particle collider is very easy compared to the stuff needed to distinguish the various theories of quantum gravity / string theory from each other.</p>\n<p>So realistically, unless a miracle happens on par with the discovery of fossil fuels that accelerates technology enough and bring down costs enough to allow such high energy probes to happen, we have reached the limits of the scientific method in this field.</p>",
        "id": 507265024,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742560214
    },
    {
        "content": "<p>Also, in case people get confused, there is a big difference between testing whether gravity is quantum or not and testing whether specific theories of quantum gravity is true or not. Even if we do scientifically establish that gravity is quantum, we still don't have a way to experimentally distinguish asymptotic safety from string theory or loop quantum gravity yet.</p>",
        "id": 507266475,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742560662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507235884\">said</a>:</p>\n<blockquote>\n<p>Amazingly, lots of conformal field theory gets applied to condensed matter nowadays (afaik), so it's not even premature to investigate.</p>\n</blockquote>\n<p>Then perhaps people need to be more upfront that the science that they are doing is research into [tools to study] exotic matter phases in condensed matter physics, rather than waxing lyrical about finding a currently experimentally untestable and unscientific theory of everything in high energy physics. </p>\n<p>For example, Urs Schreiber is a condensed matter physicist who studies anyonic solitons and other topologically ordered quantum materials and their applications to quantum computing. M-theory and the modal type theory / (infinity,1)-topos theory that justifies M-theory is just a mathematical tool he uses to study anyonic solitons, and should be evaluated on the basis whether it is an effective tool in studying topologically ordered quantum materials. All this philosophical speculation in the podcast is ultimately a distraction and irrelevant to the more important question of M-theory's real scientific purpose in condensed matter physics.</p>",
        "id": 507268871,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742561440
    },
    {
        "content": "<p>And at least Urs Schreiber is making the case that string theory / M-theory is useful in condensed matter physics, which is important if string theory wants to be known as anything other than a failed scientific or unscientific theory in high energy physics a few decades from now.</p>",
        "id": 507282184,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742564905
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507266475\">said</a>:</p>\n<blockquote>\n<p>Also, in case people get confused, there is a big difference between testing whether gravity is quantum or not and testing whether specific theories of quantum gravity is true or not. Even if we do scientifically establish that gravity is quantum, we still don't have a way to experimentally distinguish asymptotic safety from string theory or loop quantum gravity yet.</p>\n</blockquote>\n<p>The phrase \"testing whether gravity is quantum or not\" displays a misunderstanding of what 'quantum gravity' means, or perhaps a misrepresentation within the podcast, to which I have little interest in listening. General relativity and the various branches of quantum  mechanics are experimentally well-tested theories resting on generally sound mathematical frameworks. However, they are not compatible with one another. \"Quantum gravity\" is not a single established theory, but rather the blanket term for attempts to reconcile the existing successful theories (and since it is such an appealing phrase, popular science literature abounds with bad or naive attempts). Finding a viable mathematical framework is a legitimate obstacle in this reconciliation.</p>\n<p>Regarding the possibility of testing theories as they arrive, one might expect the main source of data to be astronomical observations rather than terrestrial experiments, which makes the question of financial viability (given the popular support for the James Webb telescope, say) more reasonable. That said, in the current political climate I don't expect many ambitious research projects to be taking off soon -- besides private ones, I suppose.</p>",
        "id": 507308689,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1742571761
    },
    {
        "content": "<p>I'd interpret \"testing whether gravity is quantum or not\" as shorthand for \"testing whether gravity displays any deviations from general relativity predicts - deviations which might be due to quantum effects\".    Finding any such deviation from what general relativity predicts would be big news.  (That's <em>one</em> reason people are so excited about dark matter and dark energy, which may be such deviations.)    But proving that a deviation is due to quantum effects will not be so easy, since it requires coming up with a theory of quantum gravity, or at least an approximate one, and showing that it predicts the effect found.</p>\n<p>We already understand quantum gravity well enough that everyone (okay, everyone I consider reasonable) agrees on the leading quantum correction to the inverse square force law.   But <em>this</em> particular effect is not something we can measure yet - it's too small.</p>",
        "id": 507316116,
        "sender_full_name": "John Baez",
        "timestamp": 1742573744
    },
    {
        "content": "<p>Personally I was thinking about those proposed experiments which try to put a heavy object like a tardigrade in a superposition and then try to test the resulting gravitational field.</p>",
        "id": 507322944,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742575500
    },
    {
        "content": "<p>Such experiments would be good to do if possible (probably not with water bears).  Standard thinking predicts that when you measure the gravitational field of a superposed object, the field will pull towards one location of the superposed object or the other, and when you look (shine photons at it and detect them) that's where it will be.</p>",
        "id": 507352147,
        "sender_full_name": "John Baez",
        "timestamp": 1742585380
    },
    {
        "content": "<p>If anything else happens it will be revolutionary, but most physicists believe the standard thinking so if what I just described happens we'll feel confirmed, and feel we didn't learn anything helpful.</p>",
        "id": 507352892,
        "sender_full_name": "John Baez",
        "timestamp": 1742585637
    },
    {
        "content": "<p>Is the video any good, though?</p>",
        "id": 508165347,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1742956034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"389450\">Keith Elliott Peterson</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/508165347\">said</a>:</p>\n<blockquote>\n<p>Is the video any good, though?</p>\n</blockquote>\n<p>I found it enjoyable.</p>",
        "id": 508194470,
        "sender_full_name": "fosco",
        "timestamp": 1742972582
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507316116\">said</a>:</p>\n<blockquote>\n<p>I'd interpret \"testing whether gravity is quantum or not\" as shorthand for \"testing whether gravity displays any deviations from general relativity predicts - deviations which might be due to quantum effects\". </p>\n</blockquote>\n<p>General relativity flat out does not take quantum effects into account. It's a classical theory. Meanwhile, quantum theories are essentially formulated in flat space time (special relativity). If we have a particle in a superposition of position states, what is its local effect on spacetime? Answering that depends on constructing a theory of quantum gravity. We know that in the context of everyday life approximating with one theory or the other works fine, but there must be some rules for more extreme situations. It's not such an esoteric pursuit: these are both things that physicists model every day, it's not so absurd to wonder how to formally model how they interact.</p>",
        "id": 508326064,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1743006126
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/506955686\">said</a>:</p>\n<blockquote>\n<p>My own take on aspects of the program is in this <a href=\"https://www.cs.ox.ac.uk/seminars/2733.html\">OASIS talk</a>. Slides are <a href=\"https://ncatlab.org/davidcorfield/show/HomePage#OxLHoTT\">here</a>. I don't know if they intend to post the recording.</p>\n</blockquote>\n<p>A little off-topic... I get the talk/slide is for those in the field, but...</p>\n<p><a href=\"/user_uploads/21317/VvIGSoG90DgzFS4V9YV6DLhB/image.png\">image.png</a><br>\nWhat exactly is parameterized <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>H</mtext><mi mathvariant=\"double-struck\">C</mi></mrow><annotation encoding=\"application/x-tex\">\\text{H}\\mathbb{C}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6889em;\"></span><span class=\"mord text\"><span class=\"mord\">H</span></span><span class=\"mord mathbb\">C</span></span></span></span>-module spectra?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/VvIGSoG90DgzFS4V9YV6DLhB/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"758x565\" src=\"/user_uploads/thumbnail/21317/VvIGSoG90DgzFS4V9YV6DLhB/image.png/840x560.webp\"></a></div>",
        "id": 508358357,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1743016134
    },
    {
        "content": "<p><a href=\"https://ncatlab.org/nlab/show/parametrized+spectrum\">https://ncatlab.org/nlab/show/parametrized+spectrum</a>, <a href=\"https://ncatlab.org/nlab/show/module+spectrum\">https://ncatlab.org/nlab/show/module+spectrum</a></p>",
        "id": 508369593,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1743020178
    },
    {
        "content": "<p>And <a href=\"https://ncatlab.org/nlab/show/Eilenberg-Mac+Lane+spectrum\">https://ncatlab.org/nlab/show/Eilenberg-Mac+Lane+spectrum</a></p>",
        "id": 508379407,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1743023888
    },
    {
        "content": "<p>Re parameterized module spectra, there's a useful passage of <a href=\"https://ncatlab.org/schreiber/show/The+Quantum+Monadology\">The Quantum Monadology</a> here:<br>\n<a href=\"/user_uploads/21317/I7S3fOFyYN_ewjYB4pVBjbgl/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/I7S3fOFyYN_ewjYB4pVBjbgl/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"590x506\" src=\"/user_uploads/thumbnail/21317/I7S3fOFyYN_ewjYB4pVBjbgl/image.png/840x560.webp\"></a></div><p>1.22 is </p>\n<p><a href=\"/user_uploads/21317/6PPfIaZOS0mEH30LdG8Bz2nq/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/6PPfIaZOS0mEH30LdG8Bz2nq/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"570x119\" src=\"/user_uploads/thumbnail/21317/6PPfIaZOS0mEH30LdG8Bz2nq/image.png/840x560.webp\"></a></div>",
        "id": 508456936,
        "sender_full_name": "David Corfield",
        "timestamp": 1743064920
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/508326064\">said</a>:</p>\n<blockquote>\n<p>General relativity flat out does not take quantum effects into account. It's a classical theory. </p>\n</blockquote>\n<p>True.</p>\n<blockquote>\n<p>Meanwhile, quantum theories are essentially formulated in flat space time (special relativity).</p>\n</blockquote>\n<p>Not always - see below.</p>\n<blockquote>\n<p>If we have a particle in a superposition of position states, what is its local effect on spacetime? Answering that depends on constructing a theory of quantum gravity.</p>\n</blockquote>\n<p>I'll add some nuances:</p>\n<ul>\n<li>\n<p>Quantum field theory is formulated only on flat spacetime.  Quantum field theory on curved spacetime has been extensively developed, with a good intro being Wald's book <em><a href=\"https://archive.org/details/quantumfieldtheo0000wald\">Quantum Field Theory on Curved Spacetime and Black Hole Thermodynamics</a></em>.    This line of work is very important to people interested in quantum gravity, e.g. it's fundamental to our understanding of Hawking radiation from black holes and other aspects of black hole thermodynamics.   Quantum field theory on curved spacetime is by now just about as rigorous as quantum field theory on flat spacetime.  (Both have significant limitations.)   However, the bulk of this work does not attempt to take into account the 'back-reaction': the effect of quantum fields on the geometry of spacetime.   Spacetime is treated as having a fixed classical geometry.  Thus it's only an approximation to some better theory.</p>\n</li>\n<li>\n<p>Most researchers (including me) believe this better theory will require a quantum treatment of the gravitational field: 'quantum gravity'.   However, it's worth noting the dissident viewpoint that perhaps gravity is not quantum-mechanical in nature, recently popularized by the work of Jonathan Oppenheim.   Consistently coupling quantum and stochastic classical systems is hard, and I find it unappealing, but I'm glad someone is thinking about it (see for example his <a href=\"https://arxiv.org/abs/2301.04677\">Path integrals for classical-quantum dynamics</a>).   It's also possible that instead of gravity being quantum or classical it will be described by some theory that goes beyond what we currently understand.   My own thoughts can be found in <a href=\"https://math.ucr.edu/home/baez/quantum/\">Quantum quandaries: a category-theoretic perspective</a>.</p>\n</li>\n</ul>",
        "id": 508596357,
        "sender_full_name": "John Baez",
        "timestamp": 1743101540
    },
    {
        "content": "<p>Thanks for the nuances, which I think support the point I was trying to make: Madeleine was concerned about people working on quantum gravity because we don't have empirical evidence of \"whether gravity is quantum or not\", but this question doesn't really make sense until there any proposed theory of quantum gravity is advanced enough to make falsifiable predictions about what we should expect to observe. It's reasonable for physicists to be striving for \"some better theory\"!</p>",
        "id": 508608893,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1743106160
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507011444\">said</a>:</p>\n<blockquote>\n<p>I've sometimes thought of spending time explaining the flaws of various theories of quantum gravity, \"theories of everything\", etc.   I don't think many people are in a decent position to evaluate them, so it could be a useful service.  </p>\n</blockquote>\n<p>Apologies for resurrecting and derailing the thread, but I would certainly be interested in hearing your thoughts on this if you have something to point to or ever get around to writing/speaking on the topic.</p>",
        "id": 510008922,
        "sender_full_name": "Chris Barrett",
        "timestamp": 1743704443
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277010\">Chris Barrett</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/510008922\">said</a>:</p>\n<blockquote>\n<p>Apologies for resurrecting and derailing the thread, but I would certainly be interested in hearing your thoughts on this if you have something to point to or ever get around to writing/speaking on the topic.</p>\n</blockquote>\n<p>Yes, I agree with this! It seems almost on a monthly basis there's a \"new theory\" of quantum gravity. Most of them seem nonsense to me, but I don't have the experience or ability to pick out the precise reasons why it is nonsense. Though maybe John Baez meant explaining flaws in the more widely-known ones like string theory, loop quantum gravity, etc., but either way this is an interesting idea!</p>",
        "id": 510025422,
        "sender_full_name": "John Onstead",
        "timestamp": 1743709800
    },
    {
        "content": "<p>Thanks, both of you, for being interested!   I'm not sure what theories I would critique.  The main thing holding me back is that it could potentially be a lot of work - and not particularly pleasant work, since I'd wind up having to decide whether or not to argue with the proponents of these theories, who would presumably fight back.   I've seen how nasty these fights were back in the heyday of the \"loop-string wars\".</p>",
        "id": 510027353,
        "sender_full_name": "John Baez",
        "timestamp": 1743710446
    },
    {
        "content": "<p>As it happens, in my new job at the University of Edinburgh I'll  not only have a position specially focused on \"public engagement\" - I'll also be affiliated with the <a href=\"https://www.agq-cdt.org/\">Algebraic Geometry and Quantum Fields</a> program, and probably talking regularly to <a href=\"https://arxiv.org/search/?query=latham+boyle&amp;searchtype=all&amp;source=header\">Latham Boyle</a>, <a href=\"https://arxiv.org/search/?query=neil+turok&amp;searchtype=all&amp;abstracts=show&amp;order=submitted_date&amp;size=100\">Neil Turok</a> and others.  So, this gives me more motivation to learn more and talk more about particle physics, quantum gravity and the like.  On the other hand, it can cause trouble to publicly announce that one's colleague's theories are flawed!   This tends to push people to look at the bright side and talk about what works - not what doesn't work.</p>",
        "id": 510028273,
        "sender_full_name": "John Baez",
        "timestamp": 1743710791
    },
    {
        "content": "<p>Ah, that does make sense. But I think it's really cool to hear about this \"Algebraic Geometry and Quantum Fields\" program! I've been trying to learn quantum fields for some time now, but they are not very accessible as a topic to learn. Hopefully this public engagement/outreach can help make it easier for people to understand.</p>",
        "id": 510040327,
        "sender_full_name": "John Onstead",
        "timestamp": 1743715728
    },
    {
        "content": "<p>Quantum field theory is incredibly hard to learn, in part because there are so many approaches to it, and experts quickly jump between approaches.   </p>\n<p>I've considered writing a textbook on it... but it's not at the top of my list, so it may never happen.   I'm finally restarting work on my book on Lagrangian mechanics with Derek Wise.  That will take a while. </p>\n<p>Instead of attempting to explain quantum field theory in a systematic way, it mayb be more likely that I'll do some \"public engagement\" work explaining what U. Edinburgh faculty are doing these days.   Maybe like \"This Week's Finds in Edinburgh\".</p>",
        "id": 510051679,
        "sender_full_name": "John Baez",
        "timestamp": 1743721723
    }
]