[
    {
        "content": "<p>On the Topos Institute blog, Brendan Fong argues that, unfortunately, <a href=\"https://topos.site/blog/2022/11/who-is-category-theory-for/\">YouTube thinks category theory is for men</a>.</p>",
        "id": 310474976,
        "sender_full_name": "John Baez",
        "timestamp": 1668624326
    },
    {
        "content": "<p>This is not isolated to category theory. In a <a href=\"https://www.frontiersin.org/articles/10.3389/fcomm.2021.612667/full\">study of French science YouTubers</a>:</p>\n<blockquote>\n<p>Communicators report that their audience does not contain many women according to their channel’s YouTube statistics (M = 19.26%, SD = 17.36, n = 149). </p>\n</blockquote>\n<p>So the case of the Topos channel is not even that extreme.</p>",
        "id": 310523888,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1668643290
    },
    {
        "content": "<p>I wonder if this is youtube's algorithm discriminating by gender or it's pre-existing 'social norms' (pardon the terrible expression, suggestions are welcome) appearing in the data. Probably the two are engaged in a mutually reinforcing loop?</p>",
        "id": 310562307,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1668673079
    },
    {
        "content": "<p>It would be interesting to know if there is a psychological dynamics that leads to this happening most everywhere. (except in traditional dance clubs)</p>",
        "id": 310587991,
        "sender_full_name": "Henry Story",
        "timestamp": 1668683516
    },
    {
        "content": "<p>Ok, For example in France waiters are mostly men. But in california mostly female. <br>\nIn France dentist are mostly men (from my personal experience). When I went to east Germany they seemed to be all female (which makes sense, as they have smaller hands in general,...). <br>\nI would guess as soon as some grouping is no longer in a completely balanced position in terms of sexual presence (as by necessity it is in dancing) then the assymetry grows quickly.... So instead of trying to make everything symmetric, I would suggest finding complementary fields and have them dance together.</p>\n<p>(note: I don't think this should be the case in Category Theory, where I would expect 50/50 ratio), because the theme is about relating things.</p>",
        "id": 310589208,
        "sender_full_name": "Henry Story",
        "timestamp": 1668684028
    },
    {
        "content": "<p>Quite unfortunately, YouTube thinks a lot of things are for men, you name it...<br>\nBut there are many dimensions to this problem. Yes, preexisting social norms and YouTube's interest-based recommendation algorithms mutually reinforcing each other.<br>\nBut once in an algorithms course my professor explained that one important reason that predominantly men are shown most of the job ads, science videos, etc., is because women are shown videos/ads related to luxuries, clothing, etc., instead, because these simply generate more revenue! And as such the algorithm prioritize those.</p>",
        "id": 310589414,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668684131
    },
    {
        "content": "<p>Btw, Jordan Peterson uses the YouTube imbalance argument to explain why he has so many male followers (as he got big there). Given that women are just as much online, there have to be other networks where they are in the majority. Which ones? <br>\nI like YouTube, but it is also very much a mess.</p>",
        "id": 310589721,
        "sender_full_name": "Henry Story",
        "timestamp": 1668684265
    },
    {
        "content": "<p>Indeed, as a man, I almost never get recommended ads and videos about luxuries, etc. Except for luxury restaurants, but just because I do watch a lot of food videos</p>",
        "id": 310589841,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668684313
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Who.20is.20category.20theory.20for.3F/near/310589721\">said</a>:</p>\n<blockquote>\n<p>Btw, Jordan Peterson uses the YouTube imbalance argument to explain why he has so many male followers (as he got big there). Given that women are just as much online, there have to be other networks where they are in the majority. Which ones? <br>\nI like YouTube, but it is also very much a mess.</p>\n</blockquote>\n<p>I'm pretty sure they're on YouTube too. But they're watching different videos, in large part because YouTube's algorithms are recommending them different videos...</p>",
        "id": 310590013,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668684368
    },
    {
        "content": "<p>Ah yes, I must have misunderstood. I thought there was a gender imbalance on youtube as a whole. There is one, but not as pronounced as I was starting to think <a href=\"https://www.globalmediainsight.com/blog/youtube-users-statistics/#:~:text=The%20male-female%20ratio%20of%20YouTube%20viewers%20is%2011%3A9.,YouTube%20was%20Apple%20Inc%2C%20having%20spent%20%24237.15%20million\">https://www.globalmediainsight.com/blog/youtube-users-statistics/#:~:text=The%20male-female%20ratio%20of%20YouTube%20viewers%20is%2011%3A9.,YouTube%20was%20Apple%20Inc%2C%20having%20spent%20%24237.15%20million</a>.<br>\n<a href=\"/user_uploads/21317/OtWuzW-98NFEmaOpaaJReqlF/Screenshot-2022-11-17-at-12.29.11.png\">Screenshot-2022-11-17-at-12.29.11.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/OtWuzW-98NFEmaOpaaJReqlF/Screenshot-2022-11-17-at-12.29.11.png\" title=\"Screenshot-2022-11-17-at-12.29.11.png\"><img src=\"/user_uploads/21317/OtWuzW-98NFEmaOpaaJReqlF/Screenshot-2022-11-17-at-12.29.11.png\"></a></div>",
        "id": 310590535,
        "sender_full_name": "Henry Story",
        "timestamp": 1668684560
    },
    {
        "content": "<p>Ok, so now I understand. I actually thought that mathematics was the only field that was gender balanced... So the youtube imbalance does need to be investigated. <br>\nIs it the advertising model? Is it that people have been coming to CT from computer programming where there is a gender imbalance? (I know I did: in the 80s CT was abstract nonsense, in the 2010s it was not possible to deny its being useful - and that actually came as a big surprise to me. Plus excellent courses by Bartosz Milewski on programming...)</p>",
        "id": 310591564,
        "sender_full_name": "Henry Story",
        "timestamp": 1668684918
    },
    {
        "content": "<p>Mathematics is certainly not gender balanced... Yet to see one gender-balanced mathematics department. But yes, the YouTube imbalance is a different though closely connected issue.<br>\nI would argue that interest-based recommendation algorithms play an important role in this imbalance. Especially when taking into account profitability... Math just can't beat luxuries, fashion, cosmetics, etc. in terms of profitability. The real question is how to ensure interest-based recommendation algorithms do not propagate discrimination and inequality, while still maintaining profitability for the companies, which seems a very difficult question indeed. An entire field was created (algorithmic fairness) to address this problem. So I guess I have no idea either.</p>",
        "id": 310613621,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668693244
    },
    {
        "content": "<p>The situation discussed above for category theory reminds of my experience with engineering, where I perceive there to be a large gender gap. Interestingly, at least in Canada, the situation is very different in medical school. For example, there are significantly more women than men in my sister's medical school class. I wonder if the history of gender imbalance in the context of medical school would provide any helpful insights.</p>",
        "id": 310679228,
        "sender_full_name": "David Egolf",
        "timestamp": 1668711995
    },
    {
        "content": "<p>The situation might be a bit different here because there was always a strong association between women and healthcare historically, so bridging this gap might be easier than for, e.g., mathematics.</p>",
        "id": 310819843,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668777521
    }
]