[
    {
        "content": "<p>Thought I'd share <a href=\"https://www.chinatalk.media/p/the-many-lives-of-soviet-dissidents\">this fascinating conversation</a> on the Soviet dissident movement, which amply discusses the role of the mathematician Alexander Yesenin-Volpin, described as the \"intellectual godfather\" of the movement:</p>\n<blockquote>\n<p>Volpin was not just a mathematician, but a mathematical logician, which is to say he was interested in the nature of truth statements in mathematics and how we know that this or that given proof is rigorous or not. <br>\n[...]<br>\nVolpin’s quest was to develop a language that would be free of those ambiguities and lack of clarity. He obviously looked at mathematics as the gold standard for clarity and rigor when pursuing truth or trying to make statements about reality. But he, like everybody else in this movement, including Wittgenstein himself, ultimately failed to come up with an ideal language that could fulfill those criteria of clarity and rigor.<br>\n[...]<br>\nHaving failed, along with everybody else, to produce an actual algorithmic ideal language, he realized that Soviet law was a plan B for this quest. He gradually developed this approach that if the Soviet government could be held to its own laws, which he thought were actually pretty good, the civil liberties that were enshrined in the Soviet Constitution and the various procedural norms that were encoded in the code of criminal procedure — things would be a lot better.<br>\nThis became the disarmingly simple grand strategy of this movement, which was: make the government honor its own laws. We’re not out to change the government, we’re not out to topple the government, we’re certainly not out to seize power ourselves. It’s impossible for me to imagine someone like Volpin running anything because of how abstract and literal his thinking was. He was not a social creature. But this quest for the rule of law in a society that had gone through some of the worst episodes of lawlessness and state-sponsored terror. This became the master plan for the movement.</p>\n</blockquote>",
        "id": 534766507,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1755355329
    },
    {
        "content": "<p>That's really interesting. I'm mostly familiar with Yesenin-Volpin for his defense of ultrafinitism.</p>\n<p><a href=\"/user_uploads/21317/l24NdYCYITugiWo4d7EVUQI3/ultrafinitism.ps\">ultrafinitism.ps</a></p>",
        "id": 534769287,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1755358327
    }
]