[
    {
        "content": "<p>I am new to Zulip, and I second the comment <span class=\"user-mention\" data-user-id=\"308790\">@Merrick Hua</span>  made earlier about Zulip not being too intuitive. Maybe it's just a matter of getting used to it  (I am familiar with Slack), but I think that this is something we might want to address to make it more inclusive.</p>",
        "id": 199665663,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591212771
    },
    {
        "content": "<p>Me too. I guess if I spent more time here I'd get used to Zulip's ways, and figure out how to change the settings to my preference, but for now I'm with Merrick and Nina.</p>",
        "id": 199665873,
        "sender_full_name": "Tom Leinster",
        "timestamp": 1591212860
    },
    {
        "content": "<p>Yes, we're going to make a webpage with a guide to the server, as well as our code of conduct and some resources. Sorry that we haven't done this yet; but there are people who want to help in <a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/stream/229122-general.3A-meta\">#general: meta</a>. For now, there's a simple overview at <a href=\"#narrow/stream/229111-general/topic/guide.2Fwelcome/near/191513308\">https://categorytheory.zulipchat.com/#narrow/stream/229111-general/topic/guide.2Fwelcome/near/191513308</a></p>",
        "id": 199666494,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591213163
    },
    {
        "content": "<p>Having spent about 20 minutes to an hour a day on Zulip I can promise it's a lot of fun when you get used to it.</p>",
        "id": 199666997,
        "sender_full_name": "John Baez",
        "timestamp": 1591213365
    },
    {
        "content": "<p>It's good for \"chatting about lots of stuff\" in parallel streams, so you can chat about one thing and see another message has shown up on another topic and hop over to that, etc.</p>",
        "id": 199667104,
        "sender_full_name": "John Baez",
        "timestamp": 1591213411
    },
    {
        "content": "<p>This makes it extremely engaging, esp. if you're quarantined.</p>",
        "id": 199667138,
        "sender_full_name": "John Baez",
        "timestamp": 1591213426
    },
    {
        "content": "<p>For the first few days I thought it was weird.</p>",
        "id": 199667210,
        "sender_full_name": "John Baez",
        "timestamp": 1591213444
    },
    {
        "content": "<p>Topics also make it more practical to have discussions that take place over a span of many hours or even days, which is important when participants are distributed across many time zones.</p>",
        "id": 199669061,
        "sender_full_name": "Reid Barton",
        "timestamp": 1591214313
    },
    {
        "content": "<p>This seems like a good place to propose that a conciseness guideline be included in the guidelines are being drawn up.<br>\nIt was noted early on in Zulip that a few people (including myself) found themselves very comfortable here, and so there developed a very vocal minority. While this has generated some interesting in-depth conversation, it has not left the space for new or less adept users to easily pick up and join discussions.<br>\nAs an admin, I would like to be able to point to a guideline about \"conciseness as consideration towards other users\" when someone feels the need to personally address every point that other users in a discussion have made. This is typically not done in a bad spirit (although there are exceptions), so I haven't had good grounds to discourage over-engagement before now.</p>",
        "id": 199727107,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591265834
    }
]