[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"699750\">Julius Hamilton</span> has marked this topic as resolved.</p>",
        "id": 448355449,
        "sender_full_name": "Notification Bot",
        "timestamp": 1719845699
    },
    {
        "content": "<p>This is kind of an experiment in summarizing the content of the conversation and then if there are further questions they can be opened in new threads.</p>\n<ul>\n<li>I wanted to make a categorical model of momentum trading in order to design a momentum trading algorithm for cryptocurrency trading</li>\n<li>I personally decided that going forward, when making ologs, I will always consider the objects to be “sets of real-world things”, until I think of a clear alternative </li>\n<li>People suggested I read papers on the axiomitization of blockchains and the formalization of ledgers</li>\n<li>Patterson’s article on relational ologs seems really elucidating </li>\n<li>ologs can be the domains of functors, where the text labels are the domain, being mapped to mathematical structures</li>\n<li>ologs can be thought of as the domain being text labels and the codomain being data points, like the name of a column in a database.</li>\n<li>I think a table in a database can be understood as a collection of morphisms to an object (a cospan) because tables are like functions, the headers are indices which return a value</li>\n<li>I think Remy says that seeing an olog as a functor from text labels to mathematical structures is analogous to seeing it as a mapping from a language to a structure in model theory </li>\n<li>I think Remy says if my model includes power sets, I should use a category of monoids. In this model, I think the objects are not just sets of things, but monoids of things, where I think the monoid operation tends to be the disjoint union.</li>\n<li>I think Remy says that to add time as a factor, I could have a functor from a category of time intervals to ICM, which I think would serve to index everything temporally </li>\n<li>Remy said to design ologs so that they can <em>decompose</em> information </li>\n<li>I have some questions about choices for modeling “bundles of things” that I want to open a new thread about</li>\n</ul>\n<p>Thank you</p>",
        "id": 448363302,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1719847332
    },
    {
        "content": "<p>Besides the obvious technical difficulties, if the Ethereum Foundation has plans to ship full homomorphic encryption integration that are vaguely similar to what they did for zkproofs or verkle tries or statelesness, you can expect to have this exciting piece of tech to be part of the ecosystem in circa 20-never.</p>",
        "id": 453810215,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1721861328
    }
]