[
    {
        "content": "<p>So this is probably WAY off base, but I'm always sort of sneaking around looking for higher categories. And I tend to think that we can expect something as flexible and complicated as the ideas of \"symbol\" and \"communication\" to have a bit more structure (or a bit \"less\" structure?) than a regular old category. In particular, I'm thinking about n-categories. So whatever your category is that's coming up in semiotics or cybernetics, it's going to have objects and morphisms between them. But if these morphisms have some \"physical\" meaning, then it should make sense to ask what makes to morphisms comparable, or when can I \"deform\" one morphism into another. And so, modulo boring things like details and actual mathematics, maybe you've got a bicategory or something.</p>",
        "id": 191831703,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585186412
    },
    {
        "content": "<p>I don't think you're off base, this is how I think of it. I don't want to water down cybernetics especially when we have something in the Zulip who has made it their focus, but where cybernetics seems to certainly be about communication between dynamic objects, semiotics is the how this \"meaning\" is \"produced.\"</p>",
        "id": 191878114,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585226776
    },
    {
        "content": "<p>Frankly, I think our best bet to avoid the poststructuralism for now and go into \"biosemiotics,\" which is the field of semiotics which is less concerned with cultural exchange and more concerned with \"semiosis\" (the production of signs) in the living world, (plant communication, animal communication, &amp;c.) This began with Morris, Seboek, and now has a special department in the University of Tartu under Kalevi Kull.</p>\n<p>I think it's fascinating, and there's been recently new developments on the \"minds\" of animals and plants (there's also 'mycosemiotics'...) but the objective is studying the different _codes_ employed by the natural world. I mentioned a LaTeX document that would propose the Program and its resources around this topic, I hope to have one out by Saturday when work subsides</p>",
        "id": 191878664,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585227093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276679\">@Jonathan Beardsley</span> You might be interested in C.S. Peirce (and Umberto Eco's _The Theory of Semiotics_) where they post the \"problem of infinite semiosis,\" i.e., in Peirce's idea, sign relations have a type-signature Sign-Interpretant-Referent.</p>\n<p>Sign: what stands for another thing, the Referent (CT: source?)<br>\nInterpretant: what makes the relation between the Sign and the Referent possible (CT: arrow?)<br>\nReferent: what is being signified (CT: target?)</p>\n<p>Peirce _claims_ that the Interpretant is itself a sign, and therefore a part of another triad. To me, this sounds like Higher Category Theory, since the arrow is mapped to another object by a higher relation, and so forth, _ad infinitum_.</p>",
        "id": 191879271,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585227402
    }
]