[
    {
        "content": "<p>Stream created by <span class=\"user-mention silent\" data-user-id=\"276009\">Burak Emir</span>.</p>",
        "id": 191539019,
        "sender_full_name": "Notification Bot",
        "timestamp": 1584998846
    },
    {
        "content": "<p>I heard about Kristeva from an anime, Ergo Proxy. Abjection would be a cool name for an ACT process. Don't we all love things that produce meaning?</p>",
        "id": 191539429,
        "sender_full_name": "Burak Emir",
        "timestamp": 1584999029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276010\">@janet singer</span> I wonder if mentioning somebody adds then to a stream. Just playing around with this app.</p>",
        "id": 191539999,
        "sender_full_name": "Burak Emir",
        "timestamp": 1584999346
    },
    {
        "content": "<p>From my knowledge, abjection is the casting off or devaluation of something horrific by experiencing it, like the choice we make to view a dead body of a loved one?</p>",
        "id": 191540185,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1584999445
    },
    {
        "content": "<p>For (A)CT to find post-structuralism valuable, it would have to give a framework for a, e.g., general _abjective_ process, i.e. some process which manipulates a semiotic structure such that things re-signify something less. This means we have to design a framework for signification, etc.</p>",
        "id": 191540360,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1584999558
    },
    {
        "content": "<p>Then of course are the usual CT properties to be shown.</p>",
        "id": 191540385,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1584999582
    },
    {
        "content": "<p>It is the only thing I remembered from Kristeva. I am generally pretty ignorant about post-structuralism, but doesn't the \"skeletal category\" somehow qualify :D</p>",
        "id": 191540810,
        "sender_full_name": "Burak Emir",
        "timestamp": 1584999820
    },
    {
        "content": "<p>I’m not familiar with Kristeva’s work, but I’m up for the challenge of making way through the thickets of terminology and concepts relevant to this stream! I’m particularly interested in Zalamea’s synthesis of pragmatism/ continental philosophy/ modern mathematics</p>",
        "id": 191541084,
        "sender_full_name": "janet singer",
        "timestamp": 1584999969
    },
    {
        "content": "<p>And I thought I saw a response from <span class=\"user-mention\" data-user-id=\"275937\">@John Vickers</span> that I can’t find now …?</p>",
        "id": 191541150,
        "sender_full_name": "janet singer",
        "timestamp": 1585000014
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276009\">@Burak Emir</span> there are a lot of concepts in-and-out of poststructuralism that smack of categorical flavor. We should hunt them down...<br>\n<span class=\"user-mention\" data-user-id=\"276010\">@janet singer</span> agree completely, I bought one copy for myself and another for a friend. Whereas the \"categorification of abjection\" maps mathematics into philosophy, Zalamea is a philosophical treatment of mathematics</p>",
        "id": 191541377,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585000142
    },
    {
        "content": "<p>An interesting duality that the toposophy channel might also be interested in. I think it would help people if we made this 'adjunction' clearer</p>",
        "id": 191541434,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585000187
    },
    {
        "content": "<p>Yes, definitely – both are needed and it would be nice to make the adjunction clear. So should we have one stream for philosophy + CT with two primary topics for the two directions? Or two ‘related’ streams each with subtopics? Is there a way to provide an ‘About’ for the streams that explains the relations?</p>",
        "id": 191542321,
        "sender_full_name": "janet singer",
        "timestamp": 1585000673
    },
    {
        "content": "<p>I believe <span class=\"user-mention\" data-user-id=\"275937\">@John Vickers</span> will find us on this stream, eventually. It does take time to get used to this medium. I am looking forward to asking you guys many naive questions.</p>",
        "id": 191542499,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585000778
    },
    {
        "content": "<p>Is semiotics and semiosis not somewhat different, more narrow than philosophy in general?</p>",
        "id": 191542879,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585000983
    },
    {
        "content": "<p>I think it is, but it's taken on its own life.</p>",
        "id": 191543067,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585001087
    },
    {
        "content": "<p>I would have placed the toposophy stream somewhere in philosophy of mathematics, whereas - in my naive view - semiotics and semiosis is a study more of communication. Am I off? I do think there is a connection, maybe an adjunction is really appropriate.</p>",
        "id": 191543173,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585001146
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276009\">@Burak Emir</span> I agree, I think semiotics has a life of its own where \"production of meaning\" and the relational nature of semiotics is worth seeing if CT can clarifying it.</p>",
        "id": 191543395,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585001198
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276010\">@janet singer</span> maybe we cna jump into toposophy if we feel like its more appropriate later</p>",
        "id": 191543417,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585001212
    },
    {
        "content": "<p>Logic, seen as a linguistic activity, seems also not far off. Most of my study of CT was mainly guided by logics.</p>",
        "id": 191543592,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585001321
    },
    {
        "content": "<p>Good questions with no single answer, though phil(math) and math(phil) is a good complementarity to keep in mind,</p>",
        "id": 191544075,
        "sender_full_name": "janet singer",
        "timestamp": 1585001622
    },
    {
        "content": "<p>Maybe if we proceed by reading specific texts that would allow for some common contexts for discussion?</p>",
        "id": 191544396,
        "sender_full_name": "janet singer",
        "timestamp": 1585001804
    },
    {
        "content": "<p>I think we should focus on \"complementarity\" (or duality, etc.) as Janet puts it just to filter out structure, but if there's anything interesting you find, I say post! Kristeva's semiotic square distinguishes Contradiction and Contrary relations which is itself a nice relation I would like to bring to the table later.</p>",
        "id": 191544404,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585001809
    },
    {
        "content": "<p>Yes, maybe Umberto Eco _A Theory of Semiotics_<br>\n to start or do you have something in particular in mind?</p>",
        "id": 191544460,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585001853
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276010\">@janet singer</span> Can you describe Zalamea's synthesis and what is intriguing about it? I am not familiar at all. With anything : ) I do find pragmatics is easy to relate to.</p>",
        "id": 191544602,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585001920
    },
    {
        "content": "<p>This is good <a href=\"https://ncatlab.org/nlab/show/Fernando+Zalamea\" target=\"_blank\" title=\"https://ncatlab.org/nlab/show/Fernando+Zalamea\">https://ncatlab.org/nlab/show/Fernando+Zalamea</a></p>",
        "id": 191545120,
        "sender_full_name": "janet singer",
        "timestamp": 1585002261
    },
    {
        "content": "<p>Fernando Zalamea Traba is a mathematician at Universidad Nacional de Colombia at Bogotá with main interests in categorical logic, non-classical logic, history and philosophy of mathematics. He is also writing essays in cultural studies.</p>\n<p>On the difference between modern and contemporary mathematics: Just as Albert Lautman identified 5 features characteristic of advanced (post mid-19th century) mathematics (1-5 in this list), Zalamea identifies an additional set of 5 characteristics (6-10 in this list) which emerge only in the mid 20th century and (in addition to 1-5, which are conserved) define contemporary mathematics:</p>\n<p>1) the complex hierarchisation of various theories, irreducible to systems of intermediate deduction;<br>\n2) the richness of the models, irreducible to linguistic manipulation;<br>\n3) the unity of structural methods and of conceptual polarites, beyond the effective multiplicity of models;<br>\n4) the dynamics of the creative activity, in a permanent back-and-forth between freedom and saturation, open to the Platonic division and the Platonic dialectic;<br>\n5) the mathematically demonstrable relation between what is multiple on a given level and what is singular on another, through a sophisticated lattice of mixed ascents and descents.<br>\n6) the structural impurity of arithmetic (Weil’s conjectures, Langlands program, the theorems of Deligne, Faltings and Wiles etc.)<br>\n7) the systematic geometrization of all environments of mathematics (sheaves, homologies, cobordisms, geometrical logic etc.)<br>\n8) the schematization and the liberation from set theoretical, algebraic, and topological restrictions (groupoids, categories, schemas, topoi, motifs etc..)<br>\n9) the fluxion and deformation of the usual boundaries of mathematical structures (nonlinearity, noncommutativity, nonelemantarity, quantization etc)<br>\n10) the reflexivity of theories and models onto themselves (classification theory, fixed-point theorems, monstrous models, elementary/nonelementary classes etc..)</p>",
        "id": 191545438,
        "sender_full_name": "janet singer",
        "timestamp": 1585002455
    },
    {
        "content": "<p>Just gauging, what are our histories with CT, semiotics? I've been amateur in CT for a few years but I'm trying to seriously learn now. I was a B.A. in philosophy at USF, no publications, but I took special interest in semiotics, existential geography, and bioethics. I've been working full-time for four years after with a general exploratory attitude but I'm trying to focus on serious understanding now.</p>",
        "id": 191546006,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585002784
    },
    {
        "content": "<p>I have undergrad degrees in humanities and math, MA in math but amateur in CT as well because my interest keeps diverging into the kinds of questions Zalamea raises.</p>",
        "id": 191547339,
        "sender_full_name": "janet singer",
        "timestamp": 1585003547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276010\">@janet singer</span> thanks! I have some reading up to do. 6-10 seems related to something I have been pondering.</p>",
        "id": 191547444,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585003594
    },
    {
        "content": "<p>I have been reading up on CT from the angle of programming language technology. Lambda calculus, denotational semantics, higher order logic and types.</p>",
        "id": 191547604,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585003689
    },
    {
        "content": "<p>There is this multitude of formal systems that each let you express \"all mathematics\", which makes the foundations one chooses somewhat arbitrary.</p>",
        "id": 191547736,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585003795
    },
    {
        "content": "<p>As a programmer, one works with abstractions that are all in some sense models of reality, yet in another finite mathematical structures stacked on top of each other, in ways we fail to grasp.</p>",
        "id": 191547900,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585003908
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275940\">@Matt Cuffaro</span> have you read much of Zalamea’s book? There were some passages that were dense but it wasn’t as tough going as I expected. It does require prior immunization to both mathematical and Continental perspectives, and it seems not many people have both</p>\n<p>(I only got part way through before getting diverted expecting to get back to it, preferably with a reading group.)</p>",
        "id": 191548050,
        "sender_full_name": "janet singer",
        "timestamp": 1585004013
    },
    {
        "content": "<p>I got diverted as well</p>",
        "id": 191548538,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585004319
    },
    {
        "content": "<p>I haven’t read it since 2016 (? It’s publishing year?)</p>",
        "id": 191548562,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585004335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275940\">@Matt Cuffaro</span> to answer your q, I know my way around CCCs and used to know the triangle identities of adjunctions. Revisiting categorical logic.</p>",
        "id": 191548987,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585004568
    },
    {
        "content": "<p>BTW, is Mazzola's topos of music in scope? I heard the word 'gesture'. Couldn't get hold of it through a library but I believe the concept of gesture is relevant here.</p>",
        "id": 191553309,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585007832
    },
    {
        "content": "<p>I started reading Mazzola's \"Cool Math for Hot Music\", it was very interesting, but I haven't revisited it recently. My math background is probably to the point where I can understand more of it now.</p>",
        "id": 191566123,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1585024484
    },
    {
        "content": "<p>I agree, when I first saw it in the library years ago I was astounded</p>",
        "id": 191566241,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585024702
    },
    {
        "content": "<p>I am always amused at the subtitle \"A First Introduction to Mathematics for Music Theorists\", given how quickly the book gets into set theory and groups and rings and topology. It's more like a head-first dive!</p>",
        "id": 191566386,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1585025016
    },
    {
        "content": "<p>You all seem to be already at post-structuralism. I'm still grasping how cybernetics, CT and structuralism are connected, as outlined in \"The Cybernetic Matrix of <code>French Theory</code>\" by Céline Lafontaine.</p>",
        "id": 191620953,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1585061705
    },
    {
        "content": "<p>I think we’re just flying around. There’s a lot of explore. I have a special interest in cybernetics too. Another article I’d like to check out</p>",
        "id": 191630747,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585065135
    },
    {
        "content": "<p>I wasn’t able to read the two articles last night. Hopefully I’ll have time again</p>",
        "id": 191630789,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585065152
    },
    {
        "content": "<p>I think i am going to ask Christian to get rid of the \"abjection\" piece  of the stream title. I was close to ordering a copy of Umberto Eco last night.</p>",
        "id": 191633024,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585065994
    },
    {
        "content": "<p>We kind of got to a point where we'd want this stream to be \"mathematics of (semiotics &amp; semiosis / phil)\" and the other stream would be phil of math. I am neither very learned nor a big fan of post-structuralism.</p>",
        "id": 191633311,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585066097
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> renamed stream <strong>semiotics, semiosis and abjection</strong> to <strong>semiotics and semiosis</strong>.</p>",
        "id": 191671018,
        "sender_full_name": "Notification Bot",
        "timestamp": 1585083282
    },
    {
        "content": "<p>... sorry, Kristeva. We have chosen to dissociate from a concept of yours, in order to preserve our identity.</p>",
        "id": 191671724,
        "sender_full_name": "Burak Emir",
        "timestamp": 1585083632
    },
    {
        "content": "<p>I wanna get how post structuralism comes in here.</p>",
        "id": 191832191,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585187116
    },
    {
        "content": "<p>I mean, again, I'm embarrassingly uneducated about this type of thing, in that I only have the faintest grasp of structuralism and post-structuralism.</p>",
        "id": 191832242,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585187173
    },
    {
        "content": "<p>But one aspect of post-structuralism I always thought was cool (again assuming I understood it at all, which maybe I didn't) was this notion of Derrida's (maybe?) that the idea of \"concept\" or \"symbol\" that points to something specific is pretty messy. And I sort of got this idea that maybe our ideas of \"symbols,\" or even \"concepts,\" were kind of loci in networks, or maybe something more like \"clumps\" if you zoomed out far enough.</p>",
        "id": 191832330,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585187314
    },
    {
        "content": "<p>And so you could have this kind of strange category where the arrows are something like... \"evokes?\"</p>",
        "id": 191832353,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585187356
    },
    {
        "content": "<p>And the objects are \"concepts\" or \"symbols\"?</p>",
        "id": 191832365,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585187370
    },
    {
        "content": "<p>I don't think you should be embarrassed about not knowing (post)structuralism! it is sort of heady. I posted a link to one Leandro's \"Categorical Semiotics\" where he tries to connect semiotics with fuzzy logic. I can't vouch for it nor does it look like what I imagine CTemiotics to look like, but it addresses the \"messiness.\"</p>",
        "id": 191877151,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585226219
    },
    {
        "content": "<p>Umberto Eco in his Theory of Semiotics gives specific meaning between \"denotation\" and \"connotation,\" which is to say that the connotation is the evocation that goes on in what we might call some higher space of thinking about things. I would expect that a denotation (a relation between two things, I suppose) _induces_ a relation between the target object and the connotation. These relations don't exist in the world, but are something which the mind _does_</p>",
        "id": 191877537,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585226471
    },
    {
        "content": "<p>Re: derrida, I'm writing a LaTeX document on readings. I think I'm going to give some time to Derrida and post-structuralism, because it will help me remember its content and maybe the stream will like it</p>",
        "id": 191877597,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585226517
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> changed the <a href=\"/help/stream-permissions\">access permissions</a> for this stream from <strong>Public</strong> to <strong>Web-public</strong>.</p>",
        "id": 397854550,
        "sender_full_name": "Notification Bot",
        "timestamp": 1697898948
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> changed the description for this stream.</p>\n<ul>\n<li><strong>Old description:</strong></li>\n</ul>\n<blockquote>\n<p>Learn about signs and meaning, and try to identify an ACT concept that we can name abjection.</p>\n</blockquote>\n<ul>\n<li><strong>New description:</strong></li>\n</ul>\n<blockquote>\n<p>Deprecated, use #theory: science instead. Learn about signs and meaning, and try to identify an ACT concept that we can name abjection.</p>\n</blockquote>",
        "id": 399479180,
        "sender_full_name": "Notification Bot",
        "timestamp": 1698751078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> renamed stream <strong>semiotics and semiosis</strong> to <strong>deprecated: semiotics and semiosis</strong>.</p>",
        "id": 399479181,
        "sender_full_name": "Notification Bot",
        "timestamp": 1698751078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> changed the <a href=\"/help/stream-sending-policy\">posting permissions</a> for this stream:</p>\n<ul>\n<li><strong>Old permissions</strong>: All stream members can post.</li>\n<li><strong>New permissions</strong>: Only organization administrators and moderators can post.</li>\n</ul>",
        "id": 399479203,
        "sender_full_name": "Notification Bot",
        "timestamp": 1698751083
    }
]