[
    {
        "content": "<p>I've occasionally heard this word applied with a negative connotation, describing some sort of nefarious or underhanded practice in academic circles, but online dictionaries are of little help in getting the sense I'm searching for. </p>\n<p>Very roughly, the sense I get is that it refers to a kind of appropriation, verging on plagiarism, along the lines of \"this point of view was ours all along\", but if this is sort of on the right track, I hope someone can help sharpen it or make it more precise. Or correct it if I'm off.</p>",
        "id": 444974873,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718543226
    },
    {
        "content": "<p>To illustrate the usage, here is Gian-Carlo Rota (from his essay Combinatorics, Representation Theory and Invariant Theory, reproduced in Indiscrete Thoughts): </p>\n<blockquote>\n<p>Norbert Wiener would often join the younger mathematicians at lunch. He loved to sit at the old wooden tables in Walker. He glowed under the stares of the undergraduates and craved the fawning admiration of the younger mathematicians. The temptation to tease him was irresistible.</p>\n</blockquote>\n<blockquote>\n<p>One day several of us were having lunch at the usual table in Walker. Norbert Wiener sat at the head, with Paul Cohen at his right; others at the table were probably Adriano Garsia, Arthur Mattuck, myself, and some other person whose name I cannot recall. Cohen turned towards Wiener and asked in a tone of mock candor, \"Professor Wiener, what would you do if one day when you went home, you were to find Professor X sitting on your living room sofa?\" Cohen was alluding to a well-known mathematician who was known to indulge in the dubious practice of\"nostrification.\" Wiener became red in the face and snapped back, \"I would throw him out and start counting the silver!\" I leave it to you to figure out who Professor X is. By the way, the term \"nostrification\" was introduced by Hilbert, and the practice has been faithfully carried on by his students.</p>\n</blockquote>",
        "id": 444974883,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718543243
    },
    {
        "content": "<p>Classic Rota, these sly knowing allusions (insinuations?). Was the practice introduced by Hilbert, or the term invented by Einstein? However it was introduced/invented, it seems to have to do with a priority dispute over general relativity, where Hilbert and Einstein were both developing their own accounts, coming at it from different angles, but they were in close contact throughout, for the most part harmoniously from what I can gather, but maybe Einstein reacted at some point. Some information can be gleaned <a href=\"https://en.wikipedia.org/wiki/General_relativity_priority_dispute#Cory/Renn/Stachel_and_Friedwardt_Winterberg_(1997/2003)\">here</a>. </p>\n<p>By the way, I don't think I would ever solve the problem of Professor X on my own. Any ideas?</p>",
        "id": 444974965,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718543301
    },
    {
        "content": "<p>I can't really answer your questions, but from Pais' book <em>Subtle is the Lord</em> I got the impression that Einstein was very miffed by Hilbert taking credit for the field equations for gravity.   On December 20th, 1915 he wrote to Hilbert:</p>\n<blockquote>\n<p>There has been a certain pique between us, the causes of which I do not wish to analyze. I have struggled with complete success against a feeling of bitterness connected with that. I think of you once again with untroubled friendliness and ask you to try to do the same regarding me. It is really a shame if two real fellows who have freed themselves to some extent from this shabby world should not enjoy each other.</p>\n</blockquote>",
        "id": 444976745,
        "sender_full_name": "John Baez",
        "timestamp": 1718544770
    },
    {
        "content": "<p>He did not in this letter clarify what he was talking about, but this happened right after both of them wrote papers about those field equations.</p>",
        "id": 444976827,
        "sender_full_name": "John Baez",
        "timestamp": 1718544852
    },
    {
        "content": "<p>Hilbert also arranged for Einstein to give series of lectures in Göttingen, hosting him in his own home, and other letters between them seem to attest to their mutual admiration. Einstein obviously had the greater physical intuition; my rough sense is that Hilbert proceeded along more formal mathematical lines (and wanted to incorporate electromagnetism). Needless to say, everyone associates general relativity with Einstein, and Hilbert hardly at all (who?). </p>\n<p>I'm getting my information from the <a href=\"https://en.wikipedia.org/wiki/General_relativity_priority_dispute\">Wikipedia article</a>, where maybe the neutral point of view encourages a rosier description of their relations. But by all accounts they were corresponding intensively during the year 1915.</p>",
        "id": 444979684,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718547468
    },
    {
        "content": "<p>Irrelevant aside:</p>\n<p>I don't doubt the veracity of the Norbert Weiner story, but honestly find it hard to square these two propositions <br>\n(1) Norbert Weiner cares about good silverware<br>\n(2) Norbert Weiner forgets: that he is moving, where he is moving to, and what his own daughter looks like.</p>\n<p>(In all seriousness, I've never heard that he suffered from <a href=\"https://en.wikipedia.org/wiki/Prosopagnosia\">prosopagnosia</a> so I attribute this at least partly to his severe near-sightedness coupled with panic.)</p>",
        "id": 444979957,
        "sender_full_name": "Eric M Downes",
        "timestamp": 1718547712
    },
    {
        "content": "<p>Not recognizing his own daughter is probably apocrypha, and disputed by that daughter, although she added that the rest of the story is mainly correct. (The story is that the Wiener family was to move to a new home, and the family repeatedly reminded him leading up to that day, but that he went home and found his key didn't work, and cried out to a girl nearby that his key wouldn't work and that he couldn't find his family, and the girl said, \"Yes, Daddy, Mother asked for me to go find you here.\") </p>\n<p>\"Toss him out and count the silverware\" is I think a meme, before memes were a thing. :-)</p>",
        "id": 444980494,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718548141
    },
    {
        "content": "<p>Btw, Todd, I guess you noticed the word \"nostrification\" in the Wikipedia article you cited?  It was in a quote by Todorov (one of my advisor's few friends, a Bulgarian working on quantum field theory, who surprised me by recently coming out with some nice papers on octonions and the Standard Model).</p>",
        "id": 444987093,
        "sender_full_name": "John Baez",
        "timestamp": 1718552747
    },
    {
        "content": "<p>Yes, I did see it!  Nice to hear that Todorov is still active.</p>",
        "id": 444988613,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718553696
    },
    {
        "content": "<p>I was surprised at first, because my advisor is long gone; also not many people jump into working on octonions!</p>",
        "id": 444988990,
        "sender_full_name": "John Baez",
        "timestamp": 1718553839
    },
    {
        "content": "<p>I read <a href=\"https://arxiv.org/pdf/physics/0504179\">Todorov's paper</a> on the Einstein-Hilbert rivalry, and it confirms my guess as to the meaning of the word: </p>\n<blockquote>\n<p>Summing up the decisive phase of his work on general relativity (Fl 97) quotes Einstein’s letter to Heinrich Zangger (see also an earlier discussion of this letter in (Med 84)) which says: “Only one colleague truely understood it, and he now tries skillfully to ’nostrify’ it” [i.e. appropriate (’make it ours’)]. We already know that the colleague in question was none other than David Hilbert. Fölsing justly refutes the accusation on the basis of available evidence.</p>\n</blockquote>",
        "id": 445020977,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718572492
    },
    {
        "content": "<p>Todorov continues to vindicate Hilbert from Einstein's charge in that letter: </p>\n<blockquote>\n<p>Later the same year an article in the 14 November issue of Science, (CRS 97) made the news. This paper has a direct bearing on our topic. It points out that a lately discovered proof-sheet of Hilbert’s paper, with a publisher’s stamp of 6 December 1915, i.e. after the publication of the fourth of Einstein’s communications, involves substantial changes in the manuscript. The fact that Hilbert modified his paper after its submission has been known before: as we noted he had cited all four Einstein’s November papers and had commented on the last one (submitted after his) in the published version of his November 20 article. The authors strive to attribute a great significance to the fact that the original text only involves the Hilbert action, while the field equations, which are derived from it, appear to be first inserted at the stage of the proofreading. Their attempt to support on this ground Einstein’s accusation of “nostrification” goes much too far. A calm, non-confrontational reaction was soon provided by a thorough study (Sau 99) of Hilbert’s route to the “Foundations of Physics” (see also the relatively even handed survey (Viz 01)). A direct critical comment on the unfounded accusations in (CRS 97), (Win 04), originally rejected by the editors of Science, ∗) finally appears in a more specialized journal (Win 04). ∗∗)</p>\n</blockquote>",
        "id": 445021003,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718572508
    },
    {
        "content": "<p>The only thing I'm left to wonder is who is Professor X from Rota's gossipy [\"gossip\" is how Rota himself puts it] snippet about Wiener. Here's the doi number, if you're interested: 10.1007/978-0-8176-4781-0_3.</p>",
        "id": 445021013,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1718572525
    },
    {
        "content": "<p>Working link: <a href=\"https://doi.org/10.1007/978-0-8176-4781-0_3\">https://doi.org/10.1007/978-0-8176-4781-0_3</a></p>",
        "id": 445048940,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1718596442
    }
]