[
    {
        "content": "<p>To my surprise, there seems to be no such thing as \"the analogue of a Lawvere theory, but the models interpreted in a 2-category with (say) finite products are pseudomonoids\". Or rather, the precise definitions already in the literature seem to capture strict models (so, strict monoidal categories) but pseudo/lax model homomorphism (strong monoidal, or lax monoidal, functors): for example, Power's enriched Lawvere theories when the base of enrichment is Cat.</p>\n<p>Do you have any pointer on this specific kind of 2-dimensional functorial semantics?</p>",
        "id": 303798882,
        "sender_full_name": "fosco",
        "timestamp": 1665657390
    },
    {
        "content": "<p>There was a project of Steve Lack and John Power on exactly this topic, but no paper has ever appeared. There are slides from a CT 2007 talk <a href=\"http://www.mat.uc.pt/~categ/ct2007/slides/lack.pdf\">here</a>.</p>",
        "id": 303849528,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665671128
    },
    {
        "content": "<p>There is also some consideration in Bourke–Gurski's <a href=\"https://arxiv.org/abs/1508.07789\">The Gray tensor product via factorisation</a>.</p>",
        "id": 303850326,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665671334
    },
    {
        "content": "<p>But I don't believe there's any general theory in the literature yet.</p>",
        "id": 303850383,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665671351
    },
    {
        "content": "<p>I was also surprised how little there was on this topic. I would actually really like to have such a framework available.</p>",
        "id": 303859696,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1665674036
    },
    {
        "content": "<p>Strict <em>models</em> don't have to mean strict <em>structures</em>.  There is a strict Cat-enriched Lawvere theory whose strict models are <em>non-strict</em>  monoidal categories: you just put all the coherence isomorphisms into the theory.  So, because strict theories are a lot easier to work with, a lot of the work on 2-dimensional universal algebra uses them, since there is no loss of generality in the kinds of structures you can describe.</p>",
        "id": 303896256,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1665684990
    },
    {
        "content": "<p>Mike, I found a couple of papers by Yanofsky that make this a little bit more precise, but I must confess I still have to understand how this idea works! At first it seemed to me that he was considering only strict monoidal cats.</p>",
        "id": 303917682,
        "sender_full_name": "fosco",
        "timestamp": 1665692756
    },
    {
        "content": "<p>Given that Yanofsky was writing in 2000, I wonder if Power and Lack were aware of his work... no reference to \"The syntax of coherence\" appears in their talk</p>",
        "id": 303917881,
        "sender_full_name": "fosco",
        "timestamp": 1665692826
    },
    {
        "content": "<p>As I understand it, the point is not to capture weak models (for which, as Mike points out, strict models suffice), but to capture weak notions of morphisms, e.g. pseudo/lax/oplax, for which you genuinely do need a 2-categorical theory.</p>",
        "id": 303922605,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665694767
    },
    {
        "content": "<p>But I think it could be worth emailing Power and Lack to ask them about the work. I'd be interested to know too.</p>",
        "id": 303922761,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665694824
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/2-dimensional.20Lawvere.20theories/near/303917881\">said</a>:</p>\n<blockquote>\n<p>Given that Yanofsky was writing in 2000, I wonder if Power and Lack were aware of his work... no reference to \"The syntax of coherence\" appears in their talk</p>\n</blockquote>\n<p>It's probably worth noting that Cat-enriched algebraic theories were considered by <a href=\"http://www.tac.mta.ca/tac/volumes/6/n7/6-07abs.html\">Power in 1999</a>. (Though it goes back even further: Gray also has some papers on Cat-enriched algebraic theories, for instance.)</p>",
        "id": 303924219,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1665695426
    },
    {
        "content": "<p>the upshot of this thread is then that strict, Cat-enriched 2-theories capture pseudo-structure. I see Yanofsky's paper contains all the relevant information, but there's still sometimes that flies over my head <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> most likely, late night is the worst moment to keep doing maths</p>",
        "id": 303928364,
        "sender_full_name": "fosco",
        "timestamp": 1665697127
    },
    {
        "content": "<p>A lot more work has been done on 2D universal algebra using 2-monads rather than 2-theories.  It's true that the fully strict Cat-enriched notions don't yield weak notions of morphism directly, but you can still define and characterize such morphisms using strict monads/theories.  As Steve Lack wrote in his excellent <a href=\"https://arxiv.org/abs/math/0702535\">2-categories companion</a>,</p>\n<blockquote>\n<p>2-category theory is a “middle way” between [enriched] Cat-category theory and bicategory theory. It <em>uses</em> enriched category theory, but not in the simple minded way of Cat-category theory; and it cuts through some of the technical nightmares of bicategories.</p>\n</blockquote>",
        "id": 303942025,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1665705186
    },
    {
        "content": "<p>Another approach people have considered is looking at \"homotopy algebras\" of Lawvere theories: algebras in the category of simplicial sets, where all the laws hold up to coherent homotopy.   Julia Bergner did this for multi-sorted Lawvere theories and showed that these homotopy algebras are all equivalent to strict algebras:</p>\n<ul>\n<li>Julia Bergner, <a href=\"https://arxiv.org/abs/math/0508152\">Rigidification of algebras over multi-sorted theories</a>.</li>\n</ul>\n<blockquote>\n<p>We define the notion of a multi-sorted algebraic theory, which is a generalization of an algebraic theory in which the objects are of different \"sorts.\" We prove a rigidification result for simplicial algebras over these theories, showing that there is a Quillen equivalence between a model category structure on the category of strict algebras over a multi-sorted theory and an appropriate model category structure on the category of functors from a multi-sorted theory to the category of simplicial sets. In the latter model structure, the fibrant objects are homotopy algebras over that theory. Our two main examples of strict algebras are operads in the category of simplicial sets and simplicial categories with a given set of objects.</p>\n</blockquote>",
        "id": 303999801,
        "sender_full_name": "John Baez",
        "timestamp": 1665742094
    },
    {
        "content": "<p>oh, this is very interesting: I wonder, can you apply Bergner result to the model structure on 2-categories?</p>",
        "id": 304001677,
        "sender_full_name": "fosco",
        "timestamp": 1665742970
    },
    {
        "content": "<p>I don't know.  She may only be looking at homotopy models of Lawvere theories in SimpSet with the Quillen model structure on SimpSet?   Not sure.   If so, one may need to generalize the argument to handle models in other model categories.   It would be worth doing, since it might then handle the case you're interested in but also lots more.</p>",
        "id": 304008886,
        "sender_full_name": "John Baez",
        "timestamp": 1665746050
    },
    {
        "content": "<p>each time I study Lawvere theories I stumble upon research projects <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 304037949,
        "sender_full_name": "fosco",
        "timestamp": 1665755855
    },
    {
        "content": "<p>There are also plenty of rigidification results in the 2-category theory literature.  In particular, it seems fairly likely to me that rigidification for Lawvere 2-theories would follow from Power's <a href=\"https://www.sciencedirect.com/science/article/pii/0022404989901138\">general coherence result</a>.</p>",
        "id": 304067983,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1665763878
    }
]