[
    {
        "content": "<p>We know that e.g. any functor with a left adjoint sends limits to limits; likewise, functors with right adjoints send colimits to colimits.</p>\n<p>Are there analogous properties that could tell us that a 2-functor sends extensions to extensions?</p>",
        "id": 212836130,
        "sender_full_name": "Alastair Grant-Stuart",
        "timestamp": 1602255288
    },
    {
        "content": "<p>What do you mean by extension?</p>",
        "id": 213244201,
        "sender_full_name": "Jade Master",
        "timestamp": 1602647881
    },
    {
        "content": "<p>I think he just means the generalisation of a Kan extension to a 2-category, i.e. <a href=\"https://ncatlab.org/nlab/show/Kan+extension#In2cat\">https://ncatlab.org/nlab/show/Kan+extension#In2cat</a></p>",
        "id": 213263082,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1602666780
    },
    {
        "content": "<p>There is a general result that adjoints preserve extensions, I remember this from the Kan Extensions chapter of Emily Riehl's book. That might help?</p>",
        "id": 213264357,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1602667667
    },
    {
        "content": "<p>I don't think he means preservation in that sense - that is preservation in the 'external' Kan extension sense. A 2-functor preserves extensions iff every extension in the domain is taken to an extension in the codomain.</p>",
        "id": 213269853,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1602671381
    },
    {
        "content": "<p>Ah gotcha. 2-adjunctions are trickier beasts, as are variants of them</p>",
        "id": 213270228,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1602671611
    },
    {
        "content": "<p>I don't know much about 2- (or n-) categories but this paper <a href=\"https://arxiv.org/abs/math/0702535v1\">https://arxiv.org/abs/math/0702535v1</a> by Stephen Lack seems to have some stuff on extensions.</p>",
        "id": 213270523,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1602671814
    },
    {
        "content": "<p>But in the notes he mentions that pointwise extensions are computed as (co)ends, which are then just special (co)limits. So, assuming we still have the usual RAPL/LAPC for 2-adjunctions, that might give a partial answer for pointwise extensions.</p>",
        "id": 213270679,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1602671927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"341237\">@Fawzi Hreiki</span>  interpreted my meaning right — sorry for the ambiguity. I was indeed a little worried about using the phrase \"preserves extensions\" since that means something quite different for 1-functors than the 2-functor behaviour I'm thinking about.</p>\n<p>Thanks for the thoughts. I, too, don't know much about 2-categories yet, but it seems that learning about 2-adjunctions and their interactions with (co)limits is my next step.</p>\n<p>Private conversation with <span class=\"user-mention silent\" data-user-id=\"315499\">tslil (they)</span> also pointed out that an extension can be rephrased as something called a weighted (co)limit — I still need to learn what this is. In this case, something like a right-2-adjoints-preserve-weighted-limits/left-2-adjoints-preserve-weighted-colimits result would be what I'm looking for.</p>",
        "id": 213281979,
        "sender_full_name": "Alastair Grant-Stuart",
        "timestamp": 1602679226
    },
    {
        "content": "<p>The fact that left/right adjoint 1-morphisms preserve left/right extensions (which specialise to colimits and limits) is true for purely formal reasons in every 2-category. Presumably if you are looking for generalisations you should look for similar statements that are true in the theory of 3-categories (or tricategories?)</p>",
        "id": 213296025,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1602685653
    },
    {
        "content": "<p>I think it looks like you are considering \"extensions in a 2-category\" as a kind of higher-dim generalisation of \"limits/colimits in a category\", but that seems like the wrong intuition in this context, as in the proof of \"preservation by adjoints\" it is best to think of the latter as... extensions in the 2-category Cat!</p>",
        "id": 213296697,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1602685893
    },
    {
        "content": "<p>I think it's more helpful to think of \"2-functors preserving extensions\" as a generalisation of functors preserving specific properties of morphisms in a category, e.g. functors preserving monomorphisms</p>",
        "id": 213297000,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1602685984
    },
    {
        "content": "<p>By the way, an example of \"2-functors preserving right Kan extensions\" on which you may find more information is <em>closed</em> functors between symmetric monoidal closed categories, that is, those that preserve the internal homs.</p>",
        "id": 213297420,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1602686124
    },
    {
        "content": "<p>Since internal homs in a SMCC are right Kan extensions when you look at the monoidal category as a one-object bicategory.</p>",
        "id": 213297615,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1602686183
    }
]