[
    {
        "content": "<p>Is there a careful definition of \"Analog computer\" with a level of precision comparable to a \"Turing machine\"? Or how do category theorists generally define functors into, or out of, physical systems?</p>\n<p>The \"analogy\" in the name makes me think these sorts of computers could be a source of interesting categories, but I'm struggling to keep my definitions useful when trying to be inspired by them.</p>",
        "id": 534788782,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1755385345
    },
    {
        "content": "<p>I've been writing lots of papers on categories (and double categories) of open physical systems, and functors between these.  But maybe I'll point you to this:</p>\n<ul>\n<li>Sophie Libkind, <a href=\"https://arxiv.org/abs/2007.14442\">An algebra of resource sharing machines</a>.</li>\n</ul>\n<blockquote>\n<p><strong>Abstract.</strong> Dynamical systems are a broad class of mathematical tools used to describe the evolution of physical and computational processes. Traditionally these processes model changing entities in a static world. Picture a ball rolling on an empty table. In contrast, open dynamical systems model changing entities in a changing world. Picture a ball in an ongoing game of billiards. In the literature, there is ambiguity about the interpretation of the \"open\" in open dynamical systems. In other words, there is ambiguity in the mechanism by which open dynamical systems interact. To some, open dynamical systems are input-output machines which interact by feeding the input of one system with the output of another. To others, open dynamical systems are input-output agnostic and interact through a shared pool of resources. In this paper, we define an algebra of open dynamical systems which unifies these two perspectives. We consider in detail two concrete instances of dynamical systems -- continuous flows on manifolds and non-deterministic automata.</p>\n</blockquote>\n<p>I don't know any definition of 'analog computer'; I could make one up.   You could say any dynamical system is an analog computer (and there are tons of precise definitions of 'dynamical system'), or you could say a dynamical system counts as an analog computer only if it comes with something else, like an 'input' and 'output'.    Libkind's paper has some things to say about inputs and outputs.</p>",
        "id": 534809327,
        "sender_full_name": "John Baez",
        "timestamp": 1755418025
    },
    {
        "content": "<p>It's funny, for unrelated reasons I was thinking about lenses so</p>\n<p>\"The data of an open dynamical system is given by a lens\"</p>\n<p>Made me chuckle</p>\n<p>This looks like a really nice paper, I want to talk a bit more about this but I'll read the article you shared first</p>",
        "id": 534857105,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1755478568
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/Analog.20computation.2Ffunctors.20in.20physics.3F/near/534788782\">said</a>:</p>\n<blockquote>\n<p>Is there a careful definition of \"Analog computer\" with a level of precision comparable to a \"Turing machine\"?</p>\n</blockquote>\n<p>There's Shannon's <a href=\"https://en.wikipedia.org/wiki/General_purpose_analog_computer\">general purpose analog computer</a> (GPAC).  Olivier Bournez and collaborators have worked a lot on this in recent years (by \"recent\" I mean the 21st century <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>).  You will find links to surveys and other relevant papers on the Wikipedia page.</p>",
        "id": 534900892,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1755507132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/Analog.20computation.2Ffunctors.20in.20physics.3F/near/534857105\">said</a>:</p>\n<blockquote>\n<p>This looks like a really nice paper, I want to talk a bit more about this but I'll read the article you shared first</p>\n</blockquote>\n<p>There's also some good videos on youtube of Sophie talking about this work.</p>",
        "id": 535003520,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1755542671
    }
]