[
    {
        "content": "<p>I saw this in \"Abstract and Concrete Categories\", given as an example of a category:<br>\n<a href=\"/user_uploads/21317/fDEfBm58YdckczeoXqV_XlOq/image.png\">automata category</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/fDEfBm58YdckczeoXqV_XlOq/image.png\" title=\"automata category\"><img src=\"/user_uploads/21317/fDEfBm58YdckczeoXqV_XlOq/image.png\"></a></div><p>(See also: <a href=\"http://nlab-pages.s3.us-east-2.amazonaws.com/nlab/show/automaton\">http://nlab-pages.s3.us-east-2.amazonaws.com/nlab/show/automaton</a>.)</p>\n<p>I am interested in studying imaging with category theory. Sometimes imaging involves propagation of a disturbance through a medium, which is used to probe an unknown object. It seems like it might be possible to use an automaton to model this, where the inputs would correspond to physical objects modifying the nature of the propagating disturbance. The \"observation\" of these objects would then corresponding to the resulting sequence of states.</p>\n<p>Does anyone happen to know if there is any prior work in this direction (modelling of physical phenomena such as wave propagation using automata) with a category theory flavor?</p>",
        "id": 267263435,
        "sender_full_name": "David Egolf",
        "timestamp": 1641602554
    },
    {
        "content": "<p>I was taking a look at the start of \"Polynomial Functors\" by Spivak and Niu, and this amusing example reminded me of this idea:<br>\n<a href=\"/user_uploads/21317/eZujKpTIDAmthgM7-ED5wkh6/image.png\">two-state observers</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/eZujKpTIDAmthgM7-ED5wkh6/image.png\" title=\"two-state observers\"><img src=\"/user_uploads/21317/eZujKpTIDAmthgM7-ED5wkh6/image.png\"></a></div><p>One could imagine a piece of tissue as playing the role of an eye in the example. As a start, one could model it as having two states: perturbed, and unperturbed. The inputs could correspond to the states of surrounding pieces of tissue.</p>",
        "id": 267334022,
        "sender_full_name": "David Egolf",
        "timestamp": 1641700490
    }
]