[
    {
        "content": "<p>Hi,</p>\n<p>I'm currently working my way through Conceptual Mathematics by Lawvere.  Pretty much everywhere I go people like to deride the book as being too basic, but I'm finding it fairly profound.  However, I also what to see how some of the ideas fit into the larger context.  There is an idea that is clearly being developed but not named and I'd like to find out the name.  Clearly, I'm not a mathematician by training so forgive any abuses of terminology.  I'm all for being corrected as well.</p>\n<p>The idea in the is that within categories there seem to be \"special objects\" or a family of objects that have special status.  Here are the examples in the text:</p>\n<ul>\n<li>points in the category of sets</li>\n<li>natural numbers with the successor map in the category of sets-with-endomap</li>\n<li>the single \"dot\" and single \"arrow\" in the category of what they call \"directed irreflexive graphs\"</li>\n</ul>\n<p>The properties show so far are that</p>\n<ol>\n<li>They are \"separators\" and can be used to determine if two morphisms are equal (i.e. if hf = gf then h = h) where f is a morphism from these \"special\" object(s).</li>\n<li>If products exist for these objects in the category, they exist for all objects in the category</li>\n<li>If co-products exist for these object in the category, they exist for all objects in the category</li>\n</ol>\n<p>I'm not sure if I'm using terminology correctly or clearly.  Anyway, that's the idea and my question is, </p>\n<p>What this general process or concept is where there are objects with special status in the sense that they are some sort of \"basis\" object or objects from which all other objects in the category can be built or tested against for some universal property?</p>\n<p>If my question is too vague or muddled, I'll not be surprised, but there it is.  Either way, thanks for reading.</p>",
        "id": 209764195,
        "sender_full_name": "Matt Wilbur",
        "timestamp": 1599820159
    },
    {
        "content": "<p>All of the examples you give happen to be separating sets of objects in Grothendieck toposes, in fact presheaf toposes, and so they canonically determine <em>sites</em> for these toposes. That is, they contain the data required to generate the whole categories in a natural way.<br>\nAs it happens, the generating procedure is such that all objects of the category are colimits of these ones, and hence (a colimit of colimits being a colimit) all colimits exist. Limits in presheaf categories are computed \"pointwise\", so we also get limits from knowing that these are presheaf categories. It is worth mentioning that in a balanced category with equalisers, the property of separating is equivalent to the property of detecting isomorphisms (that is, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>:</mo><mi>A</mi><mo>→</mo><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">f:A \\to B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05017em;\">B</span></span></span></span> is an isomorphism in such a category if and only if every morphism from an object in the separating set factors through <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span>).</p>\n<p>However, it is not so straightforward that the properties of the whole category should follow from properties of such a separating set of objects. For example, if we take any full subcategory of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"bold\">S</mi><mi mathvariant=\"bold\">e</mi><mi mathvariant=\"bold\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbf{Set}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68611em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathbf\">S</span><span class=\"mord mathbf\">e</span><span class=\"mord mathbf\">t</span></span></span></span></span> which includes the/a terminal object, then that object will still be a separating object, and arbitrary limits of it will still exist (a limit of a diagram in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"bold\">S</mi><mi mathvariant=\"bold\">e</mi><mi mathvariant=\"bold\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbf{Set}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68611em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathbf\">S</span><span class=\"mord mathbf\">e</span><span class=\"mord mathbf\">t</span></span></span></span></span> in which every object is a singleton will always be a singleton, so still present in our full subcategory), but it's easy to find a subcategory which doesn't have limits, even by just omitting the set(s) of cardinality 4, say. In order to conclude anything about relationships between the separating collection of objects and the category as a whole, you also need to know the generation procedure being used to build the category from that determining data.</p>",
        "id": 209771806,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599826096
    },
    {
        "content": "<p>Thank you.  Lots for me to follow up on there.</p>",
        "id": 209781264,
        "sender_full_name": "Matt Wilbur",
        "timestamp": 1599831354
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"334732\">@Matt Wilbur</span>, <span class=\"user-mention\" data-user-id=\"336385\">@Carlos Vera</span>  also had good things to say about this book. I like it too. Turns out the three of us are also software devs. Hmm..</p>\n<p>Some people just like to do heroic calculations, based on mountainous abstractions. I don't think this book is for them. </p>\n<p>I like working with examples: show me a few good ones and I can see how to generalize from there. But give me some algebra and I get lost quickly, I dont \"see\" how to instantiate the abstraction. </p>\n<p>Maybe we should start a thread/reading group for this book...</p>",
        "id": 209803008,
        "sender_full_name": "Simon Burton",
        "timestamp": 1599841510
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277321\">@Simon Burton</span>  I would love a reading group for this book.  To be honest, because I am short on free time, I have started and re-started it several times over the past four years or so and am only getting towards some of the meatier stuff now.  Because of that, though, I've read certain chapters multiple times and seen more each time through.  The <em>reasoning</em> and some sense of meaning and relationship is what  I love about mathematics, not the algebraic manipulations.</p>",
        "id": 209805435,
        "sender_full_name": "Matt Wilbur",
        "timestamp": 1599842742
    }
]