[
    {
        "content": "<p>Hi all, one more (final) question from another classmate in our CT cohort.  They have appreciated all the insights thus far.  Forwarded below.  <span aria-label=\"thank you\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"thank you\">:thank_you:</span></p>\n<p><strong>Context</strong><br>\nI'm a PhD student in Systems Science nearing course completion, and I'm aiming to undertake dissertation research around the topic of Boolean network (<a href=\"https://www.sciencedirect.com/science/article/pii/S200103701930460X\">https://www.sciencedirect.com/science/article/pii/S200103701930460X</a>) generalizations. My current course is an independent study in category theory, the main goal of which is to formally define Boolean networks in the language of category theory. Such a formal definition would support future research efforts in generalizing Boolean network models categorically.</p>\n<p><strong>What I've Tried</strong><br>\nI have been mainly relying on Spivak's \"Category Theory for the Sciences\" and Fong and Spivak's \"Seven Sketches in Compositionality\" for pedagogical material but have been unable to find examples of Boolean networks in these works. One possible approach that I have been investigating is to express each node in a Boolean network as a Mealy machine and then compose individual Mealy machines. Mealy machine composition is described here: <a href=\"https://topos.site/blog/2024-08-19-wiring-diagrams-mealy-machines/\">https://topos.site/blog/2024-08-19-wiring-diagrams-mealy-machines/</a>.</p>\n<p><strong>What I'm Asking For</strong><br>\nWhile such an approach could work, it relies on concepts that might be a little out of reach for someone in my position - new to category theory, and coming from a STEM, as opposed to pure math, background. My question is if anyone in this community knows of, and is willing to share, resources for how Boolean network models are dealt with, i.e. formally defined, categorically in the literature. It's possible that such work already exists and I have simply failed to find it so far (at least that is my hope).  </p>\n<p>Thank you!</p>",
        "id": 484191722,
        "sender_full_name": "Sean Maley",
        "timestamp": 1732494277
    },
    {
        "content": "<p>Boolean networks should fit quite easily in the <a href=\"https://math.ucr.edu/home/baez/networks/\">structured/decorated cospan paradigm</a>, which is a category-theoretic approach to networks that already handles <a href=\"https://arxiv.org/abs/1704.02051\">chemical reaction networks</a> (or more precisely Petri nets, which are an equivalent setup), <a href=\"https://arxiv.org/abs/2301.01445\">gene regulatory networks</a>, Systems Biology Graphical Notation <a href=\"https://arxiv.org/abs/2410.18024\">process networks</a>, and <a href=\"https://arxiv.org/abs/2211.01290\">stock-flow diagrams</a>.  I feel it's just my lack of energy that's prevented me from tackling boolean networks yet!  So, I'd be glad to help you tackle them, preferably via conversations right here.</p>",
        "id": 484194775,
        "sender_full_name": "John Baez",
        "timestamp": 1732497150
    },
    {
        "content": "<p>Forwarded, and sent him a link to join the conversation.  Thanks as always, John!</p>",
        "id": 484202852,
        "sender_full_name": "Sean Maley",
        "timestamp": 1732504259
    },
    {
        "content": "<p>Thank you for the post <span class=\"user-mention\" data-user-id=\"742639\">@Sean Maley</span> , and for helping me get set up with an account!</p>\n<p>Hi <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  , I'm the classmate Sean was alluding to in his original message. Thank you for your help on this topic! I've started to look at some of the linked resources you provided above and will continue to do so this week. What else do you need from me to keep things moving?</p>",
        "id": 484516613,
        "sender_full_name": "Kevin Stoltz",
        "timestamp": 1732628545
    },
    {
        "content": "<p>I think the question is what you need from me!   To me the project of constructing a structured cospan double category of boolean networks seems very similar to doing it for many of the other examples I listed, and thus fairly straightforward.   One payoff would be that one could write code in <a href=\"https://www.algebraicjulia.org/\">AlgebraicJulia</a> (or maybe <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span>'s new system: CatColab) to work with boolean networks in various useful ways, as has been done with some other examples (e.g. <a href=\"https://algebraicjulia.github.io/AlgebraicPetri.jl/stable/\">Petri nets</a>.)  But as I say this I realize there's quite a lot one must learn to accomplish this!  So if you have questions, just ask.  That could speed things up.</p>",
        "id": 484541630,
        "sender_full_name": "John Baez",
        "timestamp": 1732635377
    }
]