[
    {
        "content": "<p>I am not a supporter of IUTT because I am, needless to say, far from understanding Anabelian Geometry, p-adic numbers and even understanding ZFC. <br>\nHowever, I recently thought that the idea of changing a universe to another universe with treating an object in the two universes is interesting to some extent, which is like comparing some obejct in two different type systems e.g. between MLTT and Refinement Type System. <br>\n( I also think my choice of the term 'universe' might be wrong for some religion. ) </p>\n<p>When I read the book \"Coq Art\", I saw a sentence like ; </p>\n<blockquote>\n<p>We say a function is a 'functional' when it is a function that takes functions as its arguments.  In the same way, we define 'tactical' as a tactic that takes tactics as its arguments </p>\n</blockquote>\n<p>In category theory, 'functors' seem doing this role. ( or sheaves ? ) <br>\nThis is <code>bottom-up style</code> of defining something. <br>\nHere I thought that it might be interesting if we have this kind of <code>bottom-up style</code> changes of universes. </p>\n<p>In contrast, in Mochizuki's setting, he seems to put <code>history</code> as a 'graph with some extra data' on the most outside of his category-like objects, i.e. <code>species</code>.<br>\nUnlike categories of categories, we could not add some structure to the outside since the most outside is not any more a category-like object but a graph with some extra data. <br>\nThus we might not treat Mochizuki's style as the <code>bottom-up style</code>. <br>\nThis seems to be <code>top-down style</code> structure-definition since he seemed to know the most outside. </p>\n<p>( Or I may not understand well that the generalization <code>species</code> can have <code>histories</code> (i.e. graphs with extra data) as its example, hence that it can be also <code>bottom-up style</code>. But if so, I cannot see why he needs this extra definition of <code>history</code>, so I believe they cannot have histories as its example.  )</p>\n<p>I have 2 questions;</p>\n<ol>\n<li>Does anyone know anything related to differences between <code>top-down style</code> and <code>bottom-up style</code>? </li>\n</ol>\n<p>( I do not know even the difference between algebra and coalgebra well. Though I might be able to think of them independently, but when I mix them, I could not figure out the whole contents or the relation between them well. Especially I do not know coalgebra well. )</p>\n<ol start=\"2\">\n<li>Could this differnece be related to Axiom of Choice because we could know what the most outside of infinite sequence of universes in <code>top-down style</code> is?</li>\n</ol>",
        "id": 214687085,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1603798294
    },
    {
        "content": "<p>For Mochizuki, as far as I can tell, he demands that a diagram in a category is <em>literally a subcategory</em>, not a functor to the category. This is I think because he wants to work all the time with isomorphism classes of functors, not a great idea!</p>\n<p>A \"history\" seems to be just a diagram, but in this Mochizukian sense, where it is a subcategory (or rather, a subcategory generated by a subgraph, and he only specifies the subgraph).</p>\n<p>It's entirely unclear what universes do for Mochizuki. His vague mutterings about needing universes else circular <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∈</mo></mrow><annotation encoding=\"application/x-tex\">\\in</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mrel\">∈</span></span></span></span>-chains lead to a violation of the axiom of foundation are .... not very enlightening.</p>",
        "id": 214701805,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1603806831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span>  <br>\nThank you for your answer! <br>\nI might see that they do not reveal objects (universes) though they handle them. <br>\nSince I do not understand the papers well, and because of your answer,  now it might not seem a good way of constructing something with referring the papers ...,  but rather I should construct from the bottom without them.</p>\n<p>In contrast, Univalence Axiom seems a good way of linking objects in two different levels, which might be a bit different topic from IUTT since it tells the exact 'equality' of two objects.</p>\n<p>Now I have read <span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> 's report (maybe) again. <br>\n<a href=\"https://thehighergeometer.files.wordpress.com/2018/09/mochizuki_final1.pdf\">https://thehighergeometer.files.wordpress.com/2018/09/mochizuki_final1.pdf</a><br>\nAnd I am gradually seeing what the report says much more and the situation of the papers seems worse for me now than when I heard the news RIMS accepted them in April. <br>\numm.....</p>",
        "id": 214706479,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1603808850
    },
    {
        "content": "<p>I found that Davide Sangiorgi's Bisimulation might answer the almost all my questions;<br>\n\" What is the difference between algebra and coalgebra ? \" <br>\n\" What are invariances between models ?  \"<br>\nNow I am reading : </p>\n<ul>\n<li>[Davide Sangiorgi 2011] Introduction to Bisimulation and Coinduction </li>\n<li>[Davide Sangiorigi 2012] Advanced Topics in Bisimulation and Coinduction</li>\n</ul>",
        "id": 218920888,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1607148434
    }
]