[
    {
        "content": "<p>What's the most natural categorical structure corresponding to first-order logic? What kind of category should the syntactic (classifying) category of a first-order theory be (so what's the right analogue of the Lindenbaum–Tarski algebra of a propositional theory)? I've picked up several keywords:</p>\n<ul>\n<li>pretopos (as in Makkai's duality)</li>\n<li>Heyting category (as in Johnstone's Elephant)</li>\n<li>first-order hyperdoctrine (<span class=\"user-mention\" data-user-id=\"276755\">@Robert Seely</span>)</li>\n</ul>\n<p>What's conceptually the difference between these approaches?</p>",
        "id": 252073071,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1630844627
    },
    {
        "content": "<p>An Heyting pretopos is what you get by 'realizing' a first-order hyperdoctrine in its quotient completion, i.e. by using the hyperdoctrine to generate a pretopos embodying the same logic (I can elaborate). Indeed, any pretopos gives a first-order hyperdoctrine of subobjects and these two constructions form an adjunction.<br>\n[N.B.: definitions here a bit slippery: you surely need your hyperdoctrine to be at least extensive to get a pretopos (and I don't know what 'first-order' is taken to mean in this context), but the intuitions are right: pretopoi and first-order hyperdoctrines both embody a first-order intuitionistic (that's the 'Heyting' part) theory]</p>",
        "id": 252079129,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1630851023
    },
    {
        "content": "<p>I can elaborate on the details if you want</p>",
        "id": 252079140,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1630851049
    },
    {
        "content": "<p>In general, there isn't just one \"right\" analogue.  The differences are that a hyperdoctrine maintains a semantic separation between types and propositions, while a Heyting category incarnates propositions as subobjects of types, and a pretopos adds coproducts and quotients.</p>",
        "id": 252079746,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1630851687
    },
    {
        "content": "<p>Depending on your definition, pretoposes and Heyting categories are particular cases of hyperdoctrines  (namely those where the psuedofunctor/fibration is the subobject one)</p>",
        "id": 252084855,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1630857365
    },
    {
        "content": "<p>The benefit of working with a Heyting category rather than a more general Heyting hyperdoctrine is that the logic already comes packaged with the category so-to-speak</p>",
        "id": 252084922,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1630857477
    },
    {
        "content": "<p>Thanks!</p>\n<p>I guess probably there's only one canonical notion of \"translation between first-order theories\" or \"interpretation of one first-order theory in another\". (Although I can't find a Wikipedia page on that notion, for instance. So probably that's not an established notion, which is weird, because I think this concept is quite fundamental.)</p>\n<p>When I talk about the right kind of categorical structure corresponding to first-order logic I mean a type of category such that the category of all categories of that type is equivalent to the category of first-order theories and translations between them. Which of the three categories (pretoposes, Heyting categories, first-order hyperdoctrines) satisfies this requirement? Are the other two categories equivalent to some other notion of \"theories and translations between them\"? If yes, which?</p>",
        "id": 252346722,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1631037947
    },
    {
        "content": "<p>Each of them corresponds to a different notion of \"translation\".</p>",
        "id": 252354971,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1631041155
    },
    {
        "content": "<p>When you translate theory A to theory B, you can choose whether to interpret each base type in A as either (0) a base type in B, (1) an arbitrary type in B, (2) a subobject of a type in B, or (3) a subquotient of a type in B.  (Maybe you could just choose a quotient too, but I'm not sure what that would correspond to categorically.)  Choices (1), (2), and (3) yield respectively notions of translation that correspond to morphisms of first-order hyperdoctrines, Heyting categories, and Heyting pretoposes.  (In all cases I'm assuming that primitive propositions in A are mapped to arbitrary propositions in B.)</p>",
        "id": 252355538,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1631041336
    },
    {
        "content": "<p>That's amazing! So the underlying class of objects of the theories-category the category of pretoposes / Heyting categories / first-order hyperdoctrines is equivalent to is in each case the class of all first-order theories, but the morphisms are different?</p>\n<p>You mentioned Heyting pretoposes. What about pretoposes? (EDIT: That also occurs in another thread.)</p>\n<p>What are the morphisms between Heyting pretoposes?</p>",
        "id": 252513738,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1631127403
    },
    {
        "content": "<p>Sorry, I meant Heyting pretoposes here.  Heyting pretoposes are the completions of Heyting categories under coproducts and quotients, so they're the right thing to look at when talking about first-order logic.  Their functors are just functors of Heyting categories, which automatically also preserve coproducts and quotients.  Plain pretoposes are for coherent logic, not first-order logic.</p>",
        "id": 252517277,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1631128866
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 252522234,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1631130795
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/categorical.20first-order.20logic/near/252355538\">said</a>:</p>\n<blockquote>\n<p>When you translate theory A to theory B, you can choose whether to interpret each base type in A as either (0) ..., (1) ..., (2) ..., or (3) a subquotient of a type in B.</p>\n</blockquote>\n<p>What do you mean by \"type\" here? Isn't a quotient of a type in B also a type in B? And isn't a subtype of a type in B also a type in B?</p>\n<p>Are the \"types in B\" you are talking about closed under coproducts?</p>\n<p>And why in that particular order (first quotient type, then subtype)? Why not allowing coproducts of quotients of subtypes of types in B too (and so on)?</p>",
        "id": 269864135,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1643462710
    },
    {
        "content": "<p>A \"type\" is a syntactic object here. So if the theory in question doesn't include subtypes or quotient types, which is usually the case, then no.  It's more common to include coproduct types, but if we don't, then to get morphisms of pretoposes we would have to use subquotients of coproducts as you suggest.</p>",
        "id": 269872116,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1643471831
    },
    {
        "content": "<p>A \"subquotient\" is either a subobject of a quotient or a quotient of a subobject; the two are the same in reasonable categories.</p>",
        "id": 269872129,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1643471861
    },
    {
        "content": "<p>Similarly, in a pretopos a coproduct of subtypes, quotients, or subquotients is also a subtype, quotient, or subquotient or a coproduct.  So there's a \"canonical form\" and you don't have to keep iterating.</p>",
        "id": 269872197,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1643471906
    },
    {
        "content": "<p>Thanks, that's enlightening!</p>\n<blockquote>\n<p>Similarly, in a pretopos a coproduct of subtypes, quotients, or subquotients is also a subtype, quotient, or subquotient or a coproduct.</p>\n</blockquote>\n<p>I guess the last \"or\" should be an \"of\". <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 269876930,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1643477085
    },
    {
        "content": "<p>yes</p>",
        "id": 269878361,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1643478823
    }
]