[
    {
        "content": "<p>I find discussion on category theory that explicitly includes philosophical motivation to be extra interesting. I've been aware of the book \"Conceptual Mathematics\" by Lawvere and Schanuel for a while, but just a few days ago I saw mentioned on this zulip another book: \"Sheaf Theory through Examples\" by Rosiak - and I've really enjoyed looking at this so far.</p>\n<p>I was wondering if there are any other book recommendations (or paper recommendations) that people here would make along these lines.</p>",
        "id": 312515667,
        "sender_full_name": "David Egolf",
        "timestamp": 1669581089
    },
    {
        "content": "<p>I'm not sure if this is quite what you're looking for, but recently Elaine Landry edited a collection called <a href=\"https://academic.oup.com/book/35959\">Categories for the Working Philosopher</a>, with contributions from a number of category theorists including myself.</p>",
        "id": 312515899,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1669581247
    },
    {
        "content": "<p>Awesome, I even have access through my school library!</p>",
        "id": 312518998,
        "sender_full_name": "David Egolf",
        "timestamp": 1669583522
    },
    {
        "content": "<p>I'm not a philosopher but I'm somewhat interested by philosophy and want to share a naive thought.</p>\n<p>I've always thought that the transition from the set-theoretic view of mathematics to the categorical one was kinda the same that the transition between the two periods of the philosopher Ludwig Wittgenstein. </p>\n<p>The first period is represented by the Tractatus Logico-Philosophicus where he defends that the world of ideas is nothing more that an abstract formal system governed by classical logic. It looks very scientistic and reductionist,  reminiscent to the craziness of Peano arithmetic where you can use 50 lines to prove that 10 + 10 = 20. </p>\n<p>In the second period (eg. the Blue and Brown Books), this view was completely rejected by the new Wittgenstein who put more emphasis on the study of the language as it is spoken by people and making philosophy a study of the \"grammar\" of the language, ie. how people interact and act using it. For instance, he likes to analyse what's going on if imagine I ask somebody to fetch a red flower, what this person is going to do, eg. if he goes in a field to chose a  flower, how is he going to determine if a flower is in fact more orange or red etc... At Cambridge where he was professor, he liked to organize practical experiments about the language with its students. Instead of lectures, they could play to kind of games of language. </p>\n<p>For me, this view of the world trough language and actions resembles more to a categorical treatment of mathematics that the first one. Studying how people interact through the language is like studying how objects are in relations to each others through morphisms. </p>\n<p>The part of the philosophy of Wittgenstein which is identified as interesting for mathematics is the first one but I think it's no more true and Wittgenstein who died (in 1951) just after the invention of category theory (in 1945), and probably never knew them, through the progression of its philosophy, realized a change of paradigm akin to the one in mathematics.</p>",
        "id": 312519881,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669584286
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/category.20theory.20and.20philosophy.20books/near/312515667\">said</a>:</p>\n<blockquote>\n<p>I find discussion on category theory that explicitly includes philosophical motivation to be extra interesting. I've been aware of the book \"Conceptual Mathematics\" by Lawvere and Schanuel for a while, but just a few days ago I saw mentioned on this zulip another book: \"Sheaf Theory through Examples\" by Rosiak - and I've really enjoyed looking at this so far.</p>\n</blockquote>\n<p>From what I've seen of Rosiak's book, I'm pretty sceptical. Philosophy is a positive addition to mathematical study to the extent that it provides concepts and accompanying terminology for reasoning about the subject or its foundations. In the passages I read, Rosiak introduces pseudo-philosophical terminology for concepts which already are more than adequately described by the categorical language. I'm specifically thinking here of the description of functors which preserve certain limits as \"katholic\" in that they preserve the \"gatekeepers\" for certain diagrams (universal solutions). We already have names for those things, and as far as I can tell this does not provide a connection to an established term which might lend insight to a philosopher reading this passage. But I might have been unlucky with my sample.</p>",
        "id": 312522582,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1669586359
    },
    {
        "content": "<p>Those are interesting thoughts, <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> . For myself, as someone with less depth of understanding of the mathematical topics discussed in Rosiak, I just really appreciate someone spelling out in words what they think these concepts \"mean\" and can be used for, and how they can relate to models describing elements of everyday life. From this perspective, whether or not the book significantly employs or engages with well-established concepts in philosophy is not my primary concern at the moment.</p>",
        "id": 312526394,
        "sender_full_name": "David Egolf",
        "timestamp": 1669589285
    },
    {
        "content": "<p>Sometimes, when reading a math book, the motivation for defining a concept feels to me something like the following: \"In chapter 7, we will want to talk about X. However, to define X and work with it, we first need to define and analyze Y.\" Unless I already know why I should care about X, this feels somehow disappointing, and I struggle to care about studying Y. So far, Rosiark is providing a refreshing contrast to this style of presentation.</p>",
        "id": 312526614,
        "sender_full_name": "David Egolf",
        "timestamp": 1669589450
    },
    {
        "content": "<p>Great references ! Thanks for sharing!</p>",
        "id": 312527253,
        "sender_full_name": "Jorge Soto-Andrade",
        "timestamp": 1669589987
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> I wouldn't be annoyed if Rosiak was just presenting similes or metaphors to aid in understanding; it's the introduction of vocabulary in an authoritative tone that's the problem. Someone in your position could easily pick up this language assuming it was well-established in the field and find themselves confronted with confusion and suspicion upon employing it in discussion with an expert. This general practice also legitimizes the mystification of category theory through more tenuous philosophical connections in my opinion, which I cannot abide.</p>",
        "id": 312575102,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1669623527
    },
    {
        "content": "<p>David wrote:</p>\n<blockquote>\n<p>From this perspective, whether or not the book significantly employs or engages with well-established concepts in philosophy is not my primary concern at the moment.</p>\n</blockquote>\n<p>I get the feeling Morgan was talking about well-established terms in <em>math</em>, and how Rosiak introduces his own.</p>",
        "id": 312649589,
        "sender_full_name": "John Baez",
        "timestamp": 1669648193
    },
    {
        "content": "<p>By the way, <span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span>, have you looked at Eugenia Cheng's book <em>The Joy of Abstraction</em>?   It's an introduction to category that really explains why we care about the basic concepts, and various ways to think about them.</p>",
        "id": 312649936,
        "sender_full_name": "John Baez",
        "timestamp": 1669648290
    },
    {
        "content": "<p>This new book that Ryan Wisnesky linked to recently, has a very philosophical feel to it.  Given that Ryan pointed to it in this forum, I trust that it does reflect key insights in category theory. And those are both very interesting, and very reminiscent of what some French philosophers who emerged out of structuralism where saying in the 1960s, when structuralism became so big in France, that the coach of the French football club stated that his team was going to win because they were trained on structuralist principles. I am pretty sure there was a strong influence from CT there. One can tell for example by how much importance Deleuze suddenly put in the 1970s on Diagrams. <br>\nIf you don't know about the maths though, and you don't know that the authors are building on it, you can loose the strength of the points made. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"281326\">Ryan Wisnesky</span> <a href=\"#narrow/stream/229111-general/topic/Introduce.20yourself!/near/303530061\">said</a>:</p>\n<blockquote>\n<p>Hi All, with the permission of the original authors I'd like to announce a new book on applied category theory.   \"A Categorical Defense of Our Future: is the first book about category theory written for business leaders and business owners, CEOs, and executives.<br>\nAnyone who deals with large-scale challenges around data, safety, and systems will find this book to be required reading.</p>\n</blockquote>\n<p>This book feels like Eugenia Cheng's book first book. It would be great if they later did a second version, with more mathematical details. Eugenia's recent book is great because it does both. The Categorical Defence would require a lot more advanced CT I think, so that would be a difficult task.</p>",
        "id": 312655453,
        "sender_full_name": "Henry Story",
        "timestamp": 1669649785
    },
    {
        "content": "<p>Sadly, the influence of structuralism in France has not been in favour of category theory. Although Grothendieck did a lot for category theory, I think he mainly imported it from the United States. He was a member of Bourbaki but Bourbaki preferred using its own and weird theory of mathematical structures in their treaty rather than category theory. And they have been identified as an example of \"structuralist mathematical style\" by Jean-Pierre Marquis in this paper: <a href=\"https://philpapers.org/archive/MARTSM-7.pdf\">The Structuralist Mathematical Style : Bourbaki as a Case Study</a>. </p>\n<p>But I think you are right, despite this point of history, category theory is something fundamentally structuralist.</p>",
        "id": 312658659,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669650675
    },
    {
        "content": "<p>I have pretty much enjoyed the books R. Krömer \"Tool and object. A history and philosophy of Category theory\". Science Network Historical Studies 32, Basel: Birkhäuser 2007 and J P Marquis  <a href=\"https://link.springer.com/book/10.1007/978-1-4020-9384-5\">From a Geometrical Point of View</a>. A Study of the History and Philosophy of Category Theory. I hope it helps</p>",
        "id": 312659689,
        "sender_full_name": "Mateo Carmona",
        "timestamp": 1669650949
    },
    {
        "content": "<p>Thanks, it looks very interesting!</p>",
        "id": 312659820,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669650979
    },
    {
        "content": "<p>There is the book \"Modal HoTT\" that is written by <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span>  a philosopher who argues that philosophy needs to take on board the advanced in CT and type theory. <a href=\"https://golem.ph.utexas.edu/category/2020/02/modal_homotopy_type_theory_the.html\">https://golem.ph.utexas.edu/category/2020/02/modal_homotopy_type_theory_the.html</a></p>",
        "id": 312664054,
        "sender_full_name": "Henry Story",
        "timestamp": 1669652078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/category.20theory.20and.20philosophy.20books/near/312649936\">said</a>:</p>\n<blockquote>\n<p>By the way, <span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span>, have you looked at Eugenia Cheng's book <em>The Joy of Abstraction</em>?   It's an introduction to category that really explains why we care about the basic concepts, and various ways to think about them.</p>\n</blockquote>\n<p>Oh, thanks for reminding me! I think I looked for Cheng's book earlier, but it hadn't come out yet at the time. I will plan to take a look!</p>",
        "id": 312667981,
        "sender_full_name": "David Egolf",
        "timestamp": 1669653146
    },
    {
        "content": "<p><em>The Joy of Abstraction</em> sounds like a book I need to read!</p>",
        "id": 312709700,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1669665226
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/category.20theory.20and.20philosophy.20books/near/312658659\">said</a>:</p>\n<blockquote>\n<p>Sadly, the influence of structuralism in France has not been in favour of category theory. Although Grothendieck did a lot for category theory, I think he mainly imported it from the United States. He was a member of Bourbaki but Bourbaki preferred using its own and weird theory of mathematical structures in their treaty rather than category theory. And they have been identified as an example of \"structuralist mathematical style\" by Jean-Pierre Marquis in this paper: <a href=\"https://philpapers.org/archive/MARTSM-7.pdf\">The Structuralist Mathematical Style : Bourbaki as a Case Study</a>. </p>\n<p>But I think you are right, despite this point of history, category theory is something fundamentally structuralist.</p>\n</blockquote>\n<p>Interestingly enough, not only was Grothendieck part of Bourbaki, but so was Samuel Eilenberg: the article states he become a member in 1950... I wonder what the difference between Bourbaki and CT in terms of style is? (I did a baccaleaureat in France, so I may have come across that way of thinking in school) What is the difference between these two structuralisms? (Perhaps the rest of the article will tell...)</p>",
        "id": 312735155,
        "sender_full_name": "Henry Story",
        "timestamp": 1669675419
    },
    {
        "content": "<p>It's a difficult question to answer and it took me some time to think to what I can say but I can say a few things.</p>\n<p>In my opinion, Bourbaki has the flaw of being reductionist. Even if in <a href=\"https://www.jstor.org/stable/2305937\">The Architecture of Mathematics</a>, they present a more realistic view of mathematics, in their books you really have this feel of reductionism. Everything is said about a category before going to a particular subcategory. This is why the notion of real numbers comes only after thousands of pages. They study firstly all the concepts that appear in a characterization of the real numbers: the groups, the abelian groups, the rings, the orders, the topological spaces... and when they know everything about these terms they say that the real numbers are the only Archimedean ordered complete topological field or whatever, something like this. But structuralism is supposed to look at objects by the interaction they have with other objects in the structure and not to reduce the meaning of something to all of its components because the sum is more than the sum of the elements. And I think everybody will agree that you are not going to learn a lot about real numbers by studying first eg. abelian groups because the real numbers form an abelian group. Jean-Pierre Marquis says that other philosophers are wrong when they argue that the structuralism of Bourbaki is not a structuralism in the sense of human sciences but I think that they are in fact not so wrong. Although I don't know it precisely, structuralism looks like something much more refined that the philosophy that seems to appear when you look at the books of Bourbaki, even if the members where in fact more clever than the books and were submerged by their massive and rigid project. </p>\n<p>As to the influence of Bourbaki on school, I'm too young to say but I think it was strong. In the 60's or 70's important reforms on the school programs happened in France and I'm not sure if it is Dieudonné, Delsarte or a friend of Bourbaki who was part on the committee working on the math program. A lot of people have been traumatized by the very abstract programs of the time (eg. learning what is a bijection before learning calculus), and if they make some research about that, they can think it's because of Bourbaki but Bourbaki says that it's not their fault but because of how they have been interpreted etc... </p>\n<p>One has to say also that weirdly Bourbaki was not in favour of logic and I suppose that they were the kind of people employing the expression \"abstract nonsense\" for development which don't provide directly theorems (in classical fields) like proof theory or abstract categorical studies, although I'm not quite sure what was their opinion. But it seems that some members thought like this, probably not Grothendieck or Eilenberg, when you read The Architecture of Mathematics. I did my curriculum in France before moving to Canada at the end of my masters program and to start a PhD in one month, and this reflex of abstract nonsense is still spread among the mathematicians in the country. People are much more enthusiastic about classical mathematical subject than the abstract approaches eg. number theory and analysis are more popular that algebraic topology or very abstract functional analysis, as far as I know. And it's maybe the reason why France produce so much Field medalists, because a lot of people work on the very classical subjects and these are the subjects which interest the Field committee I guess.</p>\n<p>Compared to category theory, Bourbaki was all about maths and their goal was/is, as they always exist, even it's no more their golden age, to make a treatise on math. Category theory has less precise objectives and is open to other fields like computer science, physics, linguistic... And there is applied category theory but not really applied bourbakism. And category theory is a theory, not a book. So, I guess category theory is more open minded and people in category theory work on what appears on the path of the development of category theory, in a more experimental way. Thus it's more interesting and create more new theorems than Bourbaki but also takes way more time. But Bourbaki, with their imperfect philosophy did a great job for the formalization of mathematics and popularized such things as widely used as the symbols <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∀</mi></mrow><annotation encoding=\"application/x-tex\">\\forall</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">∀</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∃</mi></mrow><annotation encoding=\"application/x-tex\">\\exists</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">∃</span></span></span></span>. </p>\n<p>You can read the paper <a href=\"https://philpapers.org/archive/MARFOS-4.pdf\">Forms of Structuralism: Bourbaki and the Philosophers</a>, by J.-P. Marquis, I didn't read completely the other one but I read completely this one. It's more focused on philosophy than the other one.</p>",
        "id": 312859279,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669733325
    },
    {
        "content": "<p>I can't read it, but there is also <a href=\"https://smf.emath.fr/system/files/2017-08/smf_rhm_12_119-162.pdf\">this paper in French</a> (<a href=\"https://mathscinet.ams.org/mathscinet-getitem?mr=2008b:01007\">English abstract</a>) by Ralf Krömer, where he examines exactly this question based on some unpublished archival documents.</p>",
        "id": 312864654,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1669734812
    },
    {
        "content": "<p>Thanks that looks very to the point!</p>",
        "id": 312871186,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669736631
    },
    {
        "content": "<p>Maybe I could translate it in (bad) English <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 312871332,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669736665
    },
    {
        "content": "<p>This thread should really be public. Lots of good references here that could interest a wider audience.</p>",
        "id": 313014273,
        "sender_full_name": "Henry Story",
        "timestamp": 1669799380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> maybe a moderator can do that?</p>",
        "id": 313064053,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669816302
    },
    {
        "content": "<p>I'm gonna do it asap</p>",
        "id": 313064490,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1669816421
    },
    {
        "content": "<p>Idk why this stream wasn't made web public <span class=\"user-group-mention\" data-user-group-id=\"2511\">@moderators</span> <br>\nIn the meantime, here's this topic from the archive:</p>\n<blockquote>\n<p><a href=\"https://mattecapu.github.io/ct-zulip-archive/stream/229199-learning:-questions/topic/topic_category.20theory.20and.20philosophy.20books.html\">https://mattecapu.github.io/ct-zulip-archive/stream/229199-learning:-questions/topic/topic_category.20theory.20and.20philosophy.20books.html</a></p>\n</blockquote>",
        "id": 313241970,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1669889316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275932\">@Matteo Capucci (he/him)</span> it's because this is <a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> , where we don't want anyone to not participate in asking/answering a question for fear of it being visible to an even wider public. Personally I think this is still a valid concern. However, this discussion could be moved to a public stream; should I put it in <a class=\"stream\" data-stream-id=\"229136\" href=\"/#narrow/stream/229136-theory.3A-category-theory\">#theory: category theory</a> ?</p>",
        "id": 313290684,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1669904475
    },
    {
        "content": "<p>you could move it to <a class=\"stream\" data-stream-id=\"229134\" href=\"/#narrow/stream/229134-philosophy\">#philosophy</a></p>",
        "id": 313315637,
        "sender_full_name": "Henry Story",
        "timestamp": 1669911234
    },
    {
        "content": "<p>I think that <a class=\"stream\" data-stream-id=\"229136\" href=\"/#narrow/stream/229136-theory.3A-category-theory\">#theory: category theory</a> is good because <a class=\"stream\" data-stream-id=\"229134\" href=\"/#narrow/stream/229134-philosophy\">#philosophy</a> is not a public stream either</p>",
        "id": 313318423,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669911969
    },
    {
        "content": "<p>I think the relation to structuralism and category theory comes out clearly in <a href=\"https://hackmd.io/@alexhkurz/HyMzQZLJu\">the blog post on Yoneda</a> by <span class=\"user-mention\" data-user-id=\"276830\">@Alexander Kurz</span> where he writes:<br>\n«To emphasize the fundamental importance of the notion of isomorphism for category theory, I want to show you that we could have motivated the definition of a category as providing just what is needed to formalise the intuitive notion of “same structure”» <br>\nI quoted that in this toot, and linked to a mastodon thread that cited all the articles mention in our zulip thread.<br>\n<a href=\"https://mathstodon.xyz/@bblfish/109442662970735460\">https://mathstodon.xyz/@bblfish/109442662970735460</a></p>\n<p>It seems to me that this idea that a category is the simplest structure to formalise an isomorphism, fits in very well with the papers on Bourbaki mentioned above, where with a bit of charity one can see that they laid the foundations of CT but were in a way too early to fully embrace it.</p>",
        "id": 313568833,
        "sender_full_name": "Henry Story",
        "timestamp": 1670007683
    },
    {
        "content": "<p>Sorry, but I have some doubts with what you wrote: \"how structuralism emerged from the Bourbaki project from the mid 20th Century\": structuralism emerged from the linguist Ferdinand de Saussure and then was developed by several people in human sciences like Levi-Strauss. I know nothing about structuralism, but you just have to look at the Wikipedia page to see that. Nothing to do with Bourbaki. What we can say is that Bourbaki looks a little bit structuralist in the field of mathematics, that's all.</p>\n<p>Then, a diagram with two arrows that gives an isomorphism and it is supposed to say something about how Bourbaki is a precursor of category theory? I don't understand.</p>\n<p>Please. That's not very rigorous reasoning in my opinion. But I find it nice that you advertise these papers by J.-P. Marquis and I'm interested to learn that Serre doesn't know what is a topos.</p>",
        "id": 313591716,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670016230
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/oLzkDtwPcgRnVpr6BQKSB1Tw/Screenshot_20221202_163325.png\">Screenshot_20221202_163325.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/oLzkDtwPcgRnVpr6BQKSB1Tw/Screenshot_20221202_163325.png\" title=\"Screenshot_20221202_163325.png\"><img src=\"/user_uploads/21317/oLzkDtwPcgRnVpr6BQKSB1Tw/Screenshot_20221202_163325.png\"></a></div>",
        "id": 313593092,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1670016816
    },
    {
        "content": "<p>So, it would have been better to write mathematical structuralism because that’s not the usual meaning of the word if you speak to a philosopher. But I’m not interested to speak any more. I think I wrote sensical things before but speaking by little tweets or with screenshots is not my cup of tea. Especially if it’s meant to be philosophical. So bye for me.</p>",
        "id": 313595186,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670017850
    },
    {
        "content": "<p>yes, there are many meanings of structuralism, and they seemed to have become big around the same time. <br>\n15 years ago or so I read a book by Francois Dosse \"Histoire du structuralisme\", but it was too historical and did not quite help me understand what the big idea was. Why was sturcture so big.  And so I got very intrigued by the idea that the word was coming up in mathematics and also then even more so in Category Theory, and so I was wondering if the words structure from Bourbaki were related to Category Theory, and the papers that <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span> gave to read above make that link actually very clear. </p>\n<p>From that I think one should turn things around and look for the links from bourbaki and category theory to philosophy. Very often philosophers take mathematical ideas and try to think of the consequences one can reach from those in the humanities and other places where people are unlikely to listen if one speaks maths. But the certainty that the philosophers had about their position indicates to me that there is a lot more coming from that direction than one may be able to read about. Just the fact that Deleuze got so excited about folds (le pli) and about Diagrams (discussed elsewhere on Zulip) does hint at there being some important influences from mathematics).</p>",
        "id": 313596561,
        "sender_full_name": "Henry Story",
        "timestamp": 1670018472
    },
    {
        "content": "<p>I found that article which talks about the direction Bourbaki to (philosophical) structuralism: <a href=\"https://www.nonfiction.fr/article-2739-nicolas-bourbaki-et-la-naissance-du-structuralisme.htm\">Nicolas Bourbaki et la naissance du structuralisme</a></p>",
        "id": 313597601,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670018901
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/category.20theory.20and.20philosophy.20books/near/313591716\">said</a>:</p>\n<blockquote>\n<p>Then, a diagram with two arrows that gives an isomorphism and it is supposed to say something about how Bourbaki is a precursor of category theory? I don't understand.</p>\n<p>Please. That's not very rigorous reasoning in my opinion. But I find it nice that you advertise these papers by J.-P. Marquis and I'm interested to learn that Serre doesn't know what is a topos.</p>\n</blockquote>\n<p>The papers you gave to read show, especially <a href=\"https://philpapers.org/archive/MARFOS-4.pdf\">Forms of Structuralism: Bourbaki and the Philosophers\n</a>, show that the structuralist idea depending on isomorphism was there very early on in Bourbaki.  But at the time they were reductionist to Set, and that limited them in how they could evolve. What <span class=\"user-mention\" data-user-id=\"276830\">@Alexander Kurz</span> was hinting at was that a category is just the minimal structure to  define isomorphism abstractly. Coming up with such an idea was very hard for Bourbaki it seems. So yes, it's a simple diagram (the word Deleuze liked), but at the time diagrams had no mathematical backing and so may have been thought of as unserious...</p>",
        "id": 313597754,
        "sender_full_name": "Henry Story",
        "timestamp": 1670018978
    },
    {
        "content": "<p>One day I saw a YouTube video on Bourbaki or some member of Bourbaki who speaks about Lacan which is classified as structuralist in psychoanalysis but I can't refind it. I'll put it here if I refind.</p>",
        "id": 313597960,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670019086
    },
    {
        "content": "<p>Thanks for the explanations, that's better with slightly more words!</p>",
        "id": 313598068,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670019134
    },
    {
        "content": "<p>Oh sorry, I didn't see it's in French.</p>\n<p>\"Mais le moment fondateur du structuralisme est un moment pluridisciplinaire. Il a lieu lors de la rencontre à New-York - où ils s’étaient réfugiés au cours de la seconde guerre mondiale - entre le linguiste Roman Jakobson, l’ethnologue Claude Lévi-Strauss et le mathématicien, membre fondateur de Bourbaki, André Weil, à l’occasion de l’étude par le second des « Structures élémentaires de la parenté», c’est -à-dire les règles régissant les mariage dans les différentes cultures.\" </p>\n<p>That's crazy! I didn't know this at all. Thank you for speaking about that, I didn't imagine at all that Bourbaki had an influence on philosophy or human sciences more generally.</p>",
        "id": 313598368,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670019289
    },
    {
        "content": "<p>Translated with <a href=\"http://www.DeepL.com/Translator\">www.DeepL.com/Translator</a> (free version)<br>\n\"But the founding moment of structuralism is a multidisciplinary one. It took place when the linguist Roman Jakobson, the ethnologist Claude Lévi-Strauss and the mathematician and founding member of Bourbaki, André Weil, met in New York - where they had taken refuge during the Second World War - on the occasion of the latter's study of the \"Elementary Structures of Kinship\", i.e. the rules governing marriages in different cultures.</p>",
        "id": 313598815,
        "sender_full_name": "Henry Story",
        "timestamp": 1670019499
    },
    {
        "content": "<p>It gets better and completely in line with applied category theory,...</p>\n<blockquote>\n<p>Lévi-Strauss reconnut que pour mener à bien son étude, il lui fallait utiliser des outils mathématiques élaborés. Après avoir sollicité l’aide du célèbre mathématicien Hadamard – qui lui répondit que «le mathématicien ne connait que quatre opérations, et le mariage n’est aucune d’entre elles » - il s'adresse à André Weil, qui contribue à résoudre l’énigme : ces structures étaient celles de la théorie des groupes, et différents types de structure familiales correspondent à des groupes de type différent.</p>\n</blockquote>\n<p>or Translated with <a href=\"http://www.DeepL.com/Translator\">www.DeepL.com/Translator</a> (free version)</p>\n<blockquote>\n<p>Lévi-Strauss recognised that in order to carry out his study he needed to use elaborate mathematical tools. After seeking the help of the famous mathematician Hadamard - who replied that \"the mathematician knows only four operations, and marriage is none of them\" - he turned to André Weil, who helped solve the enigma: these structures were those of group theory, and different types of family structure correspond to different types of groups.</p>\n</blockquote>",
        "id": 313599118,
        "sender_full_name": "Henry Story",
        "timestamp": 1670019656
    },
    {
        "content": "<p>I'm surprised that they say here that Bourbaki played an important role in the advent of structuralism. Is it really something attested in the history of the movement or is it slightly amplified by the author of the article which is a mathematicican? Did you read about that in the book on the history of structuralism?</p>",
        "id": 313600024,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670020059
    },
    {
        "content": "<p>I did not find the history book that helpful at the time, as it described an evolution of a thought or movement but without explaining the thought itself. The movement lost a lot of momentum in the 70s because of the association with marxism and the various east european revolutions... </p>\n<p>If we can see category theory as the continuation of structuralism, then it could help give a much more powerful reading tool, and allow one to distinguish accidental associations from essential ones.</p>",
        "id": 313600631,
        "sender_full_name": "Henry Story",
        "timestamp": 1670020308
    },
    {
        "content": "<p>There is a book in which the relationship between Bourbaki and Non-mathematical structuralism is exposed (in a \"mass-media way\"). <em>The Artist and the Mathematician</em> by Amir Aczel.</p>",
        "id": 313600998,
        "sender_full_name": "Mateo Carmona",
        "timestamp": 1670020459
    },
    {
        "content": "<p>and I would like to take the occasion to share also the following thesis <a href=\"https://theses.hal.science/tel-00193292/document\">Diagrammes et Catégories</a> by Franck Jedrzejewski</p>",
        "id": 313601159,
        "sender_full_name": "Mateo Carmona",
        "timestamp": 1670020558
    },
    {
        "content": "<p>Oh. That's the English version of the book the article <a href=\"https://www.nonfiction.fr/article-2739-nicolas-bourbaki-et-la-naissance-du-structuralisme.htm\">Nicolas Bourbaki et la naissance du structuralisme</a> is about. And thanks for the thesis.</p>",
        "id": 313601454,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670020684
    },
    {
        "content": "<p>There is this post on Philosophy Stack Exchange: <a href=\"https://philosophy.stackexchange.com/questions/2999/is-there-any-connection-between-structuralism-and-category-theory\">Is there any connection between structuralism and category theory</a> where they say:</p>\n<p>\"A letter by Jean-Michel Kantor, Bourbakis Structure and Structuralism at <a href=\"http://springerlink.com/content/x60030547jl61071/that\">springerlink.com/content/x60030547jl61071/that</a> throws a great deal of light on this:</p>\n<p>he says,'When I asked Claude Levi-Strauss about the origin of the word ‘‘structure’’ in his work, he answered (letter to the author, Nov. 16, 1990): ‘‘Ne croyez pas un instant que Bourbaki m’ait emprunté le terme ‘‘ structure’’ ou le contraire, il me vient de la linguistique et plus précisément de l’Ecole de Prague.’’ (Do not believe for one minute that Bourbaki borrowed the word ‘‘structure’’ from me, or the contrary; it came to me from linguistics, more precisely, from the School of Prague.'' <br>\n\"</p>",
        "id": 313602716,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1670021301
    },
    {
        "content": "<p>yes, but ideas travel fast, and sometime appear simultanouesly in different parts of the globe, so that one would need to find out if the Prague School was not thinking the same thing as Bourbaki...</p>",
        "id": 313603059,
        "sender_full_name": "Henry Story",
        "timestamp": 1670021460
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"425417\">Mateo Carmona</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/category.20theory.20and.20philosophy.20books/near/313601159\">said</a>:</p>\n<blockquote>\n<p>and I would like to take the occasion to share also the following thesis <a href=\"https://theses.hal.science/tel-00193292/document\">Diagrammes et Catégories</a> by Franck Jedrzejewski</p>\n</blockquote>\n<p>This thesis does  attempt to articulate the interaction of category theory and concerns in the french philosophy we were discussing (Deleuze and diagrams, for example, the notion of category theory from Aristotle onwards, etc... ) so it is a very interesting resource in that regard. But it is a bit confusing at times and does not define certain terms which are assumed known (such as \"virtuel\"), ... It looks at functors but only just about makes it to monads... </p>\n<p>It definitely does not reach the standard of quality of <a href=\"https://global.oup.com/academic/product/categories-for-the-working-philosopher-9780198748991?cc=us&amp;lang=en&amp;\">\"Categories for the Working Philosopher\"</a> edited by Elaine Landry, which I just noticed also has an article on structuralism... (Now clearly Elaine did not aim at the largest public by looking to sell a book for the working philosopher. Contrast that with \"A Categorical Defense of our Future\" aimed at business leaders).</p>",
        "id": 313782636,
        "sender_full_name": "Henry Story",
        "timestamp": 1670145770
    },
    {
        "content": "<p>Btw, the article on Structuralism  in Elaine Landry's book, is by Steve Awodey. It is  <a href=\"https://kilthub.cmu.edu/articles/journal_contribution/Structuralism_Invariance_and_Univalence/6492728/1/files/11937329.pdf\">Structuralism, Invariance, and Univalence</a> and is very clear, concise and also online.</p>",
        "id": 314086249,
        "sender_full_name": "Henry Story",
        "timestamp": 1670261439
    },
    {
        "content": "<p>I like the talk about meaning. I was a classical piano player for a long time but nobody ever talked to me about meaning until I started playing Jazz. Jazz is all about creating your own meaning. Many people who play classical can be good at technique but lacks emotional connection to it. This is similar to the relationship between formalism math and intuitionism math.</p>",
        "id": 315603829,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1670941814
    },
    {
        "content": "<p>Yes, that's interesting. I think I use a lot of philosophical, emotional and aesthetical considerations to do math even very formal math, and I'm not very strong technically and neither know a large amount of things - precisely. I prefer exploring the ideas without a lot of rigour at first, with more attention to the meaning. I use the technique when I finally need to prove the things. In that way, I feel a big difference with people who have a more academical approach and that would be more classical pianist and can be able to prove very difficult, technical and specialized results. The issue is that people in math are often too attached to an absolute seriousness and don't attribute a lot of value to intuitionism which can play an important role in original creation I think. That's a challenge to find the balance between finding some (new ideally) meaning while doing serious math. I was playing the piano also and enjoyed more the emotion than the technique, although I never had a very good level. There is a two steps cycle in math where you have to open your mind and browse broadly all the landscape to find the idea and then in the second step make things extremely clear and write them with perfect rigour. So at best one should be able to go to high intuitionism and also to high formalism, depending of the moment. Compared to piano, it is a cycle spread over time, while for music, you need the two at the same time at any moment.</p>",
        "id": 316357446,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1671223815
    },
    {
        "content": "<p>Beautifully said.</p>",
        "id": 316369092,
        "sender_full_name": "Jules Tsukahara",
        "timestamp": 1671228376
    }
]