[
    {
        "content": "<p>Hi all, I'm new. Aiming to challenge the \"No question is dumb\" mantra as much as possible.</p>\n<p>In \"A survey of graphical languages for monoidal categories\" by Selinger, it says for many kinds of monoidal categories with extra structure (e.g. pivotal categories, braided autonomous categories) that coherence of the graphical language has only been proved for special cases, such as for diagrams over a simple signature.</p>\n<p>Has coherence since been proven in the general case for such categories since then? I am particularly interested in the cases of braided pivotal categories &amp; tortile (ribbon) categories.</p>",
        "id": 223195058,
        "sender_full_name": "Alexander Cowtan",
        "timestamp": 1611042240
    },
    {
        "content": "<p>Hi!  Whew, you're going to have to work a lot harder if you're trying to ask a <em>dumb</em> question.</p>\n<p>Maybe <span class=\"user-mention\" data-user-id=\"277391\">@Cole Comfort</span> might know about coherence theorems for braided pivotal categories or ribbon categories.   I don't.  I would be inclined to just google it!</p>",
        "id": 223196429,
        "sender_full_name": "John Baez",
        "timestamp": 1611043486
    },
    {
        "content": "<p>I don't know about pivotal &amp; ribbon categories, but I <em>think</em> this paper <a href=\"https://arxiv.org/abs/1508.01069\">https://arxiv.org/abs/1508.01069</a> (\"String diagrams for traced and compact categories are oriented 1-cobordisms\") fills in the missing cases from Selinger for, as it says, traced and compact closed categories</p>",
        "id": 223217676,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611058399
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223196429\">said</a>:</p>\n<blockquote>\n<p>Hi!  Whew, you're going to have to work a lot harder if you're trying to ask a <em>dumb</em> question.</p>\n<p>Maybe <span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> might know about coherence theorems for braided pivotal categories or ribbon categories.   I don't.  I would be inclined to just google it!</p>\n</blockquote>\n<p>I am not aware of any such coherence theorems.  I think that everyone just assumes that the \"obvious\" coherence conditions are complete so there probably wouldn't be too much of a reward in actually proving them.<br>\nMaybe <span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> has more insight into such things.</p>",
        "id": 223268885,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1611080349
    },
    {
        "content": "<p>Yes, can we have more people proving these things? :)  And perhaps let's stop calling them coherence theorems since it creates a really annoying clash with the \"all diagrams commute\" sort of result. Soundness and completeness, anyone?</p>",
        "id": 223289533,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1611088258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276320\">Antonin Delpeuch</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223289533\">said</a>:</p>\n<blockquote>\n<p>Yes, can we have more people proving these things? :)  And perhaps let's stop calling them coherence theorems since it creates a really annoying clash with the \"all diagrams commute\" sort of result. Soundness and completeness, anyone?</p>\n</blockquote>\n<p>Yes please! I've been saying this for ages.</p>",
        "id": 223295385,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611090736
    },
    {
        "content": "<p>“Adequacy” also exists as a term for soundness+completeness if people prefer a single word.</p>",
        "id": 223295486,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611090781
    },
    {
        "content": "<p><a href=\"#narrow/stream/229199-learning.3A-questions/topic/Rigorous.20string.20diagrams/near/204146411\">Actually I already complained about this here...</a></p>",
        "id": 223296710,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611091333
    },
    {
        "content": "<p>Yay for \"adequacy\"!</p>",
        "id": 223339211,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1611127293
    },
    {
        "content": "<p>Thanks all.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223196429\">said</a>:</p>\n<blockquote>\n<p>Hi!  Whew, you're going to have to work a lot harder if you're trying to ask a <em>dumb</em> question.</p>\n</blockquote>\n<p>I'll try my best.</p>",
        "id": 223342610,
        "sender_full_name": "Alexander Cowtan",
        "timestamp": 1611130526
    },
    {
        "content": "<p>History question: Does anyone know who to blame for the terminology \"coherence\" for things related to graphical languages? Is it Peter Selinger, or was someone using it earlier?</p>",
        "id": 223359298,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611140723
    },
    {
        "content": "<p>Well there’s <a href=\"https://www.springer.com/gp/book/9783540059639\">this book</a> from the 70s all about coherence questions where Mac Lane originally proved the coherence theorem for monoidal categories</p>",
        "id": 223363444,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611143754
    },
    {
        "content": "<p>But I’m not sure if that’s what you mean regarding graphical languages</p>",
        "id": 223363507,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611143779
    },
    {
        "content": "<p>Nope, I mean results like \"the free blah category on a signature is isomorphic to the category whose morphisms are blah diagrams modulo blah topological moves\"</p>",
        "id": 223363573,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611143855
    },
    {
        "content": "<p>The issue being that those results are only loosely related to Mac Lane style \"all diagrams commute\" results, and Mac Lane got there first</p>",
        "id": 223363645,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611143896
    },
    {
        "content": "<p>I don't know if Selinger invented this use of coherence, but they did probably popularise it.</p>\n<p>I think it stems from a misreading of what Mac Lane's use of “coherence” refers to. I imagine that Selinger or their source interpret Mac Lane's theorem as something like<br>\n<em>The equational theory of monoidal categories is sound and complete for... our ideal model of what a monoidal category should be</em>,<br>\nwhich is the one in which all well-formed diagrams made up of structural morphisms commute.<br>\nSo a soundness-and-completeness result with respect to the coherent model as an embodiment of an ideal model that we aspire to. </p>\n<p>And then you get the graphical language theorems as generalisations of this reading, where now our “ideal model” is the one expressed by the string diagram picture.</p>\n<p>The misreading is that “coherence” refers to a property of the equational theory, that is, that Mac Lane's theorem is<br>\n<em>The equational theory of monoidal categories is “coherent” for the model in which all diagrams commute.</em><br>\nWhereas coherence is a property of the free models, that is, Mac Lane's theorem is<br>\n<em>The free models of the equational theory of monoidal categories are coherent.</em></p>",
        "id": 223368006,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611147009
    },
    {
        "content": "<p>It's a bit like thinking that Gödel's incompleteness theorem is not the statement that<br>\n<em>Peano arithmetic is incomplete</em><br>\nbut the statement that<br>\n<em>The natural numbers are incomplete</em>...</p>",
        "id": 223368900,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611147600
    },
    {
        "content": "<p>I don't understand the hairs that are being split here.  Set aside the question of whether \"all diagrams commute\", since as is well known there are plenty of \"coherent\" structures in which not all diagrams commute.  A more generalizable way to state MacLane's result is that it gives a method for determining whether a particular diagram shape in the language of monoidal categories commutes in general.  This is equivalent to giving a concrete description of free monoidal categories.  String diagrams can also be interpreted as doing both of these things.</p>",
        "id": 223393697,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611158543
    },
    {
        "content": "<p>(A more problematic usage, in my opinion, is saying \"coherence theorem\" for a result of the form \"every pseudo-blah is equivalent to a strict blah\".  This is not completely unrelated, but certainly not equivalent, since there are plenty of coherence theorems that do not imply a full strictification theorem.)</p>",
        "id": 223393856,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611158612
    },
    {
        "content": "<p>I agree with your version of generalised Mac Lane coherence -- I didn't mean to say that all coherence results are of the form \"all diagrams commute\", but they are of the form \"<em>these particular</em> diagrams commute\" or better in some contexts \"commute up to a higher cell\"... That's certainly also the usage of coherence by French rewriting theorists :)</p>",
        "id": 223397596,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611160050
    },
    {
        "content": "<p>On the other hand I don't think I agree that \"string diagrams can be interpreted as doing these things\". My reading of Joyal-Street is that it is, by itself, a theorem on <em>strict</em> monoidal categories, that only says something about general monoidal categories because of Mac Lane's coherence theorem; but the two parts are logically independent.</p>",
        "id": 223397894,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611160174
    },
    {
        "content": "<p>Specifically, it is coherence which gives a \"pasting theorem\" allowing to interpret string diagrams in arbitrary monoidal categories by choosing a bracketing on the sources and targets of individual boxes/nodes. This only \"coherently\" extends to composite diagrams because coherence ensures that rebracketing can be done in a unique way to compose things together.</p>",
        "id": 223398607,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611160477
    },
    {
        "content": "<p>I agree that strictification is another related, but not equal notion to either of the ones we're discussing.</p>",
        "id": 223398699,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611160529
    },
    {
        "content": "<p>I think of Selinger's use of the word \"coherent\" as a natural outgrowth of Mac Lane's coherence theorem.  Mac Lane used the word \"coherent\" in the main theorem of his 1963 paper <a href=\"https://scholarship.rice.edu/handle/1911/62865\">Natural associativity and commutativity</a>.   Maybe the applications to graphical languages is a bit different,... but I doubt Selinger thought he was doing anything new in using the word that way.</p>",
        "id": 223422309,
        "sender_full_name": "John Baez",
        "timestamp": 1611170743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Yes, Mac Lane says:</p>\n<blockquote>\n<p>Coherence can also be defined in terms of diagrams: it requires that any diagram with vertices iterates of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>⊗</mo></mrow><annotation encoding=\"application/x-tex\">\\otimes</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.66666em;vertical-align:-0.08333em;\"></span><span class=\"mord\">⊗</span></span></span></span> and edges expansions of instances of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi></mrow><annotation encoding=\"application/x-tex\">a</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">a</span></span></span></span> be commutative.</p>\n</blockquote>\n<p>So a property that “certain diagrams commute in all models”. It's a property of <em>models</em> of a theory.<br>\nIt's analogous, for example, to the property that all models of the theory of vector spaces are free models.<br>\nThat's very different from soundness+completeness, which is a property of a theory with respect to a class of models, and which is what Selinger's theorems are about. I really don't think there's any “hair splitting” involved.</p>",
        "id": 223430389,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611174445
    },
    {
        "content": "<p>If you had a theorem stating roughly<br>\n“These axioms are sound and complete for vector spaces over a field <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>k</mi></mrow><annotation encoding=\"application/x-tex\">k</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03148em;\">k</span></span></span></span>. Also, (Freeness theorem): all models of this theory are free.” <br>\nAnd then somebody wrote a survey of soundness+completeness theorems calling them “freeness theorems”, I don't think there would be any doubt that it's a bad choice.</p>",
        "id": 223430832,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611174625
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223295486\">said</a>:</p>\n<blockquote>\n<p>“Adequacy” also exists as a term for soundness+completeness if people prefer a single word.</p>\n</blockquote>\n<p>Unfortunately, it's also used in denotational semantics to mean <a href=\"https://en.wikipedia.org/wiki/Denotational_semantics#Abstraction\">something else</a>. (A lot of the terminology in denotational semantics is bad, though.)</p>",
        "id": 223431582,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611174967
    },
    {
        "content": "<p>Comploundness...</p>",
        "id": 223432005,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611175194
    },
    {
        "content": "<p>Still a better word than “clopen”!</p>",
        "id": 223432214,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611175298
    },
    {
        "content": "<p>I don't see why one can't talk about a coherence theorem for strict structures, in the sense of a concrete description of the free such structure.  It's not the <em>same</em> theorem as a coherence theorem for weak structures, but if it's doing the same thing for the relevant 2-monad we should be able to call it the same thing.</p>",
        "id": 223534171,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611246757
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223430389\">said</a>:</p>\n<blockquote>\n<p>So a property that “certain diagrams commute in all models”. It's a property of <em>models</em> of a theory.</p>\n</blockquote>\n<p>You could say that, but you could also regard soundness+completeness as a property of models.  Soundness means that something provable in the theory is true in all models, and completeness means that something not provable in the theory is false in some model.  I think \"certain diagrams commute in all models\" is much more closely analogous to (and, given the right framework, even an instance of) \"something provable in the theory is true in all models\" than it is to something like \"all models are free\".</p>",
        "id": 223534546,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611246929
    },
    {
        "content": "<p>Yes, I see what you are saying. Still, my feeling is that there are two logically independent parts to something like Joyal and Street's result. There is what I would call properly coherence theorems, which can be put in the form<br>\n<em>The universal morphisms from the free models of this theory to the free models of this stricter theory are (weak) equivalences</em>,<br>\nand then there are “coherence theorems” in Selinger's sense which are of the form<br>\n<em>Free models of the stricter theory have this concrete description up to isomorphism</em>.<br>\nIn the paradigmatic example, Mac Lane proves that the quotient functor from free monoidal categories to free strict monoidal categories is an equivalence, and then Joyal &amp; Street prove that free strict monoidal categories can be presented by string diagrams up to ambient isotopy. I don't see any logical dependency between the two. <br>\nAnd my impression is that even Joyal &amp; Street use “coherence” to refer to the first property, even though the two can be somewhat conflated into a single statement, like “free models of this theory are weakly equivalent to these concrete, stricter models”.</p>",
        "id": 223560086,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611257963
    },
    {
        "content": "<p>I still think that the analogy with “vector spaces are free models” is not off the mark. You can state two logically independent theorems:<br>\n<em>All vector spaces are isomorphic to free vector spaces</em><br>\nand<br>\n<em>The free vector space on a set is the vector space of formal linear combinations of elements of the set.</em><br>\nI would say that Mac Lane's coherence theorem is logically analogous to the first and Selinger's coherence theorems are analogous to the second.</p>",
        "id": 223560859,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611258278
    },
    {
        "content": "<p>Yes, certainly the result decomposes in that way.  But I don't see why you would insist that only one half of it should be called a \"coherence theorem\".  In fact the part of it that you want to call a \"coherence theorem\" seems to me <em>less</em> like a coherence theorem than the other part, because it doesn't give a concrete description of anything; it only says that one abstract thing is equivalent/isomorphic to some other abstract thing.  Rather than a coherence theorem, I'd be tempted to call it more of a strictification theorem for free structures.</p>",
        "id": 223848914,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611540330
    },
    {
        "content": "<p>I think that Mac Lane uses the word “coherence” in the sense of “all the choices that we make are coherent/consistent” because all a priori different parallel paths of morphisms are actually equal. In more homotopical settings you could say “we have a contractible space of choices”. To me this reading makes sense based on the non-mathematical semantics of the word. With strict structures there is a unique choice so “coherence” is trivial, not something that deserves a coherence theorem.<br>\nIt is also this meaning of the word that French rewriting theorists have in mind in the theory of “coherent presentations”, so maybe I'm biased because I'm interested in this.<br>\nHow do you relate the (non-mathematical) meaning of “coherence” to “being a concrete description of something”?</p>",
        "id": 223861786,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611559012
    },
    {
        "content": "<p>“Strictification for free structures” to me is just a way to encapsulate coherence in the fact that, roughly “quotienting out the spaces of choices produces an acyclic fibration”, and that's the comparison map between a free model and a free strict model.</p>",
        "id": 223862054,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611559335
    },
    {
        "content": "<p>I'm getting kind of bored of this conversation, but I'll give it one more go.  Yes, the original meaning of coherence derived from \"all the choices are consistent\", but I think that was because the first coherence theorems were of the \"all diagrams commute\" kind.  When you generalize beyond that, I suppose one might argue that the word \"coherence\" shouldn't apply (which would exclude it from being used, for instance, for <em>any</em> kind of \"coherence theorem\" for braided monoidal categories), but I think that ship has sailed.  Nowadays we certainly apply \"coherence theorem\" to situations in which not all diagrams commute, and in that case what it means is giving a concrete presentation.</p>",
        "id": 223896303,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611581292
    },
    {
        "content": "<p>I'm kind of interested in this conversation just because I've never encountered anyone actively defending the status quo terminology before, I've only ever seen people who are actively against it and people who don't care</p>",
        "id": 223898059,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611582168
    },
    {
        "content": "<p>I'm no prescriptivist and I don't mind if there's conflicting terminology. The only moments when I care is when I meet someone learning string diagrams and monoidal categories, and they invariably get confused about what the hell coherence is. But we'll have to disagree. <br>\nI never said that coherence is necessarily “all diagrams commute”, rather it's about “some diagrams commute” (maybe up to a higher cell). That covers the usage of “coherence” in most 'classical' papers that I can think of: Mac Lane, Kelly-Laplaza, Joyal-Street, Gordon-Power-Street... Also perhaps the one where I found it spelled out most clearly, “coherence for weak units” by Joyal and Joachim Kock where the coherence theorem is explicitly of the form “a certain 2-category is contractible”. Honestly I think Selinger is the exception and the only “major” paper which in my opinion misuses the word coherence. So I don't think it's fair to put it like “It's a done deal, everyone uses coherence this way nowadays”.</p>",
        "id": 223904462,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611585176
    },
    {
        "content": "<p>My thesis was on coherence theorems, and I understand the term the same way as Mike. A coherence theorem gives a way to decide equality in free categorical structures. This usage has been with us a long time, and was codified by Australian category theorists in the early 70's.</p>",
        "id": 223908657,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611586969
    },
    {
        "content": "<p>(Sorry, I wrote then deleted a few messages because I think I misunderstood what you meant by “decide equality” the first time -- I interpreted it in the sense of a computational decision procedure, but now I think you meant “define equality”, i.e. give a complete presentation of a theory of equality)</p>",
        "id": 223915177,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611589592
    },
    {
        "content": "<p>I think maybe it's starting to click to me why we are not understanding each other <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 223915993,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611589927
    },
    {
        "content": "<p>For you and Mike, a <em>free model</em> is defined by a universal property, as the image of a left adjoint to a forgetful functor from the category of models -- is that right?</p>\n<p>While all this time I've been thinking “as a computer scientist”: a <em>free model</em> for me is a <em>syntactic</em> model of a certain <em>presented</em> theory.</p>",
        "id": 223916375,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590100
    },
    {
        "content": "<p>That's why it didn't make sense to me. I'm thinking of <em>coherence</em> as a property of a <em>presented theory</em> which is equivalently a property of its <em>syntactic models</em>.</p>",
        "id": 223916588,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590185
    },
    {
        "content": "<p>Ah but then you're distinguishing syntactic presentations which give rise to the same object right?</p>",
        "id": 223916662,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611590217
    },
    {
        "content": "<p>Yes! So for me a coherence theorem is literally the fact that certain diagrams <em>made from the generators of this presentation</em> commute up to <em>equations or higher-dim generators of this presentation</em>.<br>\nWhich certainly can give a procedure for deciding equality in free structures (so Todd's definition makes sense to me as a <em>consequence</em> of coherence).</p>",
        "id": 223916893,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590317
    },
    {
        "content": "<p>The most basic coherence theorem we learn is that the operation in a group is associative. This means that when writing down a group presentation, we can do so without brackets. The words in a group are akin to the diagrams in a category (they're both just generalised elements). Just because we can present the same element in a group in different ways (i.e. via different words), it doesn't mean we don't have coherence.</p>",
        "id": 223917026,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611590379
    },
    {
        "content": "<p>While for Todd and Mike, if now I understand correctly, a coherence theorem is a theorem which <em>constructs a presentation for a 'free model' which is defined 'semantically' by a universal property</em>.</p>",
        "id": 223917445,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590459
    },
    {
        "content": "<p>So of course we could not understand each other, we were thinking of different meanings of “free model”.</p>",
        "id": 223917637,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590496
    },
    {
        "content": "<p>So is your understanding of 'free model' a syntactic presentation?</p>",
        "id": 223917803,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611590526
    },
    {
        "content": "<p>Yeah, I guess for me a “free monoidal category” is a syntactic model made up of building blocks that are associators, unitors, etc...</p>",
        "id": 223918122,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590606
    },
    {
        "content": "<p>In fact I should have known better, because I conflated “theory” with “presentation of a theory” a few times.</p>",
        "id": 223918529,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590713
    },
    {
        "content": "<p>For me, a pretty important lesson from category theory is to distinguish between presentations and their universal realisations.</p>",
        "id": 223918547,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611590721
    },
    {
        "content": "<p>Yep. So the thing is, I would still say that Mac Lane's coherence theorem is about a <em>presentation</em> of the theory of monoidal categories.</p>",
        "id": 223918691,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590764
    },
    {
        "content": "<p>Or equivalently about its free models in the sense of syntactic models.</p>",
        "id": 223918860,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590833
    },
    {
        "content": "<p>But I think I'm starting to understand better how the term has shifted in usage.</p>",
        "id": 223919051,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611590905
    },
    {
        "content": "<p>Am I understanding right? A general coherence theorem says \"the free [as in universal property] foo is equivalent to bar [defined concretely]\"; results of the form \"all diagrams commute [except those that don't]\" can be seen as a special case of that?</p>",
        "id": 223919509,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611591105
    },
    {
        "content": "<p>I think it may be something like:<br>\nMac Lane: “Coherence theorem: this presentation of the theory is coherent, that is, the syntactic models are coherent.” </p>\n<p>-&gt; (first shift): “Coherence theorem: the free models of this theory are equivalent to these syntactic models, which are coherent.”</p>\n<p>-&gt; (second shift): “Coherence theorem: the free models of this theory are equivalent to these syntactic models.”</p>",
        "id": 223919620,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611591137
    },
    {
        "content": "<p>And then finally Selinger's usage of “Coherence theorem: the free models of this theory are equivalent to these concrete models.”</p>",
        "id": 223919747,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611591188
    },
    {
        "content": "<p>My personal understanding of the word \"syntactic\" has expanded to include diagrams, as in \"diagrams are 2-dimensional syntax whereas strings and terms are 1-dimensional syntax\"</p>",
        "id": 223920122,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611591343
    },
    {
        "content": "<p>While I agree for some formalisations of string diagrams, I cannot really agree for “embedded real manifolds modulo ambient isotopy”.</p>",
        "id": 223920327,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611591401
    },
    {
        "content": "<p>The usual coherence theorem for monoids is \"the free monoid on a set is equivalent to the monoid of strings with concatenation\". A less useful but equally valid one is \"the free monoid on a set is equivalent to a bunch of labelled points on a line, modulo isotopy\"</p>",
        "id": 223921317,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611591752
    },
    {
        "content": "<p>Well, you see, for me a coherence theorem for monoids would be “all well-formed binary bracketings of the same string are equal”.</p>",
        "id": 223921660,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611591906
    },
    {
        "content": "<p>Isn't that the same statement?</p>",
        "id": 223921760,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611591946
    },
    {
        "content": "<p>No, my statement refers to the syntactic model for the presentation of monoids with a binary multiplication. That's where binary bracketings come from.</p>",
        "id": 223922084,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592052
    },
    {
        "content": "<p>Not the same, merely equivalent.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 223922164,
        "sender_full_name": "John Baez",
        "timestamp": 1611592069
    },
    {
        "content": "<p>Right. The free monoid is the one with binary bracketings. Asserting it's equal to the monoid of strings is the same as saying that all bracketings are equal.</p>",
        "id": 223922382,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592102
    },
    {
        "content": "<p>To what extent would it be reasonable to say that coherence theorems are results stating that free <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">Σ</mi></mrow><annotation encoding=\"application/x-tex\">\\Sigma</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\">Σ</span></span></span></span>-algebras are equivalent to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"normal\">Σ</mi><mo lspace=\"0em\" mathvariant=\"normal\" rspace=\"0em\">′</mo></msup></mrow><annotation encoding=\"application/x-tex\">\\Sigma'</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.751892em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\">Σ</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.751892em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">′</span></span></span></span></span></span></span></span></span></span></span></span>-algebras, where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">Σ</mi></mrow><annotation encoding=\"application/x-tex\">\\Sigma</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\">Σ</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"normal\">Σ</mi><mo lspace=\"0em\" mathvariant=\"normal\" rspace=\"0em\">′</mo></msup></mrow><annotation encoding=\"application/x-tex\">\\Sigma'</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.751892em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\">Σ</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.751892em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">′</span></span></span></span></span></span></span></span></span></span></span></span> are presentations and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"normal\">Σ</mi><mo lspace=\"0em\" mathvariant=\"normal\" rspace=\"0em\">′</mo></msup></mrow><annotation encoding=\"application/x-tex\">\\Sigma'</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.751892em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\">Σ</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.751892em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">′</span></span></span></span></span></span></span></span></span></span></span></span> is a \"simpler\" presentation?</p>",
        "id": 223922478,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592119
    },
    {
        "content": "<p>The coherence theorem for monoids is then \"free monoids are equivalent to lists\".</p>",
        "id": 223922545,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592133
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223922382\">said</a>:</p>\n<blockquote>\n<p>Right. The free monoid is the one with binary bracketings. Asserting it's equal to the monoid of strings is the same as saying that all bracketings are equal.</p>\n</blockquote>\n<p>You are making the same “mistake” that I was making! Thinking that free model = syntactic model. That's CS-thinking.</p>",
        "id": 223922605,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592145
    },
    {
        "content": "<p>I think it's a tautology to say that the free model is the syntactic model.</p>",
        "id": 223922721,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592175
    },
    {
        "content": "<p>For Mike and Todd a free model is one that's obtained through the left adjoint of the forgetful functor from monoids to sets.</p>",
        "id": 223922761,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592192
    },
    {
        "content": "<p>There <em>has</em> to be a syntactic presentation by definition, though. It just might not be the one you want.</p>",
        "id": 223922833,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592212
    },
    {
        "content": "<p>Or through “a” left adjoint. Really it refers to a whole (contractible) groupoid of things.</p>",
        "id": 223922861,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592221
    },
    {
        "content": "<p>(Because all left adjoints are uniquely naturally isomorphic as functors.)</p>",
        "id": 223922927,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592259
    },
    {
        "content": "<p>To muddy the waters further: A syntactic monoid is (in my opinion) literally defined in terms of <em>trees</em>. Proving that it's equivalent to strings over the same set together with the extra symbols \"(\" and \")\", satisfying a certain balance property, is an exercise you can give to make 1st years suffer</p>",
        "id": 223922956,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611592268
    },
    {
        "content": "<blockquote>\n<p>The free monoid is the one with binary bracketings.</p>\n</blockquote>\n<p>It depends on what you mean by \"the free monoid\".  You could argue it's the one freely formed by a binary operation mod the equivalence relation (ab)c = a(bc) (and some laws involving units), and then we get the binary bracketings you're talking about.  But you could also argue it's the monoid of strings on the generators.  Since they're isomorphic, they're both perfectly fine \"free monoids\" on a given set.</p>",
        "id": 223923005,
        "sender_full_name": "John Baez",
        "timestamp": 1611592292
    },
    {
        "content": "<p>But proving they're isomorphic is a kind of \"coherence theorem\".</p>",
        "id": 223923111,
        "sender_full_name": "John Baez",
        "timestamp": 1611592324
    },
    {
        "content": "<p>So can we agree that these are the two competing reading of coherence?</p>\n<ul>\n<li>Coherence as a property of a <em>presented theory</em>, or equivalently, of its syntactic models; namely, that certain diagrams made of generators commute up to higher generators or relations.</li>\n<li>Coherence as a property of the <em>free models of a theory</em>, where being free is defined wrt to a free-forgetful adjunction for the category of models; namely, that they are equivalent to the syntactic models of a certain presentation.</li>\n</ul>",
        "id": 223923600,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592524
    },
    {
        "content": "<p>By the way, I think there are lots of interesting questions here, and to me the <em>least</em> interesting questions are \"what is coherence?\" and \"what are coherence theorems?\", since those are purely about definitions.</p>",
        "id": 223923811,
        "sender_full_name": "John Baez",
        "timestamp": 1611592596
    },
    {
        "content": "<p>The two competing readings of coherence sound a bit like this to me:</p>\n<ul>\n<li>proving that a syntactic model of a presented theory is equivalent to a free model of that theory;</li>\n<li>proving that a free model of a theory is equivalent to a syntactic model of a presentation of that theory.</li>\n</ul>",
        "id": 223924174,
        "sender_full_name": "John Baez",
        "timestamp": 1611592745
    },
    {
        "content": "<p>I'm sort of joking... one of your two choices involved diagrams commuting... but they don't sound so different to me.</p>",
        "id": 223924353,
        "sender_full_name": "John Baez",
        "timestamp": 1611592813
    },
    {
        "content": "<p>Yeah, it's more like:</p>\n<ul>\n<li>the theorem is that a specific presentation has a property.</li>\n<li>the theorem is that a theory has a specific presentation.</li>\n</ul>",
        "id": 223924504,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592900
    },
    {
        "content": "<p>I think the difficulty here is that most of the time, when we define a notion of syntactic presentation, we do so quite informally and without defining what the category of presentations looks like.</p>",
        "id": 223924604,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611592936
    },
    {
        "content": "<p>The confusion is also the sometimes they are put together into</p>\n<ul>\n<li>the theorem is that a theory has a specific presentation which has a property.</li>\n</ul>",
        "id": 223924612,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611592943
    },
    {
        "content": "<p>Both of these seem like they can be reduced to \"one specific presentation is equivalent to another specific presentation\".</p>",
        "id": 223924614,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592943
    },
    {
        "content": "<p>E.g. the presentation of monoidal categories is equivalent to the presentation of strict monoidal categories.</p>",
        "id": 223924661,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611592969
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223923811\">said</a>:</p>\n<blockquote>\n<p>By the way, I think there are lots of interesting questions here, and to me the <em>least</em> interesting questions are \"what is coherence?\" and \"what are coherence theorems?\", since those are purely about definitions.</p>\n</blockquote>\n<p>I think that there is a lot to learn from the fact that the same word means related but different things to two of us, and trying to understand where the difference comes from.</p>",
        "id": 223925190,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611593203
    },
    {
        "content": "<p>I think the nlab definition of coherence in terms of contractibility of the space of choices is pretty intuitive. The idea is that we may have many different options, but in the end it shouldn't really matter which one we choose. This relates to syntax and diagrams I think in the following way: supposing we follow certain rules regarding how we build our syntactic presentations, we will stay within this contractible space of choices.</p>",
        "id": 223925322,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611593266
    },
    {
        "content": "<p>Its analogous to a soundness result in logic: supposing we start with a presentation and follow the deduction rules of the ambient language, we will always stay within the space of things true in the free model on that presentation.</p>",
        "id": 223925508,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611593338
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223925322\">said</a>:</p>\n<blockquote>\n<p>I think the nlab definition of coherence in terms of contractibility of the space of choices is pretty intuitive. The idea is that we may have many different options, but in the end it shouldn't really matter which one we choose. This relates to syntax and diagrams I think in the following way: supposing we follow certain rules regarding how we build our syntactic presentations, we will stay within this contractible space of choices.</p>\n</blockquote>\n<p>Oh, that's the nLab definition? I used those same words a few messages ago, but I must have forgotten where they came from <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 223925720,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611593415
    },
    {
        "content": "<p>The contractibility 'definition' is from the nlab: <a href=\"https://ncatlab.org/nlab/show/coherence+law\">https://ncatlab.org/nlab/show/coherence+law</a></p>",
        "id": 223925829,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611593454
    },
    {
        "content": "<p>Yes, that's certainly where I got my own idea from, then. That's certainly coherence in the first sense (property of a presentation), because the choices are relative to specific generators/structural cells.</p>",
        "id": 223926037,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611593526
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223925190\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223923811\">said</a>:</p>\n<blockquote>\n<p>By the way, I think there are lots of interesting questions here, and to me the <em>least</em> interesting questions are \"what is coherence?\" and \"what are coherence theorems?\", since those are purely about definitions.</p>\n</blockquote>\n<p>I think that there is a lot to learn from the fact that the same word means related but different things to two of us, and trying to understand where the difference comes from.</p>\n</blockquote>\n<p>Yes.  I was just saying that I don't care which definition of \"coherence\" or \"coherence theorem\" is \"correct\".     The interesting part is sorting out various concepts and their relationships.  Maybe this remark of mine was too obvious to be necessary.</p>",
        "id": 223926215,
        "sender_full_name": "John Baez",
        "timestamp": 1611593617
    },
    {
        "content": "<p>I think it is a useful remark to make, because I think for some people two concepts are obviously the same, so they're happy to conflate those concepts; whereas for others, it's not clear, especially because as-stated the two concepts look different. E.g. if you take the 6 different ways to describe the coherence theorem(s) for monoidal categories <a href=\"https://ncatlab.org/nlab/show/coherence+theorem+for+monoidal+categories\">on the nLab page</a>, it's not immediately clear why some imply the others (and if these statements would generalise to other situations).</p>",
        "id": 223927035,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611593919
    },
    {
        "content": "<p>If they do always generalise, then it makes it more obvious that \"coherence\" has a single meaning, but may be phrased differently, but if they don't always generalise, then it's important to draw the distinction.</p>",
        "id": 223927149,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611593961
    },
    {
        "content": "<p>It would be nice to have a paper proving coherence in various ways for some reasonably general notion of presentation/theory and showing them to be equivalent (or at least related). (Though this is essentially what <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> said already.)</p>",
        "id": 223927303,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611594008
    },
    {
        "content": "<p>It's not totally unreasonable to want different names for these closely related but subtly different things. There's a tension between \"equivalent things should have the same name\" and \"equivalent but not identical things should have different names\"</p>",
        "id": 223927667,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611594154
    },
    {
        "content": "<p>I can imagine a very nice paper going through all 6 theorems about monoidal categories on the nLab, proving them, and discussing how they're related to each other - e.g. how you can prove some starting from others.</p>\n<p>(Nathanael mentioned 7 but I just see 6.)</p>\n<p>On the other hand, monoidal categories are a bit \"too easy\"; symmetric monoidal categories introduce important new challenges since for these the \"all diagrams commute\" formulation fails if interpreted naively.</p>",
        "id": 223927921,
        "sender_full_name": "John Baez",
        "timestamp": 1611594232
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223927667\">said</a>:</p>\n<blockquote>\n<p>It's not totally unreasonable to want different names for these closely related but subtly different things. There's a tension between \"equivalent things should have the same name\" and \"equivalent but not identical things should have different names\"</p>\n</blockquote>\n<p>That's also true, and such a paper would be well-placed to give proper names to each of approaches.</p>",
        "id": 223928284,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611594340
    },
    {
        "content": "<blockquote>\n<p>(Nathanael mentioned 7 but I just see 6.)</p>\n</blockquote>\n<p>Just a typo!</p>",
        "id": 223928418,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611594374
    },
    {
        "content": "<p>Whew, I thought this was another case of not agreeing whether two theorems are the same.</p>",
        "id": 223928557,
        "sender_full_name": "John Baez",
        "timestamp": 1611594422
    },
    {
        "content": "<p>I think the word 'coherence' is like 'space' or 'structure'. It doesn't really need a single rigid definition so long as all the different uses somehow cohere (sorry for the pun).</p>",
        "id": 223928608,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611594442
    },
    {
        "content": "<p>I think Gould's <a href=\"https://arxiv.org/abs/1002.0879\">Coherence for Categorified Operadic Theories</a> could be a good starting point.</p>",
        "id": 223928610,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611594443
    },
    {
        "content": "<p>(This generalises the \"Every monoidal category is monoidally equivalent to a strict monoidal category.\" version of coherence.)</p>",
        "id": 223928879,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611594553
    },
    {
        "content": "<p>I read Gould and for a second I thought it was the other thread on Bach.</p>",
        "id": 223931291,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611595549
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223915177\">said</a>:</p>\n<blockquote>\n<p>(Sorry, I wrote then deleted a few messages because I think I misunderstood what you meant by “decide equality” the first time -- I interpreted it in the sense of a computational decision procedure, but now I think you meant “define equality”, i.e. give a complete presentation of a theory of equality)</p>\n</blockquote>\n<p>No, I actually meant what I said. To solve a coherence problem means to give a method for deciding when two morphisms in the free structure are equivalent.</p>",
        "id": 223965257,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611611262
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223965257\">said</a>:</p>\n<blockquote>\n<p>No, I actually meant what I said. To solve a coherence problem means to give a method for deciding when two morphisms in the free structure are equivalent.</p>\n</blockquote>\n<p>So is Joyal-Street's theorem about string diagrams a coherence theorem in your opinion? It presents free strict monoidal categories in terms of  equivalence classes modulo isotopy of real manifolds, which seems quite undecidable.</p>",
        "id": 223966409,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611611825
    },
    {
        "content": "<p>In general these coherence theorems for graphical languages that are being debated do not strike me as results that give algorithmic decision procedures.</p>",
        "id": 223966728,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611611972
    },
    {
        "content": "<p>I'm starting to think that maybe your definition of coherence is even <em>more</em> restrictive than mine?</p>\n<p>I think the positions are:</p>\n<ul>\n<li>Mike: to solve a coherence problem is to give a presentation of the free model of a theory.</li>\n<li>Me: to solve a coherence problem is to characterise what morphisms are equal in a syntactic model of a theory (wrt a presentation).</li>\n<li>Todd: to solve a coherence problem is to give a decision procedure for equality of morphisms in a syntactic model of a theory (wrt a presentation).</li>\n</ul>\n<p>Do you accept this characterisation?</p>\n<p>If so, than a solution of the coherence problem in your sense is stronger than a solution in my sense and definitely much stronger than in Mike's sense...</p>",
        "id": 223971533,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611613469
    },
    {
        "content": "<p>Right, it would not be a coherence theorem in the sense I indicated. String diagrams give a way of presenting free categorical structures in particularly useful geometric form. </p>\n<p>What I said in my previous post is not exactly what Mike said, but then again, in my previous post, instead of trying to say what a coherence theorem is, I shifted over to say how I understand what it means to <em>solve</em> a coherence <em>problem</em>. I'm willing to agree there could be a useful distinction.</p>",
        "id": 223971716,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611613573
    },
    {
        "content": "<p>(I haven't read through the entire thread, so I'm not immediately sure what your position means.)</p>",
        "id": 223972002,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611613744
    },
    {
        "content": "<p>Uhm, I suppose for me coherence is “these diagrams commute” without necessarily being translated into a decision procedure. For example I would be happy with a coherence theorem that assigns to morphisms <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span> elements <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>m</mi><mo stretchy=\"false\">(</mo><mi>f</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">m(f)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">m</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mclose\">)</span></span></span></span> of a monoid whose word problem is undecidable, and says that “<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>=</mo><mi>g</mi></mrow><annotation encoding=\"application/x-tex\">f = g</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span></span></span></span> if and only if <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>m</mi><mo stretchy=\"false\">(</mo><mi>f</mi><mo stretchy=\"false\">)</mo><mo>=</mo><mi>m</mi><mo stretchy=\"false\">(</mo><mi>g</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">m(f) = m(g)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">m</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">m</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span><span class=\"mclose\">)</span></span></span></span>”.</p>",
        "id": 223972840,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611614234
    },
    {
        "content": "<p>But that is a minor distinction.</p>",
        "id": 223972880,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611614262
    },
    {
        "content": "<p>So where \"I agree with Mike\" was where he said \"that ship has sailed\" (coherence no longer means all diagrams commute) and where he said (Jan. 20) \"A more generalizable way to state MacLane's result is that it gives a method for determining whether a particular diagram shape in the language of monoidal categories commutes in general.\" I was giving a strong sense to \"determining\". A really strong desideratum for solving a coherence problem would be in the form of a strongly normalizing confluent rewrite system on syntactic expressions so that the normal forms are in bijection with the morphisms in the free structures.</p>",
        "id": 223973858,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611614827
    },
    {
        "content": "<p>Great, I also agree with Mike (and you) on both of those <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> In fact I had already agreed on Jan 20! <br>\nThen I had disagreed when he added “String diagrams can also be interpreted as doing both those things” because I don't think string diagrams say anything about associators or unitors, which are also part of the language of monoidal categories.</p>",
        "id": 223974436,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611615173
    },
    {
        "content": "<p>Of course, there are also lots of distinctions that could be made. For example, Kelly and Mac Lane in their paper Coherence in Closed Categories give what I would call a partial coherence theorem, in which it's possible to decide equality of morphisms between objects belonging to a restricted class (roughly, objects which don't \"essentially\" involve the monoidal unit -- I can be more precise if need be).</p>",
        "id": 223974502,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611615228
    },
    {
        "content": "<p>Or rather, that's poorly worded. They don't say anything <em>by themselves</em> in addition to Mac Lane's coherence theorem. As in, you can give a statement of coherence which is of the form “these morphisms are equal if their interpretation in string diagrams is equal modulo ambient isotopy”. But really that's Mac Lane (equal if equal in the free strict model) + Joyal-Street (equal in the free strict model if equal as string diagrams).</p>",
        "id": 223974649,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611615319
    },
    {
        "content": "<p>I'm not so fussed about the associators and units, because already in Geometry of Tensor Calculus, they re-present the classical Mac Lane coherence theory (in terms of ana-objects or \"cliques\") as a preamble to their string diagram calculus, which refers to symmetric strict monoidal categories, etc. (written while you were writing your last comment; I'm a slow typist).</p>",
        "id": 223974710,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611615362
    },
    {
        "content": "<p>And really that was the whole beginning of this “debate”... whether it makes sense to call <em>both</em> of these two sides “coherence theorems”, or are they one coherence theorem + one soundness&amp;completeness theorem.</p>",
        "id": 223974868,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611615472
    },
    {
        "content": "<p>Yeah, I don't know, I've probably been \"guilty\" in the past of referring to the Joyal-Street theorem as a \"coherence theorem\", while forgetting the sense of coherence theorem that I learned from reading the classical 70's stuff, e.g., in Lecture Notes in Math. 420.</p>",
        "id": 223974995,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611615525
    },
    {
        "content": "<p>You may know of even earlier work by Lambek and his school (e.g., Szabo) which presented morphisms in free structures as equivalence classes of sequent deductions. That's a different style of syntactic presentation (but a breakthrough, in that techniques of cut elimination were imported).</p>",
        "id": 223975286,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611615681
    },
    {
        "content": "<p>I've seen it mentioned (maybe in your article on linearly distributive cats?) but so far I've found it too scary to read directly...</p>",
        "id": 223975483,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611615800
    },
    {
        "content": "<p>So what happens there is that while a free monoidal closed category on a set, say, is presented by saying that a morphism \"is\" a suitable equivalence class of sequent deductions, the beauty is that by passing to cut-free deductions, all these equivalence classes are <em>finite sets</em> -- and thus equality can be <em>decided</em> by checking whether any old cut-free sequent presentation of morphism <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span> lies in the same finite class as one for another morphism <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>g</mi></mrow><annotation encoding=\"application/x-tex\">g</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span></span></span></span>. That in principle does give a solution to the coherence problem in my sense, since one just enumerates the finitely many possibilities.</p>",
        "id": 223975848,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611615983
    },
    {
        "content": "<p>(It's not a super-elegant solution, necessarily, but it is a solution. The real challenge is to turn it into something humanly elegant.)</p>",
        "id": 223976148,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611616194
    },
    {
        "content": "<p>Now it may be possible to give an actual decision procedure for things like the free symmetric monoidal category generated by a tensor scheme. To be honest, I've been out of the game for quite some time, so I don't know what literature might be out there on this sort of thing. It's sort of in a different direction to the spirit of Joyal-Street.</p>",
        "id": 223976317,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611616321
    },
    {
        "content": "<p>I see. I guess that can reach free non-algebraic structures, like things where there are free witnesses of existential statements? That seems outside the scope of the usual coherence theorems.</p>",
        "id": 223976529,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611616502
    },
    {
        "content": "<p>Well, perhaps, but I think \"usual coherence theorems\" are usually understood as referring to structures which are 2-monadic over <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext mathvariant=\"sans-serif\">Cat</mtext></mrow><annotation encoding=\"application/x-tex\">\\textsf{Cat}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord text\"><span class=\"mord textsf\">Cat</span></span></span></span></span>, or sometimes over the 2-category of categories, functors, and natural isomorphisms. Kelly tried to pin this down further in terms of clubs, where one can in a sense reduce coherence problems to the study of the free structure generated by a single object.</p>",
        "id": 223976928,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611616788
    },
    {
        "content": "<p>(Sorry for asking a really vague question! This is rapidly reaching the limits of what I'm confident about...)</p>",
        "id": 223976932,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611616793
    },
    {
        "content": "<p>I don't have a strong intuition about what is 2-monadic over Cat, except that it should include all equational theories in the formal language of  2-categories, which I guess is what my intuition of “usual coherence theorems” applies to (e.g. pseudomonoids in Cat)...</p>",
        "id": 223977336,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611617068
    },
    {
        "content": "<p>But for example I remember thinking briefly about what “free closed non-monoidal categories” look like, and that they seem something quite different from these other free algebras.</p>",
        "id": 223977496,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611617163
    },
    {
        "content": "<p>If there even is such a thing, properly speaking...</p>",
        "id": 223977600,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611617247
    },
    {
        "content": "<p>There isn't a free closed category over Cat, but there is one over categories, functors, and natural isomorphisms.</p>",
        "id": 223977785,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611617370
    },
    {
        "content": "<p>(I'll be off to sleep now, but thank you for the conversation!)</p>",
        "id": 223977802,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611617380
    },
    {
        "content": "<p>Right. These can absolutely be accommodated (Nathanael beat me to it).</p>",
        "id": 223977818,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611617393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223966409\">said</a>:</p>\n<blockquote>\n<p>So is Joyal-Street's theorem about string diagrams a coherence theorem in your opinion?</p>\n</blockquote>\n<p>Todd has already answered, but I feel like answering too: I love that theorem, but I've never thought of it as a \"coherence theorem\", and I never even noticed that anybody called it a \"coherence theorem\".</p>",
        "id": 223989817,
        "sender_full_name": "John Baez",
        "timestamp": 1611627212
    },
    {
        "content": "<p>Speaking of \"coherence\": John Baez and Mike Stay seem to be using a version of string diagrams for closed monoidal categories (and then compact closed) in their <a href=\"https://arxiv.org/abs/0903.0340\">Rosetta Stone</a>, section 2.6. Can anyone tell me if we can use those diagrams for proving results? Also, are those string diagrams used elsewhere? Who was first?<br>\nI'm particularly interested in the non-compact case.   </p>\n<p>(If this is off-topic, we can move this question to a separate thread.)</p>",
        "id": 224012503,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1611652097
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223989817\">said</a>:</p>\n<blockquote>\n<p>I never even noticed that anybody called it a \"coherence theorem\".</p>\n</blockquote>\n<p>Unless I'm badly misremembering, Selinger's <em>survey of graphical languages</em> calls it exactly that, systematically all the way through. And almost everyone learns via that paper....</p>",
        "id": 224021307,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1611657551
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/224021307\">said</a>:</p>\n<blockquote>\n<p>Unless I'm badly misremembering, Selinger's <em>survey of graphical languages</em> calls it exactly that, systematically all the way through. And almost everyone learns via that paper....</p>\n</blockquote>\n<p>You're not misremembering, it's what prompted the discussion in the first place :)</p>",
        "id": 224027276,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611661352
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/224012503\">said</a>:</p>\n<blockquote>\n<p>Speaking of \"coherence\": John Baez and Mike Stay seem to be using a version of string diagrams for closed monoidal categories (and then compact closed) in their <a href=\"https://arxiv.org/abs/0903.0340\">Rosetta Stone</a>, section 2.6. Can anyone tell me if we can use those diagrams for proving results? Also, are those string diagrams used elsewhere? Who was first?<br>\nI'm particularly interested in the non-compact case.   </p>\n<p>(If this is off-topic, we can move this question to a separate thread.)</p>\n</blockquote>\n<p>John/Mike should probably answer themselves, but the answer to the first question is: of course!  More recently, Mike Shulman has been developing such string-diagrammatic aspects further; see <a href=\"https://johncarlosbaez.wordpress.com/2020/04/21/star-autonomous-envelopes/\">here</a> for a start. </p>\n<p>Some of the basic ideas of string diagrams had precursors going far back in time, to the extranaturality graphs of Kelly and Eilenberg (late 60s), and these graphs were the basis of the really early coherence theorems for monoidal closed, monoidal biclosed, and symmetric monoidal closed categories. Kelly and Mac Lane write a paper, Coherence in Closed Categories (JPAA, 1971 or 1972 I think), which interprets morphisms in free closed categories as such graphs. Lambek's groundbreaking early work on the connection between coherence problems and proof theory interpreted these graphs in terms of a notion of \"generality of proof\". There was also a lot of work on this sort of thing in the Australian school in the early 1970s. </p>\n<p>Later these graphs were reincarnated in linear logic, in the form of proof nets.</p>",
        "id": 224028983,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1611662579
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/224028983\">said</a>:</p>\n<blockquote>\n<p>John/Mike should probably answer themselves, but the answer to the first question is: of course!  More recently, Mike Shulman has been developing such string-diagrammatic aspects further; see <a href=\"https://johncarlosbaez.wordpress.com/2020/04/21/star-autonomous-envelopes/\">here</a> for a start. </p>\n</blockquote>\n<p>Oh wow, how could I miss that talk? Thank you SO much! This seems to be exactly what I'm looking for.</p>",
        "id": 224031750,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1611664330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/224012503\">said</a>:</p>\n<blockquote>\n<p>Speaking of \"coherence\": John Baez and Mike Stay seem to be using a version of string diagrams for closed monoidal categories (and then compact closed) in their <a href=\"https://arxiv.org/abs/0903.0340\">Rosetta Stone</a>, section 2.6. Can anyone tell me if we can use those diagrams for proving results? Also, are those string diagrams used elsewhere? Who was first?</p>\n</blockquote>\n<p>I made them up for a course I taught on <a href=\"https://math.ucr.edu/home/baez/qg-fall2006/index.html#computation\">classical and quantum computation</a> - see the notes for week 4 and subsequent weeks.</p>\n<p>We didn't turn them into a systematic tool for proving things.  To do that, one would need to think about the rules for nested bubbles.  I don't guarantee that it's possible!</p>\n<p>As you probably know, Mike Shulman has introduced his own string diagrams for closed monoidal categories, which have more of a theoretical footing.  It would be interesting to see if they're fun to use in practice.</p>",
        "id": 224055338,
        "sender_full_name": "John Baez",
        "timestamp": 1611675054
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Coherence.20for.20graphical.20languages/near/223971533\">said</a>:</p>\n<blockquote>\n<p>I think the positions are:</p>\n<ul>\n<li>Mike: to solve a coherence problem is to give a presentation of the free model of a theory.</li>\n<li>Me: to solve a coherence problem is to characterise what morphisms are equal in a syntactic model of a theory (wrt a presentation).</li>\n<li>Todd: to solve a coherence problem is to give a decision procedure for equality of morphisms in a syntactic model of a theory (wrt a presentation).</li>\n</ul>\n</blockquote>\n<p>I certainly wouldn't insist that a solution of a coherence problem entail an algorithmic decision procedure, although in practice they often do, and those that do are certainly more useful.  But I think there's room for coherence in a <em>mathematical</em> sense that isn't necessarily <em>computational</em>.  It's true that without a condition like decidability, there's room for debate in how \"explicit/concrete\" a \"characterization\" is, and I would certainly agree that coherence is a continuum rather than a binary choice.</p>\n<p>But while I hate to burst a bubble, so to speak, I don't think I agree with your characterization of my position.  It's true that to me a free model is the image of a left adjoint to a forgetful functor, but a syntactic model of a presented theory (quotiented by the relations of the theory presentation) is always, almost tautologically, such an object.  Thus, to characterize equality of morphisms in a syntactic model is precisely to give an explicit description of a free object.  I presume that by \"characterize\" you mean a characterization that is more explicit/concrete than the tautological description as a syntactic model, and I would also make that requirement: the syntactic model of a presented theory is certainly a presentation of the initial model, but I generally wouldn't regard it as solving a coherence problem.</p>",
        "id": 224057155,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611675761
    },
    {
        "content": "<p>I agree with everything. I meant the three positions to be in increasing order of strength: everything that Todd would consider a solution to a coherence problem is also a solution for me, and everything that I would consider a solution is a solution for you too. Which is consistent with what sparked the discussion (that some of us would not include Joyal-Street in the continuum of coherence, but you would). In any case, I understand your opinion much better now and I can see that the distinction is much more subtle than I thought at the beginning.</p>",
        "id": 224064646,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611678501
    },
    {
        "content": "<p>As in, we agree on the basic ingredients to “the solution of a coherence problem” and there are only slightly different opinions on how 'computational' the content should be. I think there are two main aspects, correct me if I'm wrong:</p>\n<ul>\n<li>does the presentation need to be finite or recursive?</li>\n<li>does there need to be a decision procedure for equality in the presented model?</li>\n</ul>\n<p>Of course if we can say “yes” to both it is the best scenario. But I am willing to call something a solution even if it's “no” on the second, and you are willing to call something a solution even if it's “no” on both (e.g. in the Joyal-Street case where equality is presented by “all ambient isotopies of diagrams”).</p>",
        "id": 224066039,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611679070
    },
    {
        "content": "<p>Oh, is that the only difference?  You only object to considering string diagrams a coherence theorem because ambient isotopy isn't finite/recursive?</p>",
        "id": 224073792,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611682317
    },
    {
        "content": "<p>Yeah, that actually seems like a silly distinction to make. I think you are convincing me, sorry, just bear with me for a little longer. :)</p>",
        "id": 224090328,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611689470
    },
    {
        "content": "<p>I'd like to propose some definitions that I think can work as a common ground.</p>\n<ul>\n<li>Coherence is with reference to some <em>fixed</em> \"free model\" functor <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span> (possibly for a \"stricter\" theory).</li>\n<li>A presentation of a theory determines some other functor. Let's call it <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span>. Then <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> <em>is coherent</em> (or <em>has the coherence property</em>) <em>with respect to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span></em> if we have a natural transformation <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi><mo>→</mo><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">P \\to F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span> (or maybe just some indexed family of comparison maps?) whose components are all “acyclic fibrations” in some sense.</li>\n<li>A <em>coherence theorem</em> for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> is the theorem that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> is coherent with respect to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span>. When the components are all isomorphisms that is the same as a soundness and completeness theorem!</li>\n<li>The <em>coherence problem</em> for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span> is the problem of finding <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> which is coherent with respect to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span>.</li>\n</ul>\n<p>Mac Lane: <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span> is “syntactic strict monoidal category”, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> is “syntactic monoidal category”, and the quotient maps <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi><mi>x</mi><mo>→</mo><mi>F</mi><mi>x</mi></mrow><annotation encoding=\"application/x-tex\">Px \\to Fx</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\">x</span></span></span></span> are <em>not</em> isomorphisms but are monoidal equivalences.<br>\nJoyal-Street: same <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span>, but <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> is now “string diagrams modulo ambient isotopy”, and the comparison maps are isomorphisms (so we are in the case where coherence = soundess and completeness).<br>\nDoes this make sense?</p>",
        "id": 224092731,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611690573
    },
    {
        "content": "<p>So maybe my issue was, after all, just that the “coherence theorem” in the case of Joyal-Street is of the kind where proving a coherence theorem = proving a soundness and completeness theorem.</p>",
        "id": 224092998,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611690700
    },
    {
        "content": "<p>So now I think that you have “the coherence problem for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span>” and “the coherence property of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> with respect to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span>” -- that is, the subjects of the 'problem' and the 'property' are different subjects... which I think may be the source of some of the confusion!</p>",
        "id": 224096949,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611692365
    },
    {
        "content": "<p>I suppose.  I'm wary of trying to give any too-formal definition of an informal term like \"coherence\".</p>",
        "id": 224109183,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611697926
    },
    {
        "content": "<p>Sure! Not trying to “fix” a formal definition, just trying to see if our informal understanding is in the ballpark of those definitions.</p>",
        "id": 224114560,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611700369
    },
    {
        "content": "<p>Thank you for your time, it was useful for me to clarify my thoughts. I hope it wasn't a complete waste of time for you.</p>",
        "id": 224114636,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1611700408
    },
    {
        "content": "<p>No worries, you made me think some too, which is always a good thing.</p>",
        "id": 224116304,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611701369
    }
]