[
    {
        "content": "<p>Everywhere I have looked, a diagram is said to be commutative if any two paths with the same source and target compose to the same arrow. Then, when it's time to define equalizers and coequalizers, we cannot draw the whole diagram with the (co)fork and the universal arrow and say it is commutative because the parallel arrows are not the same.</p>\n<p>For this reason, I thought that it could be useful to define commutative by: any two paths <strong>of length bigger than 1</strong> with the same source and target compose to the same arrow. I am not aware of any example where commutativity is used to equate two parallel morphisms, so I believe this definition would work just as well and let us draw commutative diagrams for the (co)equalizers.</p>\n<p>Do you see an objection to my statement? Do you like this alternative definition?</p>",
        "id": 211113527,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1600943873
    },
    {
        "content": "<p>I do like it; I used a similar definition in an informal explanation I gave recently. However, in some sense it's unnecessary. Since all morphisms in a diagram are labelled, having two parallel morphisms in an equalizer diagram is just shorthand for the corresponding square with the equalizer arrow duplicated; we just use parallel arrows to build intuition and save space. In Freyd and Scedrov's book <em>Categories, Allegories</em>, they included a \"cross\" mark in their notation to indicate which regions in their diagram were <em>not</em> required to commute, which I found to be an elegant solution (unlike the \"box\" presentation of the theory of categories which appears right at the start of the book!)</p>",
        "id": 211114857,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1600944738
    },
    {
        "content": "<p>I also like the 'cross' notation. It can be generalised to do things like putting in a question mark for a diagram that is not yet known to commute, but will eventually be shown to do so.</p>",
        "id": 211116573,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1600945970
    },
    {
        "content": "<p>it does raise the question of: should diagrams be assumed to be commutative or not if not otherwise stated?</p>",
        "id": 211116742,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1600946103
    },
    {
        "content": "<p>obviously the good answer is just “always be explicit about it”, but i was thinking more “morally”</p>",
        "id": 211116764,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1600946125
    },
    {
        "content": "<p>It's simpler to convert a non-commutative diagram to a commutative one, by splitting paths, than the converse. Drawing shapes inside the diagram only works so well, before it starts to become ambiguous.</p>",
        "id": 211116999,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1600946311
    },
    {
        "content": "<p>Which is to say diagrams ought to be commutative unless specified otherwise.</p>",
        "id": 211117024,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1600946341
    },
    {
        "content": "<p>I dislike drawing parallel arrows for exactly this reason. It's easy enough to duplicate the domain or codomain label so that the arrows are no longer parallel &amp; the path independence definition of commutativity is restored.</p>",
        "id": 211178688,
        "sender_full_name": "Simon Burton",
        "timestamp": 1600975666
    }
]