[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405160\">ww</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/John.20Baez/near/524052593\">said</a>:</p>\n<blockquote>\n<p>We did some work, jesus, it's 10 years ago now, on annotation of rule-based models (by which I mean graph rewriting). The idea there was to have a way (probably a functor) of relating the schema of the rewriting system to a schema in RDF in order to facilitate model composition. If you want to compose models, you need to be able to identify objects at least, and you can do this if you can say that they correspond to some standard thing in Uniprot, GO, etc.</p>\n</blockquote>\n<p>I'm interested in studying models of different systems that can compose and <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  posted this in his Our Work channel. I'm not familiar with \"RDF\" and \"Uniprot, GO, etc.\". </p>\n<p>Where might I find more information, maybe more generically/abstractly, about:</p>\n<ol>\n<li>\"a way (probably a functor) of relating the schema of the rewriting system to a schema in RDF in order to facilitate model composition\"?</li>\n<li>How to compose models, and how \"being able to identify objects\", works?</li>\n</ol>",
        "id": 569070347,
        "sender_full_name": "JR Learnstomath",
        "timestamp": 1768925527
    },
    {
        "content": "<p>I wrote a polemic comparing CT (more specifically, regular logic) against RDF for the purposes of data exchange; it has technical details relating them: <a href=\"https://arxiv.org/abs/2407.19095\">https://arxiv.org/abs/2407.19095</a> .  David Spivak's lifting problem paper is also a good place to look.  Basically, an RDF database is just a giant collection of triples, interpreted as (subject, predicate, object), along with a bunch of questionable design decisions on top.  Nowadays \"triple stores\" seem to be more popular but similar idea</p>",
        "id": 569144418,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1768951101
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"700428\">JR Learnstomath</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/composing.20models/near/569070347\">said</a>:</p>\n<blockquote>\n<p>Where might I find more information, maybe more generically/abstractly, about:</p>\n<ol>\n<li>\"a way (probably a functor) of relating the schema of the rewriting system to a schema in RDF in order to facilitate model composition\"?</li>\n<li>How to compose models, and how \"being able to identify objects\", works?</li>\n</ol>\n</blockquote>\n<p>I know of no source that answers these questions in a simple way: one needs a lot of category-theoretic background.  So I'll recommend that you start by reading David Spivak's <em><a href=\"https://arxiv.org/abs/1302.6946\">Category Theory for Scientists</a></em>.   It won't answer these particular questions, but it will move you closer to being able to understand the answers.</p>",
        "id": 569159305,
        "sender_full_name": "John Baez",
        "timestamp": 1768961429
    },
    {
        "content": "<p>Many thanks to you both! As ever, all I can ever hope for is \"less lost\"...</p>",
        "id": 569210318,
        "sender_full_name": "JR Learnstomath",
        "timestamp": 1768988965
    }
]