[
    {
        "content": "<p>[Beginner Question]:</p>\n<p><strong>Background:</strong> In <em>Category Theory for the Sciences</em>, Spivak defines an aspect as, \"the way of viewing a thing, <em>x</em>; a particular way in which <em>x</em> can be regarded or measured.\" He gives the example that a molecule has a molecular mass so a molecular mass is an aspect of a molecule. Later, he goes on to say that every function has an image. I follow this all and this makes sense to me.</p>\n<p><strong>Problem:</strong> What I get confused on is an exercise he poses where he says:</p>\n<blockquote>\n<p>For each of the following types, write a function for which it is the image, or write “not clearly useful as an image type.”</p>\n</blockquote>\n<p>There are many types he gives but the one I am going to use is <em>a used book</em>. In this case, I took <em>a used book</em> to be an aspect that has the relationship:</p>\n<p>a book -- was owned by --&gt; a person </p>\n<p>Which I would read as \"A book which was owned by a person\" which I think describes the aspect of <em>a used book</em> as an image type of books.</p>\n<p><strong>Question:</strong> Somehow, this doesn't sit right as when I draw out a small olog to describe this process, the paths do not commute leading me think I am wrong in my reasoning somewhere. Could anyone explain to me why <em>a used book</em> is not a valid image type? Thanks! <a href=\"/user_uploads/21317/PZzCYMTBpWAmz1JiVjj5tvOg/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/PZzCYMTBpWAmz1JiVjj5tvOg/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/PZzCYMTBpWAmz1JiVjj5tvOg/image.png\"></a></div>",
        "id": 290716111,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1658719965
    },
    {
        "content": "<p>The \"is\" arrow should go the other way and the upper function doesn't make sense given that not every book is owned by someone?</p>",
        "id": 290723643,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1658730646
    },
    {
        "content": "<p>Agreed. Ownership of a book should be a bidirectional relationship (<a href=\"https://ncatlab.org/nlab/show/span\">[[span]]</a>) <br>\nBook &lt;- Ownership -&gt; Person.</p>",
        "id": 290750522,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1658751015
    },
    {
        "content": "<p>This makes sense - thanks <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> and <span class=\"user-mention\" data-user-id=\"278008\">@Spencer Breiner</span> . Out of curiosity, my intuition when the olog didn't make sense - is this a good way of \"checking\" myself when working through questions such as these? Because, as y'all indicate, I was right in my thinking that I was wrong. Just couldn't pinpoint why with the language I currently knew/understood. Thanks!</p>",
        "id": 290773255,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1658762385
    },
    {
        "content": "<p>I don't understand your question, but it's definitely good to keep in mind that sometimes when you're confused, it's because the book is confused.</p>",
        "id": 290785731,
        "sender_full_name": "John Baez",
        "timestamp": 1658767055
    }
]