[
    {
        "content": "<p>In cases typically arising in practice, a <a href=\"https://ncatlab.org/nlab/show/convenient%20category%20of%20spaces\">[[convenient category of spaces]]</a> is coreflective in the larger category of all topological spaces. A category that is coreflective in a <a href=\"https://ncatlab.org/nlab/show/cototal%20category\">[[cototal category]]</a> (such as the category of topological spaces) is also cototal, so on these grounds a convenient category of spaces is typically going to be cototal. But is it total? I'm guessing probably not, but can someone say for sure?</p>",
        "id": 450518140,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1720632976
    },
    {
        "content": "<p>I presume your question is whether there exists a coreflective category of Top which is not total, rather than whether failing to be total would make the category inconvenient <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 450637483,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1720682788
    },
    {
        "content": "<p>If you believe the nlab, the answer is in fact that every coreflective subcategory of Top (Edit: for which the coreflectors are bijective, which is typically the case for convenient categories of spaces) is total. Every topological concrete category is both total and cototal (according to <a href=\"https://ncatlab.org/nlab/show/total+category\">https://ncatlab.org/nlab/show/total+category</a>) and both reflective and coreflective subcategories of topological concrete categories (Edit: for which the (co)reflectors are bijections) are again topological concrete categories (according to <a href=\"https://ncatlab.org/nlab/show/topological+concrete+category#further_properties\">https://ncatlab.org/nlab/show/topological+concrete+category#further_properties</a>).</p>",
        "id": 450642571,
        "sender_full_name": "Benedikt Peterseim",
        "timestamp": 1720684534
    },
    {
        "content": "<p>Ah, thank you Benedikt!  I knew that topological categories are both total and cototal, but I'd missed that \"further property\". (Probably a lot of this is in The Joy of Cats, so I'll look there next.)</p>",
        "id": 450681750,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1720696759
    }
]