[
    {
        "content": "<p>How can one find or create a small-scope undergraduate-level (or possibly beginning graduate level) math research project, that seeks to give one experience with using mathematical ideas to organize and analyze applications of interest?</p>\n<p>I provide some context and initial thoughts below:</p>\n<p>I would like to (someday!) use math - likely organized by category theory - to think carefully about how and why medical imaging systems yield useful images, how different imaging systems relate to one another, and how the components of a given imaging system work together. My hope is that this sort of analysis could help enable the transfer of design ideas (for transmission and reconstruction) between imaging modalities. In addition, I would hope that having a clearer understanding of what makes an imaging system work could help guide the design of new imaging systems. (I recently finished an MSc in electrical and computer engineering, where I did research on ultrasound and photoacoustic imaging systems - doing that research is what got me interested in medical imaging systems).</p>\n<p>This is a big goal, but I would happy to even make some small progress towards it.</p>\n<p>My current approach for working towards this goal is to gradually work on developing relevant skills. In this spirit, I have learned a lot more math than I used to know by reading textbooks, working exercises, and having interesting discussions here on this zulip. As a result, I feel that my ability to puzzle out the details of what is meant by mathematical writing has improved a lot. That being said, based on the textbooks I find I can read, I suspect that my level of \"mathematical maturity\" is at the undergraduate level, or possibly at the beginning graduate level in some areas. So I have a lot of learning ahead of me, even to get through the basics!</p>\n<p>However, I wonder if my level of mathematical background might now be sufficient to start trying out some short, clearly-scoped, and beginner-friendly research projects. Ideally I'd be looking for a project that involves applying mathematical ideas to organize or analyze some application of interest, but I'd also be interested in finding or creating a project that can give me experience with doing any kind of research that centrally involves mathematics.</p>\n<p>I'm not sure how to go about finding or creating such a project, so I thought I would ask here!</p>\n<p>My first idea for creating such a project would be to try and find a paper on a topic that looks interesting to me, and see if I can understand it. If I can, then I might try reading some related papers. Eventually, at some point in this process, I am guessing a research question would occur to me - probably as a spin-off of something investigated in one of those papers. However, I think it might be difficult to come up with a research question that is simultaneously (1) interesting to me and (2) something I can puzzle out, or make some progress on.</p>\n<p>I think I've also seen some textbooks that include problems intended as small research projects. Perhaps that could be another reasonable place to start?</p>\n<p>Any thoughts are welcome!</p>",
        "id": 391790747,
        "sender_full_name": "David Egolf",
        "timestamp": 1695079303
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/creating.20or.20finding.20beginner.20research.20projects/near/391790747\">said</a>:</p>\n<blockquote>\n<p>How can one find or create a small-scope undergraduate-level (or possibly beginning graduate level) math research project, that seeks to give one experience with using mathematical ideas to organize and analyze applications of interest?</p>\n</blockquote>\n<p>Well I keep a spreadsheet of my work in progress that includes ideas. Here are two that don't require a ton of background but do require the ability to read recent papers and do some research. They are probably both publishable in PAMS or a pretty good CS/adjacent conference that will entertain this sort of thing (I can help identify this given a preprint).</p>\n<p>1) Elaborate on a quantum algorithm for magnitude of finite dissimilarity spaces in the sense of Leinster et al. It is clear that an efficient algorithm exists, and also clear that it could be useful. Stretch goal: sort out the details of a quantum algorithm for magnitude (co)homology.</p>\n<p>2) Prove that the graphs in the family in Figure 5 of <a href=\"https://doi.org/10.1007/s41109-021-00441-z\">https://doi.org/10.1007/s41109-021-00441-z</a> have torsion in path homology. Stretch goal: find a connection to lens spaces.</p>",
        "id": 391806113,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695087297
    },
    {
        "content": "<p>PS- Re 1) once drafted, I can put you in touch with someone who has improved on the state of the art for doing quantum TDA. Not sure if their work on this has been published.</p>",
        "id": 391806404,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1695087469
    },
    {
        "content": "<p>The structure of the project you propose sounds sensible <span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> , but I recommend that you find someone who can act as a supervisor for such a project. At the small scale, the skills required for the mathematical practice of a research project are not so far removed from what you will have acquired in working through exercises, but the open-endedness of a research project results in a much larger decision space in which it's easy to get lost, and your internal map of the research landscape will also necessarily be limited, making it hard to identify which directions are worth pursuing or lead to already-established material.</p>",
        "id": 391842956,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1695106833
    },
    {
        "content": "<p>I agree that finding an advisor (formal or informal) is a great idea.  Everything goes faster and more smoothly with an advisor.... <em>if</em> they're excited about the project you're working on!  This usually requires that you come up with a project <em>with them</em>, and let them have a big role in shaping the project - often the leading role.  You can't just say \"hey, here's what I want to do\" and expect someone to be interested to spend a lot of time on it.</p>\n<p>I think applying category theory to medical imaging systems is a tough project to do, and tough to find a good advisor for, since it requires knowledge of two quite distinct fields, and I don't know <em>anyone</em> who is an expert on both.</p>",
        "id": 391916496,
        "sender_full_name": "John Baez",
        "timestamp": 1695131248
    },
    {
        "content": "<p>So if were you I might start by reviewing papers on medical imaging systems, or imaging systems in general, focusing on the most mathematical papers, and trying to find people who are really good at the math in this subject.</p>",
        "id": 391916897,
        "sender_full_name": "John Baez",
        "timestamp": 1695131361
    },
    {
        "content": "<p>You might bump into some manageable questions, and you might bump into some experts who would be good to talk to.</p>",
        "id": 391916995,
        "sender_full_name": "John Baez",
        "timestamp": 1695131394
    },
    {
        "content": "<p>If I were you I would <em>separately</em> keep learning category theory, and not try to rush into applying it to medical imaging systems.</p>",
        "id": 391917204,
        "sender_full_name": "John Baez",
        "timestamp": 1695131447
    },
    {
        "content": "<p>Then, after a while, you will be an expert on the math of imaging systems, and you'll know enough category theory that you can naturally translate your concerns into the language of category theory.</p>",
        "id": 391917373,
        "sender_full_name": "John Baez",
        "timestamp": 1695131501
    },
    {
        "content": "<p>At that point you'll be ready to try applying category theory to imaging systems.  You may still need some help with category theory, but you'll be a lot closer to having specific problems you need help with, and the ability to express those problems fluently in the language of category theory.</p>",
        "id": 391917718,
        "sender_full_name": "John Baez",
        "timestamp": 1695131590
    },
    {
        "content": "<p>Thanks everyone! Your thoughts are much appreciated, and have given me a lot to think over.</p>",
        "id": 391988093,
        "sender_full_name": "David Egolf",
        "timestamp": 1695154428
    }
]