[
    {
        "content": "<p>I was wondering why it's the <em>pre</em>image of an open set that's open. So I went \"a topology is a nice (A-&gt;Bool)-&gt;Bool, a continuous function is an A-&gt;B such that the obvious triangle has the obvious 2-cell\" and that made sense of it. Is there prior work on such an approach to topology?<br>\n(Is this the right place to ask this?)</p>",
        "id": 251702396,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1630583429
    },
    {
        "content": "<p>I suppose that's one way to think about it. But you could equally well define a continuous map to be a map such that the image of the closure is contained in the closure of the image, for every subset of the domain.</p>",
        "id": 251703885,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1630584261
    },
    {
        "content": "<p>Does that keep working when the above obvious 2-cell is a 2-isomorphism or we replace Bool with some other preorder?</p>",
        "id": 251750518,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1630602801
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/8B5JcCt5SYLqJYxjqkQuthx7/image.png\">image.png</a> okay yep that's how you do topology, i concede :)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/8B5JcCt5SYLqJYxjqkQuthx7/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/8B5JcCt5SYLqJYxjqkQuthx7/image.png\"></a></div>",
        "id": 251751440,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1630603116
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"419857\">Gurkenglas</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/CT.20Topology/near/251702396\">said</a>:</p>\n<blockquote>\n<p>I was wondering why it's the <em>pre</em>image of an open set that's open. </p>\n</blockquote>\n<p>One simple point is that given a map between sets, <em>pre</em>image preserves intersection, union and complement, while <em>image</em> preserves only union.  So preimage is just much better to work with!</p>",
        "id": 251756087,
        "sender_full_name": "John Baez",
        "timestamp": 1630604863
    },
    {
        "content": "<p>It's funny, I see the motivations here backwards from this. The definition of continuous map between Euclidean spaces is clearly what it has to be. Generalizing to metric spaces is not hard. Then if you want to define the notion of general topology, you should look at what continuous maps are like and ask yourself what structure they preserve.</p>",
        "id": 251757050,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1630605220
    },
    {
        "content": "<p>That's very reasonable.  But then you have to wonder why maps between topological spaces have their <em>pre</em>image preserving open sets, maps between measurable spaces have their <em>pre</em>image preserving measurable sets, and so on - why is the preimage better than the image?   </p>\n<p>And one answer is that in every case we want to do arguments involving intersections, unions and complements, and how they transform under maps.    These operations are all preserved by preimage, but not by image.   </p>\n<p>In category theory we generalize this insight in many ways....</p>\n<p>But one basic idea is that subsets of various kinds (open, measurable, etc.) form \"algebras\" of various kinds (boolean algebras, Heyting algebras, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>σ</mi></mrow><annotation encoding=\"application/x-tex\">\\sigma</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">σ</span></span></span></span>-algebras, etc.) under operations like intersection, union and complement.    And maps between these algebras go in the opposite direction from the maps between spaces.   So we get a bunch of dualities between \"geometry\" and \"algebra\".</p>",
        "id": 251758577,
        "sender_full_name": "John Baez",
        "timestamp": 1630605735
    },
    {
        "content": "<p>To me it likewise has to do with geometry-algebra duality. Notions of space are understood by probing _into_ something that classifies some algebraic data (opens, sheaves, sheaves of modules, etc.); therefore the right notion of morphism will always act on that data by <em>pre</em>composition.</p>",
        "id": 251759146,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1630605939
    },
    {
        "content": "<p>Well my point was that preimage is already present in the most basic notion of continuous. <br>\nI think the duality of algebra and geometry should be inferred from these sorts of things, not the other way around.</p>",
        "id": 251760091,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1630606280
    },
    {
        "content": "<p>I guess I prefer to think about space synthetically, but you are right that there is a <em>reason</em> things turned out to arrange themselves in the way they do.</p>",
        "id": 251760337,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1630606361
    }
]