[
    {
        "content": "<p>Many constructions in homological algebra are special cases of a very general 'bar construction'. For example, Hochschild homology of associative algebras, the standard resolution for computing group cohomology, etc. One can express these constructions using monoids in the category, or sometimes monads. </p>\n<p>There are some other constructions which look vaguely 'simplicial' and can be given, not exactly by a bar construction, but by some minor variation on the theme. Instead of considering simplicial Abelian groups one considers symmetric simplicial Abelian groups, semi-simplicial Abelian groups, and more generally presheaves of Abelian groups over some cousin of the simplex category. I have discovered a nice characterization of the Koszul complex of a module equipped with a number of pairwise commuting endomorphisms in this way. (I can share this if someone asks.)</p>\n<p>I would like to know if there is any abstract characterization of the de Rham complex of sheaves of differential forms on a smooth manifold in this way, or its close relative the Chevalley-Eilenberg complex <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>V</mi><mo stretchy=\"false\">(</mo><mi>g</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">V(g)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">V</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span><span class=\"mclose\">)</span></span></span></span> of a Lie algebra, a categorical or abstract construction. I was hoping that the result I found for the Koszul complex would generalize, as the Koszul complex is a kind of special case of the Chevalley-Eilenberg complex over an Abelian Lie algebra, but I am stumped.</p>\n<p>I did find this <a href=\"https://mathoverflow.net/questions/12029/algebraic-categorical-motivation-for-the-chevalley-eilenberg-complex\">https://mathoverflow.net/questions/12029/algebraic-categorical-motivation-for-the-chevalley-eilenberg-complex</a><br>\nI do not know enough about operads to make sense of the first answer. The last answer makes sense to me but I don't know what he means by the filtration associated to the coalgebra, so I don't know how to build the spectral sequence he's discussing. If anyone would be willing to discuss these answers with me, I would appreciate it.</p>\n<p>There is a paper on 'A simplicial foundation for differential and sector forms' by Cruttwell and Lucyshyn which presents a symmetric cosimplicial object of forms. However their paper uses a different notion of differential form than is standard which generalizes to their setting of tangent categories. At the end they prove their complex of differential forms agrees with the usual one but I cannot understand the proof of this, they embed it in a topos for doing synthetic differential geometry and prove the result there. I don't have enough background in SDG to make sense of this.</p>",
        "id": 255775212,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1633107543
    },
    {
        "content": "<p>Here is one such abstract characterization: the de Rham complex of a smooth manifold M is the free differential graded C^∞-ring on C^∞(M).</p>",
        "id": 256756381,
        "sender_full_name": "Dmitri Pavlov",
        "timestamp": 1633706576
    }
]