[
    {
        "content": "<p>The category of preorders has a Cartesian product, so it is a monoidal category and we can talk about the category of preorder-enriched categories. Call this PreOrdCat.</p>\n<p>The category of preorders is enriched over itself. Therefore for any PreOrdCat C we can talk about C shaped diagrams of preorders.</p>\n<p>PreOrdCat includes such categories as the walking closure operator (whose underlying 1 cat is free on one element) and the walking Galois correspondence (whose underlying 1 cat is free on two 1 cells in opposite directions)</p>\n<p>There is a forgetful functor from Cat to PreOrd by 0-truncation of homs. This induces a forgetful functor from 2Cat to PreOrdCat which we can call 1-truncation. The 1-truncation of the walking adjunction is the walking Galois correspondence. The 1-truncation of the walking monad is the walking closure operator.</p>\n<p>Question:<br>\nCan the walking adjunction be defined in any way using the walking Galois correspondence or a particular presentation of it? Similarly can the walking monad be defined using the walking closure operator? What distinguishes the walking adjunction among 2-categories whose 1-truncation is the walking Galois correspondence?</p>",
        "id": 493596032,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1736864484
    },
    {
        "content": "<p>Using the adjoint to the forgetful functor, you can compare the respective pairs of things in 2Cat. The walking adjunction admits a 2-functor to the walking Galois connection. There are a lot of things that live over the walking Galois connection, including many which factorize that 2-functor, so to have any chance of characterising it, you need to either place restrictions on the domain, on properties of the functor, or both.</p>",
        "id": 494142917,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1737033143
    },
    {
        "content": "<p>I agree. That's a good point. I think part of the reason I'm asking is I'm wondering if there's anything special about the theory of adjunctions specifically among theories that generalize Galois connections to the 2 categorical setting, or special about monads specifically among generalizations of closure operators.</p>\n<p>I think we have a pretty good theory of how to vertically categorify algebraic structures: monoids -&gt; monoidal categories and so on. The paper \"Laplaza sets\" by Fiore and others gives a good treatment of this for many cases, for example. </p>\n<p>I am not familiar with any theory of how to vertically categorify relational structures. Perhaps this is a red herring or the wrong question. I don't insist that there is a good answer. But, often people do refer to adjunctions as categorified Galois connections or monads as categorified closure operators.</p>",
        "id": 494148904,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1737034832
    },
    {
        "content": "<p>As I suggested earlier one could also say not just PreOrdCat but a presentation of a PreOrdCat by a graph G and some 2-cells adjoined to the free category on G, for example.</p>",
        "id": 494149644,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1737035045
    },
    {
        "content": "<p>And then the question is whether there are relations between 2 cells which can be derived from the generators.</p>",
        "id": 494150027,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1737035162
    },
    {
        "content": "<p>For example the walking adjunction is freely generated by two 1 cells F and G and some 2 cells eta and epsilon subject to the relation that the generators F and G have no nontrivial endomorphisms. Similarly the walking monad has the character that it is generated by a 1 cell T and 2 cells eta, mu subject to the constraint that T has no nontrivial endomorphisms. So perhaps it is sensitive to the choice of generators.</p>",
        "id": 494150714,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1737035351
    },
    {
        "content": "<p>This works for the examples here but it doesn't strike me as a particularly robust theory of categorification</p>",
        "id": 494151138,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1737035466
    }
]