[
    {
        "content": "<p>When we have an inclusion of a full subcategory $I:B\\hookrightarrow C$ which has a left adjoint we call it a reflector and say we have a reflective subcategory. An example is the inclusion of the category of complete metric spaces into metric spaces, where the reflector is given by the completion, another one is the inclusion of compact Hausdorff spaces in topological spaces, where the reflector is the Stone-Cech compactification. These examples build an intuition of a reflective subcategory as one that contains 'nice' objects , which can be built canonically for each object in the ambient category. Moreover such construction is idempotent.   <br>\nNow, the dual notion of coreflective subcategory is that of an inclusion of a full subcategory $I:B\\hookrightarrow C$ which has a right adjoint we call it a coreflector. And honestly, I have not found much more explanation. <br>\nHow can we intuitively deal with this concept?</p>",
        "id": 221543247,
        "sender_full_name": "Francesco Bilotta",
        "timestamp": 1609776844
    },
    {
        "content": "<p>My personal intuition is that a coreflector is a kind of forgetful functor that \"forgets all the parts of objects in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span></span></span></span> that objects in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05017em;\">B</span></span></span></span> cannot access/map to\". </p>\n<p>An example is the various \"n-skeleton\" operations on globular/simplicial/cubical sets or higher categories. The idea is that n-dimensional objects can only map to k-dimensional parts of an object for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>k</mi><mo>≤</mo><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">k \\leq n</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.83041em;vertical-align:-0.13597em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03148em;\">k</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">≤</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>, so any parts that are of dimension higher than n are \"inaccessible from n-dimensional objects\". The coreflector just forgets all those parts.</p>",
        "id": 221545867,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1609777893
    },
    {
        "content": "<p>I'm not sure what sort of answer you're looking for, but there are lots of examples in topology which involve retopologization to make a finer topology. For example, the inclusion of compactly generated spaces into topological spaces: you refine the topology so that a set is open iff its intersection with any compact subset is open in that compact subspace: that may entail throwing in more open sets than you originally had. Another is the inclusion of locally connected spaces into spaces, where you may have to add more open sets to ensure that connected components become open (by considering the smallest topology containing the original topology making this true). </p>\n<p>Another example is the inclusion of Boolean algebras into Heyting algebras. For each Heyting algebra <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>H</mi></mrow><annotation encoding=\"application/x-tex\">H</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.08125em;\">H</span></span></span></span>, the subset of complemented elements gives the coreflection. See the <a href=\"https://ncatlab.org/nlab/show/Heyting+algebra\">nLab article</a>. </p>\n<p>A 2-categorical example is the inclusion of cartesian monoidal categories into symmetric monoidal categories, where the coreflector sends a symmetric monoidal category to the cartesian monoidal category of cocommutative comonoids. </p>\n<p>Just as forming a reflection of an object may involve quotienting elements to force a property to hold, so a coreflection may involve including just those elements where the property happens to be true. The example of Boolean algebras and Heyting algebras is a good illustration of that.</p>",
        "id": 221546978,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1609778389
    },
    {
        "content": "<p>Thanks to both, the examples are indeed helpful!</p>",
        "id": 221618653,
        "sender_full_name": "Francesco Bilotta",
        "timestamp": 1609830792
    },
    {
        "content": "<p>A much more handwavy intuition: left adjoints ~ colimits and right adjoints ~ limits. Indeed reflectors wrap, glue, mix around objects to get new ones (think: sheafification, Stone-Cech), while coreflectors cut, forget, separate objects (think: Todd's examples).<br>\nSo to me coreflectors and reflectors are morally doing same thing but in different ways.</p>",
        "id": 221626214,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1609838407
    },
    {
        "content": "<p>An even more hand wavy and silly intuition: left adjoints are left wing (liberal, free, etc..) while right adjoints are right wing (conservative, restricting, etc..).</p>",
        "id": 221702631,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1609881298
    },
    {
        "content": "<p>So left adjoints tend to add things (eg localisation of a category which adds inverses) while right adjoints tend to remove things (eg core of a category).</p>",
        "id": 221702885,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1609881443
    }
]