[
    {
        "content": "<p>I'd like to understand the relationship between the simply typed lambda calculus and Cartesian closed categories. (I have heard that simply typed lambda calculus is the internal language of a Cartesian closed category, but I don't know what that means.) I know this is part of a much bigger family of concepts involving toposes, fibrations and dependent type theory, but I'm hoping I can start small and work up. So I'm hoping to see the connection between lambda calculus and closed Cartesian categories clearly without going on too much of an excursion through those other topics first. Is there an easy way to see it, or a resource that explains it?</p>\n<p>My background is such that I know my way around Cartesian closed categories pretty well and simply typed lambda calculus reasonably well, but I don't have any clear idea of what an internal language is or how it relates to an <a href=\"https://ncatlab.org/nlab/show/internal%20logic\">[[internal logic]]</a>. I don't have much background in logic, and specifically I don't have any prior knowledge of how lambda calculi and logic are related.</p>",
        "id": 392626191,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1695431639
    },
    {
        "content": "<p>Roy Crole's book <em>Categories for Types</em> explains the relationship between algebraic theories and cartesian categories, and between simply typed lambda calculus and cartesian closed categories, in a lot of detail. IMO, it's a nice place to start if you want to learn some of the main ideas of categorical logic: functorial semantics, internal languages, and classifying categories.</p>",
        "id": 392627279,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1695432221
    },
    {
        "content": "<p>If you want to have the \"full picture\", Part D of the Elephant (vol. 2) covers categorical logic quite thoroughly.  In particular, the first chapter (D1) introduces the concepts of internal language and syntactic category in full detail.  That chapter deals only with first-order theories, the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>λ</mi></mrow><annotation encoding=\"application/x-tex\">\\lambda</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">λ</span></span></span></span>-calculus is covered much later in the book (section D4.2, and you don't really need to read everything in between), but I think that once you know how that works, the higher-order case is an expected generalization, and it's not necessarily easier conceptually.  Probably the Elephant is not the best source to use as a first introduction, but for this particular topic I think it's ok (personally, that's how I first learned categorical logic).</p>",
        "id": 392659622,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1695456596
    },
    {
        "content": "<p>Otherwise, if you want to go straight to your question without going through first-order categorical logic, the standard reference is Lambek and Scott's <em>Introduction to higher order categorical logic</em>.  It's available online (just google something like \"lambek scott categorical logic\"). I never read it but Part I is called \"Cartesian closed categories and the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>λ</mi></mrow><annotation encoding=\"application/x-tex\">\\lambda</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">λ</span></span></span></span>-calculus\".  Sounds promising <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 392659945,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1695456831
    },
    {
        "content": "<p>You might try my course notes on the lambda calculus and closed categories:</p>\n<ul>\n<li>Classical and quantum computation: <a href=\"https://math.ucr.edu/home/baez/qg-fall2006/index.html#computation\">Fall 2006</a> and <a href=\"https://math.ucr.edu/home/baez/qg-winter2007/qg-winter2007.html#computation\">Winter 2007</a>.</li>\n</ul>\n<p>I was learning this material from Lambek and Scott's book, conversations with <span class=\"user-mention\" data-user-id=\"276048\">@Mike Stay</span> and other sources (listed on these web pages).</p>",
        "id": 392668244,
        "sender_full_name": "John Baez",
        "timestamp": 1695461128
    },
    {
        "content": "<p>In these course notes I talk about:</p>\n<ul>\n<li>the lambda calculus and its role in classical computation,</li>\n<li>how quantum computation differs from classical computation,</li>\n<li>the quantum lambda calculus and its role in quantum computation,</li>\n<li>cartesian closed categories and symmetric monoidal closed categories,</li>\n<li>how treating computation as a process makes us \"categorify\" all the above.</li>\n</ul>",
        "id": 392668490,
        "sender_full_name": "John Baez",
        "timestamp": 1695461217
    },
    {
        "content": "<p>We further developed some — but far from all! — of the material in my course notes in this long paper:</p>\n<ul>\n<li>John Baez and Mike Stay, <a href=\"https://arxiv.org/abs/0903.0340\">Physics, topology, logic and computation: a Rosetta Stone</a>.</li>\n</ul>",
        "id": 392668784,
        "sender_full_name": "John Baez",
        "timestamp": 1695461345
    },
    {
        "content": "<p>That sounds great! I was reading some of that paper earlier today, having realised it might be relevant. I'll check out the other resources as well.</p>",
        "id": 392685942,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1695469563
    },
    {
        "content": "<p>My unfinished <a href=\"http://mikeshulman.github.io/catlog/catlog.pdf\">categorical logic notes</a> start from even simpler type theories and their corresponding categories, and build up to STLCs/CCCs and then on to first-order logic.</p>",
        "id": 392707772,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1695481697
    },
    {
        "content": "<p>I assume there's no particular prospect of you finding time to work on those notes further is there, Mike? I like them a lot.</p>",
        "id": 392729341,
        "sender_full_name": "Kevin Arlin",
        "timestamp": 1695494945
    },
    {
        "content": "<p>Not in the near future, unfortunately, but I definitely intend to finish them one day.</p>",
        "id": 392730990,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1695496270
    },
    {
        "content": "<p>I published some papers on \"Categories for Children\", and they practically start with CCCs and the simply-typed λ-calculus... take a look a the introduction of the first link below and at the section 5.5 (\"A way to teach adjuctions\") in the second link:</p>\n<p><a href=\"http://anggtwu.net/LATEX/2017planar-has-1.pdf\">http://anggtwu.net/LATEX/2017planar-has-1.pdf</a><br>\n<a href=\"http://anggtwu.net/LATEX/2022on-the-missing.pdf#page=26\">http://anggtwu.net/LATEX/2022on-the-missing.pdf#page=26</a></p>",
        "id": 392873663,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1695596007
    }
]