[
    {
        "content": "<p>The usual proof to obtain any limit out of products and equalizers relies on the axiom of choice (to choose the products, since we only need existence of the equalizer, we don't need to choose one). Can we prove this without the axiom of choice?</p>",
        "id": 307010565,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667166052
    },
    {
        "content": "<p>This question confuses me. The result you're quoting is the construction of the limit of a given diagram as an equalizer of a pair of arrows between products determined by the diagram (assuming the latter exist). If the choice you're talking about it the choice of a specific representative of the product in order to form the equalizer diagram, how could the construction possibly avoid such a choice? But moreover, how does that depend on the axiom of choice?</p>",
        "id": 307010951,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667166432
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284005\">Ralph Sarkis</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Limits.20from.20products.20and.20equalizsers.20without.20choice/near/307010565\">said</a>:</p>\n<blockquote>\n<p>Can we prove this without the axiom of choice?</p>\n</blockquote>\n<p>I was using \"this\" (rather clumsily) to refer to the statement: If <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">C</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span></span></span></span> has products and equalizers, then it is complete. The usual way to prove this is by giving a construction (the one you described) that uses choice. Is there another way to prove existence of the limits without necessarily constructing them?,  or constructing them without choice?</p>",
        "id": 307012419,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667167744
    },
    {
        "content": "<p>But in a constructive setting, \"having products and equalizers\" means \"having specified products and equalizers\"; there's no choice involved</p>",
        "id": 307014342,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667169212
    },
    {
        "content": "<p>I see. Thanks!</p>",
        "id": 307015091,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667169955
    },
    {
        "content": "<p>I said that rather authoritatively, but it's true that there's some subtlety here: in Set we need choice to assert that we can construct an element of a product, but the \"construction\" of the product itself is choice free. On the other hand, when we construct one category from another, the new category may inherit structure such as products but without inheriting a specified choice, and so asserting that it \"has products\" in the sense of specified products requires some form of choice. I don't have good examples to hand, but Johnstone discusses this at some point in Sketches of an Elephant (if it's of interest I can find the ref tomorrow)</p>",
        "id": 307015957,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667170684
    },
    {
        "content": "<p>It's ok, I was just wondering whether I should point out the choice we make when I teach this proof, but I think this subtlety goes too far.</p>",
        "id": 307017349,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667172048
    },
    {
        "content": "<p>One could consider the anafunctor approach à la Makkai, and have the limit-assigning functor be an anafunctor, and leverage this to construct a limit-assigning anafunctor for an arbitrary diagram shape. No choice needed at all.</p>",
        "id": 307097105,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1667221083
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Limits.20from.20products.20and.20equalizsers.20without.20choice/near/307015957\">said</a>:</p>\n<blockquote>\n<p>when we construct one category from another, the new category may inherit structure such as products but without inheriting a specified choice, and so asserting that it \"has products\" in the sense of specified products requires some form of choice.</p>\n</blockquote>\n<p>This is technically true, but examples of this sort are quite rare.  In the vast majority of cases, when a constructed category inherits limits and colimits from its inputs, it does so in a constructive \"specified\" way.  The only counterexamples I know of are \"homotopy category\" type constructions where one quotients the \"natural\" morphisms by some equivalence relation, and constructing limits or colimits requires a choice of representatives for some equivalence classes of morphisms.  This is even rarer than it might appear, because the average \"homotopy category\" doesn't even <em>have</em> all limits and colimits, even classically (and those that it does have, like products and coproducts, don't have arrows as inputs and hence don't require choice either).  The only naturally-occurring example I'm aware of where a \"homotopy category\" does have limits and colimits is the one in the Elephant, namely \"exact completion\" constructions.  Not that these aren't important, but one shouldn't overstate the magnitude of the issue (and there are also <a href=\"https://arxiv.org/abs/2105.08152\">other ways</a> to think about exact completions).</p>",
        "id": 307141293,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1667231860
    },
    {
        "content": "<p>Furthermore, unless I'm missing something, I think the usual construction of limits from products and equalizers works just fine constructively if we interpret both the products/equalizers <em>and</em> the limits in an unspecified way.  To prove that unspecified limits exist, all you need is that one product and one equalizer exist, not that there is a specified choice of all of them.</p>",
        "id": 307141698,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1667231960
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Limits.20from.20products.20and.20equalizsers.20without.20choice/near/307141293\">said</a>:</p>\n<blockquote>\n<p>Not that these aren't important, but one shouldn't overstate the magnitude of the issue (and there are also <a href=\"https://arxiv.org/abs/2105.08152\">other ways</a> to think about exact completions).</p>\n</blockquote>\n<p>Fair enough. I was vaguely picturing a situation where we construct a category over another in which the fibers are groupoids with no specified section, but didn't have a specific construction in mind.</p>",
        "id": 307152612,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667234900
    }
]