[
    {
        "content": "<p>Are there structural set-theoretic 'halfway houses' that allow one to speak of sets of sets like one can in material set theories or are structural set theories always limited to a family of sets construction?</p>",
        "id": 258666528,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1634882052
    },
    {
        "content": "<p>Well, one could debate about the meaning of \"structural set theory\", but the way I generally use the term, no.  I would say that in a structural set theory the elements of a set are always \"intrinsically featureless\" and only given meaning (to be regarded, for instance, as representatives of some other set) by external structure relating that set to some other set(s).  However, in <a href=\"https://golem.ph.utexas.edu/category/2013/01/from_set_theory_to_type_theory.html\">type theory</a> one can have some of both worlds.</p>",
        "id": 258708596,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1634907973
    },
    {
        "content": "<p>(BTW, I also used to use \"halfway house\" to mean \"point in the middle\", but then I learned that actually it's <a href=\"https://en.wikipedia.org/wiki/Halfway_house\">something else</a>.)</p>",
        "id": 258708660,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1634908015
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/material.2Fstructural.20set.20theory.20quicky/near/258708660\">said</a>:</p>\n<blockquote>\n<p>(BTW, I also used to use \"halfway house\" to mean \"point in the middle\", but then I learned that actually it's <a href=\"https://en.wikipedia.org/wiki/Halfway_house\">something else</a>.)</p>\n</blockquote>\n<p>(Looking at <a href=\"https://en.wiktionary.org/wiki/halfway_house\">meaning 3</a>, it seems to me that \"point in the middle\" is also an established meaning of the phrase)</p>",
        "id": 258740044,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1634921732
    },
    {
        "content": "<p>Y'all are looking too deeply into the metaphor.</p>\n<p>Does MLTT come with its own form of diagrammatic reasoning, just as in ZF we have collections of dots/subcollections or the collections of dots with arrows between dots view of ETCS/SEAR?</p>",
        "id": 258903938,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1635117732
    },
    {
        "content": "<p>I'm not sure that I would call those diagrammatic reasoning.  But whatever they are, one could imagine drawing pictures of types and their elements.  An element of a function type is a function and can be drawn as arrows between dots or however you like, an element of a powertype is a subset and can be drawn with subcollections of dots, etc.</p>",
        "id": 258922567,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1635145252
    },
    {
        "content": "<p>Okay, good. I wrote a program that drew functions sets as literal sets of functions, with the functions drawn as their cographs. It is nice to see it was meaningful.</p>",
        "id": 259059769,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1635232767
    }
]