[
    {
        "content": "<p>I've currently slowly working my way through a couple of different search results on Google Scholar that seem to provide a category theory-informed approach to modelling the relationship between a system and someone's knowledge of it, which would for instance allow us to characterize how well/the way someone knows about a system, or say something like, \"that's right, but that perspective is lacking an essential component from this other alternative perspective on this system\" (e.g., a monad can be seen as a monoid, which makes more obvious its relationship to algebra) . I got started on this citation hunt by encountering the following wikipedia article: <a href=\"https://en.wikipedia.org/wiki/Olog\">https://en.wikipedia.org/wiki/Olog</a> , which made curious about the ways knowledge can be modeled through category theory.</p>\n<p>I was wondering, does anyone have suggested readings on this topic, or does anyone know the main reference about this topic? All suggestions are welcome (especially wrt. the relationship between a system and knowledge about it)</p>",
        "id": 470237677,
        "sender_full_name": "nrs",
        "timestamp": 1726354737
    },
    {
        "content": "<p>MMT has a concept of \"views\" <a href=\"https://kwarc.info/people/frabe/Research/mmt.pdf\">https://kwarc.info/people/frabe/Research/mmt.pdf</a></p>\n<p>Some relevant quotes:</p>\n<blockquote>\n<p><em>Modularity</em>  Modern developments of mathematical knowledge are highly modular. They take pains to identify minimal sets of assumptions so that results are applicable at the most general possible level. This modularity and the mathematical practice of <strong>“framing”, i.e., of viewing objects of interest in terms of already understood structures</strong>, must be supported to even approach human capabilities of managing mathematical knowledge in computer systems.</p>\n</blockquote>\n<p>The emphasis is mine. If S and T are logical theories, a \"view\" from S to T is an interpretation of theory S in theory T. So, an interpretation of a monad as a monoid would be a view morphism from the theory of monoids in a monoidal category to the theory of monads.</p>\n<blockquote>\n<p>Views are closely associated with the intuitions of category theory: Many declarative languages can be naturally formulated as categories with the primary modules as objects and views as morphisms. Views permit framing in the following sense: A view from S to T interprets all declarations of S in terms of T and thus frames T from the perspective of S. Views yield a homomorphic extension that maps expressions over S to expressions over T : All symbols in an S-expression<br>\nare replaced with their T -definition provided by the view. In logic, such views were introduced as relative interpretations in [End72].</p>\n</blockquote>\n<p>So, he suggesting the intuition of a category of theories and interpretation morphisms that allow us to interpret one theory in another.</p>",
        "id": 470240221,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1726357264
    },
    {
        "content": "<p>Many of the people developing that field are in this group, however, perhaps they don’t always have time to share their knowledge, but many others can step in to help you.</p>\n<p>The paper that first introduced ologs I believe is this:</p>\n<p><a href=\"https://arxiv.org/abs/1102.1889\">https://arxiv.org/abs/1102.1889</a></p>\n<p>It seems like since then the idea has spread out in many directions. I’m not sure if there’s currently any single best resource to get an overview of it all. Maybe someone else knows of a review article regarding category theory applied to <a href=\"https://www.sciencedirect.com/topics/social-sciences/knowledge-representation\">knowledge representation</a> and <a href=\"https://www.sciencedirect.com/topics/computer-science/knowledge-engineering\">knowledge engineering</a>.</p>\n<p>In some ways the phrase “the relationship between a system and knowledge about it” reminds me of how in certain categorical settings you will see the difference between a <em>theory</em> of something versus the <em>thing itself</em> made explicit. For example, in <a href=\"https://arxiv.org/abs/1909.04881\">this paper</a>, you have this diagram:</p>\n<p><a href=\"/user_uploads/21317/cmJ9tb1jgIhmQrHDeMQ9M57N/9970AC02-BBE2-4D00-B341-4818ECB54B3F.jpg\">apg.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/cmJ9tb1jgIhmQrHDeMQ9M57N/9970AC02-BBE2-4D00-B341-4818ECB54B3F.jpg\" title=\"apg.jpg\"><img data-original-dimensions=\"735x559\" src=\"/user_uploads/thumbnail/21317/cmJ9tb1jgIhmQrHDeMQ9M57N/9970AC02-BBE2-4D00-B341-4818ECB54B3F.jpg/840x560.webp\"></a></div><p>In which you have elements mapped to their labels and labels mapped to their type annotation; and elements mapped to their values and values mapped to their type. So you have a diagrammatic representation of the difference between the syntax, talking about a thing (the labels), and the semantics, the elements and the values they are taking.</p>\n<p>I recently saw <a href=\"https://youtu.be/ju17bM9p2RU?si=bM1IqEky9y7PINHP\">this</a> video of Spivak and at one point he said “in category theory we make things much more explicit than they do in other mathematical disciplines”.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ju17bM9p2RU\" href=\"https://youtu.be/ju17bM9p2RU?si=bM1IqEky9y7PINHP\"><img src=\"https://uploads.zulipusercontent.net/fa00b87ea796ad66a2e473e38c3990f7d569928d/68747470733a2f2f692e7974696d672e636f6d2f76692f6a753137624d39703252552f64656661756c742e6a7067\"></a></div><p>The <a href=\"https://topos.site/blog/\">Topos Institute</a> seems like one central hub of research and activity regarding categorical modeling, though.</p>\n<p>However, your idea of formalizing how the same thing appears different from different perspectives really interests me as well. I haven’t gotten to that level of understanding yet, but since in category theory the characteristics of things are expressed through external relationships to other things, I’m wondering if there’s some way to characterize how two syntactic structures representing the same semantic object nonetheless have different properties in relation to the context they are defined in.</p>",
        "id": 470244427,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1726361020
    },
    {
        "content": "<p>This might be unrelated to what the poster is asking about but I wanted to throw this out there because I coincidentally was reading through it the other day. It's <a href=\"https://arxiv.org/pdf/2009.03297\">this paper published in 2020</a> where they use the theory of string diagrams in symmetric monoidal categories to formalize the notion of distinguishing between causation and inference, especially when it comes to quantum mechanical systems. The paper uses the term \"causation\" to talk about the actual physical reality of what is going on while they use \"inference\" to talk about people's knowledge of the system. So in a way this paper is talking about a particular situation where we want to tell the difference between a system and the way someone knows about a system, similarly to the question asked above. The paper proposes that these notions might get confused in the quantum scale, and that it's important to not get them confused because it might be possible for something to have changed without us believing it has changed (a causation without an inference) or for our beliefs about something to change even when its physical nature has not (an inference without a causation). However I do want to mention there's zero connections between this idea and ologs, quite unfortunate :(</p>",
        "id": 470245582,
        "sender_full_name": "John Onstead",
        "timestamp": 1726361975
    },
    {
        "content": "<p>You might be interested in categorical systems theory in general, for instance as outlined in David Jaz Myers’ book; any situation in which you have a category of “models” of systems and a “semantics” functor interpreting those models could be seen to be about the relationship between a system and your knowledge of it. The DJM book is pretty advanced for the most part; you can get an earlier orientation to lots of parts of applied category theory with Spivak and Fongs’s <em>Seven Sketches</em>, or you might enjoy the Poly book (Spivak and Niu). But it’s a huge question and almost anything is plausibly relevant, so if you want to share what papers you’re intrigued by so far there might be more specific references available to give too.</p>",
        "id": 470265104,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1726371056
    },
    {
        "content": "<p>Thank you very much for all the resources and the comments! I'll begin working through these, will post here again when I delve a little deeper. Thank you very much again!</p>",
        "id": 470419314,
        "sender_full_name": "nrs",
        "timestamp": 1726453920
    },
    {
        "content": "<p>We talked about this question with <span class=\"user-mention\" data-user-id=\"679887\">@Fabrizio Romano Genovese</span> in the context of security <a href=\"https://dl.acm.org/doi/full/10.1145/3531063\">https://dl.acm.org/doi/full/10.1145/3531063</a></p>",
        "id": 470556465,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1726485166
    }
]