[
    {
        "content": "<p>As someone who is learning about monoidal categories, and who has  read some basic texts about closed cartesian categories and topos theory before, the following question came to my mind:<br>\nThere is a monoidal structure induced on <strong>Set</strong> by the cartesian product. A topos has all finite limits, in particular it has all binary products. Do binary products induce a monoidal structure on an arbitrary topos? If they don't (I somehow suspect that), what is an easy example for a topos without a monoidal structure imposed by binary products?</p>",
        "id": 464669107,
        "sender_full_name": "Sascha Haupt",
        "timestamp": 1724426021
    },
    {
        "content": "<p>Every category with binary products and a terminal object can be equipped with a monoidal structure so you will not find a topos which can't be equipped with such a monoidal structure.</p>",
        "id": 464670643,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1724426443
    },
    {
        "content": "<p>The definition of a monoidal category is self-dual, so this also works with coproducts and initial objects.</p>",
        "id": 464681856,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1724429302
    },
    {
        "content": "<p>And every topos has coproducts and an initial object, so that's a second way you can make any topos into a monoidal category.</p>",
        "id": 464683588,
        "sender_full_name": "John Baez",
        "timestamp": 1724429792
    },
    {
        "content": "<p>If you're interested in monoidal structures on toposes more generally, you might want be interested in <a href=\"https://ncatlab.org/nlab/show/Day%20convolution\">[[Day convolution]]</a>.</p>",
        "id": 464825365,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1724497743
    },
    {
        "content": "<p>That's a great way to get monoidal structures that are neither cartesian nor cocartesian.</p>",
        "id": 464852756,
        "sender_full_name": "John Baez",
        "timestamp": 1724508462
    }
]