[
    {
        "content": "<p>Maybe the problem is that you describe this \"obvious construction\" in a very detailed way that would require quite a bit of work to follow.    Maybe you can compress it down to a sentence or two?   Generalizing it might make it easier to understand its key features.  When I read</p>\n<blockquote>\n<p>The subobject classifier has two vertices T and F, and five edges: four for each way of including or excluding the source and target while excluding the edge, plus one more for including source, target, and edge.</p>\n</blockquote>\n<p>my eyes glaze over, because I don't know the 'big picture'.</p>",
        "id": 489586745,
        "sender_full_name": "John Baez",
        "timestamp": 1734476565
    },
    {
        "content": "<p>Thanks for responding.  Sorry if it wasn't clear; I thought the Set-enriched examples would be helpful for contextualizing the construction.  Here's the short version: </p>\n<p>In the arrow topos of functions and commuting squares, the subobject classifier looks like</p>\n<div class=\"codehilite\"><pre><span></span><code>0 1 2  ΩD domain\n| | |\n| |/   Ωf\n| |\n∨ ∨\n⊥ ⊤    ΩC codomain\n</code></pre></div>\n\n<p>ΩD is a totally ordered set, with 0/\"false\" &lt; 1/\"intermediate\" &lt; 2/\"true\".</p>",
        "id": 489590137,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734478380
    },
    {
        "content": "<p>There's a pretty obvious generalization to a Pos-enriched structure (described above) where the truth values ΩD have an entire open unit interval of intermediate values.  Does the construction have a name?</p>",
        "id": 489590396,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734478524
    },
    {
        "content": "<p>The particular thing you mentioned your eyes glazing over at is this picture you posted on Azimuth:</p>",
        "id": 489590689,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734478686
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/qeuY3LCc9HETU50rCYHVVQtm/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/qeuY3LCc9HETU50rCYHVVQtm/image.png\" title=\"image.png\"><img data-original-dimensions=\"360x173\" src=\"/user_uploads/thumbnail/21317/qeuY3LCc9HETU50rCYHVVQtm/image.png/840x560.webp\"></a></div>",
        "id": 489590699,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734478691
    },
    {
        "content": "<p>When we insist that s ≤ t, the top blue edge gets excluded because T (the green vertex, the source of the top blue edge) is not less than or equal to F (the red vertex, the target of the top blue edge), leaving four totally ordered edges.</p>",
        "id": 489591188,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734478975
    },
    {
        "content": "<p>We could think of them as the truth values {0, 1/3, 2/3, 1}, though there's no real concept of magnitude beyond the total order.</p>",
        "id": 489592490,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734479693
    },
    {
        "content": "<p>Thanks!   I bet some of the topos theorists here could comment.</p>",
        "id": 489592699,
        "sender_full_name": "John Baez",
        "timestamp": 1734479809
    },
    {
        "content": "<p>Exactly what construction are you asking whether it has a name?  The (1,2)-topos of presheaves on this specific small (1,2)-category?  Or its subobject classifier?</p>",
        "id": 489625068,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734501425
    },
    {
        "content": "<p>The (1,2)-topos itself, like \"the unit interval topos\" or \"Fuzz\" or something.  (I presume it has a name; it seems too obvious and simple not to have a common name.)</p>",
        "id": 489626501,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734502231
    },
    {
        "content": "<p>Not a lot of people have studied (1,2)-toposes.</p>",
        "id": 489627023,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734502569
    },
    {
        "content": "<p>Huh. OK, thanks.</p>",
        "id": 489627041,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734502585
    },
    {
        "content": "<p>Irrelevantly:<br>\n<span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/Name.20of.20this.20fuzzy.20logic.20.281.2C2.29-topos.3F/near/489625068\">said</a>:</p>\n<blockquote>\n<p>Exactly what construction are you asking whether it has a name?</p>\n</blockquote>\n<p>This is one of those sentences that I can't figure out how to write it grammatically in English.</p>\n<p>The previous sentence should be \"This is one of those sentences that I can't figure out how to write grammatically in English\" -- the \"it\" is omitted since \"those sentences\" were already mentioned earlier.  But the question version \"Exactly what construction are you asking whether has a name?\" sounds wrong to me, although the version with \"it\" also sounds wrong, and I can't figure out a way to rephrase it that sounds right.</p>",
        "id": 489628785,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734503615
    },
    {
        "content": "<p>Ha, I love it!  Maybe, \"Whether exactly what construction has a name are you asking?\" <br>\n Or, \"About exactly what construction are you asking whether the construction has a name?\"</p>",
        "id": 489641124,
        "sender_full_name": "Mike Stay",
        "timestamp": 1734504890
    },
    {
        "content": "<p>In french, that would be \"quelle est cette construction dont tu cherches le nom?\"<br>\nA literal translation would be \"what is that construction you are looking the name for?\"</p>",
        "id": 489647648,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1734505152
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276048\">Mike Stay</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/Name.20of.20this.20fuzzy.20logic.20.281.2C2.29-topos.3F/near/489641124\">said</a>:</p>\n<blockquote>\n<p>Ha, I love it!  Maybe, \"Whether exactly what construction has a name are you asking?\"</p>\n</blockquote>\n<p>Whoo-ee!  Makes sense in principle, but while I can imagine pronouncing that aloud so that the listener might have a chance of parsing it correctly (with a rising tone on \"what\", to make it clear that that's the question word in the question <em>I'm</em> asking), even knowing how it is to be parsed my brain rebels at making sense of it written down.  (-:</p>\n<blockquote>\n<p>Or, \"About exactly what construction are you asking whether the construction has a name?\"</p>\n</blockquote>\n<p>Hmm, that might work.  It's a little awkward, but probably clear.  Could it be just \"About exactly what construction are you asking whether it has a name?\"</p>",
        "id": 489696497,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734507375
    },
    {
        "content": "<p>It's an interesting grammatical puzzle. Perhaps rephrasing to avoid \"it\" (without introducing repetition) is clearest?</p>\n<blockquote>\n<p>Regarding which construction are you asking whether there exists a name?</p>\n</blockquote>",
        "id": 489700647,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1734509290
    },
    {
        "content": "<p>(\"About which\" might be a better, less formal choice.)</p>",
        "id": 489700791,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1734509366
    },
    {
        "content": "<p>Hmm... as a mathematician I feel queasy about a \"there exists\" that isn't followed by a \"such that\"... (-:O</p>\n<p>Seriously, with that phrasing it doesn't sound as clear to me that the name being asked about is a name for the construction.</p>",
        "id": 489703356,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734510403
    },
    {
        "content": "<p>Would \"For which\" make that clearer, or does it still have the same problem?</p>",
        "id": 489703862,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1734510592
    },
    {
        "content": "<p>Ah, that would help!  \"there exists a name for this\" is clearer than \"there exists a name regarding this\".</p>",
        "id": 489704686,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734510878
    },
    {
        "content": "<p>\"For exactly what construction are you asking whether there is a name?\"</p>",
        "id": 489704839,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734510943
    },
    {
        "content": "<p>I think an “it” construction of the form “Of exactly which construction are you asking whether it has a name?” seems to land for me about as well, didn’t see us ruling out that one.</p>",
        "id": 489808303,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1734543028
    },
    {
        "content": "<p>Hmm... I wouldn't say \"I am asking of that construction whether it has a name\" -- that sounds like I went up to the construction and said \"hey, do you have a name\"?</p>",
        "id": 489811659,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734544229
    },
    {
        "content": "<p>But going back to \"about\" might work: \"about which construction are you asking whether it has a name?\"  \"I am asking about that construction whether it has a name.\"</p>",
        "id": 489811975,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734544338
    },
    {
        "content": "<p>That's a little more awkward to my ear than Nathanael's suggestion, but I think it works.</p>",
        "id": 489812407,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1734544485
    }
]