[
    {
        "content": "<p>The entry <a href=\"https://ncatlab.org/nlab/show/higher+observational+type+theory\">[[higher observational type theory]]</a> has a passage sounding rather judgmental:</p>\n<p><a href=\"/user_uploads/21317/MpdeQItAmu70JAgxoIBB_UAe/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/MpdeQItAmu70JAgxoIBB_UAe/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"689x150\" src=\"/user_uploads/thumbnail/21317/MpdeQItAmu70JAgxoIBB_UAe/image.png/840x560.webp\"></a></div><p>Like your doctor saying \"Ideally, you'd be exercising every day,\" when you admit to sitting about all day.</p>\n<p>Is this a fair representation of the hope for H.O.T.T., and if so, is the extent to which the hope is being realized properly elucidated in the references?</p>",
        "id": 517344596,
        "sender_full_name": "David Corfield",
        "timestamp": 1746956813
    },
    {
        "content": "<p>That does sound a little \"well, I <em>hope</em> the details are in the references on this page, the authors really should have done so\"...</p>",
        "id": 517350950,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1746962154
    },
    {
        "content": "<p>Yeah. If it's written from a position of ignorance, like the doctor before they inquire about your exercise regime, then we could have such a phrase on just about every page. If it's written in a pointed way for this particular entry, even if it's fair at a certain moment, it's unlikely to be updated as people write and add new references.</p>",
        "id": 517351324,
        "sender_full_name": "David Corfield",
        "timestamp": 1746962504
    },
    {
        "content": "<p>My only problem is that when people speak of \"the hope\", they would do better to say who is hoping it.   Of course mathematicians try not to be personal, but if there's a hope then someone is hoping it and it matters who!</p>",
        "id": 517352652,
        "sender_full_name": "John Baez",
        "timestamp": 1746963542
    },
    {
        "content": "<p>I believe <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> is working on higher observational type theory so maybe he can say something about this topic.</p>",
        "id": 517358755,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1746967827
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/nLab.20.3A.20.20higher.20observational.20type.20theory/near/517344596\">said</a>:</p>\n<blockquote>\n<p>Like your doctor saying \"Ideally, you'd be exercising every day,\" when you admit to sitting about all day.</p>\n</blockquote>\n<p>Hmm... it doesn't sound that way to me.  But if it sounds that way to you, maybe you can help rephrase it to be better.</p>\n<p>This entry has to be somewhat speculative because HOTT is still work in progress.  There is no formally specified theory called HOTT in the literature yet.  What there is right now is</p>\n<ul>\n<li>a version of the theory with internal parametricity instead of homotopy theory</li>\n<li>a proof that it satisfies canonicity</li>\n<li>an implementation of it, hence a normalization algorithm, but which is not proven correct</li>\n<li>an internal definition in that implementation of \"fibrancy\", which we intend to produce a model of HOTT internally</li>\n</ul>\n<p>I would mostly agree with the two hopes currently written on the page, but they have a somewhat different status.  The second one is a mathematical hope (although by this point I'm confident enough that I would call it an <em>expectation</em>): that once the theory is formally specified we will be able to prove univalence in it and prove metatheoretically that it computes (e.g. satisfies normalization).  The first one is more of a sociological hope: it's a fact that the theory won't have an interval primitive (although I'm not sure what \"second-class\" means), but whether it's \"logically cleaner\" is more of an aesthetic judgment, and my hope is that a substantial number of people will feel that way (as I do).  (-:  (Although I'm not sure that \"logically cleaner\" is quite how I would describe how I feel, but I suppose it's a reasonable approximation.)</p>",
        "id": 517376613,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1746981538
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/nLab.20.3A.20.20higher.20observational.20type.20theory/near/517376613\">said</a>:</p>\n<blockquote>\n<p>it's a fact that the theory won't have an interval primitive (although I'm not sure what \"second-class\" means)</p>\n</blockquote>\n<p>I think \"second-class\" means simply that the interval is not a type, but is defined externally to the base dependent type theory. But it doesn't matter since that word isn't in the article anymore from what I can see.</p>",
        "id": 517379513,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1746983675
    },
    {
        "content": "<p>Apparently someone named \"p\" is editing it as we speak.</p>",
        "id": 517379983,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1746984061
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/nLab.20.3A.20.20higher.20observational.20type.20theory/near/517376613\">said</a>:</p>\n<blockquote>\n<p>HOTT is still work in progress.  There is no formally specified theory called HOTT in the literature yet</p>\n</blockquote>\n<p>That sounds worth specifying on the page, so I have.</p>",
        "id": 517443621,
        "sender_full_name": "David Corfield",
        "timestamp": 1747032518
    },
    {
        "content": "<p>I also added a remark and link to slides for Mike's philosophical motivation. Nice for my discipline to feel useful, even if not from my pen!</p>\n<blockquote>\n<p>While we hope that HOTT will have technical advantages as well, my primary motivation for it was philosophical. &lbrack;<a href=\"https://home.sandiego.edu/~shulman/papers/philsci.pdf\">slides</a>&rbrack;</p>\n</blockquote>",
        "id": 517488679,
        "sender_full_name": "David Corfield",
        "timestamp": 1747044000
    }
]