[
    {
        "content": "<p>How do you draw products and coproducts with string diagrams? Is there a good reference that I can consult?</p>",
        "id": 324133160,
        "sender_full_name": "Bernd Losert",
        "timestamp": 1674846161
    },
    {
        "content": "<p>A common thing is to use the fact (attributed to Fox) that a monoidal product is cartesian iff every object is a commutative comonoid + all morphisms are comonoid homomorphisms, and dually a monoidal product is cocartesian iff every object is a commutative monoid + all morphisms are monoid homomorphisms. (There's a tiny bit more to it than that, but that's close enough.) That's a very easy way to get string diagrams, it's written in Selinger's \"survey of graphical languages for monoidal categories\"</p>",
        "id": 324135795,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1674846991
    },
    {
        "content": "<p>Thanks. Hopefully that paper has an example of what I'm looking for.</p>",
        "id": 324270629,
        "sender_full_name": "Bernd Losert",
        "timestamp": 1674905742
    },
    {
        "content": "<p>If you want to draw both products and coproducts in the same string diagram, it is likely you need string diagrams for a <a href=\"https://ncatlab.org/nlab/show/rig%20category\">[[rig category]]</a> (or more precisely a <a href=\"https://ncatlab.org/nlab/show/distributive%20category\">[[distributive category]]</a>)… We made \"sheet diagrams\" for that: <a href=\"https://arxiv.org/abs/2010.13361\">https://arxiv.org/abs/2010.13361</a></p>",
        "id": 324345276,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1674937230
    },
    {
        "content": "<p>Also, see <a href=\"https://arxiv.org/abs/2210.09950\">tape diagrams</a>.</p>",
        "id": 324353369,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1674944071
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284005\">Ralph Sarkis</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/products.20and.20coproducts.20with.20string.20diagrams/near/324353369\">said</a>:</p>\n<blockquote>\n<p>Also, see <a href=\"https://arxiv.org/abs/2210.09950\">tape diagrams</a>.</p>\n</blockquote>\n<p>I would argue that these two things are actually the same, just using two depictions of the projection of the same three dimensional structure, where in the case of tape diagrams, the degeneracies at the branching are not drawn.</p>",
        "id": 324748500,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675103237
    },
    {
        "content": "<p>The rules in the tape diagrams paper express the same isotopy that is described in our paper.  Again, minus the degeneracies at the branching points, which one should be careful about so as not to make moves which disrespect the isotopy</p>",
        "id": 324748796,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675103319
    },
    {
        "content": "<p>It seems that there is some confusion about our paper on sheet diagrams, because the normalization procedure which we describe is is used to prove completeness, but not every diagram has to be normalized when using it.  The normalization rules correspond to moves respecting a certain isotopy, so they can of course be inverted; all that you need to know is that such a normal form actually exists.</p>",
        "id": 324749574,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675103534
    },
    {
        "content": "<p>Of course in the tape diagrams paper they do much more things than prove completeness, and it is actually for a more specific kind of bimonoidal category.  But aside from that they are the same axioms as far as I can tell.</p>",
        "id": 324751601,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675104158
    },
    {
        "content": "<p>It is analagous to how in a a logic, you can eliminate cut, but you don't have to do it, you just have to be able to.  And in multiplicative linear logic this cut elimination corresponds to the normalization of proof nets in some sense, to wrap it back around to string diagrams.</p>",
        "id": 324753346,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675104734
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277391\">@Cole Comfort</span>  are you saying that the requirements to have biproducts to make tape diagrams is not actually essential, and that the syntax could be generalized for arbitrary rig categories? I haven't dived in the paper enough to really be able to tell ^^</p>",
        "id": 324938191,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1675178011
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276320\">Antonin Delpeuch</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/products.20and.20coproducts.20with.20string.20diagrams/near/324938191\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span>  are you saying that the requirements to have biproducts to make tape diagrams is not actually essential, and that the syntax could be generalized for arbitrary rig categories? I haven't dived in the paper enough to really be able to tell ^^</p>\n</blockquote>\n<p>I believe that the extra axioms for biproducts and duals are independent from the rig category axioms.  For example, the adjoints and diagonal maps don't exist in general, but if you drop them, then you seem to get exactly the same thing as sheet diagrams.</p>",
        "id": 324939499,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675178295
    },
    {
        "content": "<p>Also, just because this is the case doesn't mean that the proof strategies of either paper could easily be refined/generalized to prove completeness in the more refined/generalized case.</p>",
        "id": 324939795,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1675178361
    }
]