[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"367398\">Eric Forgy</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Puzzle.3A.20Finitely.20complete.20categories/near/223148104\">said</a>:</p>\n<blockquote>\n<p>I still need to calibrate when something is obvious enough not to say it. Product and diagonal maps have obvious diagrams and those diagrams have to obviously commute <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>\n</blockquote>\n<p>I think this is a challenge in general when communicating between engineering and math cultures. It's been my experience that in engineering culture oftentimes objectively ambiguous or wrong statements are perfectly acceptable: as long as the other person can guess what you mean (or should mean!), then this is often good enough. </p>\n<p>I found this hard to get used to when taking engineering classes. I once complained to an engineering professor that an assigned problem was ambiguous. His response was interesting: \"In engineering there are two reasons to make an assumption when solving a problem: 1. the assumption is justified, 2. you can't solve the problem otherwise!\"</p>\n<p>It's my impression that oftentimes tractability (or \"standard practice\") provide a background context that helps remove ambiguity or even implicitly correct wrong statements in an engineering context.</p>",
        "id": 223160270,
        "sender_full_name": "David Egolf",
        "timestamp": 1611000939
    },
    {
        "content": "<p>Totally, even before I switched careers to finance, I sat at the middle of the triumvirate of mathematics, physics and engineering. I didn't fit in anywhere <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<p>My mathematician friends looked at me like a physicist.</p>\n<p>My physicist friends looked at me like an engineer.</p>\n<p>My engineering friends looked at me like a mathematician. </p>\n<p><span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span> </p>\n<p>There are definitely challenges communicating across the three communities. I don't think the burden is entirely on engineers and physicists to learn to speak like mathematicians though.</p>\n<p>Today, I don't know what I am. I've had an entire career in finance, but still consider myself a physicist <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 223161027,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1611001513
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> [said](<a href=\"#narrow/stream/229199-learning.3A-questions/topic/Puzzle.3A.20Finitely.20complete.20categories.20(sidetrack.20on.20commun.2E.2E.2E/near/223160270)\">https://categorytheory.zulipchat.com/#narrow/stream/229199-learning.3A-questions/topic/Puzzle.3A.20Finitely.20complete.20categories.20(sidetrack.20on.20commun.2E.2E.2E/near/223160270)</a>:</p>\n<blockquote>\n<p>I think this is a challenge in general when communicating between engineering and math cultures. It's been my experience that in engineering culture oftentimes objectively ambiguous or wrong statements are perfectly acceptable: as long as the other person can guess what you mean (or should mean!), then this is often good enough. </p>\n</blockquote>\n<p>In math it's really not good enough - this is why I keep having to beat up Eric.  In math if you say a mathematical statement, you are claiming it's <em>true precisely as stated</em>, and you are really putting your reputation on the line for this.   The more times you're right, the more your reputation goes up, and the more times you're wrong, the more it goes down.   So you try to take the trouble to add in the fine print that makes a sentence really true: you don't leave it out.</p>\n<p>Of course even if you're sure something is true, sometimes you'll be wrong.  Then when someone points that out you have to admit you were wrong - or correct them if you think <em>they're</em> wrong.  The best way to save your reputation is a prompt, clear admission of error.</p>\n<p>Also, sometimes you have to say something that's vague, or make a guess.  Then you have to say \"Roughly,... \" or \"Maybe... \" or \"I think...\" or \"Something like this is true...\" or \"Under suitable conditions...\"   These qualifiers are really essential, to keep from losing reputation when saying something that is false as stated!</p>",
        "id": 223169311,
        "sender_full_name": "John Baez",
        "timestamp": 1611008901
    },
    {
        "content": "<p>Someone who doesn't learn to talk these ways can never be taken seriously as a mathematician.</p>",
        "id": 223169352,
        "sender_full_name": "John Baez",
        "timestamp": 1611008957
    }
]