[
    {
        "content": "<p>I am taking a course on Homological Algebra and the first four classes have been a very hasty introduction to category theory. The main examples until now have all been related to the operation of tensoring modules with a bimodule, leading to the Eilenberg-Watts theorem.</p>\n<p>Although I've taken long ago a classical algebra course involving rings, modules, etc. at this point I'm much more familiar with category theory than with those things. The categorical part is known to me but the examples are not. I can see how bimodules of rings as Ab-enriched profunctors (between 1-object Ab-enriched categories i.e. rings), and tensoring with them as Ab-enriched profunctor composition. I don't know too much about enriched profunctors, but I think this would be a great opportunity to learn.</p>\n<p>I'd appreciate any references that treat this material (basic homological algebra examples using ring bimodules) from the perspective of Ab-enriched category theory!</p>",
        "id": 431204307,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1712193354
    },
    {
        "content": "<p>I don't know if you've checked out Anderson and Fuller's <em><a href=\"http://lib.ysu.am/disciplines_bk/fe3d976562178fdc9f74740ece7137ce.pdf\">Rings and Categories of Modules</a></em> (someone left a copy online).</p>",
        "id": 431370572,
        "sender_full_name": "John Baez",
        "timestamp": 1712252820
    },
    {
        "content": "<p>It's very gentle in its use of categories, so it might seem frustratingly slow if you're comfortable with category theory, but it's a good source of information on rings, categories of modules, bimodules, and Morita equivalence.</p>",
        "id": 431370918,
        "sender_full_name": "John Baez",
        "timestamp": 1712252935
    },
    {
        "content": "<p>A Morita equivalence between rings is an equivalence between their categories of modules.  Equivalently, it's a bimodule that has an \"inverse\".</p>",
        "id": 431371043,
        "sender_full_name": "John Baez",
        "timestamp": 1712252987
    },
    {
        "content": "<p>Chapter 6 is all about this, and Corollary 21.9 lists a bunch of properties of rings that are preserved by Morita equivalence.</p>",
        "id": 431371185,
        "sender_full_name": "John Baez",
        "timestamp": 1712253034
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thanks John! I had not checked out that book and I'll definitely do. I guess it doesn't do exactly what I'd like to see (e.g. a search for \"profunctor\" doesn't return any match) but most likely what I'd like to see doesn't even exist, since it would answer a very specific and unconventional need (want)</p>",
        "id": 431822572,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1712529775
    },
    {
        "content": "<p>Yeah, Anderson and Fuller's book is aimed at typical algebraists, not hotshots who like enriched profunctors.  What you'll learn here is how bimodules get <em>used</em> by ring theorists, and in particular how Morita equivalence gets used.   They leave you the fun of translating this material into the language of enriched profunctors.</p>\n<p>(Two rings are Morita equivalent iff they have equivalent categories of left modules iff they have equivalent categories of right modules iff are equivalent in the bicategory of rings, bimodules and bimodule homomorphisms.)</p>",
        "id": 431839742,
        "sender_full_name": "John Baez",
        "timestamp": 1712544259
    }
]