[
    {
        "content": "<p>Of course, completeness of a category implies finite-completeness of the same. However, I was wondering under which (non-trivial) conditions the converse statement is true?</p>",
        "id": 522624062,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1749138806
    },
    {
        "content": "<p>The only general condition I can think of offhand is if the category is a finite poset.</p>",
        "id": 522629864,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1749140555
    },
    {
        "content": "<p>If you already know that the category has some other limits and is sufficiently \"cogenerated\" under them from a small enough collection of objects, you can get this result. The dual situation is that of finitely accessible categories, which are generated under filtered colimits from a collection of compact objects. A finitely accessible category is cocomplete if and only if it has finite colimits (in which case it is called a locally finitely presentable (LFP) category). The dual classes of category are the ones relevant to you.</p>",
        "id": 522632417,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1749141464
    },
    {
        "content": "<p>Thank you very much, both of you. I think that I was looking for something like what <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> mentioned. Could you please also tell me where I can find a proof of this result?</p>",
        "id": 522698439,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1749180655
    },
    {
        "content": "<p>Do you really need the small cogeneration?  I would have guessed that if you have cofiltered limits and finite limits then you automatically have all small limits, regardless.  The limit of any diagram should be the cofiltered limit of the limits of its finite subdiagrams.</p>",
        "id": 522705113,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1749186213
    },
    {
        "content": "<p>That does seem sensible <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>.  <span class=\"user-mention\" data-user-id=\"295542\">@সায়ন্তন রায়</span> you can find at least the result I stated in Adamek and Rosicky's book.</p>",
        "id": 522712669,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1749191400
    },
    {
        "content": "<p>I have checked the details, and, as has been pointed out by <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> one does not need the hypothesis of small cogeneration.</p>",
        "id": 522938764,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1749361823
    },
    {
        "content": "<p>Unless I am missing something, the same proof seems to work for weak limits as well.</p>",
        "id": 522938801,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1749361884
    }
]