[
    {
        "content": "<p>A (colored) prop is called \"representable\" when each list of objects in the prop is isomorphic to a single object.</p>\n<p>It seems to me most people who like props are aware of the fact that representable props are equivalent to symmetric monoidal categories.</p>\n<p>This appears as Theorem 2.3 in Mike Shulman's <a href=\"https://arxiv.org/abs/1911.00818\">A practical type theory for symmetric monoidal categories</a> . This paper is the only reference I know for this fantastic result or any result like it. Does anyone know the history of analogous theorems about the equivalence between representable prop-like structures and weak 2-categorical structures?</p>\n<p>For similar reasons, it seems monoidal categories are equivalent to representable pros.<br>\nLikewise, it seems bicategories are equivalent to representable \"pros with colored regions\".</p>\n<p>What about double categories?<br>\nConsider a structure X defined by the analogy <em>monoidal category : pro :: double category : X</em>. This structure X is like a double category, except its 1-cells cannot compose (neither vertically nor horizontally), and its 2-cells are bordered by pasting diagrams of 1-cells rather than single 1-cells.</p>\n<p>Are doubly weak double categories equivalent to Xs that are both vertically and horizontally representable? Is this a good way to first wrap my head around doubly weak double categories?</p>",
        "id": 301511384,
        "sender_full_name": "Aaron David Fairbanks",
        "timestamp": 1664478020
    },
    {
        "content": "<p>Hermida's <a href=\"https://www.sciencedirect.com/science/article/pii/S0001870899918777\">Representable multicategories</a> is the standard reference for the general setup, there instantiated for the equivalence between monoidal categories and representable multicategories. But the idea is already present in Cockett and Seely's papers on linearly distributive categories (equivalent to polycategories “representable on both sides”). There is also a version “with coloured regions”: <a href=\"https://ncatlab.org/nlab/show/linear+bicategory\">linear bicategories</a> are equivalent to representable <a href=\"http://www.tac.mta.ca/tac/volumes/11/2/11-02abs.html\">poly-bicategories</a></p>\n<p>For people who are acquainted with this branch of “Canadian” category theory, I think the result about pros and props are mostly understood as degenerate versions of the result for polycategories: if a representable polycategory extends to a prop, then the “tensor” and “par” of the corresponding linearly distributive category collapse to a single operation, so the linearly distributive category is “actually” a monoidal category. </p>\n<p>I think this fact -- that the “representable prop” result is a “degenerate case” of a more refined result about polycategories -- may be why the prop result is hard to find in publications (I have also only seen it spelled out in Shulman's paper that you cite).</p>",
        "id": 301514454,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1664479122
    },
    {
        "content": "<p>More troublingly, the relevance of this result to the theory of string diagrams seems to be little known in the string diagram community, which has led to parts of it being “rediscovered” over and over... I am actually writing an expository paper for this purpose.</p>",
        "id": 301514767,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1664479226
    },
    {
        "content": "<p>Unfortunately, I don't know an answer to your question about double categories :)</p>",
        "id": 301514824,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1664479252
    },
    {
        "content": "<p>Ah, thank you for all this!</p>\n<p>I agree, I see this as a very useful result. I've specifically gotten a lot of mileage out of thinking of 2-categorical structures as representable \"many-in, many-out\" prop-like structures (more than multicategory-like structures) because representability is so neatly described in terms of existence of isomorphisms within the structure.</p>\n<p>Good luck with your expository paper!</p>",
        "id": 301517558,
        "sender_full_name": "Aaron David Fairbanks",
        "timestamp": 1664480262
    },
    {
        "content": "<p>Regarding double categories, this is actually something I spent a while thinking about!  In fact, I have a half-written paper lying around waiting to be completed (or superseded).  This definition of doubly-weak double category isn't in the literature, so far as I know, but I believe it's the best one.</p>",
        "id": 301525537,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664483160
    },
    {
        "content": "<p>There is an extra subtlety in that not every \"arrangement of rectangles\" is actually composable in a double category: as shown by <a href=\"http://www.tac.mta.ca/tac/volumes/1995/n7/1-07abs.html\">Dawson</a> there are \"pinwheel\" shapes that can't be decomposed into the binary composites available in the standard definition of double category.  So in defining prop-like double-category structures (at one time I planned to call them \"double caterads\") you have to decide whether to allow \"pinwheel composites\".</p>",
        "id": 301525597,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664483170
    },
    {
        "content": "<p>I think a nice way to construct and compare double-categorical structures is in terms of monads on the category of <em>double computads</em>, which have objects, two kinds of arrows without compositions, and 2-cells with the same shapes as in a double caterad but without any compositions there either.  There should be monads on this category whose algebras are (1) double categories, (2) augmented double categories, in which pinwheels etc. can be composed, (3) double caterads, (4) augmented double caterads, (5) doubly-weak double categories, and (6) augmented doubly-weak double categories.</p>",
        "id": 301525999,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664483326
    },
    {
        "content": "<p>Thank you Mike, that is very helpful. I will from now on start calling these \"double caterads\" in my head.</p>",
        "id": 301526102,
        "sender_full_name": "Aaron David Fairbanks",
        "timestamp": 1664483366
    },
    {
        "content": "<p>The notions of doubly-weak double category that have been suggested elsewhere then arise by restricting the shapes that you allow in the double computads.  Verity's <a href=\"https://ncatlab.org/nlab/show/double%20bicategories\">[[double bicategories]]</a> have just squares and bigons, while the \"cubical bicategories\" once proposed by Garner have only squares.</p>",
        "id": 301526423,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664483487
    },
    {
        "content": "<p>And now I know why I got stuck trying to work out double categories in Agda (its MLTT core, not cubical) has been so hard: strict anything is really hard, it's 'simplest' to always work with weak structures. Didn't know that trying to do doubly-weak double categories might turn out to be 'new'.</p>",
        "id": 301629099,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1664539349
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Representable.20props.20and.20pros/near/301629099\">said</a>:</p>\n<blockquote>\n<p>And now I know why I got stuck trying to work out double categories in Agda (its MLTT core, not cubical) has been so hard: strict anything is really hard, it's 'simplest' to always work with weak structures. Didn't know that trying to do doubly-weak double categories might turn out to be 'new'.</p>\n</blockquote>\n<p>Just to clarify, \"weak\" in this context is being used to mean nonrepresentable/\"virtual\", rather than \"pseudo\". Double categories that have composition in both directions, but associative/unital only up to isomorphism have been studied in the literature before, under the name <a href=\"https://ncatlab.org/nlab/show/double%20bicategories\">[[double bicategories]]</a>.</p>",
        "id": 301653574,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1664546399
    },
    {
        "content": "<p>Ah, thank you, I had misunderstood. And I had not idea that <a href=\"https://ncatlab.org/nlab/show/double%20bicategories\">[[double bicategories]]</a> was were I ought to look, as that's not the expected name (as the page acknowledges). But now I know, that should help.</p>",
        "id": 301665698,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1664549548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span>, I don't think that's right.  At least, that's certainly not what I meant by \"weak\" -- I meant it in the sense of \"pseudo\".  And I'm pretty sure Aaron meant \"pseudo\" too, because he asked \"Are doubly weak double categories equivalent to [double caterads] that are both vertically and horizontally representable?\"</p>",
        "id": 301690680,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664556448
    },
    {
        "content": "<p>Verity's double bicategories are <em>a</em> notion of \"doubly-weak double category\", but they're a little odd because they have bigons as separate data in addition to the squares, and in particular a double bicategory in which all the coherences are identities is more general than a strict double category in the traditional sense.  One of the virtues of the double-caterad approach to doubly-weak double categories is that it avoids this issue.</p>",
        "id": 301691028,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664556558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>: ah, sorry, I misunderstood – thanks for the clarification. When you wrote </p>\n<blockquote>\n<p>Regarding double categories, this is actually something I spent a while thinking about!</p>\n</blockquote>\n<p>I thought you meant the \"X\"s that Aaron mentioned, rather than the representable kind (because your next message was about the nonrepresentable kind, and I thought it was talking about the same structure). Sorry for the confusion <span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span>!</p>",
        "id": 301702323,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1664560101
    },
    {
        "content": "<p>I meant both!  (-:</p>",
        "id": 301703016,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664560332
    },
    {
        "content": "<p>So now I am indeed confused. What is a good definition of \"doubly weak double category\" in the pseudo sense that I should be using, as a means to formalize that in Agda?</p>",
        "id": 301785594,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1664613138
    },
    {
        "content": "<p>Probably Mike Shulman's definition.  But you will have to extract it from him:</p>\n<blockquote>\n<p>Regarding double categories, this is actually something I spent a while thinking about! In fact, I have a half-written paper lying around waiting to be completed (or superseded). This definition of doubly-weak double category isn't in the literature, so far as I know, but I believe it's the best one.</p>\n</blockquote>",
        "id": 301842557,
        "sender_full_name": "John Baez",
        "timestamp": 1664641882
    },
    {
        "content": "<p>Perhaps I should try summoning <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> and that might work?</p>",
        "id": 301869394,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1664660763
    },
    {
        "content": "<p>I don't have it written down in explicit form.  My half-written notes define them as algebras for a monad on the category of double computads, but the monad isn't very explicit.  The definition is basically you have composition and unit operations on both sets of arrows, with no axioms, and then a set of squares with any possible sequences of composable arrows on all four boundaries, with \"all the possible composition operations\" of those.</p>",
        "id": 301878526,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664669383
    },
    {
        "content": "<p>I don't even know whether there is a finite presentation of that definition.</p>",
        "id": 301878535,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664669397
    },
    {
        "content": "<p>I think it should be possible to give an equivalent definition by starting with a <a href=\"https://ncatlab.org/nlab/show/double%20bicategory\">[[double bicategory]]</a> and then imposing as an extra axiom that the canonical maps from bigons to degenerate squares are bijections.</p>",
        "id": 301878606,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664669448
    },
    {
        "content": "<p>That might be easiest for formalization.</p>",
        "id": 301878609,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1664669457
    },
    {
        "content": "<p>Thanks - I'll give that a try.</p>",
        "id": 302011901,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1664782327
    }
]