[
    {
        "content": "<p>Is it possible to change the cofinality of a regular cardinal without collapsing any cardinals ?</p>",
        "id": 411617220,
        "sender_full_name": "Jan Pax",
        "timestamp": 1704648575
    },
    {
        "content": "<p>A quick search finds Magdor's article <em>Changing cofinality of cardinals</em>, Fundamenta Mathematicae, 99(1):61–71, 1978. though it's changing cofinalities of measurable cardinals (which <em>are</em> regular), which of course extend ZFC.</p>",
        "id": 411635372,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1704664757
    },
    {
        "content": "<p>do you mean that every cardinal remains the same  and just cofinality of a measurable becomes countable ? That would really answer my question.</p>",
        "id": 411636930,
        "sender_full_name": "Jan Pax",
        "timestamp": 1704666164
    },
    {
        "content": "<p><a href=\"https://bibliotekanauki.pl/articles/1364212.pdf\">https://bibliotekanauki.pl/articles/1364212.pdf</a> </p>\n<blockquote>\n<p>A forcing notion is defined by which the cofinality of certain kinds of measurable cardinals can be changed to any given value without collapsing any cardinals.</p>\n</blockquote>",
        "id": 411704205,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1704707813
    },
    {
        "content": "<p>I asked a strong <a href=\"https://pedromarun.github.io/\">set theorist friend of mine</a> (who's actually on the job market right now, just saying <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span>) and he said this:</p>\n<blockquote>\n<p>Yes, it's consistent that this is the case. If CH holds, then Namba forcing preserves all cardinals while making aleph_2 singular of cofinality omega. If there’s a measurable, then Prikry forcing makes the measurable have cofinality omega while also preserving all cardinals. I’ll get back to you on whether it’s consistent that every cardinal preserving poset is cofinality preserving.</p>\n</blockquote>",
        "id": 411966950,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1704816851
    }
]