[
    {
        "content": "<p>hello there. does anyone know of a structured library of facts and factoids about various xyz-monoids and xyz-categories, and various things that each one exemplifies? beyond \"x is an example of [a, b, c, ...]\", there's lots of dimensions along which the data can be structured, e.g. the lattices formed by concepts under the relation of \"generalizes\", but something basic would also be very ueful.</p>\n<p>as someone who doesn't know how to do much category theory, but can find a lot of uses for it, i find it hard to review/recall quickly whether such and so a x-monoid/category/functor has such-and-so a property, or whether all foos are bars. i think a more structured library of facts that is akin to the excellent ncatlab project would be very useful to me (and other people like me).</p>",
        "id": 232215205,
        "sender_full_name": "Asad Saeeduddin",
        "timestamp": 1616990313
    },
    {
        "content": "<p>perhaps the exercise of structuring these facts for systematic presentation will involve some non-trivial category theory (structuring mathematics is after all what category theory excels at)</p>",
        "id": 232215368,
        "sender_full_name": "Asad Saeeduddin",
        "timestamp": 1616990484
    },
    {
        "content": "<p>I don't know of anything like what you want.</p>\n<p>I believe the Topos Institute is planning to do some work on a more structured version of the nLab - better for computers.   But this will be just the start of things, not the end.   </p>\n<p>There's a lot of room for other projects, too.</p>",
        "id": 232216366,
        "sender_full_name": "John Baez",
        "timestamp": 1616991547
    },
    {
        "content": "<p>Many facts about category theory and other areas of mathematics have been formalized in different proof assistants over the years. This is at the other end of the spectrum in relation to the nlab: good for computers to parse, terrible for humans. However, good documentation built on top of these standard libraries should make them more human-friendly.</p>",
        "id": 232239932,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1617010013
    }
]