[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> in his talk <a href=\"https://math.ucr.edu/home/baez/theoretical/\">Theoretical Physics in the 21st Century</a> states that increasingly in physics, people are searching and finding condensed matter physics systems which behave like various exotic quantum field theories. The example he gave is an emergent system which behaves like it has two time dimensions and two space dimensions rather than the usual one time dimension and three space dimensions. Then I wonder, has there been any condensed matter systems discovered which behave like a supersymmetric quantum field theory?</p>",
        "id": 507290628,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742567119
    },
    {
        "content": "<p>I've never heard of such a system, and this would be such big news I feel I'd surely have heard of it: fans of supersymmetry would be incredibly excited, since finally their math would apply to a small piece of the real world!</p>",
        "id": 507304153,
        "sender_full_name": "John Baez",
        "timestamp": 1742570608
    },
    {
        "content": "<p>Nobody has ever found higher gauge fields in condensed matter physics, but there are at least papers investigating how you could design forms of matter that have higher gauge symmetry.   Here I am more optimistic that someday one will be created in the lab.</p>",
        "id": 507305027,
        "sender_full_name": "John Baez",
        "timestamp": 1742570837
    },
    {
        "content": "<p>I've heard that <a href=\"https://arxiv.org/abs/nucl-th/0412090\">some atomic nuclei are approximately supersymmetric</a>, and now you're making me want to understand this.    It has something to do with the fact that nuclei are very different depending on whether they have an even or odd number of neutrons, and on whether they have an even or odd number of protons, but there's some trick to unify the study of the various cases.   The paper I linked to says:</p>\n<blockquote>\n<p>Almost 15 years after the prediction of the spectrum of the odd-odd nucleus by nuclear supersymmetry, it was shown experimentally that the observed spectrum of the nucleus <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mrow></mrow><mn>196</mn></msup><mtext>Au</mtext></mrow><annotation encoding=\"application/x-tex\">{}^{196}\\text{Au}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141em;\"></span><span class=\"mord\"><span class=\"mord\"></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">196</span></span></span></span></span></span></span></span></span><span class=\"mord text\"><span class=\"mord\">Au</span></span></span></span></span> is amazingly close to the theoretical one.</p>\n</blockquote>\n<p>But I believe here we have supersymmetry showing up in a Hamiltonian on a finite-dimensional Hilbert space (a simplified model of some states of a nucleus), not a supersymmetric field theory.</p>",
        "id": 507305676,
        "sender_full_name": "John Baez",
        "timestamp": 1742570997
    },
    {
        "content": "<p>Going even further down the ladder of complexity, there's a way to use supersymmetry to compute the spectrum of energy states of a hydrogen atom - one of the first problems one solves in a quantum mechanics class.   In the fall of 2011, my friend Blake Stacey told me:</p>\n<blockquote>\n<p>\"The SUSY QM approach is how we solved the hydrogen atom in our undergrad quantum class at MIT.\"</p>\n</blockquote>\n<p>I have a list of references on this <a href=\"https://math.ucr.edu/home/baez/gravitational.html\">here</a>, but I haven't dug into them.</p>",
        "id": 507308467,
        "sender_full_name": "John Baez",
        "timestamp": 1742571704
    },
    {
        "content": "<p>But I hope it's obvious why these are less exciting than a material described by a supersymmetric field theory would be.</p>",
        "id": 507311290,
        "sender_full_name": "John Baez",
        "timestamp": 1742572455
    }
]