[
    {
        "content": "<p>What symbolic software packages do people use in their research? Julia, Pari GP, Mathematica, Maple, home brew? Does anyone use the Comstruct package? Thanks.</p>",
        "id": 194695698,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1587398221
    },
    {
        "content": "<p>Probably the biggest one here, if you count it, would be proof assistants. I've been using Agda a lot, and recently it's helped me check some proof refactorings.</p>",
        "id": 194782245,
        "sender_full_name": "James Wood",
        "timestamp": 1587463638
    },
    {
        "content": "<p>A bit linked: which formalism have you used to handle categories in Agda? Do you have a github or something where I could look it up? I tried developing some categories in Agda, but never reached the point where I could really benefit from having a proof assistant.  I use Agda a lot for working on type theory, and the benefit is much more immediate there</p>",
        "id": 194791155,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1587470085
    },
    {
        "content": "<p>Okay, I'm using it more like you, for type theory. If I were to do more category theory, I'd probably start from <a href=\"https://github.com/agda/agda-categories\" title=\"https://github.com/agda/agda-categories\">agda-categories</a>.</p>",
        "id": 194792048,
        "sender_full_name": "James Wood",
        "timestamp": 1587470725
    },
    {
        "content": "<p>Thanks, it looks there is quite a lot in this already! I might have a go with it when I have some free time</p>",
        "id": 194813351,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1587480781
    },
    {
        "content": "<p>A similar thing in idris is <a href=\"https://github.com/statebox/idris-ct\" title=\"https://github.com/statebox/idris-ct\">idris-ct</a></p>",
        "id": 194815327,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1587481479
    },
    {
        "content": "<p>Thanks for pointing it out, I have never used idris, so there is probably a bigger learning curve for me. I have worked with UniMath formalization of categories, but unfortunately Coq does not support natively inductive-recursive types, that I need to work with type theory. I have moved out of this a bit at the moment, but I will go back to it and check this out as well</p>",
        "id": 194901646,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1587544684
    }
]