[
    {
        "content": "<p>As far as I know, primitive recursive arithmetic can be characterised as the initial category with finite products containing a parametrised NNO. Likewise, Godel's System T is the initial cartesian closed category containing a NNO. We can say these things because the respective doctrines are essentially algebraic.</p>\n<p>Is it also true that Heyting (resp. Peano) arithmetic is the initial Heyting (resp. Boolean) category with a parametrised NNO? Also, can anything similar be said about second-order arithmetic?</p>",
        "id": 221453563,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1609684577
    },
    {
        "content": "<p>There isn't really anything out there about the categorical semantics of second-order logic. My first guess would be that, like first-order theories are indexed posets with quantifiers to substitution, second-order theories should be indexed first-order hyperdoctrines.</p>",
        "id": 221453632,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1609684745
    },
    {
        "content": "<p>Those are fun questions!  I can't help you with them, but I hope someone tells us some answers.</p>",
        "id": 221473073,
        "sender_full_name": "John Baez",
        "timestamp": 1609710757
    },
    {
        "content": "<p>Maybe a bit orthogonal to your question (and/or telling you things you already know), but one can ask which functions on naturals are representable given a NNO + some further structure. Afaik, in a monoidal category a NNO gives all primitive recursive functions, and under suitable conditions you get all partial recursive functions (aka computable functions. See these slides by Phil Scott <a href=\"http://www.site.uottawa.ca/%7Ephil/papers/Lambekfest2.pdf\">http://www.site.uottawa.ca/%7Ephil/papers/Lambekfest2.pdf</a> and/or this paper by Gordon Plotkin for more <a href=\"https://link.springer.com/chapter/10.1007/978-3-642-38164-5_21\">https://link.springer.com/chapter/10.1007/978-3-642-38164-5_21</a></p>",
        "id": 221772988,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1609943518
    }
]