[
    {
        "content": "<p>In 2-category theory it is common to have weak structures, called <em>lax</em> when the morphisms go in one direction (the \"default\" direction) and <em>oplax</em> or <em>colax</em> when they go in the other. In his \"2-categories companion,\" Lack says:</p>\n<blockquote>\n<p>Typically one speaks of <em>pseudo</em> widgets for the up-to-isomorphism notion, <em>lax</em> widgets for the up-to-not-necessarily-invertible comparison notion, and when the direction of the comparison is reversed, either <em>oplax</em> widget or <em>colax</em> widget, depending on the specific case.</p>\n</blockquote>\n<p>What I am wondering is whether there is any rhyme or reason to what is called \"oplax\" and what is called \"colax.\" For example, the nLab uses \"oplax\" for <a href=\"https://ncatlab.org/nlab/show/monoidal+functor\" title=\"https://ncatlab.org/nlab/show/monoidal+functor\">monoidal functors</a> and \"colax\" for <a href=\"https://ncatlab.org/nlab/show/slice+2-category\" title=\"https://ncatlab.org/nlab/show/slice+2-category\">slice 2-categories</a>. Should I make anything of this?</p>",
        "id": 194570856,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1587255556
    },
    {
        "content": "<p>i think it's just different people writing different pages</p>",
        "id": 194572298,
        "sender_full_name": "sarahzrf",
        "timestamp": 1587258328
    },
    {
        "content": "<p>i might be wrong though</p>",
        "id": 194572340,
        "sender_full_name": "sarahzrf",
        "timestamp": 1587258365
    },
    {
        "content": "<p>The Australians use \"op\", and this is part of a systematic thing for them: just as a category has an \"op\", a 2-category has an \"op\" where you turn around the morphisms and a \"co\" where you turn around the 2-morphisms.   But it's hard to stay consistent.</p>\n<p>Once upon a time there some people talked about Grothendieck fibrations and Grothendieck \"cofibrations\", I think - or maybe I'm just imagining it.  But when Quillen invented model categories, with fibrations and cofibrations, it became better to talk about Grothendieck \"opfibrations\".</p>",
        "id": 194574279,
        "sender_full_name": "John Baez",
        "timestamp": 1587262390
    },
    {
        "content": "<p>OK, thanks. The examples I gave from the nLab seem to be consistent with that convention.</p>",
        "id": 194574764,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1587263344
    }
]