[
    {
        "content": "<p>sharing here a question <a href=\"https://mathoverflow.net/questions/484478/sheaves-of-modules-over-a-topologically-ringed-space\">that I asked on mathoverflow</a> just in case in reaches some new eyes: has there been any study of the category of sheaves of modules over topologically ringed spaces somewhere in the literature? I can't find much beyond EGA 1, and that doesn't consider any extra structure that comes from the continuity of the action</p>",
        "id": 491631326,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1735834184
    },
    {
        "content": "<p>Can one present the theory of topological rings by a a limit sketch? Or maybe by a geometric theory? I mean if you can restrict enough your desired sheaves of top rings to take value in a subcat of models of theories like that, I guess Lurie's extension of Hakim's work, DAGV, would apply, no?</p>",
        "id": 491642293,
        "sender_full_name": "Fernando Yamauti",
        "timestamp": 1735839193
    },
    {
        "content": "<p>You mention condensed stuff in the question; one reason going in that direction is useful (that I've seen explained by Scholze) is that continuous modules don't typically form an abelian category. As soon as there are several topologies making the action continuous, the continuous identity map from the module with a finer topology to a coarser one is epic and monic but not an isomorphism. I don't have anything to add that applies more specifically to coherent things, but if you can't find much on the topic, that obstacle might explain it.</p>",
        "id": 491762964,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1735913212
    },
    {
        "content": "<p>that's a good example of why the condensed framework allows you to \"do\" topology and algebra at the same time, but the case of coherent sheaves in slightly special, especially in the holomorphic case: it's a very classical result that there is essentially a <em>unique</em> topology to put on all your modules, so you don't need to worry about different topologies on the same object</p>",
        "id": 491776765,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1735919986
    },
    {
        "content": "<p>So you think it will be abelian? I hope someone has a more positive answer, then!</p>",
        "id": 491790598,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1735926944
    }
]