[
    {
        "content": "<p>When I started out getting interested in categories, maybe the late 1980s and early 1990s, double categories seemed to be quite unpopular.  Now they are all the rage.   When did this first start to change, and why?</p>\n<p>I know the answer must be quite complex, but I'm trying to write about this so I'd be interested in various takes on it.</p>",
        "id": 531841419,
        "sender_full_name": "John Baez",
        "timestamp": 1753881596
    },
    {
        "content": "<p>(A very short answer for now, as I'm on the move.) Weak double categories were (for all intents and purposes) introduced in <a href=\"https://www.numdam.org/item/CTGDC_1999__40_3_162_0.pdf\">Limits in double categories</a> by Grandis and Paré in 1999. This was really the starting point for modern double category theory. Along with Marco and Bob's papers in the 2000s, Mike's 2007 paper <a href=\"https://arxiv.org/abs/0706.1286\">Framed bicategories and monoidal fibrations</a> was influential in demonstrating the application of double categories.</p>",
        "id": 531843431,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753882055
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531841419\">said</a>:</p>\n<blockquote>\n<p>I know the answer must be quite complex, but I'm trying to write about this so I'd be interested in various takes on it.</p>\n</blockquote>\n<p>It may also be worthwhile to ask this question on the categories mailing list! I would be very interesting to hear the various perspectives.</p>",
        "id": 531843501,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1753882071
    },
    {
        "content": "<p>I hadn't realized weak double categories were introduced so late!   What does \"for all intents and purposes\" mean, <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span>?   (It'd be dangerous for me to write something like that, even if it's true, because whoever had thought about them earlier would be offended.)</p>",
        "id": 531843930,
        "sender_full_name": "John Baez",
        "timestamp": 1753882187
    },
    {
        "content": "<p>They appear in passing in §8.11 of Street's <a href=\"https://www.ams.org/journals/tran/1980-258-02/S0002-9947-1980-0558176-3/S0002-9947-1980-0558176-3.pdf\">Cosmoi of Internal Categories</a>, and in a paper of the Ehresmanns, they claim that a French category theorist (I think Lair, but I will need to check when I am at a computer) defined such a notion, but the paper never appeared.</p>",
        "id": 531851019,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753883936
    },
    {
        "content": "<p>Weak double categories can also be obtained by restricting Verity's <a href=\"http://www.tac.mta.ca/tac/reprints/articles/20/tr20abs.html\">double bicategories</a>.</p>",
        "id": 531851186,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753883970
    },
    {
        "content": "<p>However, as far as I am aware, Grandis and Paré's paper is the first to give the explicit description of precisely what is meant by a weak double category today.</p>",
        "id": 531851503,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753884036
    },
    {
        "content": "<p><a href=\"https://mathoverflow.net/a/431929/4177\">https://mathoverflow.net/a/431929/4177</a> says Ehresmann defined double categories in print in 1963, and possibly in 1961, according to Guitart.</p>",
        "id": 531857079,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1753885458
    },
    {
        "content": "<p>Not massively relevant, but prehistory perhaps. That Bénabou (as a student of Ehresmann) took double categories and defined 2-categories, and thence bicategories, is kinda fun.</p>",
        "id": 531857437,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1753885558
    },
    {
        "content": "<p>But, just so everyone knows, Ehresmann only considered <em>strict</em> double categories.  I think Nathanael is quite correct that the growth of popularity of double categories could only get going in earnest once people learned to work with weak double categories... since many of the most important examples 'in nature' are weak (in one direction).</p>\n<p>And I think <em>the</em> crucial example for the rise of double categories was the double category of (enriched) categories, functors and profunctors.</p>\n<p>I should look at the early work on 'proarrow equipments' and see to what extent they were formulated in terms of double categories.  By the time we get to Mike's 'framed bicategories' and 'fibrant double categories' they clearly were, but that's later.</p>",
        "id": 531859754,
        "sender_full_name": "John Baez",
        "timestamp": 1753886195
    },
    {
        "content": "<p>Section 0.5 of Verity's thesis that Nathanael linked provides some historical context for double categories, presumably written around 2011 when it was reprinted.</p>",
        "id": 531865991,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1753887804
    },
    {
        "content": "<p>My impression is that before my paper, Verity was the only one to formulate proarrow equipments using double categories, and his approach never caught on much, probably because double bicategories were so complicated.</p>\n<p>For me, Prof was certainly only one example among many.  My original motivation for studying double categories was the May-Sigurdsson double category Ex of parametrized spectra.  I don't recall how central Prof was as an example for Grandis and Pare; I do think they certainly also considered examples like Span.</p>",
        "id": 531874043,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1753890024
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531874043\">said</a>:</p>\n<blockquote>\n<p>My original motivation for studying double categories was the May-Sigurdsson double category Ex of parametrized spectra</p>\n</blockquote>\n<p>I'd also be interested to hear more about any uptake of double categories in \"mainstream\" mathematics. E.g., did/do any algebraic topologists appeal to them?</p>\n<p>Is it perhaps that for more telling use, there would need to be first the homotopification to <a href=\"https://ncatlab.org/nlab/show/double+infinity-category\">[[double infinity categories]]</a>, which comes more recently?</p>",
        "id": 531879584,
        "sender_full_name": "David Corfield",
        "timestamp": 1753891668
    },
    {
        "content": "<p>Bob Paré told me that his original motivation for caring about weak double categories was observing that the \"hom functor\" for a double category should land in Span, but this is merely a weak double category.</p>",
        "id": 531881157,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753892172
    },
    {
        "content": "<p>Thanks, Nathanael - that sort of from-the-horse's-mouth historical observation is very nice.</p>",
        "id": 531893972,
        "sender_full_name": "John Baez",
        "timestamp": 1753896433
    },
    {
        "content": "<p>I think Evan Patterson wrote a nice note on his website on this.</p>",
        "id": 531895371,
        "sender_full_name": "Siya Mthimkulu",
        "timestamp": 1753896970
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531874043\">said</a>:</p>\n<blockquote>\n<p>My original motivation for studying double categories was the May-Sigurdsson double category Ex of parametrized spectra.</p>\n</blockquote>\n<p>Do you know if any other algebraic topologists followed up on that kind of application of double categories?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531879584\">said</a>:</p>\n<blockquote>\n<p>I'd also be interested to hear more about any uptake of double categories in \"mainstream\" mathematics. E.g., did/do any algebraic topologists appeal to them?</p>\n</blockquote>\n<p>Of course Ronnie Brown and coauthors have been using double categories in algebraic topology for a long time - here's an early paper:</p>\n<ul>\n<li>R. Brown, C. B. Spencer, <a href=\"https://www.numdam.org/item/CTGDC_1976__17_4_343_0.pdf\">Double groupoids and crossed modules</a>, <em>Cahiers Topologie Geom. Differentielle Categ.</em> <strong>17</strong> 4, (1976), 343-362.</li>\n</ul>\n<p>But I have the feeling that this work never became 'mainstream' in algebraic topology.   At least Brown always acted like an outsider, unappreciated... and Peter May, more of an 'insider', dismissed Brown's ideas in my presence.</p>\n<p>In 1993 Bullejos, Cegarra and Duskin used n-fold categories internal to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"sans-serif\">G</mi><mi mathvariant=\"sans-serif\">p</mi></mrow><annotation encoding=\"application/x-tex\">\\mathsf{Gp}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord\"><span class=\"mord mathsf\">Gp</span></span></span></span></span> to model connected homotopy (n+1)-types (see the <a href=\"https://www.math.uchicago.edu/~may/IMA/Incoming/Paoli/Paoli_IMA.pdf\">nice review by Simona Paoli</a> from 2010).    But again, I wouldn't call this work 'mainstream' algebraic topology.   </p>\n<p>(By the way, I'm not saying mainstream = good.  There is however some interest in seeing how much double categories have been adopted by the mainstream.  The mainstream seems less interested in algebraic models of homotopy n-types than in studying various invariants of homotopy types - particularly generalized cohomology theories.)</p>",
        "id": 531897028,
        "sender_full_name": "John Baez",
        "timestamp": 1753897599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531897028\">said</a>:</p>\n<blockquote>\n<p>Do you know if any other algebraic topologists followed up on that kind of application of double categories?</p>\n</blockquote>\n<p>That's a good question, I don't really know.  I think certainly the May-Sigurdsson Ex has found uses, but I don't know if anyone has used a double-categorical perspective.  May-Sigurdsson described it basically as a proarrow equipment, without using that language (a \"bicategory with base change objects\").</p>",
        "id": 531910256,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1753902260
    },
    {
        "content": "<p>As I suggested above, there is some ongoing work on double <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord\">∞</span></span></span></span>-categories with eventual applications somewhat in mind. For instance, </p>\n<ul>\n<li>Félix Loubaton, Jaco Ruit, <em>On the squares functor and the Gaitsgory-Rozenblyum conjectures</em></li>\n</ul>",
        "id": 532008424,
        "sender_full_name": "David Corfield",
        "timestamp": 1753949510
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/531881157\">said</a>:</p>\n<blockquote>\n<p>Bob Paré told me that his original motivation for caring about weak double categories was observing that the \"hom functor\" for a double category should land in Span, but this is merely a weak double category.</p>\n</blockquote>\n<p>Interesting! Could you elaborate?</p>",
        "id": 532019777,
        "sender_full_name": "Adrian Clough",
        "timestamp": 1753952852
    },
    {
        "content": "<p>Continuing my <a href=\"#narrow/channel/274877-community.3A-our-work/topic/David.20.20Corfield/near/500757471\">puzzlement</a>, can there be any good reason, intellectual rather than cultural, for double categories being all the rage in ACT, but not in pure mathematics, mathematical physics, etc. Looking at their centrality to ACT in grand frameworks such as <a href=\"https://arxiv.org/abs/2505.18329\">Towards a double operadic theory of systems</a>, it's hard to see any intrinsic reason why double categories wouldn't be valuable elsewhere in mathematics and its applications.</p>",
        "id": 532022095,
        "sender_full_name": "David Corfield",
        "timestamp": 1753953511
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277917\">Adrian Clough</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/532019777\">said</a>:</p>\n<blockquote>\n<p>Interesting! Could you elaborate?</p>\n</blockquote>\n<p>Paré's paper <a href=\"http://www.tac.mta.ca/tac/volumes/25/17/25-17abs.html\">Yoneda theory for double categories</a> develops the theory (though he doesn't mention here that this was one of his original motivations; that comes from personal conversation).</p>",
        "id": 532024154,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753954087
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/532022095\">said</a>:</p>\n<blockquote>\n<p>Continuing my <a href=\"#narrow/channel/274877-community.3A-our-work/topic/David.20.20Corfield/near/500757471\">puzzlement</a>, can there be any good reason, intellectual rather than cultural, for double categories being all the rage in ACT, but not in pure mathematics, mathematical physics, etc.</p>\n</blockquote>\n<p>I think that it's inaccurate to say that double categories are less popular in pure category theory than applied category theory. Double category theories have been increasingly popular in pure category theory in the last 15 or so years. It may only be more visible in ACT because it's a smaller field.</p>",
        "id": 532024736,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753954247
    },
    {
        "content": "<p>I think it's clear, for instance, to anyone who has been attending the Category Theory conference in the last few years, that a rising proportion of mathematicians are acknowleding the usefulness of double categories in their work.</p>",
        "id": 532025022,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753954319
    },
    {
        "content": "<p>My limited understanding of the development of the subject is that a breakthrough was <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> and <span class=\"user-mention\" data-user-id=\"317561\">@Geoff Cruttwell</span> paper \"A unified framework for generalized multicategories\", providing precisely what the title says, in relation to Leinster's fc-multicategories and Wood's equipments. Especially the latter notion feels a powerful one, but written in an unwieldy way. With virtual double categories, everything is elegant and easy to bookkeep, and a proarrow equipment is just a special kind of vdc with nice properties. This was a breakthrough because it neatly put into perspective an old idea that (I suppose, because it happened to me) never really clicked.</p>\n<p>Part of the reason why I became friend with <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> was our joint fascination for the expressive power of vdcs; after some time Nathanael really did something with them, I was more content with just learning without a \"concrete\" way to test the language,  I found it beautiful but for me it was always all a bit up in the air.</p>\n<p>Yet, to this day, it remains one of my favourite papers in <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> long list of works :-) every time I go back reading it, I learn something new. </p>\n<p>And, I certainly feel awkward reviewing Mike's work when he's in the room, so perhaps I'll leave to you to dis/agree with my retrospective reading of how things went...</p>",
        "id": 532030490,
        "sender_full_name": "fosco",
        "timestamp": 1753955893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/532022095\">said</a>:</p>\n<blockquote>\n<p>Continuing my <a href=\"#narrow/channel/274877-community.3A-our-work/topic/David.20.20Corfield/near/500757471\">puzzlement</a>, can there be any good reason, intellectual rather than cultural, for double categories being all the rage in ACT, but not in pure mathematics, mathematical physics, etc. Looking at their centrality to ACT in grand frameworks such as <a href=\"https://arxiv.org/abs/2505.18329\">Towards a double operadic theory of systems</a>, it's hard to see any intrinsic reason why double categories wouldn't be valuable elsewhere in mathematics and its applications.</p>\n</blockquote>\n<p>Things don't happen merely because they could.  I believe often the limiting factor is not any intrinsic reason but just that nobody has tried yet.    I believe the fraction of interesting things we could do that actually get done is quite small.   It's much easier to do less interesting things that are almost like things that people have already done.</p>\n<p>In applied category theory, back around 2014, I was very excited about using bicategories to describe composition of open systems (1-morphisms) and also morphisms between open systems (2-morphisms).  But by 2016, after Kenny Courser had managed to build <a href=\"https://arxiv.org/abs/1605.08100\">symmetric monoidal bicategories of open systems</a>, we realized that symmetric monoidal double categories were better.  Not only are they technically simpler, they more clearly reflect what's really going on.</p>\n<p>I had hoped that this bicategorical or double categorical framework for open systems would be useful in science (e.g. physics and chemistry).   So far that hasn't really happened.  </p>\n<p>I think the main reason is that it would take someone who really understands some science also double categories well about a year of work to develop a good application.  I don't think anyone qualified has put that much time into it.  I know I haven't!   I probably should.   But it will require being frustrated and 'stuck' for weeks or months, which is not much fun.</p>\n<p>It turned out to be much easier to take structured cospan ideas and <a href=\"https://blog.algebraicjulia.org/post/2020/10/structured-cospans/\">implement them in software, using CatLab</a>.  But even here, the double categorical aspect has not yet been implemented.</p>\n<p>CatColab, on the other hand, really does use double categories - but in a completely different way!  It uses <a href=\"https://arxiv.org/abs/2310.05384\">double categorical doctrines</a> as a framework for expressing theories, which are themselves a framework for building models.   </p>\n<p><a href=\"https://arxiv.org/abs/2005.05956\">David Jaz Myers' double categorical systems theory</a> goes in yet another direction.  This may have an impact on the real world, because he's been put in charge of the ARIA <a href=\"https://www.aria.org.uk/opportunity-spaces/mathematics-for-safe-ai/safeguarded-ai/#programmeoverview\">Safeguarded AI</a> project as chief cat herder.   That is, he's been told to organize all the applied category theorists working for this project and get them to produce some working software.</p>\n<p>David and Sophie Libkind's <a href=\"https://arxiv.org/abs/2505.18329\">Towards a double operadic theory of systems</a> can be seen as part of that push.</p>",
        "id": 532052888,
        "sender_full_name": "John Baez",
        "timestamp": 1753962878
    },
    {
        "content": "<p>To be sure, while David is now starting to cat-herd the theorists on the project, he is not responsible for causing cool software to be made! There are two other chunks of the project launching led by software development shops, and then a whole other phase not yet extant where something like a new public benefit company implementing the mathematical and software ideas from the early phase is meant to get fully rolled out.</p>",
        "id": 532128782,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753982207
    },
    {
        "content": "<p>Okay, I'm glad David's burden is less than I thought.</p>",
        "id": 532149455,
        "sender_full_name": "John Baez",
        "timestamp": 1753988979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> I share the sentiment about the central role played by Mike's work on double categories over the last almost 20 years, and I'm also a  fan of the Cruttwell-Shulman paper. Virtual double categories are really great!</p>",
        "id": 532165134,
        "sender_full_name": "Jonas Frey",
        "timestamp": 1753994819
    },
    {
        "content": "<p>Aw, shucks.  (-:</p>\n<p>It's nice to have our work appreciated.  I do feel I should point out, for anyone listening who may not know, that virtual double categories <em>are</em> the same as Leinster's <a href=\"https://arxiv.org/abs/math/9903004\">fc-multicategories</a>, and I would say that Tom recognized their importance in a general way before we did.  In particular, he observed that they are the natural context for the monoids-and-modules construction.</p>",
        "id": 532171923,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1753997736
    },
    {
        "content": "<p>As long as we're talking about the double-categorical renaissance, there's another kind of double category that I feel deserve more attention than they've gotten: those whose two kinds of morphisms are distinct but dual, in particular with neither being stricter than the other.</p>\n<p>The paradigmatic double category of this sort is <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi><mrow><mi mathvariant=\"normal\">A</mi><mi mathvariant=\"normal\">l</mi><mi mathvariant=\"normal\">g</mi></mrow></mrow><annotation encoding=\"application/x-tex\">T\\mathrm{Alg}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span><span class=\"mord\"><span class=\"mord mathrm\" style=\"margin-right:0.01389em;\">Alg</span></span></span></span></span> for a 2-monad <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span></span></span></span>, where the two classes of morphisms are the lax and colax <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span></span></span></span>-morphisms.  I think this double category ought to be a nice place for studying 2-monad theory, e.g. its companion pairs are (up to equivalence) pseudo <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span></span></span></span>-morphisms, while its conjoint pairs are \"doctrinal adjunctions\".  Sometimes it may be useful to generalize it to a triple category where the transverse morphisms are the strict <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span></span></span></span>-morphisms.  In particular, I have a suspicion that these double or triple categories would be a good context in which to talk about limits of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">T</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">T</span></span></span></span>-algebras that involve both lax and colax morphisms, such as the comma object <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>f</mi><mi mathvariant=\"normal\">/</mi><mi>g</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(f/g)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mord\">/</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span><span class=\"mclose\">)</span></span></span></span> where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">f</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span> is colax and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>g</mi></mrow><annotation encoding=\"application/x-tex\">g</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span></span></span></span> is lax.  But I don't think anyone has gone this direction.</p>\n<p>The other example of a double category I know of like this is the double category of model categories with left and right Quillen functors, which I <a href=\"https://arxiv.org/abs/0706.2868\">showed</a> can be used to study coherence problems involving composites of left and right derived  functors.  But I don't know of any applications that have been made of this idea either.</p>",
        "id": 532173125,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1753998248
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/channel/229199-learning.3A-questions/topic/the.20rise.20of.20double.20categories/near/532173125\">said</a>:</p>\n<blockquote>\n<p>there's another kind of double category that I feel deserve more attention than they've gotten: those whose two kinds of morphisms are distinct but dual, in particular with neither being stricter than the other.</p>\n</blockquote>\n<p>There's work relating them to orthogonal factorization systems:</p>\n<ul>\n<li>Branko Juran,  <a href=\"https://arxiv.org/abs/2501.01363\">On orthogonal factorization systems and double categories</a></li>\n</ul>",
        "id": 532248919,
        "sender_full_name": "David Corfield",
        "timestamp": 1754034888
    },
    {
        "content": "<p>This is based on earlier work by <span class=\"user-mention\" data-user-id=\"386750\">@Miloslav Štěpán</span>: <a href=\"https://arxiv.org/abs/2305.06714\">Factorization systems and double categories</a>.</p>",
        "id": 532254637,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1754036591
    },
    {
        "content": "<p>People have recently used double categories in K-theory, for instance in understanding the Waldhausen construction: <a href=\"https://arxiv.org/abs/2107.07701v3\">https://arxiv.org/abs/2107.07701v3</a></p>",
        "id": 533402665,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1754633294
    },
    {
        "content": "<p>Interesting!  </p>\n<blockquote>\n<p>The main appeal of these double categories is that they generalize the structure of exact sequences to key non-additive settings such as finite sets and varieties, where the notion of complements replaces that of kernels and cokernels. This makes it possible to study finite sets and varieties as if they were the objects of an exact category, for the purposes of K-theory.</p>\n</blockquote>\n<p>I have a paper on biochemistry with one of the coauthors, Maru Saruzola.  We never submitted it for publication.   <span aria-label=\"crying cat\" class=\"emoji emoji-1f63f\" role=\"img\" title=\"crying cat\">:crying_cat:</span></p>",
        "id": 533416764,
        "sender_full_name": "John Baez",
        "timestamp": 1754640439
    },
    {
        "content": "<p>Why \"never\" and not \"haven't yet\"?</p>",
        "id": 533417302,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1754640647
    },
    {
        "content": "<p>At what point does \"haven't yet\" turn into \"never\"?   One of life's great questions...</p>",
        "id": 533417884,
        "sender_full_name": "John Baez",
        "timestamp": 1754640869
    },
    {
        "content": "<p>Presumably when there is no longer an intention.</p>",
        "id": 533420595,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1754641850
    },
    {
        "content": "<p>We wrote the paper <a href=\"https://arxiv.org/abs/1806.10764\">Biochemical coupling through emergent conservation laws</a> with Blake Pollard and Jonathan Lorand, who are either out of academia or leaving it.   Nobody but me had a sustained interest in biochemistry.  We all felt that the paper would need to be changed substantially to get it accepted by any sort of journal that has biochemists as referees.   Right now it's supposed to be readable by mathematicians and scientists of all sorts.  So to publish it, I'd have to do a lot of work on my own now.</p>\n<p>It's a fun paper, so I hope y'all read it!   It addresses the mystery of \"coupling\": how chemical processes that \"run uphill\" (require energy) can be driven by other processes that \"run downhill\" (release energy).   </p>\n<p>Maybe I should think about this using double categories.   <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 533423138,
        "sender_full_name": "John Baez",
        "timestamp": 1754642816
    }
]