[
    {
        "content": "<p>Double categories are pretty fashionable in category theory nowadays, what with a series of online conferences about them, and people using them to study open systems, and now even as a key part of the software system Catcolab.</p>\n<p>But my impression is that 20-50 years ago double categories were quite <em>un</em>popular, even in the category theory community, and even among people interested in 2-categories.   I felt that Grandis and Pare were \"voices in the wilderness\" preaching the importance of double categories but largely going unheard (with some obvious exceptions).  </p>\n<p>Does anyone have thoughts about this - or much better, <em>written evidence</em> of people discussing the (un)popularity of double categories back then?</p>",
        "id": 491033379,
        "sender_full_name": "John Baez",
        "timestamp": 1735334660
    },
    {
        "content": "<p>Good topic. One thing that comes to mind is <a href=\"https://golem.ph.utexas.edu/category/2008/05/double_categories_warm_and_cud.html\">this abstract</a> posted on the n-Cat Cafe as late as 2008, which begins:</p>\n<blockquote>\n<p>Ross Street, Double categories for better or worse, Australian Category Seminar, Macquarie University, Wednesday May 28, 2008.</p>\n<p>Abstract: I suspect no-one actually thinks of double categories as warm and cuddly, or wants to study them for their own sakes. Usually they are studied as a means to an end... Much interest in double categories has been to use them to study 2-categories. </p>\n</blockquote>\n<p>So here is a statement in plain terms by a famous 2-category theorist that such interest as there is in double categories is mostly as a means to understand 2-categories.</p>",
        "id": 491034786,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1735335821
    },
    {
        "content": "<p>For what it's worth, that was also my impression.  Around 20 years ago I was a graduate student, and it definitely seemed to me that all the interest and momentum was around <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-categories.  (But I expect you know that better than I do, having been one of the organizers of the 2004 IMA conference on <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-categories that was my introduction to the field.)  I remember being surprised by the realization during my thesis work that the structures I was looking at <em>weren't</em> really bicategories but double categories, and making an intentional effort to popularize double categories and other higher-categorical structures.</p>",
        "id": 491039625,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1735339922
    },
    {
        "content": "<p>As for written evidence, it's hard to find evidence of a negative, but we could point to writings that <em>could</em> have mentioned double categories but didn't.  For instance, Steve Lack's 2007 <a href=\"https://arxiv.org/abs/math/0702535\">2-categories companion</a> only mentions double categories as \"a related notion\" that \"will be less important\".  (Of course the title declares that it will be about 2-categories rather than double categories, but I happen to know that that paper was titled after it was written, so the title didn't influence the choice of topics.)</p>",
        "id": 491039679,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1735339943
    },
    {
        "content": "<p>We could also look at things that could have been done earlier but weren't, or were done in a different way.  For instance, there was a substantial amount of work that went into studying the bicategory Prof and characterizing bicategories like it.  I feel like if double categories had been more fashionable, some of that work would have considered Prof as a double category.</p>",
        "id": 491039825,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1735340087
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span> and <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> !  That abstract by Street is very good evidence: little did we suspect that Street favored \"warm and cuddly\" math.   <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span>   The remark by Lack is also good.</p>\n<p>I can probably get more evidence by talking to Grandis and Pare.  </p>\n<p>What I'm planning to do, btw, is write a short paper about the rise of double category theory, especially in \"applied\" category theory.   Both of you have played key roles in that rise.</p>",
        "id": 491045296,
        "sender_full_name": "John Baez",
        "timestamp": 1735345381
    },
    {
        "content": "<p>To be precise, what Lack said is that double categories \"will be less important <em>in this companion</em>\".  I didn't mean to give the impression he was stating they were less important in general (although he may have felt that they were).</p>",
        "id": 491046600,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1735346782
    },
    {
        "content": "<p>My impression is that internal categories are less studied than enriched categories more generally, though I do not know a reference discussing this.</p>",
        "id": 491068309,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1735369701
    },
    {
        "content": "<p>My first introduction to the wider world of higher category theoretic structures was <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> <a href=\"https://golem.ph.utexas.edu/category/2009/11/equipments.html\">speaking</a> of proarrow equipments as belonging to a 'zoo of “higher categorical structures”'. </p>\n<p><a href=\"/user_uploads/21317/F5d3IoNs4RdXW_1PVWKwj1Du/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/F5d3IoNs4RdXW_1PVWKwj1Du/image.png\" title=\"image.png\"><img data-original-dimensions=\"835x525\" src=\"/user_uploads/thumbnail/21317/F5d3IoNs4RdXW_1PVWKwj1Du/image.png/840x560.webp\"></a></div><p>Mike's <a href=\"https://golem.ph.utexas.edu/category/2009/11/the_1000th_post_on_the_ncatego.html\">introduction</a> at the nCafe includes:</p>\n<blockquote>\n<p>One theme that seems to keeps popping up in my research is that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-categories are really just one corner of a largely-unexplored zoo of higher categorical structures. In particular, I’ve become a big proponent of double categories, equipments, and related structures.</p>\n</blockquote>",
        "id": 491073832,
        "sender_full_name": "David Corfield",
        "timestamp": 1735374923
    },
    {
        "content": "<p>Yes, Mike really helped popularize double categories as well as proving a lot of theorems that show how we can use them effectively to do various things.</p>",
        "id": 491103048,
        "sender_full_name": "John Baez",
        "timestamp": 1735402637
    }
]