[
    {
        "content": "<p>Any articles dealing with category theory applied to \"Air-traffic-control\" type scenarios?  </p>\n<p>The overarching goal is to manage the time and location of vehicles en route to destinations so that they always maintain a safe distance from each other.</p>",
        "id": 436954366,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1714768171
    },
    {
        "content": "<p>There is David Spivak and Patrick Schultz's work on using category theory  to enhance safety in the national airspace system - see the <a href=\"https://topos.institute/safe-air\">short summary here</a> and details here:</p>\n<ul>\n<li><a href=\"https://arxiv.org/abs/1710.10258\">Temporal Type Theory: A topos-theoretic approach to systems and behavior</a>.</li>\n</ul>",
        "id": 436955268,
        "sender_full_name": "John Baez",
        "timestamp": 1714768662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thanks again John!  The variety of applications out there seems to be so dazzling...</p>",
        "id": 437072284,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1714879462
    },
    {
        "content": "<p>That Temporal Type Theory book is pretty heavy lifting. I will have to go through it carefully later to see if I can clean stuff, but do you know if there are any gentler surveys?  It would be nice to have toy examples...</p>",
        "id": 444120114,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1718149672
    },
    {
        "content": "<p>I'm not sure about [gentler surveys for] air traffic control specifically, where part of the idea of the temporal type theory book is that it outputs a type theory one could (in principle) reason in without knowing about the tops theory, but Gioele Zardini has a lot of work related to self-driving vehicles, which is at least vaguely relevant, and most of his writing is targeted much moreso at a \"normal\" engineering audience.</p>",
        "id": 444124147,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1718152586
    },
    {
        "content": "<p>Try this one<br>\n<a href=\"https://arxiv.org/pdf/1904.01081\">https://arxiv.org/pdf/1904.01081</a></p>",
        "id": 444128852,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1718155658
    },
    {
        "content": "<p>That actually looks like a <em>survey</em>.  Spivak's book was a research project.</p>",
        "id": 444190599,
        "sender_full_name": "John Baez",
        "timestamp": 1718185083
    },
    {
        "content": "<p>The request was for a survey</p>",
        "id": 444205403,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1718190331
    },
    {
        "content": "<p>Yes, that's why I said this actually looks like a survey.   It meets the request.   Part of my point was that Spivak's work is the exact opposite of the survey.</p>",
        "id": 444206624,
        "sender_full_name": "John Baez",
        "timestamp": 1718190676
    },
    {
        "content": "<p>Yeah. That book is no easy going.</p>",
        "id": 444219480,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1718194501
    }
]