[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> <br>\nDo you know any good instruction papers about transfinite compositions which is applied to type theory or logic ?</p>",
        "id": 210023057,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1600097916
    },
    {
        "content": "<p>Not quite what you're asking for, but Todd Trimble just wrote an expository paper proving Tychonoff's theorem using transfinite compositions.   You'd have to ask him to take a look.   It's not about type theory or logic, but it explains transfinite composition.  </p>\n<p>(I mention this mainly because I saw the paper just yesterday, and I'd never heard of \"transfinite composition\" before then.)</p>",
        "id": 210023412,
        "sender_full_name": "John Baez",
        "timestamp": 1600098103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <br>\nThank you for that information. I am loving to see it! <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span> ( I would like to avoid using AC! ) <br>\nI recently found the term \"transfinite composition\" in Cisinski's Book (Higher Categories and Homotopical Algebra : <br>\nDefinition 2.1.2).<br>\nAnd my current interest about this question is type theoretic implementation of proof assistant systems, using lambda term, of classical logics. </p>\n<p>In some papers, I found three ways how to implement classical logic; </p>\n<ol>\n<li>\"symmetric lambda calculus\"</li>\n<li>assuming \"~~A -&gt; A\"  on MLTT, HoTT  or something else </li>\n<li>\"continuation passing style\"</li>\n</ol>\n<p>Additionally, I felt that these concepts have something to do with the existence of colimit.<br>\nI see the definition of the following two terms but do not understand the relation between\" transfinite induction\" and \"transfinite composition\" too.</p>\n<p>Now I cannot organize the type theory which is correspond to classical Logic well.</p>",
        "id": 210023568,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1600098182
    },
    {
        "content": "<p>I'm afraid this is also the first time I'm encountering this concept (I found the reference you mention)<br>\nWhat relationship to you see between transfinite composition and implementations of classical logic, <span class=\"user-mention\" data-user-id=\"302332\">@GhaS Shee</span> ?</p>",
        "id": 210063389,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1600117634
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> <br>\nFor me, the transfinite composition is saying about the existence of the morphism to some kind of colimits. <br>\nAssuming the existence of colimit in the computation, for me, it seems to handle a computation that never ends.<br>\nIf we have morphisms to the computation that never ends, we can ADD some number to the value which we get from the never-ending computation. <br>\nI think that this concept, doing the latter calculation first,  is the very what we call \"continuation\", with which we might construct classical logic.</p>",
        "id": 210082498,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1600133584
    },
    {
        "content": "<p>Ah, I see what you're getting at, more or less.<br>\nThere are various principles that come under the banner of \"classical logic\".<br>\nOne of these is the law of excluded middle, which (as long as you have the relevant logical operators to hand) is equivalent to the double negation elimination rule you mentioned.<br>\nAnother is the axiom of choice.<br>\nHowever, you should just beware that:</p>\n<ol>\n<li>There are other, less frequently encountered principles of classical logic. The collection of classical principles do not form a single homogeneous mass: it's possible to explore them independently (although some imply others) so beware that any approach you take to study or implement classical logic may carry only some of these principles.</li>\n<li>Just because a principle is non-constructive does not make it a principle of classical logic. I don't understand transfinite composition well enough to tell how it fits in yet. </li>\n<li>The definition of transfinite composition <em>does not</em> assert that the colimit exists, but rather that whenever the colimit does exist, a certain leg of the colimit cone also lies in the class of morphisms being studied.</li>\n</ol>",
        "id": 210102290,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1600157985
    },
    {
        "content": "<p>Yes, indeed :-)</p>",
        "id": 210110525,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1600164214
    },
    {
        "content": "<p>From Todd Trimble's paper I gather that transfinite composition is a case of transfinite recursion.  Transfinite recursion is a way to recursively define functions indexed by ordinals.  You need to separately treat successor ordinals (as in ordinary finite recursion) and limit ordinals.   Transfinite recursion is to the ordinary finite recursive definition of functions as <a href=\"https://en.wikipedia.org/wiki/Transfinite_induction\">transfinite induction</a> is to ordinary induction.   Wikipedia tells me this:</p>\n<blockquote>\n<p>Proofs or constructions using induction and recursion often use the axiom of choice to produce a well-ordered relation that can be treated by transfinite induction. However, if the relation in question is already well-ordered, one can often use transfinite induction without invoking the axiom of choice. For example, many results about Borel sets are proved by transfinite induction on the ordinal rank of the set; these ranks are already well-ordered, so the axiom of choice is not needed to well-order them.</p>\n</blockquote>",
        "id": 210147828,
        "sender_full_name": "John Baez",
        "timestamp": 1600184862
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> where did you see this paper? Searching \"Todd Trimble transfinite composition\" doesn't help me, nor does substituting \"Tychonoff theorem\"</p>",
        "id": 210368642,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1600336204
    },
    {
        "content": "<p>Not yet uploaded, I believe you would need to ask him personally to see it.</p>",
        "id": 210371006,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1600338029
    },
    {
        "content": "<p>Todd is writing this paper now.  He paid my student Joe Moeller to put it in the format for submission to the <em>American Mathematical Monthly</em>.  Joe, Todd and I are working on another paper together.  </p>\n<p>I don't know if Todd plans to put this paper on the arXiv.  He hasn't published in a long time; he wants to get back into it.</p>",
        "id": 210392541,
        "sender_full_name": "John Baez",
        "timestamp": 1600350758
    }
]