[
    {
        "content": "<p>Skepticism, in the sense that he used at some point étale cohomology, and the citation chain went back to SGA4, where universes are used.</p>",
        "id": 272899675,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1645586033
    },
    {
        "content": "<p>What?  Was there really \"skepticism\" about Wiles' proof of FLT because it used the axiom of universes?    Did anyone come out and say they doubted it for that reason?</p>",
        "id": 272899798,
        "sender_full_name": "John Baez",
        "timestamp": 1645586148
    },
    {
        "content": "<p>I'd love to see a quote like that.</p>",
        "id": 272899801,
        "sender_full_name": "John Baez",
        "timestamp": 1645586158
    },
    {
        "content": "<p>I know McLarty and others spent a lot of time trying to eliminate the use of universes, but I always thought that was just out of interest in seeing if it could be done, not to allay actual doubts.</p>",
        "id": 272902513,
        "sender_full_name": "John Baez",
        "timestamp": 1645589043
    },
    {
        "content": "<p>Not by experts, perhaps, but you got things like this: <a href=\"https://mathoverflow.net/questions/35746/inaccessible-cardinals-and-andrew-wiless-proof\">https://mathoverflow.net/questions/35746/inaccessible-cardinals-and-andrew-wiless-proof</a>, where the \"proof\" that universes wasn't needed is that Brian Conrad says</p>\n<blockquote>\n<p>For etale cohomology all of that universe stuff is entirely irrelevant. I say this not as an \"article of faith\", but because I've read all of the proofs of the theorems of etale cohomology.</p>\n</blockquote>\n<p>So do we have to believe this guy who says he read all the references from Wiles' papers back to SGA4 and figured out how to eliminate universes, but never wrote up his argument? This is not just my take, but here's Ekedahl, responding</p>\n<blockquote>\n<p>I completely agree with BCnrd opinions here but as far as I know there is no published complete proof of the relevant results that bypasses SGA IV so in that sense it is not an established fact.</p>\n</blockquote>\n<p>There is mention on that post that Manin once asked publicly about whether universes could be eliminated from the proof of the Weil conjectures by Deligne, so perhaps that's another data point</p>",
        "id": 272925716,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1645609971
    },
    {
        "content": "<p>Not to mention Brian Conrad's heuristic for rejecting universes hinges on being able to work around the impredicativity inherent to category-theoretic universal properties:</p>\n<blockquote>\n<p>The 2nd issue is univ. mapping properties on \"entire category\" (your comment about \"whole categories of sheaves\"). That's an issue for category theory in general, not just SGA; handled as for flatness against \"all\" mods over a ring.</p>\n</blockquote>\n<p>Even I as a category theorist agree that this is an issue that needs to be taken more seriously by category theorists and advocates of category theory in general – with or without universes. Not for nothing did I make it the subject of my first paper. So I feel I understand where the sceptics (of category theory!) are coming from.</p>",
        "id": 272934346,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645614755
    },
    {
        "content": "<p>Am I correct that the axiom of universes is not just independent of ZFC, but that it might even be false?<br>\nThis is something that does not happen with older approaches to universes, such as NBG set theory. The drawback of NBG set theory is that you only have two universes (a universe of sets and a universe of classes), but it seems that the construction can be iterated to get more universes. Here is a relevant MathOverflow question by <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>: <a href=\"https://mathoverflow.net/questions/51257/\">https://mathoverflow.net/questions/51257/</a></p>",
        "id": 272939939,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645618447
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282722\">@Jens Hemelaer</span> if you can the axiom of universes is false, then you have just disproved some large cardinal axioms, and not very big ones at that. I really don't think you can have \"independent of ZFC\" and false at the same time.</p>",
        "id": 272945179,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1645621524
    },
    {
        "content": "<p>The discussion about universes is interesting to be sure, but quite far removed from the original topic--maybe a moderator could separate it out?</p>",
        "id": 272945335,
        "sender_full_name": "Reid Barton",
        "timestamp": 1645621597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276480\">@Reid Barton</span> quite right.</p>",
        "id": 272946066,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1645621938
    },
    {
        "content": "<p>Didn't know exactly where to split, but hopefully this helps a little :)</p>",
        "id": 272946921,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1645622443
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/universe.20axioms/near/272945179\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"282722\">Jens Hemelaer</span> if you can the axiom of universes is false, then you have just disproved some large cardinal axioms, and not very big ones at that. I really don't think you can have \"independent of ZFC\" and false at the same time.</p>\n</blockquote>\n<p>I agree that it can not be false and independent at the same time, but I believe it is not known which of the two it is. Whereas for NBG set theory it is known that it is consistent if and only if ZFC is consistent.</p>",
        "id": 272952007,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645624871
    },
    {
        "content": "<p>Universes can be used to prove the consistency of ZFC, so this is a clearly a different situation from NBG. But I think saying we don't know if universes are inconsistent or not, while true, is overstating the case since we don't know that ZFC or PA are consistent either. I don't think anyone seriously thinks adding universes makes things inconsistent here.</p>",
        "id": 272962947,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1645629762
    },
    {
        "content": "<p>It does seem to me that the objection is not probably not something like \"I believe ZFC is consistent but large cardinals are not\" but rather \"I never needed universes in my work before, why do you?\" – that is, it's an objection of parsimony. And maybe some maximalists also object on the grounds that the category of \"all sets\" should be literally that and not secretly replaced with \"all sets in U\".</p>",
        "id": 272966915,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645631311
    },
    {
        "content": "<p>Yes, ideally there would be some theorem that says that any classical statement without universes (i.e. about \"small things\") is provable in ZFC+universes if and only if it is provably in ZFC. This would be very practical, for example it would eliminate the discussion about whether or not universes are needed to prove FLT (without having to look at the proof of FLT).</p>\n<p>However, as long as we don't even know that ZFC+universes is equiconsistent with ZFC, we can't hope for a theorem like this.</p>",
        "id": 272975508,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645634841
    },
    {
        "content": "<p>That would be nice, but unfortunately, ZFC+U proves Con(ZFC) while ZFC doesn't (assuming it's consistent), and Con(ZFC) is a statement purely about natural numbers, which are pretty \"small\".</p>",
        "id": 272975693,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645634911
    },
    {
        "content": "<p>Also, I think the fact that ZFC+U proves Con(ZFC) means it can't be equiconsistent with ZFC unless they are both inconsistent.</p>",
        "id": 272975800,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645634978
    },
    {
        "content": "<p>Ah yes, this shows that the theorem can't exist. But the theorem does exist if you use NBG set theory rather than universes. So I'm a bit confused as to why universes are used more often. Maybe there is some advantage of universes over NBG set theory that I'm missing.</p>",
        "id": 272977178,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645635516
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/universe.20axioms/near/272975800\">said</a>:</p>\n<blockquote>\n<p>Also, I think the fact that ZFC+U proves Con(ZFC) means it can't be equiconsistent with ZFC unless they are both inconsistent.</p>\n</blockquote>\n<p>I almost said something similar, but is this right? I thought equiconsistent just meant the one is consistent iff the other one is. If they are both consistent then this would be true. Of course, we couldn't prove it.</p>",
        "id": 272977293,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1645635570
    },
    {
        "content": "<p>Yes, if they are both absolutely consistent (insofar as that means anything) then they would also be equiconsistent.</p>",
        "id": 272978592,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645636033
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282722\">@Jens Hemelaer</span> There are some things you can do with universes that you can't do with NBG, like form the functor category between two large categories.</p>",
        "id": 272978658,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645636069
    },
    {
        "content": "<p>Almost always this sort of stuff can be avoided if you work at it, but sometimes it requires clever tricks or unnatural encoding, while universes are easy to use and think about.</p>",
        "id": 272978791,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645636113
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 272981256,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645637052
    },
    {
        "content": "<p>I think part of the point is that the axiom of universes is so easy and natural to use if you're already using ZFC, while using NBG requires actually learning new stuff.    I typically work with ZFC in the back of my mind, and if I accidentally say something like \"the category of all categories\" I whip out the axiom of universes to save my butt.</p>",
        "id": 272989959,
        "sender_full_name": "John Baez",
        "timestamp": 1645640124
    },
    {
        "content": "<p>I'm convinced that we need more than two universes, just maybe not as many as provided by the axiom of universes. Maybe countably many would be enough? Then the category of sets is a class, the category of classes is a 2-class, the category of 2-classes is a 3-class, and so on.</p>",
        "id": 272992713,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645641298
    },
    {
        "content": "<p>The thing is that classes are fundamentally different from sets --- they are not closed under function spaces, for instance --- so I would not expect a notion of 2-class and 3-class to be as useful as it sounds. This is where universes play an important role --- they say, roughly, that we should think about sets rather than classes.</p>",
        "id": 272993048,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645641451
    },
    {
        "content": "<p>I don't personally know what I think about universes. There is something very unattractive about everything being stratified in a universe, because I feel that part of what is objective about category theory is its ability to speak about \"all\" things (even if the <em>need</em> to speak about \"all\" things is also a weakness).</p>",
        "id": 272993205,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645641517
    },
    {
        "content": "<p>But I do not yet know how to do my work without universes. I wouldn't mind it if I figured out how.</p>",
        "id": 272993240,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645641539
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297784\">Jonathan Sterling</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/universe.20axioms/near/272993048\">said</a>:</p>\n<blockquote>\n<p>The thing is that classes are fundamentally different from sets --- they are not closed under function spaces, for instance --- so I would not expect a notion of 2-class and 3-class to succeed. This is where universes play an important role --- they say, roughly, that we should think about sets rather than classes.</p>\n</blockquote>\n<p>Ok, thanks! That is probably the point where my naive construction fails.</p>",
        "id": 272993543,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1645641699
    },
    {
        "content": "<p>Btw Lawvere seems to take a different position on the matter --- I think that Lawvere believes that the failure of cartesian closure for classes is more of a failure of imagination, and we should just assert that classes do whatever we want them to do. I guess Lawvere's view is not so different from the universe perspective.</p>\n<p>The difficulty for me is that I am torn between the fibrational perspective, where I use relative category theory to deal with the relationship between \"large\" and \"small\", and the fact that it remains difficult even to develop fibered category theory without a pre-existing notion of large and small. I think these things could be dealt with in principle, but I do not yet have the skills.</p>",
        "id": 272993749,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645641814
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297784\">Jonathan Sterling</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/universe.20axioms/near/272993205\">said</a>:</p>\n<blockquote>\n<p>I don't personally know what I think about universes. There is something very unattractive about everything being stratified in a universe, because I feel that part of what is objective about category theory is its ability to speak about \"all\" things (even if the <em>need</em> to speak about \"all\" things is also a weakness).</p>\n</blockquote>\n<p>I feel similarly. Often introducing universes 'solves' the size issues, but leads to constructions which are sensitive to exactly what level of the hierarchy they are done at. And if you want the constructions to be invariant with respect to this level in a nice way or whatever, you then end up needing to solve the same things you would have needed to if you just dealt with the size issues in the first place.</p>",
        "id": 272996137,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1645642961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"386922\">Graham Manuell</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/universe.20axioms/near/272996137\">said</a>:</p>\n<blockquote>\n<p>Often introducing universes 'solves' the size issues, but leads to constructions which are sensitive to exactly what level of the hierarchy they are done at. And if you want the constructions to be invariant with respect to this level in a nice way or whatever, you then end up needing to solve the same things you would have needed to if you just dealt with the size issues in the first place.</p>\n</blockquote>\n<p>This is something I've thought about a fair amount.  One way to deal with the sensitivity to level is to use something like <a href=\"https://golem.ph.utexas.edu/category/2009/11/feferman_set_theory.html\">Feferman set theory</a> or a reflection principle, where the \"smallness\" cutoff doesn't have any special properties.</p>",
        "id": 273014679,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645652202
    },
    {
        "content": "<p>Just to clarify for Jens, the collection of all classes (as conventionally understood in the ontology of NBG or MK) is not a \"universe\" in the same way that the collection of all sets is. If we write V for the collection of all sets then, roughly speaking, the collection of all classes is P(V), and though V is an element of P(V), P(V) is not, and we want universes to be closed under P.</p>",
        "id": 273020436,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645655075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> I seem to remember that you once wrote about an ontology where \"small\" things behave like sets in classical set theory but \"large\" things behave like types in homotopy type theory, or something like that. That sounded quite interesting to me, but I don't remember the details now. Did you develop it further?</p>",
        "id": 273022268,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645656120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"416301\">@Zhen Lin Low</span>  You may be thinking of <a href=\"http://home.sandiego.edu/~shulman/papers/cambridge-stacksem.pdf\">this</a>.  I haven't finished writing the paper yet, but it's close to the top of my stack.</p>",
        "id": 273023639,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645656991
    },
    {
        "content": "<p>I don't think I've seen those slides before – at least, it's more detailed than what I remembered! I'm glad to hear it's being developed.</p>",
        "id": 273024645,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645657557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> This discussion also reminds me of a suggestion of Hamkins --- which is that rather than having simply a hierarchy of grothendieck universes, you want their inclusions to be elementary embeddings. I think (but am not sure) that this corresponds to a hierarchy linked by logical functors (??). Have you thought about such an arrangement and whether it helps with the problems we are discussing?</p>",
        "id": 273056506,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645688786
    },
    {
        "content": "<p>I think, despite the name, logical functors are incomparable to elementary embeddings. It is easy to check that the category of sets in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>V</mi><mi>α</mi></msub></mrow><annotation encoding=\"application/x-tex\">V_\\alpha</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8333em;vertical-align:-0.15em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">V</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.1514em;\"><span style=\"top:-2.55em;margin-left:-0.2222em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.0037em;\">α</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> is a elementary topos for every limit ordinal <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>α</mi></mrow><annotation encoding=\"application/x-tex\">\\alpha</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.0037em;\">α</span></span></span></span>. Furthermore if <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>α</mi><mo>≤</mo><mi>β</mi></mrow><annotation encoding=\"application/x-tex\">\\alpha \\le \\beta</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7719em;vertical-align:-0.136em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.0037em;\">α</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">≤</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05278em;\">β</span></span></span></span> are limit ordinals then the corresponding categories of sets embed logically. But <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>V</mi><mi>α</mi></msub></mrow><annotation encoding=\"application/x-tex\">V_\\alpha</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8333em;vertical-align:-0.15em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">V</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.1514em;\"><span style=\"top:-2.55em;margin-left:-0.2222em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.0037em;\">α</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> is not always (maybe even rarely??) an elementary substructure of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>V</mi><mi>β</mi></msub></mrow><annotation encoding=\"application/x-tex\">V_\\beta</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.9694em;vertical-align:-0.2861em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">V</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361em;\"><span style=\"top:-2.55em;margin-left:-0.2222em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.05278em;\">β</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2861em;\"><span></span></span></span></span></span></span></span></span></span>.</p>",
        "id": 273070212,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645697948
    },
    {
        "content": "<p>Conversely (?) I think it is possible to have elementary substructures of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>V</mi><mi>β</mi></msub></mrow><annotation encoding=\"application/x-tex\">V_\\beta</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.9694em;vertical-align:-0.2861em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">V</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361em;\"><span style=\"top:-2.55em;margin-left:-0.2222em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.05278em;\">β</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2861em;\"><span></span></span></span></span></span></span></span></span></span> that correspond to subcategories that are not logically embedded.</p>",
        "id": 273070441,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645698085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297784\">@Jonathan Sterling</span> Yes, Feferman set theory goes more or less in same direction as using elementary embeddings between universes.</p>",
        "id": 273099063,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645714341
    },
    {
        "content": "<p>It's definitely true that not every logical functor is an elementary embedding.  One reason is that general logical functor only <em>preserves</em> the truth of statements, while an elementary embedding preserves and reflects them.  A <em>conservative</em> logical functor also reflects truth, so it is closer to an EE.  The second reason I can think of is that logical functors deal only with bounded statements, while EEs deal with arbitrary ones.  That makes me think that an elementary embedding is strictly stronger than a conservative logical functor.  <span class=\"user-mention\" data-user-id=\"416301\">@Zhen Lin Low</span> , can you think of an example of the last sort you suggested, an elementary substructure that is not a logical functor?</p>",
        "id": 273099511,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645714541
    },
    {
        "content": "<p>I was thinking it would be possible to have the substructure disagree on what powersets are… but maybe that doesn’t happen if you have an elementary embedding rather than a mere elementary equivalence.</p>",
        "id": 273100126,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1645714823
    },
    {
        "content": "<p>I would think that \"<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi></mrow><annotation encoding=\"application/x-tex\">x</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">x</span></span></span></span> is the powerset of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>y</mi></mrow><annotation encoding=\"application/x-tex\">y</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span></span></span></span>\" is a statement whose truth would have to be preserved by the embedding.</p>",
        "id": 273102376,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1645715845
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"416301\">@Zhen Lin Low</span> and <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> for the discussion!</p>",
        "id": 273197797,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1645775489
    }
]