[
    {
        "content": "<p>I've been interested for a while in the contrast between the vector-space approach to semantics, used by LLMs, and <a href=\"https://ncatlab.org/nlab/show/dependent+type+theoretic+methods+in+natural+language+semantics\">[[type-theoretic approaches]]</a>. Where one may exploit the capacity of a high-dimensional vector space to contain very many near orthogonal vectors to keep different meaning concepts apart, the type-theoretic way looks to constrict via the typing discipline. Dependent type theories allow towers of types, each depending on the one (and hence ones) below.</p>\n<p>I was interested to see in <a href=\"https://arxiv.org/abs/2406.01506\">this paper</a> the appearance of a hierarchical structure within a vector space associated to an LLM:</p>\n<p><a href=\"/user_uploads/21317/N9x_vn9-qJT8t_1Jlb7OPBqf/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/N9x_vn9-qJT8t_1Jlb7OPBqf/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"474x456\" src=\"/user_uploads/thumbnail/21317/N9x_vn9-qJT8t_1Jlb7OPBqf/image.png/840x560.webp\"></a></div><p>Now, could there be a way to mediate between the two approaches, such as a way to generate towers of dependent types from a collection of vectors in a vector space?</p>\n<p>You might think that <a href=\"https://ncatlab.org/nlab/show/dependent+linear+type+theory\">[[linear dependent type theory]]</a> could play a role in mediating between the two extremes, allowing towers of different heights topped off by vector spaces (if linear types are restricted to depend only on nonlinear ones).</p>\n<p>Now, is there anything useful to say mathematically about this situation? Seems like approaches to phylogenetic tree formation should be near. </p>\n<p>It's surely easier to pass from a tower of sets to a corresponding vector space than to reconstruct a tower in reverse, or rather that there would be significant choices to be made to optimize in some sense this latter process.</p>\n<p>Ring any bells?</p>",
        "id": 509376256,
        "sender_full_name": "David Corfield",
        "timestamp": 1743491925
    }
]