[
    {
        "content": "<p>This coming Thursday (the 25th of March), <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> will be giving a talk on \"Mathematics in the 21st century\". As usual, the details can be found at <a href=\"https://topos.site/topos-colloquium\">https://topos.site/topos-colloquium</a>, but I'll save you a click and post all the relevant details below.</p>",
        "id": 231377139,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616443980
    },
    {
        "content": "<p>Zoom ID: 534 486 2882 / <a href=\"https://en.wikipedia.org/wiki/65,537\">PW: 5th Fermat prime</a><br>\nYouTube livestream: <a href=\"https://www.youtube.com/watch?v=lUqqQXFTHUY\">https://www.youtube.com/watch?v=lUqqQXFTHUY</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"lUqqQXFTHUY\" href=\"https://www.youtube.com/watch?v=lUqqQXFTHUY\"><img src=\"https://i.ytimg.com/vi/lUqqQXFTHUY/default.jpg\"></a></div>",
        "id": 231377247,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616444027
    },
    {
        "content": "<p><strong>Abstract.</strong> The climate crisis is part of a bigger transformation in which humanity realizes that the Earth is a finite system and that no physical quantity can grow exponentially forever. This transformation may affect mathematics — and be affected by it — just as dramatically as the agricultural and industrial revolutions did. After a review of the problems, we discuss how mathematicians can help make this transformation a bit easier, and some ways in which mathematics may change.</p>",
        "id": 231377402,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616444057
    },
    {
        "content": "<p><em>note that this talk is taking place at 18:00 UTC. this is confusing for two reasons: 1) the US has moved over to summer time but Europe hasn't yet, and 2) the colloquium normally takes place at 17:00 UTC</em></p>",
        "id": 231377529,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616444103
    },
    {
        "content": "<p>By the way, while people are hanging around waiting for my talk I'd like to play a video - if that's convenient.</p>",
        "id": 231574156,
        "sender_full_name": "John Baez",
        "timestamp": 1616553448
    },
    {
        "content": "<p>this sounds rather nice. is it a short video?</p>",
        "id": 231574884,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1616554188
    },
    {
        "content": "<p>It's a short video loop, so it can go on while people are waiting to start.  I guess I'll try to get <span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span> or whoever is running the show to let me play this.  Who is in charge of the Zoom session, Tim?</p>",
        "id": 231579405,
        "sender_full_name": "John Baez",
        "timestamp": 1616558165
    },
    {
        "content": "<p>yes, <span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span>  is running the show. and I'm sure there will be some reply from him either here or directly to you soon! looking forward to the talk and to the video too now.</p>",
        "id": 231580085,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1616558850
    },
    {
        "content": "<p>oh yes, sorry, i realised that i should have emailed you on monday to talk technical details! i’ll send you an email in a bit</p>",
        "id": 231622377,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616587701
    },
    {
        "content": "<p>Okay, I'll check it out.  (Just waking up...)</p>",
        "id": 231663383,
        "sender_full_name": "John Baez",
        "timestamp": 1616602831
    },
    {
        "content": "<p>just to be sure, it's starting in ~1 hour not in 5 minutes, right?</p>",
        "id": 231837037,
        "sender_full_name": "Daniel Plácido",
        "timestamp": 1616691253
    },
    {
        "content": "<p>yes correct (sorry for the late reply!)</p>",
        "id": 231847015,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616694853
    },
    {
        "content": "<p>it's starting in 5 minutes now!</p>",
        "id": 231847030,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1616694857
    },
    {
        "content": "<p>Chat log <br>\n<a href=\"/user_uploads/21317/FR45tJDaywcJTIwqoat5Yms4/meeting_saved_chat.txt\">meeting_saved_chat.txt</a></p>",
        "id": 231867452,
        "sender_full_name": "Konstantin Lindström",
        "timestamp": 1616702618
    },
    {
        "content": "<p>Thanks for the chat log, <span class=\"user-mention\" data-user-id=\"380694\">@Konstantin Lindström</span>  - and thanks every more for the interesting comments.  I really <em>do</em> want to think more about the dynamics of open systems, and under what conditions their \"interestingness\" tends to increase with time (whatever that means)... or whether there are any general statements one can make.   I know quite a few unconvincing papers about this topic.</p>",
        "id": 231868121,
        "sender_full_name": "John Baez",
        "timestamp": 1616702884
    },
    {
        "content": "<p>Your talk inspired a lot of thoughts. I was hoping that making the simplification of looking at the planet level (no mass exchange) there would be a simple description of a toy open dynamical system in a few variables describing energy dissipation of a planet with the property \"life\", vs radiative energy balance of a planet without that property. Lots of people before me have of course thought about these questions before. But from a ACT perspective one might be hoping for a nice categorical property to recognize open systems posessing the life property.</p>\n<p>So why this \"philosophical question\" you may ask. The question came up in another forum with the paradoxical argument that all life wants to do is to maximize its throughput of mass and energy. Somehow this implies that we are born for the sole purpose of maximising consumption until we all die! The equivalent of a stupid Corona virus not knowing better than to kill its host.<br>\nYay anthropocene...</p>\n<p>As you might imagine, I got an uneasy reaction to this  argument. Currently the only objection I have come up with is that greedy maximization for a finite time (until we destroy the earth) is suboptimal. Long term maximum sustainable throughput would be a better strategy. Thus my question on the long term steady state solution to a planet with life. In the far future, when genetic/technological evolution has done its utmost best, what kind of property would the system have?<br>\nIe. what is ultimate sustainability?</p>\n<p>So, any thoughts on how we model the steady state of sustainable dissipative systems?</p>",
        "id": 231877819,
        "sender_full_name": "Konstantin Lindström",
        "timestamp": 1616707189
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276053\">@Brendan Fong</span> <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span>  Regarding the subject of mathematics at the service of humanity and the work at the Topos Institute </p>\n<p>Currently looking at an interdisciplinary project modeling emotionaly driven human behaviour at a societal level. Looking for ways to model the heuristic \"Kahneman thinking fast\" part of human behaviour and possibly explore some cognitive biases <a href=\"https://en.wikipedia.org/wiki/List_of_cognitive_biases\">https://en.wikipedia.org/wiki/List_of_cognitive_biases</a></p>\n<p>This is  with a view towards the sociology of emergent cooperative behaviour vs competition and conflict. It seems a lot of current issues (conspiracies, climate change denial, vaccine denial, social tensions) are not amenable to rational reasoning, thus the need to model emotional multi agent systems . Furthermore, the complexity of societal issues tend to lead to wicked problems <a href=\"https://en.wikipedia.org/wiki/Wicked_problem\">https://en.wikipedia.org/wiki/Wicked_problem</a> where the agent is simultaneously part of a multitude of differerent interacting system dynamics. One would hope for a compositional way to build and refine and compose the models.</p>\n<p>Would love to have a video-call about any thoughts you might have on the matter.</p>",
        "id": 231886935,
        "sender_full_name": "Konstantin Lindström",
        "timestamp": 1616711700
    },
    {
        "content": "<p>I'd like to respond to your comments in detail, <span class=\"user-mention\" data-user-id=\"380694\">@Konstantin Lindström</span>.  It will take a while.</p>",
        "id": 231892109,
        "sender_full_name": "John Baez",
        "timestamp": 1616714917
    },
    {
        "content": "<p>After my talk someone sent an interesting email to <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span>, <span class=\"user-mention\" data-user-id=\"304002\">@Micah Halter</span> and me.  I think it's worth sharing:</p>\n<blockquote>\n<p>Hi all. John, I’m just listening to the tail end of your Topos Institute talk now, and enjoying it.</p>\n<p>You mentioned disappointment that nobody in the epi modelling circles has taken structured cospans and ran with it. I think that my experience is somewhat parallel. In early 2020, I was still at the University of Edinburgh where I was taking a break from doing computational models of biological things to do some natural language processing work. When the COVID happened I thought that it would be a useful thing to use some of the ways we have of representing processes in molecular biology. There’s no reason you can’t make epidemic models using rules (things like the kappa language, or double pushout graph rewriting) and they’re a lot more powerful than differential equations and a lot more clear than bespoke agent-based models. And, of course, they compose much like Petri nets do, which is a key property, like you’ve been writing and talking about.</p>\n<p>Getting this stuff adopted by a community with its own favourite tools and vocabulary is really difficult. I think it is partly cultural and partly a reaction that happens when a field is suddenly thrust into a prominent place central to everyone’s thinking on a pressing problem. It was pretty surprising that there was very little established good quality software infrastructure in place. I was told by one person in the field who I was working with on models that included a reasonably realistic concept of testing and contact tracing (instead of just burying it opaquely in rate constants) that we must do it as ODEs otherwise nobody would listen to us. Oh well. (In fact we did that, and it made a nice little paper, but not very general.) But it’s not as if this is the only sort of thing that goes on. There’s a nice paper from Dodd and Ferguson where they do a path integral formulation of epidemics, for example, so there is definitely an openness to new ideas, and more ground has been covered in the field than might at first be apparent. But many of those things are well outside the mainstream go-to tools and concepts.</p>\n<p>I landed at CMMID where I’m using a kind of lightweight coloured graph rewriting (lightweight because the edges are fixed, only the labels get changed, but the processes are expressed in a rule-based, Petri-net like way) to try to reconstruct the epidemic in a particular community in London. One reason that CMMID is interesting is that they have a focus on developing methodology.</p>\n<p>There are a few things that I wonder right now:</p>\n<p>- Would you — any of you — be interested at all in giving a talk on compositional modelling for epidemics at CMMID? There’s a Julia interest group and the structured cospans stuff that you’ve been working on is written in Julia, and I’ve been going on about Petri nets and stochastic rewriting systems for a while now so people have some exposure to the ideas.<br>\n  - Do you have any thoughts about how graph rewriting fits with structured cospans? I’m not a category theorist — I spent years at LFCS and picked up some concepts by osmosis, but I’m really just an engineer. If you do rewriting of discrete labelled graphs, that should be just a coloured Petri net. But if you let the tokens have edges between themselves, it’s a different beast. But there’s a sense (that I would have trouble making precise) in which they kind of feel the same. This is important in infectious disease modelling because epidemics on networks (as opposed as epidemics where the processes are described as a network) are a major current research topic with many open problems.<br>\n  - In case you’re not aware, there’s an NIH thing called the IMAG Multi-scale Modelling of Viral Pandemics Working Group. It is very ambitious with a scope much wider than just epi models. They are imagining large composite model that had sub-models for immune responses in hosts, transmission in the population, social dynamics and so forth. One of the main topics being worked out is the interfaces between models and how they compose.</p>\n<p>With best wishes,<br>\n-w</p>\n<p>Dr William Waites CEng MIET, Research Fellow<br>\nCentre for Mathematical Modelling of Infectious Diseases<br>\nLondon School of Hygiene and Tropical Medicine</p>\n</blockquote>",
        "id": 231892171,
        "sender_full_name": "John Baez",
        "timestamp": 1616714991
    },
    {
        "content": "<p>I think this is promising.</p>",
        "id": 231892236,
        "sender_full_name": "John Baez",
        "timestamp": 1616715023
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/Maximum_sustainable_yield\">https://en.wikipedia.org/wiki/Maximum_sustainable_yield</a><br>\nIs this relevant?</p>",
        "id": 231894250,
        "sender_full_name": "Konstantin Lindström",
        "timestamp": 1616716459
    },
    {
        "content": "<p>I just watched the talk and I would like to say thank you! The environmental crisis is quite a sensitive topic to me since I live in Brazil, if you know what I mean.</p>\n<p>When I was an undergrad I once worked in a lab which was analyzing the amazon rain forest soil.  They had the hypothesis that the forest had been deeply cultivated by ancient indigenous people. If this is true, we have a great evidence that it is possible to develop agriculture not only preserving  the forests, but also (re)building forests! Trees are the ultimate machine in CO2 absorption. Unfortunately, we are going towards the opposite direction. We had major fires last year. One quarter of the Brazilian swamps were destroyed. This year we became officially the worst country in regards to dealing with the pandemics.</p>\n<p>I have chosen to study pure math and it is awesome to see great people in such area concerned with problems that are so connected to my reality. It gives more hope.</p>",
        "id": 232770864,
        "sender_full_name": "Mayk Alves de Andrade",
        "timestamp": 1617289136
    },
    {
        "content": "<p>Thanks!  Yes, plants are the great way to pull carbon out of the atmosphere.   All the really large-scale methods of doing this involve plants.   We need to work with the biosphere, not against it.</p>",
        "id": 232771516,
        "sender_full_name": "John Baez",
        "timestamp": 1617289345
    },
    {
        "content": "<p>I hadn't known that fires were so bad in Brazil recently.  I must have been distracted by the big fires in the US, Australia and Indonesia!</p>",
        "id": 232772790,
        "sender_full_name": "John Baez",
        "timestamp": 1617289750
    },
    {
        "content": "<p>\"<a href=\"https://en.wikipedia.org/wiki/Terra_preta\">Terra preta</a>\" is fascinating:</p>\n<blockquote>\n<p>Terra preta (Portuguese pronunciation: [ˈtɛʁɐ ˈpɾetɐ], locally [ˈtɛha ˈpɾeta], literally \"black soil\" in Portuguese) is a type of very dark, fertile artificial (anthropogenic) soil found in the Amazon Basin. It is also known as \"Amazonian dark earth\" or \"Indian black earth\". In Portuguese its full name is terra preta do índio or terra preta de índio (\"black soil of the Indian\", \"Indians' black earth\"). Terra mulata (\"mulatto earth\") is lighter or brownish in color.</p>\n<p>Terra preta owes its characteristic black color to its weathered charcoal content, and was made by adding a mixture of charcoal, bone, broken pottery, compost and manure to the low fertility Amazonian soil. A product of indigenous soil management and slash-and-char agriculture, the charcoal is stable and remains in the soil for thousands of years, binding and retaining minerals and nutrients.</p>\n<p>Terra preta is characterized by the presence of low-temperature charcoal residues in high concentrations; of high quantities of tiny pottery shards; of organic matter such as plant residues, animal feces, fish and animal bones, and other material; and of nutrients such as nitrogen, phosphorus, calcium, zinc and manganese. Fertile soils such as terra preta show high levels of microorganic activities and other specific characteristics within particular ecosystems. </p>\n</blockquote>",
        "id": 232773488,
        "sender_full_name": "John Baez",
        "timestamp": 1617289893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/269484-seminar.3A-Topos.20Colloquium/topic/John.20Baez.3A.20.22Mathematics.20in.20the.2021st.20century.22/near/232772790\">said</a>:</p>\n<blockquote>\n<p>I hadn't known that fires were so bad in Brazil recently.  I must have been distracted by the big fires in the US, Australia and Indonesia!</p>\n</blockquote>\n<p>We had, indeed. And the most ironic thing is that most of them were illegally enlarged by farmers to increase their production area.</p>",
        "id": 232799167,
        "sender_full_name": "Mayk Alves de Andrade",
        "timestamp": 1617300154
    }
]