[
    {
        "content": "<p>tomorrow (the 29th of April) we have Jonathan Gorard speaking! 17:00 UTC</p>\n<p><em>Abstract</em><br>\nThe Wolfram Model — a discrete spacetime model based upon hypergraph rewriting — can be naively formalized as a conventional double-pushout rewriting system over a partial adhesive category of (directed) hypergraphs. However, the abstract rewriting structure of the model also permits an elegant interpretation in terms of dagger compact categories, with considerable formal analogies to FdHilb and the foundations of categorical quantum mechanics, yet with an additional causal semantics definable in terms of a second symmetric strict partial monoidal structure (such that the entire system can be formalized, for instance, in terms of a double category or a weak 2-category). In addition to potentially defining a general categorical semantics for discrete models of quantum gravity, this formalism presents a fundamentally new approach to performing efficient diagrammatic reasoning over combinatorial structures, by suggesting various generalizations of the standard deductive inference rules of resolution, superposition, paramodulation and factoring in the Knuth-Bendix completion approach to automated theorem-proving, and by making more explicit use of the causal structure of the abstract rewriting system in the choice of which inference rules to apply. We show how this approach can be applied to the problem of enacting fast diagrammatic simplification of circuits in quantum information theory, as well as (time-permitting) the problem of efficiently discretizing the Cauchy problem in numerical general relativity, showcasing comparisons against some existing software frameworks and algorithms.</p>\n<p>YouTube: <a href=\"https://www.youtube.com/watch?v=F7ax0L1c2g0\">https://www.youtube.com/watch?v=F7ax0L1c2g0</a><br>\nZoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"F7ax0L1c2g0\" href=\"https://www.youtube.com/watch?v=F7ax0L1c2g0\"><img src=\"https://i.ytimg.com/vi/F7ax0L1c2g0/default.jpg\"></a></div>",
        "id": 236497433,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1619612850
    },
    {
        "content": "<p>this is in 5 minutes!</p>",
        "id": 236708195,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1619715291
    }
]