[
    {
        "content": "<p>Thursday the 1st of July (tomorrow) at 17:00 UTC</p>\n<p><em>Abstract:</em><br>\nA long-standing question in mathematics is the relevance of formalisation to practice. Rising awareness of fallibility among mathematicians suggests formalisation as a remedy. But are today's proof assistants up to the task? And what is the right formalism?</p>\n<p>A wide variety of mathematical topics have been formalised in simple type theory using Isabelle/HOL. The partition calculus was introduced by Erdös and R. Rado in 1956 as the study of “analogues and extensions of Ramsey’s theorem”. Highly technical results were obtained by Erdös-Milner, Specker and Larson (among many others) for the case of ordinal partition relations, which is concerned with countable ordinals and order types. Much of this material was formalised last year (with the assistance of Džamonja and Koutsoukou-Argyraki).</p>\n<p>Grothendieck's Schemes have also been formalised in Isabelle/HOL. This achievement is notable because some prominent figures had conjectured that schemes were beyond the reach of simple type theory.</p>\n<p>Some highlights of this work will be presented along with general observations about role of type theory in the formalisation of mathematics.</p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=tYqbbRsx8DI\">https://www.youtube.com/watch?v=tYqbbRsx8DI</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"tYqbbRsx8DI\" href=\"https://www.youtube.com/watch?v=tYqbbRsx8DI\"><img src=\"https://uploads.zulipusercontent.net/7d395c6f87b3dbe68cf0305aafafff547299ac5e/68747470733a2f2f692e7974696d672e636f6d2f76692f74597162625273783844492f64656661756c742e6a7067\"></a></div>",
        "id": 244435307,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1625064649
    },
    {
        "content": "<p>starting in 3 minutes!</p>",
        "id": 244596708,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1625158686
    },
    {
        "content": "<p>During Lawrence Paulson's talk, there was a note in the chat (alas, I missed the poster's name):</p>\n<p>\"The Edinburg school (Rod Burstall-‪David Rydeheard‬-Tatsuya Hagino) has attempted intrinsic Computational Categorical Datatypes; and the school of Kosta Dosen goes farther with intrinsic Computational-Logic Categorical Datatypes with Sheafification (the MODOS proof-assistant). Have you reviewed these attempts?\"</p>\n<p>I'm familiar with the works of Burstall, Rydeheard and Hagino, but I've never heard of MODOS. Google was unhelpful, but for one cryptic page. Does anyone have a reference?</p>",
        "id": 244631955,
        "sender_full_name": "Rich Hilliard",
        "timestamp": 1625176697
    },
    {
        "content": "<p>I guess the cryptic page was <a href=\"https://en.everybodywiki.com/Modos\">this one</a>? There is this link to a <a href=\"https://github.com/1337777/cartier\">github repository</a> where there is a pdf (all pdfs there seem to be identical) giving some hints at what MODOS is. But it's not a real explanation. I guess if you can read Coq better than me you can get more out of it...</p>",
        "id": 244657693,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1625198663
    },
    {
        "content": "<p>Yes, that is the cryptic page and link to repository that I found. I've downloaded the Coq files for study ;-)</p>",
        "id": 244682937,
        "sender_full_name": "Rich Hilliard",
        "timestamp": 1625220783
    }
]