[
    {
        "content": "<p>Hello  <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>  <span class=\"user-mention\" data-user-id=\"275956\">@Duncan Mortimer</span>  <span class=\"user-mention\" data-user-id=\"277554\">@Toby Smithe</span>  and <span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span>. I'll move the discussion to a new stream, hope that works out fine.  I thought about moving this to <a class=\"stream\" data-stream-id=\"229111\" href=\"/#narrow/stream/229111-general\">#general</a>, but  people can more easily choose to subscribe or unsubscribe to streams than to topics. </p>\n<p>There actually is some work on category theory and cognitive neuroscience. <a href=\"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1000858\" title=\"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1000858\">Phillips  and  Wilson</a> explain systematicity of human cognition. Andrée Ehresmann built a <a href=\"https://www.researchgate.net/publication/267958477_MENS_an_Info-Computational_Model_for_Neuro-cognitive_Systems_Capable_of_Creativity\" title=\"https://www.researchgate.net/publication/267958477_MENS_an_Info-Computational_Model_for_Neuro-cognitive_Systems_Capable_of_Creativity\">bio-inspired model for higher level cognitive systems</a>, and Piaget <a href=\"https://www.karger.com/Article/Abstract/275811\" title=\"https://www.karger.com/Article/Abstract/275811\">worked on category theory in his later years</a>. There is also some work on autopoiesis by <a href=\"https://www.amazon.de/Principles-Biological-Autonomy-Francisco-Varela/dp/0135009502\" title=\"https://www.amazon.de/Principles-Biological-Autonomy-Francisco-Varela/dp/0135009502\">Varela</a> and <a href=\"https://www.researchgate.net/publication/301171417_A_Proposal_for_Combination_of_Category_Theory_and_l-Calculus_in_Formalization_of_Autopoiesis\" title=\"https://www.researchgate.net/publication/301171417_A_Proposal_for_Combination_of_Category_Theory_and_l-Calculus_in_Formalization_of_Autopoiesis\">Nomura</a>. I didn't work through all these papers and would be happy for some discussion as a motivation to do so. The Ehresmann model is something I'm interested in right now.</p>",
        "id": 193931393,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1586885522
    },
    {
        "content": "<p>One line of attack is to consider natural transformations as related to mental abstraction. Maybe the beauty of CT come's from the brain going to a low energy level when programmed with CT.</p>",
        "id": 193985411,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1586927081
    },
    {
        "content": "<p>I'm suggesting that CT might naively be modeling cognitive/neural structures creating a feeling of harmony and beauty. I study this from both directions. I have a background in psychology as well as computer science. I've been involved in brain wave experiments. I also got into yoga meditation fifty years ago to study meta-cognition.</p>",
        "id": 193986286,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1586928409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> , great survey paper on neuroscience! My favorite sections (from skimming) are \"Active Learning\" and \"Cost Funcitons That Approximate Properties of the World\". In \"Active Learning\" they discuss how a gradient may be optimally chosen in an unknown environment. One idea is to \"choose actions that will lead to the largest improvement in its prediction or data compression performance\".  Additionally they suggest priors or heuristics such as novelty, other people's attention or the organisms developmental state. </p>\n<p>The \"Properties of the World\" explores how statistical properties of the world may lead to specific properties of the nervous system. Olshausen and Field developed a model which employs a sparseness prior on the internal representation. When applied to natural images the learned feature detectors look a lot like receptive fields in the visual cortex.</p>\n<p><span class=\"user-mention\" data-user-id=\"276053\">@Brendan Fong</span>'s  Backprop as a functor is surly an exciting paper. I heard that <span class=\"user-mention\" data-user-id=\"276875\">@Bruno Gavranovic</span> is working in a similar direction. The \"lens pattern\" in general seems to pop up in a lot of situations.</p>",
        "id": 193995245,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1586937176
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276867\">Daniel Geisler</span> <a href=\"#narrow/stream/233925-neuroscience/topic/general/near/193986286\" title=\"#narrow/stream/233925-neuroscience/topic/general/near/193986286\">said</a>:</p>\n<blockquote>\n<p>I'm suggesting that CT might naively be modeling cognitive/neural structures creating a feeling of harmony and beauty. I study this from both directions. I have a background in psychology as well as computer science. I've been involved in brain wave experiments. I also got into yoga meditation fifty years ago to study meta-cognition.</p>\n</blockquote>\n<p>Schmidhuber developed <a href=\"http://people.idsia.ch/~juergen/sice2009.pdf\" title=\"http://people.idsia.ch/~juergen/sice2009.pdf\">a theory of subjective beaty</a> and couples it with curiosity. I would be very interested to couple these ideas with neurophenomenology a la Varela. \"Sleeping, dreaming and dying\" was an extraordinary attempt to relate subjective notions with hard science.</p>",
        "id": 193995780,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1586937550
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275946\">Johannes Drever</span> <a href=\"#narrow/stream/233925-neuroscience/topic/general/near/193995245\" title=\"#narrow/stream/233925-neuroscience/topic/general/near/193995245\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276053\">Brendan Fong</span>'s  Backprop as a functor is surly an exciting paper. I heard that <span class=\"user-mention silent\" data-user-id=\"276875\">Bruno Gavranovic</span> is working in a similar direction. The \"lens pattern\" in general seems to pop up in a lot of situations.</p>\n</blockquote>\n<p>Yes - I'm working in a direction relying heavily on a generalization of Lenses called Optics to model these bidirectional data transformers that could be said to have <em>agency</em>. The idea is to yeah, use this \"lens pattern\" to talk about bidirectional data transformation with \"one extra leg\" which accounts for the internal state of these learners. See <a href=\"http://events.cs.bham.ac.uk/syco/strings3-syco5/papers/dalrymple.pdf\" title=\"http://events.cs.bham.ac.uk/syco/strings3-syco5/papers/dalrymple.pdf\">http://events.cs.bham.ac.uk/syco/strings3-syco5/papers/dalrymple.pdf</a> for a good intro</p>",
        "id": 194004251,
        "sender_full_name": "Bruno Gavranović",
        "timestamp": 1586942728
    },
    {
        "content": "<p>So I'm currently working in a similar direction to Bruno, formalising the \"free energy\" framework of Karl Friston in terms of optics / open games. In December, Jules Hedges and I proved that Bayesian updates compose optically (I'm working on a note on that today), and that's at the heart of Friston's work (aka. \"active inference\"). That note should be on arXiv soon, and my active inference work should be not long after that..</p>\n<p>But active inference is not so much about neuroscience itself, although Friston's model has some nice parallels with neurological structures. I think CT also has plenty to contribute in \"hard\" neuroscience, further away from where it intersects with machine learning.</p>",
        "id": 194004252,
        "sender_full_name": "Toby Smithe",
        "timestamp": 1586942728
    },
    {
        "content": "<p>Hi Bruno! :)</p>",
        "id": 194004276,
        "sender_full_name": "Toby Smithe",
        "timestamp": 1586942743
    },
    {
        "content": "<p>Hi Toby :)</p>",
        "id": 194004290,
        "sender_full_name": "Bruno Gavranović",
        "timestamp": 1586942756
    },
    {
        "content": "<blockquote>\n<p>Schmidhuber developed a theory of subjective beaty and couples it with curiosity. I would be very interested to couple these ideas with neurophenomenology a la Varela.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"275946\">@Johannes Drever</span> Do you know Camilo Signorelli? He's a friend of mine in Oxford and is also interested in such things, I think.</p>\n<blockquote>\n<p>These works remind me of Robert Rosen's limited success in applying category theory to biology. It's a start, but not by much. That's a good thing if you want to come up with a better theory, of course.</p>\n</blockquote>\n<p>I'm with <span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> on these works [eg MENS], which I think are too far removed from the domain-specific ideas that have been developed by people actually modelling brains (in as much detail as possible). I'm sure it might be possible to reverse-engineer those structures from abstract ones, but such an approach seems rather 'dual' to the usual \"rising sea\"; call it \"falling sea\", perhaps...</p>",
        "id": 194006376,
        "sender_full_name": "Toby Smithe",
        "timestamp": 1586943974
    },
    {
        "content": "<p>Hi Toby, good to hear that you are working on something similar and that there is quite some activity in this direction. Active inference is something I wanted to look into for a long time. Friston <a href=\"https://www.sciencedirect.com/science/article/pii/S0149763416301336\" title=\"https://www.sciencedirect.com/science/article/pii/S0149763416301336\">relates it to artificial curiosity quite explicitly</a>. I don't know Camilo, but the whole Oxford-group looks pretty amazing.</p>\n<p>I see the point that specific principles lend themselves more towards being cast into an algorithm, which may then be related to a neural substrate. But I also think the dual view of thinking about abstract patterns is very interesting. In the end that is what our brains are really good at, and we want to know the difference which makes a difference, so to say.</p>",
        "id": 194009395,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1586945781
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277554\">Toby Smithe</span> </p>\n<blockquote>\n<p>Could you direct me a few groups or individuals that may be actively researching on this aspect (hard neuroscience). I wish to get initiated into cognitive neuroscience and I really hope to use CT as a tool, I've noted the works of Brown and Porter, A. Ehresmann and Ramirez.</p>\n</blockquote>",
        "id": 203046961,
        "sender_full_name": "Nivedita",
        "timestamp": 1594073557
    }
]