[
    {
        "content": "<p>OK, I'm out of the retreat.  The week after the retreat I had extremely limited internet service, so I couldn't respond then either, but now I can respond.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Freelance.20ACT/near/456289945\">said</a>:</p>\n<blockquote>\n<p>Like, you are putting together many things different people did talk about, but the narrative seems entirely yours, especially re restricting access to ACT <em>a la</em> AGI doomers. I don't agree with that and I have never heard anybody else talking about it.</p>\n</blockquote>\n<p>I think it's pretty clear that I was <strong>not</strong> advocating restricting access to ACT on my webpage.  I was merely saying that \"it might seem reasonable\" to do this.  And I didn't attribute this attitude of \"it might seem reasonable\" to the ACT community.  In fact, right afterwards I explain why the ACT community <strong>doesn't</strong> hold this attitude.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Freelance.20ACT/near/456290048\">said</a>:</p>\n<blockquote>\n<p>Instead, I've heard (and I share) other's people concerns that this might harm the perception of the ACT community, and that you shouldn't entitle yourself to zeitgeist interpreter.</p>\n</blockquote>\n<p>The idea that one needs a \"title\" to interpret the zeitgeist of a community they are part of is new to me.  I figured anyone in a community would be able to interpret the zeitgeist of that community.  But it seems that you and many others on this thread think that one needs a \"title\" to do this.  What do you think the process should be by means of which one gets such a title?  I'd like to get that title as I think I'd be good for the role.</p>\n<p>Also, I'm obviously not claiming to be the sole \"zeitgeist interpreter\".  I'd be happy to see anybody else's take on the ACT community zeitgeist.  (Of course, if there's a titling process involved they would also have to get the title.)</p>",
        "id": 463551388,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1724116050
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Freelance.20ACT/near/463551388\">said</a>:</p>\n<blockquote>\n<p>I think it's pretty clear that I was <strong>not</strong> advocating restricting access to ACT on my webpage</p>\n</blockquote>\n<p>The whole section 'A secret society?' reads very suggestive of this eventuality. If you don't want to advocate for that, just remove it then, or explain why you bring it up in the first place (BTW, afaik Grothendieck never advocated for maths to be done in secrecy). Wouldn't it be very suspicious if I added a page on my blog titled 'Shall we euthanize all pets?' starting with 'It might seems reasonable, some even did it, but most people think it's not a good idea'. I doubt readers will think I'm not even considering the idea lol.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Freelance.20ACT/near/463551388\">said</a>:</p>\n<blockquote>\n<p>The idea that one needs a \"title\" to interpret the zeitgeist of a community they are part of is new to me. I figured anyone in a community would be able to interpret the zeitgeist of that community. But it seems that you and many others on this thread think that one needs a \"title\" to do this. What do you think the process should be by means of which one gets such a title? I'd like to get that title as I think I'd be good for the role</p>\n</blockquote>\n<p>There's no title! No one is entitled to this. A senior person might go out and say 'talking with the community, I feel that'---which, btw is fine for <em>anyone</em> to say!---but (in my, admittedly, short experience) I have never heard of anyone going out and say 'here's what people think'. Just don't do that.</p>",
        "id": 463615014,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1724138128
    },
    {
        "content": "<blockquote>\n<p>I'd like to get that title as I think I'd be good for the role.</p>\n</blockquote>\n<p>I jaw-dropped at how you fail to realize how entitled this sounds, and what is worse is that it's said in absolute good faith. It feels like you don't understand the idea that being bestowed with \"the role\" is not up to you, but up to the community.<br>\nIt feels like the idea that people with \"the role\" have been given the privilege to speak on behalf of the community <em>because they proved to be extremely good</em> is totally alien to you. </p>\n<p>And (to me, this is the worst of all) it feels like you have an unshakable faith in what's your importance in the grand scheme of things [which -breaking news- is <em>exactly zero</em>, like mine and that of the vast majority of people here]:</p>\n<blockquote>\n<p>The idea that one needs a \"title\" to interpret the zeitgeist of a community they are part of is new to me.</p>\n</blockquote>\n<p>Most of the times, this attitude is the consequence of \"you can be anything you want to be\" parenting style... I <em>suspect</em> you grew up in an environment that has not even once curbed your enthusiasm or made you reflect about your shortcomings, without really engaging with ideas that are bigger than you to the point of giving you a tangible, almost physical, sense of insignificance, and this is the byproduct of that? You act and talk like scientific credibility is blanketly given, that it shouldn't be <em>earned</em> as a consequence of proving one's worth. Or probably you're intoxicated by the belief that you're as worth as your passion and determination: results don't matter (\"and why would they?!\" -surprise: they're <em>the only thing that matters</em> in math), and you can take the stage about whatever you're passionate about, just because it's something you enjoy, and something you feel a calling for. Let me put it mildly: I find this attitude abhorrent. It enables mediocrity; it doesn't just \"lower the bar\", it removes the bar altogether.</p>\n<p>But you want to know how to become a <em>zeitgeister</em>. I have no idea, let me reiterate: I'm also irrelevant in the grand scheme of things. But usually a good rule of thumb to tell if someone is fit for \"the role\" to zoom out and interpret where a community is going, or should go, is that they immensely contributed to its development, outreach and discoveries. So, I think the best approach is:</p>\n<ol>\n<li>work for 50 years in the field you want to be part of, shaping it and seeing it change, and keep track of where it goes</li>\n<li>open groundbreaking research paths, inspiring a large part of your community for years to come</li>\n<li>dis/prove an important open problem in your field changing the paradigm with which the object of your study is regarded</li>\n<li>create a network of connections with the Gotha of researchers in your field, so that you're in contact with a <em>heterogeneous</em> set of beliefs </li>\n<li>try to distil a set of common themes, inspiring the work of your peers, that even they are unaware of</li>\n</ol>\n<p>I hope you can agree with me that 1. and 5. can only be done in retrospective, looking at an outstandingly stellar career punctuated by success. 2. and 3. can be done if you're <em>damn good</em> at your job.  4. is also something that stretches aaaall alooooong one's career.</p>\n<p><em>Probably</em> Lawvere ticks all the boxes. </p>\n<p>You, on the other hand, you're an internet rando who goes to ayahuasca rituals  and believes that since he once spoke with John Doe and keeps Grothendieck's tongue in a religuary, can interpret the zeitgeist of category theory. [Interpret this as an ad hominem, or don't; warn me, ban me, or don't; I don't care, at this point I'm very tired of this shit.]</p>",
        "id": 463616491,
        "sender_full_name": "fosco",
        "timestamp": 1724138656
    },
    {
        "content": "<p>PS: I didnt mention that some giants of a certain field sometimes <em>try</em> to interpret the zeitgeist... and then no one listens. </p>\n<p>But I think this is another story, also beyond the point, the point being: you should feel free to do whatever you want with your time, find the universal property of Surah 19, set up a seance to speak with Grothendieck's ghost... but you shouldn't believe that just because you exist and you're passionate, you're worth listening to. This is for the community to decide, and it's usually done <em>after you say something worth listening to</em>.<br>\nThe fact that someone can be unshakably convinced of the contrary, is profoundly irksome to me.</p>",
        "id": 463617400,
        "sender_full_name": "fosco",
        "timestamp": 1724138962
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Freelance.20ACT/near/463616491\">said</a>:</p>\n<blockquote>\n<p>Most of the times, this attitude is the consequence of \"you can be anything you want to be\" parenting style... I <em>suspect</em> you grew up in an environment that has not even once curbed your enthusiasm or made you reflect about your shortcomings, without really engaging with ideas that are bigger than you to the point of giving you a tangible, almost physical, sense of insignificance, and this is the byproduct of that? </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> Please do not speculate about people's personal lives and background and insult people based on it. Saying that someone is \"irrelevant\" and has an \"abhorrent\" attitude is not constructive or appropriate for this Zulip. This is absolutely a warning.</p>",
        "id": 463629829,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1724142424
    },
    {
        "content": "<p>I am not going to cooperate to this farce. Ban me altogether, it's way less painstaking and you'll save time and bile.</p>",
        "id": 463633474,
        "sender_full_name": "fosco",
        "timestamp": 1724143587
    },
    {
        "content": "<p>I feel that the rest of your message, in particular your list of how the best way to become a spokesperson of a community is to contribute extensively to that community and the fact that being passionate isn't enough to speak authoritatively about something, had a lot of value. You only have to contain the impulse to insult or dismiss someone who holds opinions you think are absurd.</p>",
        "id": 463634918,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1724143862
    },
    {
        "content": "<p>I think this discussion has upset too many people too many times. Let's all stop posting here now. If zulip had the ability to lock a thread, I would lock this. Please respect that this is a moderator decision, and let's move on with our lives.</p>",
        "id": 463638189,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1724144419
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span> has marked this topic as resolved.</p>",
        "id": 463638213,
        "sender_full_name": "Notification Bot",
        "timestamp": 1724144422
    }
]