[
    {
        "content": "<p>Naturalness in Category Theory is a difficult notion to pin down. Here is some discussion about naturalness:</p>\n<p><a href=\"https://golem.ph.utexas.edu/category/2008/01/mark_weber_on_nerves_of_catego.html\">https://golem.ph.utexas.edu/category/2008/01/mark_weber_on_nerves_of_catego.html</a></p>\n<p>I try to study and generate applications of Category Theory to the natural world. I believe that naturalness has been a guiding principle in my work over the years. Another principle that has guided me is Occams's razor. I get the feeling they may be related, but I have never seen this written about. Does anyone have any thoughts on this?</p>\n<p>I have been developing ideas about science couched in the language of monads. They seemed rather natural to me. I am now discovering sketches, but have a very limited understanding of both of these. They both seem like a way to have natural presentations of theories or analysis of ideas. Is one more natural than the other? I feel that monads are more natural, but that might just be because I don't understand sketches very well. I think monads are more natural because there is this effect that, when you are looking for a given monad, it may only exist on a particular category. It forces you to accept the particular site where everything that ought to be true, is true. Cleverness, or brittle constructions are not as useful.</p>\n<p>I suppose the counter argument could be made that sketches work by choosing the kinds of limits you are going to use and then you can achieve various presentations of theories given that kind of limits you chose. So, you work in the universe or logic of particular limits and all things that ought to be true with those limits are true.</p>",
        "id": 204307555,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1595090370
    },
    {
        "content": "<p>What are you reading to learn about sketches?</p>",
        "id": 204318259,
        "sender_full_name": "Simon Burton",
        "timestamp": 1595107073
    },
    {
        "content": "<p>Hi Simon,</p>\n<p>I started with Adamek's text Locally Presentable and Accessible Categories.  Then I read a bit of Joyal, Toposes, Triples Theories.  Then I read Hyland \"Lawvere Theories and Monads\".  Then I was working with a talented mathematician to find a natural notion of science experiments with sketches, which failed.</p>",
        "id": 204356189,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1595172954
    },
    {
        "content": "<p>I talk regularly with James Dolan, who does a lot with locally presentable categories.... These are like categorified presentations for a ring, or \"theories\" as you say. I should have another look at the TTT book..</p>",
        "id": 204356600,
        "sender_full_name": "Simon Burton",
        "timestamp": 1595173606
    }
]