[
    {
        "content": "<p>The following was posted by Clara Michelle Barker on LinkedIn, and a friend suggested I post it to this Zulip, which seemed to me like a good idea. Note that it is specifically targeted at people living in the UK.</p>\n<blockquote>\n<p>Hi everyone,<br>\nWe are still recruiting for people living in the UK for our project. We are looking to hear from LGBTQI+ people who have felt they needed to change/pivot their careers in STEM due to a hostile environment - but how you define this is up to you. <br>\nDid you shift from academia to industry or vice versa, or maybe move into comms or teaching when you didn't want / plan to?<br>\nWas this because of a hostile environment/ bullying/ discrimination/ generally grim working environment?<br>\nWe want to hear your story. (I would love to hear this from other countries also but the funding is for the UK study!)</p>\n</blockquote>\n<blockquote>\n<p>This happened to me, so I care. Honestly, the reason I 'quit' STEM academic research was the fear of the reaction when I came out as trans. I've talked about this (notably my TEDxLondon talk). I did have some negative reaction but on the whole it was much better than I expected. But it still meant I stopped publishing results and invested to move to another field. A lot of this was due to the discrimination I did have but also the lack of role models feeding my assumptions. I know this has not gone away. </p>\n</blockquote>\n<blockquote>\n<p>It was luck/fate that led me to apply for the lab manager post in my current group. But still, I moved from research into lab management because of the environment - I didn't want to become a lab manager. Nothing wrong with the position at all - we need more technicians! But wasn't the career route I wanted. <br>\nAs it happens, it was an amazing move for me and thanks to the support of my supervisors, department and the Daphne Jackson Trust/Royal Society of Chemistry I was able to get back to my passion - academic research. <br>\nSo yes, I never left STEM but I didn't take the easiest route and it is down to some amazing people and organisations that I am now back where I want to be.</p>\n</blockquote>\n<blockquote>\n<p>If you have a story to share, we want to hear it. You will be totally anonymous, and there is a small compensation for your time. <a href=\"https://usd.qualtrics.com/jfe/form/SV_9F7HmRIfTat9CtM\">https://usd.qualtrics.com/jfe/form/SV_9F7HmRIfTat9CtM</a></p>\n</blockquote>",
        "id": 473695276,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1727695989
    }
]