[
    {
        "content": "<p>Or perhaps I should say \"am a-historical view of CT\". I am a big fan of the books <a href=\"https://www.wiley.com/en-us/Post+Modern+Algebra-p-9780471127383\">Post-modern algebra</a> and [Practical Foundations of Mathematics[(<a href=\"https://www.amazon.ca/Practical-Foundations-Mathematics-Paul-Taylor/dp/0521631076\">https://www.amazon.ca/Practical-Foundations-Mathematics-Paul-Taylor/dp/0521631076</a>) because they both take a global, informed by as much current knowledge as possible, view of their respective topics -- and throw out as much historical baggage as possible.  A lot of mathematical exposition is heavily weighed down by what was previously thought as important (rightly or wrongly), and it is rare to see books free themselves from those shackles.</p>\n<p>So on to a question: what would that approach to category theory give?</p>\n<p>I think one can see glimpses of that in <a href=\"https://arxiv.org/abs/1803.05316\">Seven Sketches in Compositionality</a>. By this I mean that the topics covered don't correspond to classical textbook approaches to what the important topics are.</p>\n<p>I do understand that CT is still quite rapidly evolving, so that asking about the now-view is not likely to yield a roadmap that will necessarily survive the test of time. Nevertheless, I think it would give an interesting snapshot.</p>\n<p>Even though I do have my own view of what that is, I won't give it here, as that could immediately derail the conversation into a discussion of the many ways that view is wrong [perhaps quite legitimately so] without giving others a change to give their view.</p>",
        "id": 209182649,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599318968
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229111-general/topic/Category.20Theory.20from.20the.20point.20of.20view.20of.20'now'/near/209182649\">said</a>:</p>\n<blockquote>\n<p>they both take a global, informed by as much current knowledge as possible, view of their respective topics -- and throw out as much historical baggage as possible.</p>\n</blockquote>\n<p>Almost certainly the most well-known, classic category theory textbook is Mac Lane's <em>Categories for the Working Mathematician</em>, which was published as recently as 1978. While there is some homological algebra motivation mentioned in it, it would be hard to accuse it of being weighed down with historical baggage, not least because there has been less than fifty years for any baggage to accumulate, and also because the recent explosion (or noticeable increase, at least) in interest in category theory in its own right is rather recent. I use concepts and results present there on a daily basis in my research! But perhaps one could afford to throw out some of the formality and any results that aren't directly involved in the applications that one wants to present, for a more narrative-driven textbook?</p>",
        "id": 209185641,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599323612
    },
    {
        "content": "<p>It's also a matter of emphasis. I get the feeling that (co)ends are turning out to be quite a bit more important than originally foreseen, so the material on them could be more substantial, for example.</p>",
        "id": 209185928,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324052
    },
    {
        "content": "<p>But also there is the issue of motivation. The definition of a category is usually given as if it arose magically. But now we understand that it arises 'naturally' from iodification of monoids.</p>",
        "id": 209186000,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324176
    },
    {
        "content": "<p>Isn't that just displacing the magic? <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span> I personally don't find that a natural way to introduce categories, although it's a perfectly valid description of them.</p>",
        "id": 209186183,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599324460
    },
    {
        "content": "<p>The same is true for the definition of functor and natural transformation. A functor is nothing but the obvious 'homomorphism' for categories. Once you see the definition of a category in the dependently typed setting, and understand generalized algebraic theories, functor really is just homomorphism. That view is (to me!) way more enlightening that any that says \"here is some data and some axioms the data must satisfy\".</p>\n<p>Natural transformations also tend to be presented in this style, and as they then appear to be quite mysterious, a lot of examples have to be given [which is a good thing...].  But at some level, natural transformations are not mysterious: they are 'just' homomorphisms of functors. Unwinding that does take some work, but when you do, you find out that the definition of natural transformation is 'inevitable'.</p>\n<p>As bonus, you now know how to get 'modification'. The mystery is gone, you have a systematic process.</p>",
        "id": 209186184,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324466
    },
    {
        "content": "<p>It does move the magic. But the generalization from \"on a point\" to \"a typed arrow\" lets you see that there are going to be other ways of doing it.</p>",
        "id": 209186265,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324548
    },
    {
        "content": "<p>I'm surprised you think that \"homomorphism of categories\" is <em>not</em> the usual intuition given for functors. I would have imagined that to anyone who had seen any other algebraic structure and its homomorphisms, the definition of functor would appear entirely natural.</p>",
        "id": 209186334,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599324618
    },
    {
        "content": "<p>For example, one can see that the usual n-categories, via globular sets, arise from doing the same oidification over and over.</p>\n<p>But you can see that this isn't the only way to go. You can oidify transversally in the next step, and get double categories instead!</p>",
        "id": 209186357,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> But it's not usually <strong>written down</strong> as being such in textbooks!  That should be regarded as a criminal pedagogical error. [Some textbooks do say so. Not enough.]</p>",
        "id": 209186416,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324725
    },
    {
        "content": "<p>It seems counterintuitive to me to introduce a huge pile of things - the collections of models of general theories - that will eventually fit into categories before you introduce the notion of category. If you're starting from the assumption that people have encountered monoids or groups before, you immediately have a motivating example of a category to hand, and then the formal definition isn't so mysterious.</p>",
        "id": 209186430,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599324772
    },
    {
        "content": "<p>I think I've only ever seen natural transformations described as functor homomoprhisms once, and only in a rather recent textbook.</p>",
        "id": 209186433,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324778
    },
    {
        "content": "<p>Perhaps it's an issue with prerequisites. I think several textbooks start with categories, and therefore \"homomorphism\" has not even been defined.</p>",
        "id": 209186434,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599324780
    },
    {
        "content": "<p>(This is essentially the same point <span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> makes.)</p>",
        "id": 209186445,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599324827
    },
    {
        "content": "<p>The textbooks that I pointed to at the start of this thread deal with that: they start 'several steps back' from the material they really want to cover, to give the prerequisites they need/want, in the proper way.</p>",
        "id": 209186494,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324889
    },
    {
        "content": "<p>And, of course, I would not want an introductory textbook to talk about globular sets early on. What I'm looking for is an introductory textbook that is written from the point of view of where it eventually all has to end up.</p>",
        "id": 209186510,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599324949
    },
    {
        "content": "<p>If a textbook has defined monoids and monoid homomorphisms, I agree functor should be explained as a category homomorphism explicitly. (Interestingly, pseudofunctors used frequently to be called simply \"homomorphisms of bicategories\".)</p>",
        "id": 209186516,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599324961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229111-general/topic/Category.20Theory.20from.20the.20point.20of.20view.20of.20'now'/near/209186416\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> But it's not usually <strong>written down</strong> as being such in textbooks!  That should be regarded as a criminal pedagogical error. [Some textbooks do say so. Not enough.]</p>\n</blockquote>\n<p>I first encountered categories in my first year of undergrad in a tiny subsection of Bert Mendelson's <em>Introduction to Topology</em>. Funnily enough, even though he has access to all sorts of metric and topological spaces to use as examples by this point in the book, Mendelson goes to the trouble of defining groups and group homomorphisms in order to provide another example and to enable him to present functors as the analogous concept of homomorphisms for categories!<br>\nThat tiny subsection blew my mind. I haven't recovered since. <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span></p>",
        "id": 209186659,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599325152
    },
    {
        "content": "<p>I guess the question could be asked as: if we know what the 'best' explanation for certain concepts is (from the point of view of 'now', which includes ideas such as various flavours of infinity-categories, double categories, mutl- and poly-categories, polynomial functors, species, generalized algebraic theories, internal languages of categories, etc, etc), how would we write up category theory?</p>",
        "id": 209186674,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599325183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span> this is hard because category theory is BIG, much bigger than it might seem through this community. It's like asking for a write-up of \"geometry\" or \"number theory\". This is not an exaggeration.</p>",
        "id": 209186855,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599325437
    },
    {
        "content": "<p>Each branch could feasibly take a different slant on how categories are presented and on which part of the theory is built up! (I know this is not a constructive contribution; Seven Sketches does a pretty good job, after all, but it would need a LOT more chapters to plumb the depths of modern category theory.)</p>",
        "id": 209186928,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599325537
    },
    {
        "content": "<blockquote>\n<p>if we know what the 'best' explanation for certain concepts is</p>\n</blockquote>\n<p>I also think it becomes unclear what the most natural explanation for certain concepts is, even quite early on. For instance, the notion of \"cocomplete category\" is a subtle notion when viewed through the lens of formal category theory (which is arguably the most natural way to present many category theoretic concepts).</p>",
        "id": 209187541,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599326544
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> I'm not asking for a write-up of all of CT, that's much too huge, I agree. Rather, a view of \"basic\" CT, that is informed by as much of modern CT as possible, where \"basic\" is allowed to be re-defined. And the pre-requisites for an appropriate understanding can come along for the ride (so monoid, partial orders, sub-singletons, and many things I'm surely missing).</p>",
        "id": 209189296,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599329441
    },
    {
        "content": "<p>For example, it seems that both indexed categories and fibrations (I know they are intimately related) are very important, but neither are in MacLane.  Perhaps factorization systems too?</p>",
        "id": 209189525,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1599329822
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/LaTeX.20support/near/209193499\">said</a>:</p>\n<blockquote>\n<p>I spend a lot of time getting students used to mindblowing ideas like \"functors are morphisms in the category of all categories\", which tends to blow their mental fuses at first, because these \"level shifts\" are crucial in category theory.</p>\n</blockquote>\n<p>This sounds relevant given the previous ideas in this topic.</p>",
        "id": 209195183,
        "sender_full_name": "James Wood",
        "timestamp": 1599338627
    },
    {
        "content": "<p>I think a good introduction to category theory gives out many intuitions about them, not just one. What works best for a person doesn't really work for another, so giving differen povs helps. Plus, having many perspectives always comes in handy when thinking about a categorical situation (though this is a more general phenomenon, I guess)</p>",
        "id": 209297679,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1599486593
    },
    {
        "content": "<p>So, is there historical baggage at all? Can you get to such if you just read an introduction? What are some examples.<br>\nCan a group theory 101 book from 1940 do very wrong in that sense?</p>",
        "id": 209317629,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1599501581
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281274\">@Nikolaj Kuntner</span> I was taught my first group theory course by, IIRC, someone who worked in the finite group classification crowd. There were no universal properties of quotients or kernels, quotients were only defined via a very specific construction, and one went to great pains to deal with things that are isomorphic to a quotient, or how an 1-1 homomorphism made its domain isomorphic to its image. And the idea that a subgroup has an inclusion homomorphism is completely omitted. Permutation groups were defined via symbols, not as automorphisms of a given (finite) set. In hindsight, it was terrible. I was trying to work with a student who had an updated version of the same course (my lecturer long since retired), and do a project on algebra had to train him out of the mindset it had induced in him.</p>",
        "id": 209346548,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1599542060
    },
    {
        "content": "<p>It was completely antithetical to the modern EGA/Grothendieck school view of commutative algebra (where \"canonical\" isomorphisms are literally written as equalities and treated as such).</p>",
        "id": 209346593,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1599542157
    },
    {
        "content": "<p>Felix Klein talks about the \"new\" abstract definition of a group in his lectures about 19th century mathematics. After giving the modern definition of a group, he writes:<br>\n\"Thus appeal to the imagination has receded, and the logical skeleton has been laid bare -- a tendency to which we will often return as this lecture goes on. This abstract formulation is excellent, but it is not at all directed to the discovery of new ideas and methods; rather, it represents the conclusion of a preceding development. Hence it greatly facilitates instruction, insofar as one can use it to give complete and simple proofs of known theorems. On the other hand, it makes the subject much more difficult for the learner, for he is faced with a closed system, not knowing how these definitions were arrived at, and absolutely nothing is presented to his imagination. In any case, the method has the drawback that it does not stimulate thought; one has only to be alert not to transgess the four given commandments.\"<br>\n[Felix Klein, Development of Mathematics in the 19th Century, translated from german by M. Ackerman]</p>\n<p>I think that this issue that Klein talks about in 1926 is still very relevant. Do you take the \"shortcut\" and use the completely axiomatic approach, or do you go through all the work of looking at the original motivation, the most important examples, etc. One extreme would be to prove the Sylow theorems before you've seen any examples of groups outside of group theory. The other extreme would be to study Galois theory before giving the definition of a group.</p>",
        "id": 209358096,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1599553608
    },
    {
        "content": "<p>There is a spectrum of \"important examples\"- from a central example that people are trying to gain any grasp over, which perhaps motivated the theory in the first place, through simple special cases in a family which is not yet understood, to examples that are important because they provide a basic structural components of an almost completely understood theory.</p>\n<p>The first case are a rarity in teaching resources (textbooks, courses) because they tend to only exist in such isolation at the beginning of a research project. For the second case, I could be thinking about elliptic curves, where we see the same particular cubic functions sketched as examples in most introductory courses. And in the last case, in order to understand the classification of finitely generated abelian groups, I only need to know what a cyclic group is; the rest (products etc) consists of abstract constructions, and any other specific concrete examples are optional (which gives the author/lecturer space to focus on the applications they are interested in). The trouble is that anything near the start of this spectrum eventually becomes historical baggage to later observers, once the theory has developed enough for the motivating problems to be solved and sink away from the cutting edge of research, while anything too near the end \"does not stimulate thought\", as Klein puts it.</p>\n<p>Ultimately any concept is only important because someone at some point in history convinced the community that it was interesting, or because a significant problem was solved using it. The balancing act in writing a text that will withstand the test of time is in choosing examples along the spectrum, so that the results one chooses to present are motivated but not dominated by them.</p>",
        "id": 209371039,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599562725
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229111-general/topic/Category.20Theory.20from.20the.20point.20of.20view.20of.20'now'/near/209186357\">said</a>:</p>\n<blockquote>\n<p>For example, one can see that the usual n-categories, via globular sets, arise from doing the same oidification over and over.</p>\n<p>But you can see that this isn't the only way to go. You can oidify transversally in the next step, and get double categories instead!</p>\n</blockquote>\n<p>Interesting I just came across oidification reading a <a href=\"https://twitter.com/DavidCorfield8/status/1305062268019847168\">Tweet thread in which David Corfield brought these</a> up in relation to modal logics linking to <a href=\"https://ncatlab.org/nlab/show/horizontal+categorification\">horizontal categorification</a>.</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/DavidCorfield8/status/1305062268019847168\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1032571126520668160/J9W0r3KE_normal.jpg\"></a><p><a href=\"https://twitter.com/johncarlosbaez\">@johncarlosbaez</a> <a href=\"https://twitter.com/evanewashington\">@evanewashington</a> The first I heard of this idea was from John in Minneapolis in 2004: <a href=\"https://t.co/CHRleWLEhC\">https://math.ucr.edu/home/baez/IMA/</a>. There were glimpses there of what Mike Shulman later developed:\n<a href=\"https://t.co/YSrFWQ5kJV\">https://golem.ph.utexas.edu/category/2018/04/what_is_an_ntheory.html</a>. See from \"To conclude, let me say a bit about how this project relates to modal logic...\"</p><span>- David Corfield (@DavidCorfield8)</span></div></div>",
        "id": 209927883,
        "sender_full_name": "Henry Story",
        "timestamp": 1599998663
    },
    {
        "content": "<p>I was trying to see if I could get some insight into this by following up on the <a href=\"https://ncatlab.org/nlab/show/single-sorted+definition+of+a+category\">single-sorted definition of a category</a> which starts with only morphisms.  At the end of that article is says that there \"are single sorted definitions of n-categories\". Anyone have any pointers to those? <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi><mo>∈</mo><mo stretchy=\"false\">{</mo><mn>2</mn><mo separator=\"true\">,</mo><mn>3</mn><mo separator=\"true\">,</mo><mn>4</mn><mo stretchy=\"false\">}</mo></mrow><annotation encoding=\"application/x-tex\"> n \\in \\{2,3,4\\}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mord mathnormal\">n</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">{</span><span class=\"mord\">2</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">3</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">4</span><span class=\"mclose\">}</span></span></span></span> would be good enough for me :-)</p>",
        "id": 209927983,
        "sender_full_name": "Henry Story",
        "timestamp": 1599998835
    },
    {
        "content": "<p>Richard Steiner uses the single-sorted definition of omega-category in his articles. See for example Definition 2.1 in <a href=\"https://projecteuclid.org/euclid.hha/1139839551\">this one</a>. If you want n-categories, you just have to put an upper bound on the indices.</p>",
        "id": 209932974,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1600005724
    }
]