[
    {
        "content": "<p>Is there some resource online somewhere that lists useful properties of certain often-used categories?<br>\nI imagine it would be Wiki-like and have a page for each common category and then a list (possibly with references) of properties that category has.<br>\nLike, for Sets it would say it is complete, cocomplete, is a topos, every mono splits, etc.</p>",
        "id": 206688979,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597236602
    },
    {
        "content": "<p>I once saw an attempt at making such a Wiki, but it didn't take off. I do keep seeing people ask for such a thing though, so there's clearly demand for it.</p>",
        "id": 206689233,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1597236764
    },
    {
        "content": "<p>Could the same thing be accomplished by adding more information to the nLab?</p>",
        "id": 206689258,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1597236788
    },
    {
        "content": "<p>I think so</p>",
        "id": 206689570,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597236969
    },
    {
        "content": "<p>nlab has a page for the category of Sets for instance <a href=\"https://ncatlab.org/nlab/show/Set\">https://ncatlab.org/nlab/show/Set</a></p>",
        "id": 206689714,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597237080
    },
    {
        "content": "<p>But it doesn't mention a lot of properties beyond the topos-theoretic</p>",
        "id": 206689799,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597237106
    },
    {
        "content": "<p>A different resource that might be useful to quickly find counter-examples would be something like <a href=\"https://topology.jdabbs.com/\">https://topology.jdabbs.com/</a> but for categories.</p>",
        "id": 206690132,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597237280
    },
    {
        "content": "<p>I agree that probably the easiest way to do it is to add information on an existing structure such as the nlab. I actually don't know much of how to edit it, but maybe it is possible to create a page or a category \"dictionary of commonly used categories\" with references to individual pages for each of the categories. I guess if anyone do this, it would be best to come up with a page which has already substantial content, so that the added value is obvious and there is no risk for the page to get deleted. Maybe here would be a good place to browse some ideas for such a page/write a draft?</p>",
        "id": 206796851,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1597312004
    },
    {
        "content": "<p>See also: <a href=\"https://mathoverflow.net/questions/68442/what-could-be-some-potentially-useful-mathematical-databases\">https://mathoverflow.net/questions/68442/what-could-be-some-potentially-useful-mathematical-databases</a></p>",
        "id": 206797275,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1597312428
    },
    {
        "content": "<p>There are <em>many</em> subjects that would benefit from a database like this, and very few that actually have one</p>",
        "id": 206797347,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1597312457
    },
    {
        "content": "<p>The nLab has a very confusingly named page <a href=\"https://ncatlab.org/nlab/all_pages/category\">Category — category</a>.</p>",
        "id": 206797528,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1597312599
    },
    {
        "content": "<p>That lists all the categories that nLab has pages about.</p>",
        "id": 206797578,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1597312659
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276945\">Oscar Cunningham</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/206797528\">said</a>:</p>\n<blockquote>\n<p>The nLab has a very confusingly named page <a href=\"https://ncatlab.org/nlab/all_pages/category\">Category — category</a>.</p>\n</blockquote>\n<p>That looks a bit like what I had in mind, maybe that could be a good start. I agree that the name of the page is pretty terrible, and I think these should be sorted in different sections instead of being just a big list. Maybe a also a one sentence description following each of the links would make the page a little more friendly</p>",
        "id": 206799308,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1597314121
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/206797347\">said</a>:</p>\n<blockquote>\n<p>There are <em>many</em> subjects that would benefit from a database like this, and very few that actually have one</p>\n</blockquote>\n<p>Unfortunately, it seems that there is very little we can do about it, I don't believe anyone has enough influence to start a project that would reach to every community. But as a community, we can do our best to maintain such a database, and hope that will inspire other community to create maintain such resources, possibly at the same place - that's why I believe taking advantage of the nlab is also great, the more centralized the information is, the easier it is to find it</p>",
        "id": 206799936,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1597314609
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276945\">Oscar Cunningham</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/206797528\">said</a>:</p>\n<blockquote>\n<p>The nLab has a very confusingly named page <a href=\"https://ncatlab.org/nlab/all_pages/category\">Category — category</a>.</p>\n</blockquote>\n<p>Yeah, wikis of this sort have \"categories\"  - you can put any page in some category X just by writing </p>\n<p>category: X</p>\n<p>at the bottom of the page  And if someone sees this at the bottom of the page, and clicks on it, they go to the automatically-created the wiki page listing all pages in that category, which is naturally called </p>\n<p>Category - X</p>\n<p>This is a bit confusing when your wiki is about category theory, but I'm sure category theorists can handle a category called \"category\".  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>\n<p>So if you go to any nLab page about a category, like my current favorite, <a href=\"https://ncatlab.org/nlab/show/SupLat\">SupLat</a>, you'll see</p>\n<p>category: category </p>\n<p>and if you click on that, you go to the page listing all pages about categories!</p>\n<p><a href=\"https://ncatlab.org/nlab/all_pages/category\">Category - category</a></p>\n<p>And there are 84 today.</p>\n<p>at the bottom.  And if you click on it, you go to the automatically-created the wik page listing all pages in that category, which is naturally called</p>",
        "id": 206824630,
        "sender_full_name": "John Baez",
        "timestamp": 1597330393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279935\">Thibaut Benjamin</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/206799308\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276945\">Oscar Cunningham</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/206797528\">said</a>:</p>\n<blockquote>\n<p>The nLab has a very confusingly named page <a href=\"https://ncatlab.org/nlab/all_pages/category\">Category — category</a>.</p>\n</blockquote>\n<p>That looks a bit like what I had in mind, maybe that could be a good start. I agree that the name of the page is pretty terrible, and I think these should be sorted in different sections instead of being just a big list. </p>\n</blockquote>\n<p>Now I hope you see why the name of the page has to be this, and why it's just a big list - it's automatically generated.</p>\n<p>If you want to create <em>another</em> page that's a kind of database of categories, that's easy to do.   And the nLab already knows 84 categories that should be in this database.   You can format the database in any way you want, and you can easily link to the nLab pages on these 84 categories so that by clicking on them readers can go to those pages.  And this important, because while some information is nicely presented on a database, it's also nice to read articles about individual categories, and these have already been written.</p>",
        "id": 206826338,
        "sender_full_name": "John Baez",
        "timestamp": 1597331083
    },
    {
        "content": "<p>I think a really awesome example to try to emulate here is GroupProps <a href=\"https://groupprops.subwiki.org/wiki/Main_Page\">https://groupprops.subwiki.org/wiki/Main_Page</a> . It's a community wiki, but being specifically for this purpose (unlike, say, nLab which is much broader in scope) its data is much more structured. It started out small, with essentially one person, but now it's pretty awesome, and the added structure is super useful.</p>",
        "id": 207035887,
        "sender_full_name": "Joshua Grochow",
        "timestamp": 1597520324
    },
    {
        "content": "<p>cf <a href=\"https://math.stackexchange.com/q/1639034/71510\">https://math.stackexchange.com/q/1639034/71510</a> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 207287036,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1597770732
    },
    {
        "content": "<p>Hey look, there I am! I remembered that post but I couldn't find it again when this topic came up.</p>",
        "id": 207287246,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1597770821
    },
    {
        "content": "<p>i always hoped that such a thing would be like some of the currently existing databases of algebraic geometry objects and topological spaces, that let you search by boolean combinations of properties (eg <code>is_cartesian_closed &amp;&amp; !is_abelian</code>)</p>",
        "id": 207287268,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1597770827
    },
    {
        "content": "<p>if anybody is interested in starting this then i’d be very keen on helping with some of the behind-the-scenes web dev stuff</p>",
        "id": 207287592,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1597770960
    },
    {
        "content": "<p>i think i came up with some vague ideas back when i asked that SE question</p>",
        "id": 207287718,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1597771007
    },
    {
        "content": "<p>All the code for pi-base is on github. So in principle we could take that, rename \"space\" to \"category\" and we would be pretty much set on the infrastructure department right?</p>",
        "id": 207549544,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1597944196
    },
    {
        "content": "<p>I feel like it might actually be harder to find a relatively modular way to categorise different types of properties than the data entry itself.  Like different properties stack up in different ways.</p>",
        "id": 207554801,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1597946782
    },
    {
        "content": "<p>Like consider monoidal closedness.  Ideally this would be associated both with being monoidal and being closed in the way that the database is constructed.</p>",
        "id": 207555006,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1597946897
    },
    {
        "content": "<p>And a categories can have different monoidal structures/closed monoidal structures to make things even more complicated.</p>",
        "id": 207555640,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1597947269
    },
    {
        "content": "<p>Can a category be monoidal closed in two different ways? At most one of them would correspond to being closed in the sense definable without a choice of monoidal structure, right?</p>",
        "id": 207556101,
        "sender_full_name": "Dan Doel",
        "timestamp": 1597947508
    },
    {
        "content": "<p>Hmmm I am thinking of how a category can be compact closed with different cups/caps, but I suspect that they may always be isomorphic</p>",
        "id": 207556317,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1597947614
    },
    {
        "content": "<p>Just 'closed' might be more flexible than I thought.</p>",
        "id": 207556399,
        "sender_full_name": "Dan Doel",
        "timestamp": 1597947671
    },
    {
        "content": "<p>A category can have multiple nonequivalent closed structures.</p>",
        "id": 207556422,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1597947690
    },
    {
        "content": "<p>I thought it was somehow reflecting the hom more fully than it actually is.</p>",
        "id": 207556446,
        "sender_full_name": "Dan Doel",
        "timestamp": 1597947708
    },
    {
        "content": "<p>So if we were to take a very systematic approach about this and list categories with respect to their properties, we would have to enumerate all the non-isomorohic closes structures that exist on each of them? That doesn't sound that something very practical either to do, or to search. On the other hand, it seems unsatisfactory to leave out the structure entirely and not mention the possible closed structures (at least the common ones) on various categories. <br>\nTo be honest, it is not very clear to me how to organize all this data in a manageable way, that allows for easy navigation, and that account for the additional structures one can put on a category</p>",
        "id": 207650181,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1598024910
    },
    {
        "content": "<p>Maybe we could have separate databases for each categories equipped with a relevant structure (e.g. a database for monoidal closed categories), with, for each entry an attachment to the underlying category in the database of categories. Then, when consulting an entry in the database of categories, it could run a quick search in the database of monoidal categories to indicate what are the (most popular) monoidal categories with this precise category as its underlying category (I.e. the monoidal structures on this category)</p>",
        "id": 207650637,
        "sender_full_name": "Thibaut Benjamin",
        "timestamp": 1598025160
    },
    {
        "content": "<p>In that case, it would be worth to also include functors, natural transformations, monad structures over a functor, adjunctions, and so on. I feel like all this data could very intuitively be coded as objects as in object-oriented programming. For example, the \"class\" Functor has properties like source, target, isFaithfull, etc.. while the class monoidal closed structure has properties like carrierCategory, isSymmetric, isBraided, etc... Then, when you look for a category that is monoidal closed which has some other property P (not relevant to the monoidal closed structure), you first look into all monoidal closed structure and then check if the object carrierCategory has property P. I believe this works for most of the objects I have studied in category, for instance there can be multiple monad structures on a functor, or there can be several categories equivalent to one another. Nevertheless, I am sure people will come up with an easy counterexample I have not considered .</p>\n<p>Unfortunately, I don't know anything about databases and I have no idea how feasible or efficient a system like this could be. There are however database systems that seem to be working with this kind of data: <a href=\"https://en.wikipedia.org/wiki/Object_database\">https://en.wikipedia.org/wiki/Object_database</a>.</p>",
        "id": 207666913,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1598034081
    },
    {
        "content": "<p>In this flavour, there's also<br>\n<a href=\"https://en.wikipedia.org/wiki/List_of_lists_of_lists\">https://en.wikipedia.org/wiki/List_of_lists_of_lists</a></p>",
        "id": 207669854,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598035592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"303960\">@Joshua Grochow</span> I thought the groupprops page is just one guy. Is there a way to see who contributed and how much, etc.?</p>",
        "id": 207669964,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598035664
    },
    {
        "content": "<p>It started as just one, but I believe anyone can sign up to edit the wiki. Why does that matter though? It seems like the setup is a good mix of structure and flexibility that's been talked about in this thread. And just based on this thread it seems like there would be plenty of contributors.</p>\n<p>One nice thing about the groupprops wiki: it's very structured, but you don't have to decide on the monolithic structure of a database ahead of time (the some in this thread seem to be trying to do). Rather just some ideas of organization, and the rest emerges organically</p>",
        "id": 207670507,
        "sender_full_name": "Joshua Grochow",
        "timestamp": 1598035946
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/fN9m3khPhCkLST36WoaprzIF/Bildschirmfoto-2020-08-21-um-20.55.01.png\">Bildschirmfoto-2020-08-21-um-20.55.01.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/fN9m3khPhCkLST36WoaprzIF/Bildschirmfoto-2020-08-21-um-20.55.01.png\" title=\"Bildschirmfoto-2020-08-21-um-20.55.01.png\"><img src=\"/user_uploads/21317/fN9m3khPhCkLST36WoaprzIF/Bildschirmfoto-2020-08-21-um-20.55.01.png\"></a></div><p>I try to be as dedicates as possible in my own notebook to point out the other already existing notions (other notebook entires) that are used in the definitions. At one point I had it dynamically synched with a graph where I can move around and jump into the wiki entires.</p>\n<p>As for categories, there's a lot of ways in which you can write down and how objects can bend their definitions (strict, lax, up to this and up to that), so I found it hard myself to find a balance. Is a limit defined in terms of some cones, what are those cones, or is it some initial/terminal arrow from some functor to/from the diagonal functor, do I have type system underlying. What about the logic, domains of discourse, etc. Scary.</p>",
        "id": 207671223,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598036388
    },
    {
        "content": "<p>I think that it would also be great to have a database of categorical _constructions_ and ways to visualize them... there are hundreds of interesting constructions that were published in a very terse way, but since then it became much easier to typeset and share diagrams, and people published in blog posts, notes, slides, and obscure preprints their own ways of understanding these constructions, but this material is hard to find...</p>",
        "id": 207672901,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1598037210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281274\">@Nikolaj Kuntner</span>, how do you edit that graph of notions? I just found your wiki and your youtube channel, but they're both huge... is that explained there?<br>\n<a href=\"https://axiomsofchoice.org/\">https://axiomsofchoice.org/</a><br>\n<a href=\"https://www.youtube.com/channel/UCcrSMnEYhIPX_p127jI23qw/videos\">https://www.youtube.com/channel/UCcrSMnEYhIPX_p127jI23qw/videos</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"channel\" href=\"https://www.youtube.com/channel/UCcrSMnEYhIPX_p127jI23qw/videos\"><img src=\"https://i.ytimg.com/vi/channel/default.jpg\"></a></div>",
        "id": 207674273,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1598037969
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276773\">@Eduardo Ochs</span> <a href=\"/user_uploads/21317/QuAx6fFz7hOz-WpY0XA1lyNr/Bildschirmfoto-2020-08-21-um-22.06.06.png\">Bildschirmfoto-2020-08-21-um-22.06.06.png</a> <br>\nNevermind that Wiki, I haven't updated that in many years and it's just there to share my contatcs as I'm not university affiliated anymore. <br>\nI still take notes in that style, but I wrote a tiny flask server (python) and use it locally. I think DokuWiki works nicely, although it has too many wizzles for a single user. I've seen physicists use tiddlyWiki, which is more compact, but parsing a text file to html like in the pic is easy enough and features like opening the files in an editor and such can be done in a few thousand lines. But I figure a lot of people know the nLab software already, so why not use that? <br>\nIn any case, what you describe sounds too much like the nLab already - and the formalized version sounds like it will only look like something in 15 years tbqh.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/QuAx6fFz7hOz-WpY0XA1lyNr/Bildschirmfoto-2020-08-21-um-22.06.06.png\" title=\"Bildschirmfoto-2020-08-21-um-22.06.06.png\"><img src=\"/user_uploads/21317/QuAx6fFz7hOz-WpY0XA1lyNr/Bildschirmfoto-2020-08-21-um-22.06.06.png\"></a></div>",
        "id": 207679266,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598040769
    },
    {
        "content": "<p>I show how you can drag a textfile into a broswer and have its LaTeX rendered via MathJax here</p>",
        "id": 207679420,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598040857
    },
    {
        "content": "<p><a href=\"https://youtu.be/bk0J7WGwk90\">https://youtu.be/bk0J7WGwk90</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"bk0J7WGwk90\" href=\"https://youtu.be/bk0J7WGwk90\"><img src=\"https://i.ytimg.com/vi/bk0J7WGwk90/default.jpg\"></a></div>",
        "id": 207679423,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598040859
    },
    {
        "content": "<p>The arrows in the graph are literally just Wikipedia style links [[other_page]] and the software I had used was graphviz. <br>\n<a href=\"https://graphviz.org/\">https://graphviz.org/</a></p>",
        "id": 207679623,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598040972
    },
    {
        "content": "<p>Also, I just remember I did a paper review on a group in the field of Mathematical Knowledge Management some months ago<br>\n<a href=\"https://youtu.be/Pp85jeBCDmc\">https://youtu.be/Pp85jeBCDmc</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Pp85jeBCDmc\" href=\"https://youtu.be/Pp85jeBCDmc\"><img src=\"https://i.ytimg.com/vi/Pp85jeBCDmc/default.jpg\"></a></div>",
        "id": 207683376,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043080
    },
    {
        "content": "<p>Apart from some stuff you guys brought up (nLab, libraries associated with provers), they survey and keep track of things like</p>",
        "id": 207683408,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043110
    },
    {
        "content": "<p><a href=\"https://www.lmfdb.org/\">https://www.lmfdb.org/</a></p>",
        "id": 207683419,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043118
    },
    {
        "content": "<p>(LMFDB - The L-functions and Modular Forms Database)</p>",
        "id": 207683464,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043132
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/dJ_1jsZ3lwiApaCENijkxUGB/Bildschirmfoto-2020-08-21-um-22.53.10.png\">Bildschirmfoto-2020-08-21-um-22.53.10.png</a> here's a screenshot from a page in that paper, maybe you find some inspiration</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/dJ_1jsZ3lwiApaCENijkxUGB/Bildschirmfoto-2020-08-21-um-22.53.10.png\" title=\"Bildschirmfoto-2020-08-21-um-22.53.10.png\"><img src=\"/user_uploads/21317/dJ_1jsZ3lwiApaCENijkxUGB/Bildschirmfoto-2020-08-21-um-22.53.10.png\"></a></div>",
        "id": 207683598,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043213
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/YNo-471mVI9go9Kv1DH9fIM3/Bildschirmfoto-2020-08-21-um-22.54.04.png\">Bildschirmfoto-2020-08-21-um-22.54.04.png</a> I see my notes on the paper end up with the start of a list of things that aren't there (sorry for the screencap dump)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/YNo-471mVI9go9Kv1DH9fIM3/Bildschirmfoto-2020-08-21-um-22.54.04.png\" title=\"Bildschirmfoto-2020-08-21-um-22.54.04.png\"><img src=\"/user_uploads/21317/YNo-471mVI9go9Kv1DH9fIM3/Bildschirmfoto-2020-08-21-um-22.54.04.png\"></a></div>",
        "id": 207683737,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043269
    },
    {
        "content": "<p><a href=\"http://cantorsattic.info/Cantor%27s_Attic\">http://cantorsattic.info/Cantor%27s_Attic</a><br>\nI know this is (was!) a Wiki on large cardinals, I think it's actually by Hamkins</p>",
        "id": 207683856,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043342
    },
    {
        "content": "<p>You wouldn't know since the server seems to have an issue for over a year now and the site is broken</p>",
        "id": 207683940,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043367
    },
    {
        "content": "<p>But from personal anectotal evidence I can promise you he talked about various infinities there</p>",
        "id": 207683987,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043393
    },
    {
        "content": "<p>And I remember Andrej Bauer is another mathematican who has a dozens of different zoology projects</p>",
        "id": 207684040,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043426
    },
    {
        "content": "<p>In another life I also looked into the work of William M. Farmer, who I'd say is/was into lisp and he tried to formalize frameworks for MKM (Mathematical Knowledge Management). That involved type theories with undefind binders (formally related to the Bourbaki-tau or Hilbert epsilon I think) or something something sheafs representing mathematical concepts and organizing them. One can probably go infinitely deep in that \"framework direction\"<br>\nHere's that lisp like type system proposal <br>\n<a href=\"https://arxiv.org/pdf/1305.6206.pdf\">https://arxiv.org/pdf/1305.6206.pdf</a><br>\niirc he says it interprets Gödel-Bernays set theory in some sense</p>",
        "id": 207684668,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043763
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/jPTqEZr8BRJwsxA7SHBdB7Et/Bildschirmfoto-2020-08-21-um-23.05.26.png\">Bildschirmfoto-2020-08-21-um-23.05.26.png</a> If one really wants to go formal, here's a survey paper (prover related) with funky graphs <a href=\"https://arxiv.org/pdf/1912.03028.pdf\">https://arxiv.org/pdf/1912.03028.pdf</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/jPTqEZr8BRJwsxA7SHBdB7Et/Bildschirmfoto-2020-08-21-um-23.05.26.png\" title=\"Bildschirmfoto-2020-08-21-um-23.05.26.png\"><img src=\"/user_uploads/21317/jPTqEZr8BRJwsxA7SHBdB7Et/Bildschirmfoto-2020-08-21-um-23.05.26.png\"></a></div>",
        "id": 207684998,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598043967
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/207554801\">said</a>:</p>\n<blockquote>\n<p>I feel like it might actually be harder to find a relatively modular way to categorise different types of properties than the data entry itself.  Like different properties stack up in different ways.</p>\n</blockquote>\n<p>If you want a comprehensive list of structures on categories as a reference then this becomes an issue indeed. If you just want to have a database to look up some quick counter-examples, then a more bare bones architecture would do I think. E.g. you can just say that a category is monoidal closed, and then in a note to this property add to which monoidal structure this refers.</p>",
        "id": 207745907,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1598137550
    },
    {
        "content": "<p>A potential problem with designing such a database is that since we are all mathematicians, we might over-engineer it :P</p>",
        "id": 207745952,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1598137570
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/207745907\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/207554801\">said</a>:</p>\n<blockquote>\n<p>I feel like it might actually be harder to find a relatively modular way to categorise different types of properties than the data entry itself.  Like different properties stack up in different ways.</p>\n</blockquote>\n<p>If you want a comprehensive list of structures on categories as a reference then this becomes an issue indeed. If you just want to have a database to look up some quick counter-examples, then a more bare bones architecture would do I think. E.g. you can just say that a category is monoidal closed, and then in a note to this property add to which monoidal structure this refers.</p>\n</blockquote>\n<p>One could just only list off properties and not structure... things could be made a lot easier</p>",
        "id": 207746750,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1598139112
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/207556422\">said</a>:</p>\n<blockquote>\n<p>A category can have multiple nonequivalent closed structures.</p>\n</blockquote>\n<p>Yes.  Here's a nice result: there are exactly two symmetric monoidal closed structures on the category Cat, up to equivalence.  One is the usual cartesian closed structure; the other comes from the <a href=\"https://ncatlab.org/nlab/show/funny+tensor+product\">funny tensor product</a> of categories.</p>",
        "id": 207757731,
        "sender_full_name": "John Baez",
        "timestamp": 1598161375
    },
    {
        "content": "<p>There are shitloads of symmetric monoidal structures on Set, but I forget how many symmetric monoidal closed structures there are.  I'll wildly guess that there's just one, up to equivalence.</p>",
        "id": 207757783,
        "sender_full_name": "John Baez",
        "timestamp": 1598161485
    },
    {
        "content": "<p>So, why not just be more active with examples on the nLab? Contrapoints?</p>",
        "id": 207769064,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598182855
    },
    {
        "content": "<p>for me, the nLab is just lacking this search functionality: I always imagined something  a bit like Counterexamples in Topology</p>",
        "id": 207775504,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1598192177
    },
    {
        "content": "<p>But isn't that just a matter of Example sections? The nLab already has pages named after the concepts for which you'd want examples.</p>",
        "id": 207776079,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598193045
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/9Ku2sm36djR3yKv0MY2SEJ72/Bildschirmfoto-2020-08-23-um-16.35.31.png\">Bildschirmfoto-2020-08-23-um-16.35.31.png</a> <br>\nThe way I had generated the graph was just from the links in dedicated places, all deriving from the pages files that are apriori independent of it.<br>\nMy thinking is that if the pages (nodes) are predicates and the arrows (edges) are subset, actually capturing theorems, <br>\n{-4,0,4,8,12,...} ==&gt; {-4,-2,0,2,4,6,8,10,12,...}<br>\nyou actually express a sort of internal language.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/9Ku2sm36djR3yKv0MY2SEJ72/Bildschirmfoto-2020-08-23-um-16.35.31.png\" title=\"Bildschirmfoto-2020-08-23-um-16.35.31.png\"><img src=\"/user_uploads/21317/9Ku2sm36djR3yKv0MY2SEJ72/Bildschirmfoto-2020-08-23-um-16.35.31.png\"></a></div>",
        "id": 207776432,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598193683
    },
    {
        "content": "<p>\"a topos is also, in particlar, a cartesian closed category\" <br>\nis an arrow instantiated by cleaned up example section you can non-ambiguous parse from.</p>",
        "id": 207776669,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598194078
    },
    {
        "content": "<p>This is the kind of visual structure I've been wanting for a long time, although it always ends up frustratingly crowded in 2D. The best way to make it effective, imo, is to not try to cram everything into a single diagram. Or try to cram all of these suggestions into an all-encompassing database, for that matter. If any of these database ideas take on an existence, whether within or independent of the nLab, it would be straightforward to interlink them at that point.</p>",
        "id": 207778887,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1598197657
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/6_iPmgCKz6ZdwzyHHPrl4kD4/Bildschirmfoto-2020-08-23-um-18.01.57.png\">Bildschirmfoto-2020-08-23-um-18.01.57.png</a> <br>\nVery true! The graphviz library does feature a few regroupings (spring, top-bottom, left-right, etc. shown in this pic, which is the same data of the entries around \"Functor\"), but when you plot hundreds of pages, it takes forever to move around at any workable resolution. <br>\nMy idea (never coded up) was to compute the Upper set and Down set (in the sense of filters on a poset) for the subset graphs, to any depth you're interested in. <br>\nThat would help, but to dynamically recompute the info while aping around between the branches, it would require some serious user interface design effort.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/6_iPmgCKz6ZdwzyHHPrl4kD4/Bildschirmfoto-2020-08-23-um-18.01.57.png\" title=\"Bildschirmfoto-2020-08-23-um-18.01.57.png\"><img src=\"/user_uploads/21317/6_iPmgCKz6ZdwzyHHPrl4kD4/Bildschirmfoto-2020-08-23-um-18.01.57.png\"></a></div>",
        "id": 207779590,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598198762
    },
    {
        "content": "<p>It could be interesting to use Wikibase for this. It is a form of wiki where data is input in structured form, like this: <a href=\"https://www.wikidata.org/wiki/Q168620\">https://www.wikidata.org/wiki/Q168620</a>. Wikidata is a general-purpose instance of Wikibase, but we could have one specifically for category theory, with our own concepts. The ontology (properties used to describe objects) are user-defined, so there is a lot of flexibility built-in. It also comes with a powerful query language (SPARQL), which can be used to generate all sorts of visualizations from the data: <a href=\"https://w.wiki/QEW\">https://w.wiki/QEW</a>.</p>",
        "id": 208337622,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1598618932
    },
    {
        "content": "<p>I had a go at linking Wikidata and nLab better, and that lets you visualize the graph of subclasses between the concepts represented in the nLab. Result (heavy webpage!): <a href=\"https://w.wiki/bRw\">https://w.wiki/bRw</a></p>",
        "id": 209231117,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599408335
    },
    {
        "content": "<p>This graph can be edited: if you see missing relations, you can just add a \"subclass of\" property on the corresponding item, like this: <a href=\"https://www.wikidata.org/wiki/Q2943034\">https://www.wikidata.org/wiki/Q2943034</a></p>",
        "id": 209231850,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599409611
    },
    {
        "content": "<p>That's a very pleasing mess! Nice one!</p>",
        "id": 209232704,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599411189
    },
    {
        "content": "<p>That's really cool! Can you explain a bit more how this works under the hood?</p>",
        "id": 209232992,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1599411637
    },
    {
        "content": "<p>I like how after the graph settles itself you can zoom out and really easily see what the fundamental concepts are: they are sort of isolated looking nodes with a lot of arrows pointing towards it.</p>",
        "id": 209233075,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1599411754
    },
    {
        "content": "<p>The visualization is generated by a SPARQL query that you can see by clicking the \"Edit SPARQL\" link on the right-hand menu of the visualization. The query generates the graph edges by requesting all pairs of Wikidata items which are both linked to the nLab, and one is marked as a subclass of the other. All the underlying data is editable (even without creating an account) - for instance Wikidata did not know about bimonoidal categories so I have created <a href=\"https://www.wikidata.org/wiki/Q98931512\">https://www.wikidata.org/wiki/Q98931512</a>, linking it to the nLab and relating it to other items.</p>",
        "id": 209241965,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599426979
    },
    {
        "content": "<p>Pretty cool. How tightly is this dependent on the Wiki data, can it be more or less easily be used as standalone for just nLab?</p>",
        "id": 209317186,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1599501046
    },
    {
        "content": "<p>Yes it is possible to run independent instances of that software (Wikibase). Either manually (for example with <a href=\"https://github.com/wmde/wikibase-docker\">https://github.com/wmde/wikibase-docker</a>) or from hosting providers (<a href=\"https://www.wbstack.com/\">https://www.wbstack.com/</a>, <a href=\"https://professional.wiki/en/hosting/wikibase\">https://professional.wiki/en/hosting/wikibase</a>). I could help set one up if people are interested :)</p>",
        "id": 209363283,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599557159
    },
    {
        "content": "<p>I'm interested in trying to find out how it works, e.g. running it locally on a small set of data</p>",
        "id": 209428401,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1599591186
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276320\">Antonin Delpeuch</span> <a href=\"#narrow/stream/229111-general/topic/Category.20database/near/209231117\">said</a>:</p>\n<blockquote>\n<p>I had a go at linking Wikidata and nLab better, and that lets you visualize the graph of subclasses between the concepts represented in the nLab. Result (heavy webpage!): <a href=\"https://w.wiki/bRw\">https://w.wiki/bRw</a></p>\n</blockquote>\n<p>hi <span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> , this is really great! <br>\nI also wanted a better mapping between the nLab and WikiData, so I'm really pleased, thanks!!!<br>\nBut I am also a bit surprised: when I look  your graph and query, it seems to say that there are</p>\n<blockquote>\n<p>Showing 1 to 200 of 623 rows  rows per page</p>\n</blockquote>\n<p>only 623 rows and I know we have some 10.5 K pages of non-humans in the nLab.  so, it seems that 623 is too low a number.<br>\n(I am only looking at the stuff produced by your query).<br>\nis this reasonable do you think? how many mathematical concepts do you think WikiData has? do you know the number for Wikipedia? Do you have other stats that you're willing to share? Many thanks!</p>",
        "id": 209448153,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1599601452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> absolutely! At the moment there are 15k pages on nLab, and 3.4k of them are linked to Wikidata via the dedicated property (<a href=\"https://www.wikidata.org/wiki/Property:P4215\">https://www.wikidata.org/wiki/Property:P4215</a>). So there is a lot of room for improving this linkage :) The reason why the query returns 623 results is that each result corresponds to an edge in the graph, so you only get one per pair of nLab concepts for which we have a known \"subclass of\" relation. For instance, nLab has pages about people, and on Wikidata those do not have such relations, so they are excluded from the results. There are also concrete instances of these concepts (such as the category of sets <a href=\"https://www.wikidata.org/wiki/Q2518298\">https://www.wikidata.org/wiki/Q2518298</a>) which are just \"instances of\", not \"subclasses of\" other notions, and therefore do not appear in my query (but it could probably be tweaked to show them too).</p>\n<p>To improve this, we can:</p>\n<ul>\n<li>improve the linkage between Wikidata and nLab (by adding claims to existing items and creating those that are missing). There are tools for that (<a href=\"https://www.wikidata.org/wiki/Wikidata:Tools/OpenRefine\">https://www.wikidata.org/wiki/Wikidata:Tools/OpenRefine</a>).</li>\n<li>improve the modelling of these structures in Wikidata, by adding the missing \"subclass of\" and \"instance of\" claims (and probably others! I haven't thought deeply about the sort of structured data that would be interesting in this field)</li>\n</ul>",
        "id": 209616653,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599731394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281274\">@Nikolaj Kuntner</span> then I recommend the Wikibase-Docker setup, if you have docker install you can spin up a local instance in minutes, with all the bells and whistles :)</p>",
        "id": 209632974,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1599742077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> many thanks!!! after writing I had found the info about the 3.4K nLab pages connected in the documentation page <a href=\"https://www.wikidata.org/wiki/Property_talk:P4215\">https://www.wikidata.org/wiki/Property_talk:P4215</a>.</p>",
        "id": 209652033,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1599747619
    }
]