[
    {
        "content": "<p>Has there been any approach based on category theory, Topos theory.. etc  to understand human psychology? I would be very grateful if someone can suggest some references or resources in this direction!  <br>\nThanks in advance.</p>",
        "id": 232149072,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1616916246
    },
    {
        "content": "<p>I don't know about any serious research in that direction but Ronnie Brown and Timothy Porter (famous homotopy theorists) have some interesting papers on the use of analogy in thought and the relationship to CT.</p>",
        "id": 232149250,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1616916463
    },
    {
        "content": "<p>For example, <a href=\"/user_uploads/21317/P2xpfq10p12EcbF0aK4_pWqj/Category-Theory_-an-abstract-setting-for-a-Ronald-Brown.pdf\">this</a> and <a href=\"/user_uploads/21317/ksZN8FuJDr20aaagnlDzeDdB/Category-Theory-and-Higher-Dimensional-Alg-Ronald-Brown.pdf\">this</a>.</p>",
        "id": 232149314,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1616916513
    },
    {
        "content": "<p>If you want something perhaps more substantial, there is the theory of 'Memory Evolutive Systems' by Andrée Ehresmann and Jean-Paul Vanbremeersch which is a categorical approach to biological/chemical/etc.. systems</p>",
        "id": 232149466,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1616916720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"341237\">@Fawzi Hreiki</span>  Thanks a lot  for the references.</p>",
        "id": 232149559,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1616916799
    },
    {
        "content": "<p>I may have said this elsewhere but I think a topic for investigation would be how software professionals have specialised in different categories, and find it difficult to bridge those. E.g. Category of Sets for FP, Coalgebras for OO, Bicategories of relations for Semantic Web, Functors to Set for Relational DBs? Just a thought, that I'd be happy to read a paper on to clarify or even debunk this intuition.</p>",
        "id": 232172167,
        "sender_full_name": "Henry Story",
        "timestamp": 1616943739
    },
    {
        "content": "<p>This probably isn't what you have in mind, but there's at least one serious academic investigation into the use of category theory based methods in education, led by <span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span>, which involves a not trivial amount of <em>applying</em> human psychology</p>",
        "id": 232172787,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616944352
    },
    {
        "content": "<p>I think nobody has made real progress in using category theory to understand human psychology.... yet.</p>",
        "id": 232181131,
        "sender_full_name": "John Baez",
        "timestamp": 1616953139
    },
    {
        "content": "<p>It may happen someday, but it will take a lot of work.</p>",
        "id": 232181159,
        "sender_full_name": "John Baez",
        "timestamp": 1616953194
    },
    {
        "content": "<p>I imagine when that does happen, it will happen via category-theoretic approaches to network/systems theory more broadly</p>",
        "id": 232181502,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1616953540
    },
    {
        "content": "<p>Yes, I've been working on category theory first for electrical circuits and then chemical reactions - these already posed a lot of challenges!  Next I'd like to tackle more biochemistry and evolutionary game theory.  All these are much easier to study mathematically than psychology.  Maybe someone can plunge straight into doing psychology with categories before doing all these \"easier\" sciences, but only if they know a lot of category theory and have some insight into psychology that lends itself to mathematical formalization.</p>",
        "id": 232182636,
        "sender_full_name": "John Baez",
        "timestamp": 1616954610
    },
    {
        "content": "<p>From our exposure to music we may  assume that  every scale (a sequence of musical notes ) when played in a particular time signature they somehow  expresses a particular human emotion. Though the converse may not be true that is whether every emotion can be expressed through some sequence of musical notes or not. If I assume that the converse is also true then in some sense studying human emotions will be same as studying different scale patterns in music. But I guess that  there are some good work on axiomatising music theory through category theory (for example <em>The Topos of Music</em> <a href=\"https://www.springer.com/gp/book/9783764357313\">https://www.springer.com/gp/book/9783764357313</a>). So in that case can the study of music theory will be considered as a study of human emotions(which is a part of human psychology)?</p>\n<p>I apologise priorly if I sound very naive. I am a music enthusiast and play some musical instruments. I always felt the connection of emotion and music. So I am just curious.</p>",
        "id": 232185380,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1616957594
    },
    {
        "content": "<p>I spend a year reading books on psychology around 2001 while in SF, from analytic philosophy to Jung (you can open all kinds of doors and have conversation in SF cafes with a good knowledge of him), to cognitive and existential psychotherapy,  etc... <br>\nI think (some) emotions can be modelled in terms of epistemic modal logic: it is a shift in your indexing in the set of possible worlds. So in that logic a belief is a set of possible worlds. You tend to position yourself as inside the worlds you believe to be true.  But new information can shift your understanding of where you are in the space of possibilities. <br>\nAn example:<br>\n   Jane is walking down a dark street going home after a hard days work. She hears footsteps behind her in the distance getting closer. At this point a number of possibilities could start coming up. Perhaps she is worried and so dangerous ones come to mind. Danger would requiring looking around, but that could reveal fear. So she goes on a bit. Her heart beats  faster, she searches for possible escape routes if the worst were to come true. What door could she ring on? As she gets closer to her friends house she ventures to turn her head: it's her brother. Nothing to worry about.  She smiles.<br>\n   Facts can change emotions, as they change the space of possibilities in which one places oneself.</p>",
        "id": 232188650,
        "sender_full_name": "Henry Story",
        "timestamp": 1616960992
    },
    {
        "content": "<p>Now as I recall this positioning in space is what co-monads do. Every comonad has a co-unit, that extracts the object at that location.</p>",
        "id": 232188829,
        "sender_full_name": "Henry Story",
        "timestamp": 1616961154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span>  Thanks for the reply. I am still little confused about how co-monads come into play in describing the change of space of possibilites.</p>",
        "id": 232189588,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1616961909
    },
    {
        "content": "<p>I am not sure how this works in detail, but the relation between monads, comonads and modal logic has been made in quite a number of papers.  In possible worlds logic there is a pointer, the actual world, denoted @, that picks out a world out of the sets of all worlds. (so this works like the counit). That is an indexical, in that for any agent in any world, that world in which that agent is, is the actual one. (It is indexical just like \"now\" is always the time at which that token is spoken, \"I\" refers to the person who utters the word, \"here\" refers to the place of around the person speaking, etc...). One can when reading fiction change (by suspension of disbelief) the world which one considers actual.  See the fun essay <a href=\"https://andrewmbailey.com/dkl/\">Truth in Fiction</a>.</p>\n<p>When thinking about psychology one has to take a phenomenological reading of possible worlds, which I think is how one has to read Philip K. Dick, who came up <a href=\"#narrow/stream/229451-general.3A-off-topic/topic/The.20epistemic.20coup/near/224679879\">in a discussion in Febuary</a>.</p>",
        "id": 232190041,
        "sender_full_name": "Henry Story",
        "timestamp": 1616962369
    },
    {
        "content": "<p>The idea of a shift in the space of possibilities also reminds me of what <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> has said a few times speaking of Modal HoTT, where if I recall what is going on is geometric morphisms between infinite toposes. (He mentions monadic and comonadic modalities in <a href=\"https://twitter.com/DavidCorfield8/status/1067326030044717056\">this tweet</a>).</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/DavidCorfield8/status/1067326030044717056\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1032571126520668160/J9W0r3KE_normal.jpg\"></a><p><a href=\"https://twitter.com/SchreiberUrs\">@SchreiberUrs</a> \"While Modal HoTT is about both, monadic and comonadic modalities, most talks will be about monadic modalities.\"\nSounds like they'll need a follow-up to restore the balance.</p><span>- David Corfield (@DavidCorfield8)</span></div></div>",
        "id": 232192246,
        "sender_full_name": "Henry Story",
        "timestamp": 1616964541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"318500\">@ADITTYA CHAUDHURI</span> wrote:</p>\n<blockquote>\n<p>But I guess that there are some good work on axiomatising music theory through category theory (for example <em>The Topos of Music</em>).</p>\n</blockquote>\n<p>I'm not very impressed by that book.  I would like to see someone who knows music theory and topos theory, other than the author of that book and his friends and students, say something concrete about what's good about this book.  I know a fair amount of topos theory - not much compared to some people here, but more than what's in this book - and I'm not completely ignorant of mathematical music theory.  But I don't see what that book does that's interesting.</p>",
        "id": 232195450,
        "sender_full_name": "John Baez",
        "timestamp": 1616967906
    },
    {
        "content": "<p>I'm more impressed by papers like these:</p>\n<ul>\n<li>\n<p>Thomas Fiore and Thomas Noll, <a href=\"https://arxiv.org/abs/1102.1496\">Commuting groups and the topos of triads</a>.</p>\n</li>\n<li>\n<p>Alexandre Popoff, Moreno Andreatta and Andree Ehresmann, <a href=\"https://arxiv.org/abs/1801.02922\">Groupoids and wreath products of musical transformations: a categorical approach from poly-Klumpenhouwer networks</a>.</p>\n</li>\n</ul>",
        "id": 232195676,
        "sender_full_name": "John Baez",
        "timestamp": 1616968115
    },
    {
        "content": "<p>But these focus on the mathematics of music theory - <a href=\"https://en.wikipedia.org/wiki/Neo-Riemannian_theory\">neo-Riemannian theory</a> to be specific - and don't try to say anything about psychology.</p>",
        "id": 232195721,
        "sender_full_name": "John Baez",
        "timestamp": 1616968183
    },
    {
        "content": "<p>In short, they're taking a portion of music theory that's already been mathematized, and bringing in category theory to go further.</p>",
        "id": 232195834,
        "sender_full_name": "John Baez",
        "timestamp": 1616968289
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"318500\">@ADITTYA CHAUDHURI</span> the box or necessity operator satisfies two properties: <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">□</mi><mi>A</mi><mo>→</mo><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">\\Box A\\to A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord amsrm\">□</span><span class=\"mord mathnormal\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">A</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">□</mi><mi>A</mi><mo>→</mo><mi mathvariant=\"normal\">□</mi><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">□</mi><mi>A</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\Box A \\to \\Box(\\Box A)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord amsrm\">□</span><span class=\"mord mathnormal\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord amsrm\">□</span><span class=\"mopen\">(</span><span class=\"mord amsrm\">□</span><span class=\"mord mathnormal\">A</span><span class=\"mclose\">)</span></span></span></span>. these can be modeled by a comonad as explained in <a href=\"https://www.researchgate.net/publication/226515897_On_An_Intuitionistic_Modal_Logic\">https://www.researchgate.net/publication/226515897_On_An_Intuitionistic_Modal_Logic</a></p>",
        "id": 232225118,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1617000533
    },
    {
        "content": "<p>mhh, just looking at that again, it looks like <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">□</mi><mi>A</mi><mo>→</mo><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">\\Box A \\to A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord amsrm\">□</span><span class=\"mord mathnormal\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">A</span></span></span></span> does not actually capture the @ <a href=\"https://plato.stanford.edu/entries/possible-worlds/#Actuality\">actuality indexical operator</a> for the actual world. I think that goes <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">@</mi><mi>p</mi><mo>→</mo><mi>p</mi></mrow><annotation encoding=\"application/x-tex\">@ p \\to p</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\">@</span><span class=\"mord mathnormal\">p</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">p</span></span></span></span><br>\nWhere does that come in?</p>",
        "id": 232227582,
        "sender_full_name": "Henry Story",
        "timestamp": 1617002398
    },
    {
        "content": "<p>Perhaps this does not come out so well in kripke modal logic. But the truth of a counterfactual statement depends very much on where the actual world is (counterfactuals are a <a href=\"https://ncatlab.org/nlab/show/graded+modality\">graded modality</a>) So if \"If Kangaroos had not tails they would topple over\" depends on what the closest world to the actual one is where they have no tails. Do they then have bigger feet?</p>",
        "id": 232229241,
        "sender_full_name": "Henry Story",
        "timestamp": 1617003430
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thank you Sir very much  for the references. Can the mathematical music theory has the potential to understand/explore/ classify  human emotions?  For example one can argue that the same  music may not induce the  same emotional feeling to each person but I feel there is some universality too ( example  major scales create some joyful feel whereas  minor scales create a little darker feel , Different Raagas in Indian Classical music expresses different moods, same is true when we move from one genre, sub genre of music to another). But let's discuss a hypothetical situation(inspired from <span class=\"user-mention\" data-user-id=\"319282\">@Chetan Vuppulury</span> ) say a person travels 100 years back and play hard rock then how would a person in 1921 react to it?<br>\n Generally Hard rock expresses  some extreme aggression, rebel,  Boldness....etc(hard to describe in words). But these feelings were still present  in 1921 population but might not have the right music to express them. It's a kind of similar when Einstein found the use of Riemannian geometry(which were developed much before) useful to describe the universe. But there are also other instances like if someone plays smooth Jazz in saxophone(representing a city life) to a rural population of 1500 AD they may not relate to any of their emotions prevalent in their life. But if the same person from 1500 time travels to 2000 and  leads a city life for some years then he/she may relate something to that music.</p>\n<p>Now consider pure Mathematics. It generally explores all the logical structure that can be derived from the fundamental axioms using deductive logic. It generally does not care even if that logical structure fails to prove itself to be  useful to the existing science. But it  may be possible that someone from future can find some usefulness  for that logical structure . </p>\n<p>Keeping the discussion for pure Mathematics in mind , can we say that  one can use music theory  to explore/understand all possible human emotions irrespective of the fact that whether <em>a particular human emotion</em>  can relate to some existing set of emotions in the contemporary population or not?</p>",
        "id": 232230707,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617004505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span>  Thank you very much for the reply and the reference.</p>",
        "id": 232231115,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617004751
    },
    {
        "content": "<p>So in your argument you keep moving between the space of all... and the particular. I think we need to model both, which we can do with a simple construct of pointed Xs. <br>\nWe can have Pointed Sets, which are sets with a point in them. Or pointed graphs, which are pairs of Graphs with and a node in them. So we can have Pointed Spaces with a space and a point in it. (S,a). If x is closer to y in (S,a) this may not be the case in (S,b). <br>\nSimilarily, the propositions true in (W,a) may not be true in (W,b) (here propositions can be thought geometrically as subspaces of W). <br>\nWhat is true at one time, may not be true at another. The music enjoyed at one period may not be understandable to those living at a previous one. <br>\nWhat you are imagining when you are imagining someone from the past coming to the future, is a morphism from one state to another. Children have to do this all the time, as they learn new concepts, and as their space of possibilities increases from the crib and the mother, to the family, to the village, country, earth, universe, and beyond.  But we also have to do this moment to moment as we shift from one understanding of where in the space of possibilities were are (is it an antilope or a lion over there) to another.</p>",
        "id": 232231488,
        "sender_full_name": "Henry Story",
        "timestamp": 1617004936
    },
    {
        "content": "<p>And indeed where we understand ourselves to be in the space of possibilities will inform our actions, since emotions and actions are closely related.</p>",
        "id": 232231969,
        "sender_full_name": "Henry Story",
        "timestamp": 1617005226
    },
    {
        "content": "<p>I got one psychology paper:  <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2020.527114/full\">https://www.frontiersin.org/articles/10.3389/fpsyg.2020.527114/full</a></p>",
        "id": 232244796,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617012498
    },
    {
        "content": "<p>There is also some work on conciousness by <span class=\"user-mention\" data-user-id=\"280454\">@Sean Tull</span> and <span class=\"user-mention\" data-user-id=\"296989\">@Harny Wang</span> and others.  Sean's even made the cover of New Scientist.</p>",
        "id": 232245001,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617012605
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2002.07654\">https://arxiv.org/abs/2002.07654</a></p>",
        "id": 232245010,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617012611
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2007.16138\">https://arxiv.org/abs/2007.16138</a></p>",
        "id": 232245064,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617012643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"318500\">ADITTYA CHAUDHURI</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232185380\">said</a>:</p>\n<blockquote>\n<p>From our exposure to music we may  assume that  every scale (a sequence of musical notes ) when played in a particular time signature they somehow  expresses a particular human emotion. Though the converse may not be true that is whether every emotion can be expressed through some sequence of musical notes or not. If I assume that the converse is also true then in some sense studying human emotions will be same as studying different scale patterns in music. But I guess that  there are some good work on axiomatising music theory through category theory (for example <em>The Topos of Music</em> <a href=\"https://www.springer.com/gp/book/9783764357313\">https://www.springer.com/gp/book/9783764357313</a>). So in that case can the study of music theory will be considered as a study of human emotions(which is a part of human psychology)?</p>\n<p>I apologise priorly if I sound very naive. I am a music enthusiast and play some musical instruments. I always felt the connection of emotion and music. So I am just curious.</p>\n</blockquote>\n<p>We are currently using our quantum natural language framework, which is categorical, to generate music on quantum computers in collaboration with <a href=\"https://www.plymouth.ac.uk/staff/eduardo-miranda\">https://www.plymouth.ac.uk/staff/eduardo-miranda</a>  This must be the wildest thing I have ever done.</p>",
        "id": 232245517,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617012931
    },
    {
        "content": "<p>We are also upgrading our DisCoCat NLP framework to a cognitive architecture.  A series of papers is on the way, but here is already an old one: <a href=\"https://arxiv.org/abs/1703.08314\">https://arxiv.org/abs/1703.08314</a></p>",
        "id": 232245634,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1617013007
    },
    {
        "content": "<p>Given that there is at least a school of possible worlds interpretation of quantum theory, these views must be related at some point.</p>",
        "id": 232250702,
        "sender_full_name": "Henry Story",
        "timestamp": 1617016178
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span> Thank you Sir very much for the references.</p>",
        "id": 232251629,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617016742
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276692\">Bob Coecke</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232245517\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"318500\">ADITTYA CHAUDHURI</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232185380\">said</a>:</p>\n<blockquote>\n<p>From our exposure to music we may  assume that  every scale (a sequence of musical notes ) when played in a particular time signature they somehow  expresses a particular human emotion. Though the converse may not be true that is whether every emotion can be expressed through some sequence of musical notes or not. If I assume that the converse is also true then in some sense studying human emotions will be same as studying different scale patterns in music. But I guess that  there are some good work on axiomatising music theory through category theory (for example <em>The Topos of Music</em> <a href=\"https://www.springer.com/gp/book/9783764357313\">https://www.springer.com/gp/book/9783764357313</a>). So in that case can the study of music theory will be considered as a study of human emotions(which is a part of human psychology)?</p>\n<p>I apologise priorly if I sound very naive. I am a music enthusiast and play some musical instruments. I always felt the connection of emotion and music. So I am just curious.</p>\n</blockquote>\n<p>We are currently using our quantum natural language framework, which is categorical, to generate music on quantum computers in collaboration with <a href=\"https://www.plymouth.ac.uk/staff/eduardo-miranda\">https://www.plymouth.ac.uk/staff/eduardo-miranda</a>  This must be the wildest thing I have ever done.</p>\n</blockquote>\n<p>Wow!! Thats amazing!!</p>",
        "id": 232251883,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617016875
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232229241\">said</a>:</p>\n<blockquote>\n<p>mhh, just looking at that again, it looks like □A→A\\Box A \\to A□A→A does not actually capture the @ actuality indexical operator for the actual world. I think that goes @p→p@ p \\to p@p→p<br>\nWhere does that come in?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> the actuality operator is part of hybrid logic, an extension of modal logic. I've done a bit on that with Torben Brauner (Roskilde University) <a href=\"https://www.academia.edu/674216/Intuitionistic_hybrid_logic\">https://www.academia.edu/674216/Intuitionistic_hybrid_logic</a>, but we didn't write about categorical models. if you have time, I'd love to do it, but it isn't a tiny project.</p>",
        "id": 232261157,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1617021741
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232229241\">said</a>:</p>\n<blockquote>\n<p>Perhaps this does not come out so well in kripke modal logic. But the truth of a counterfactual statement depends very much on where the actual world is (counterfactuals are a <a href=\"https://ncatlab.org/nlab/show/graded+modality\">graded modality</a>) So if \"If Kangaroos had not tails they would topple over\" depends on what the closest world to the actual one is where they have no tails. Do they then have bigger feet?</p>\n</blockquote>\n<p>hmm, the maximum that I'm willing to accept is 'counterfactuals can be modeled as a <a href=\"https://ncatlab.org/nlab/show/graded+modality\">graded modality</a>', and even that is a tall order.</p>",
        "id": 232261631,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1617021986
    },
    {
        "content": "<blockquote>\n<p>Can the mathematical music theory have the potential to understand/explore/classify human emotions? </p>\n</blockquote>\n<p>I think if you want to understand the <em>emotional</em> aspects of music you should look, not at mathematical music theory (which doesn't have much to say about emotions, at least not yet), but the work of psychologists, like this:</p>\n<ul>\n<li>Yasmin Anwar, <a href=\"https://news.berkeley.edu/2020/01/06/music-evokes-13-emotions/\">Ooh là là! Music evokes at least 13 emotions. Scientists have mapped them</a>, <em>Berkeley News</em>.</li>\n</ul>\n<p>See <a href=\"https://www.google.com/search?client=firefox-b-1-d&amp;q=emotions+in+music+alan+cowan+pnas\">the works of Alan Cowan for more</a>.</p>",
        "id": 232291062,
        "sender_full_name": "John Baez",
        "timestamp": 1617033330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thank you  very much Sir for the references. What are the aspects of music  that  mathematical musical theory covers generally? I am assuming that it must cover the formation of different scales as well as similarity in patterns between different scales in a mathematical way. If each scale represents a particular set of emotions then naturally indirectly mathematical music theory should have a connection to the study of emotions. Am I misunderstanding anything here ?</p>",
        "id": 232302529,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617038082
    },
    {
        "content": "<p>i think the idea that a scale correspond to an emotion is a bit too reductionist, since you could pick two pieces of music written in the exact same key but that relay entirely opposite emotions</p>",
        "id": 232304455,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1617038837
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span>  I got your point.  What I meant by scale here is actually a sequence of notes played in a particular time signature. Ok, I agree that that may be the music has some connection with emotions but may  not be  much useful to understand emotions.  Has there been any attempt in the past  to study human emotions rigorously through a Mathematical model (preferably  using category theory)?</p>",
        "id": 232306381,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617039560
    },
    {
        "content": "<p>Incidentally most people can't distinguish between the same piece transposed into different keys. You need at least approximate absolute pitch to be able to associate <em>anything</em> to keys, including emotions</p>",
        "id": 232306728,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617039667
    },
    {
        "content": "<p>(Which is a fact that I find <em>really weird</em>, because the key of a piece really does convey a lot of emotion to me)</p>",
        "id": 232306815,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617039698
    },
    {
        "content": "<p>Before equal temperament, different keys actually sounded different (because the intervals would be different sizes), so the key would convey emotion even to people with relative pitch.  This gave keys emotional connotations, which they still have today even now that we use equal temperament.</p>",
        "id": 232307044,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1617039786
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232306815\">said</a>:, </p>\n<blockquote>\n<p>(Which is a fact that I find <em>really weird</em>, because the key of a piece really does convey a lot of emotion to me)</p>\n</blockquote>\n<p>Yes, for me too. I play harmonica. Harmonica in different keys feels very different.</p>",
        "id": 232307089,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617039805
    },
    {
        "content": "<p>Since the human brain is extremely good at recognising patterns across all out different senses without us noticing, my guess is that when you <em>play</em> an instrument, the key of a piece gets associated to other pieces in the same key (and thus their emotions) via a \"side channel\" of the physical movements you have to do to play in that key</p>",
        "id": 232307585,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617039964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span>  I understand your point.</p>",
        "id": 232307935,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617040094
    },
    {
        "content": "<p>Another factor is that different pitches on a single instrument are not necessarily perfect transpositions of each other. They will have different timbres.</p>",
        "id": 232308004,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1617040116
    },
    {
        "content": "<p>And some instruments also respond differently in different keys, eg. a violin resonates more when you play in a key close to G major</p>",
        "id": 232308220,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617040194
    },
    {
        "content": "<p>hmm.. thats true..</p>",
        "id": 232308369,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617040236
    },
    {
        "content": "<p>That means you are saying that music may not have a Universal meaning but it depends on the instruments in which we are playing. But is it not similar to the fact that \" the feeling of Sadness\" is universal to all people but its manifestation varies from person to person?</p>",
        "id": 232308809,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617040435
    },
    {
        "content": "<p>I don't think music has a universal meaning</p>",
        "id": 232308909,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040464
    },
    {
        "content": "<p>Not emotionally, not technically</p>",
        "id": 232308925,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span>   Ok.. So you are saying that in music there is nothing like bouba-Kiki effect <a href=\"https://en.wikipedia.org/wiki/Bouba/kiki_effect\">https://en.wikipedia.org/wiki/Bouba/kiki_effect</a>? (which we have for geometrical shapes)</p>",
        "id": 232309262,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617040607
    },
    {
        "content": "<p>Not universally. I can't imagine any conceivable way that it could happen. But <em>culturally</em>, in the context of \"a bunch of standard works that everyone knows\" is a different matter, much more plausibly true and not completely inconceivable to be able to say something about it mathematically</p>",
        "id": 232309285,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617040613
    },
    {
        "content": "<p>bouba-kiki itself is not universal, in the very same page you linked it is said that the majority, but not the totality of people identifies things in the same way.</p>",
        "id": 232309471,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040694
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> Hmm.. I agree.</p>",
        "id": 232309552,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617040747
    },
    {
        "content": "<p>I would <em>guess</em> that consonance and dissonance (which are mathematically definable) are universal-ish (but I'd be interested if anyone can correct me based on academic studies!) ... but the way that people respond to different amounts of consonance and dissonance is surely cultural. Music without any dissonance is music without any tension, so it's like eating English food</p>",
        "id": 232309557,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617040748
    },
    {
        "content": "<p>Maybe not an absolute coordinate system, but it seems to me there is definitely some universal difference (for humans) between Beethoven's 5th and the Moonlight Sonata, even if only based on volume and tempo. (forgive my sparse knowledge of classical music)</p>",
        "id": 232309601,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1617040772
    },
    {
        "content": "<p>Music is mainly art, only then maths and science. Art could be described at best, as a loose ensemble of vaguely organized heuristic practices. To my knowledge, every effort to describe art from the point of view of science has led to very uninteresting science, and nearly always to very uninteresting art. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 232309614,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040777
    },
    {
        "content": "<p>You can definitely, say, for instance, how harmony struggles with this. The near totality of rock music should be considered as cacophony from the point of view of classic music.</p>",
        "id": 232309885,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040864
    },
    {
        "content": "<p>There isn't \"one\" harmony. Again, it's a set of sparsely organized practices, to which one can subscribe or not</p>",
        "id": 232309924,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040884
    },
    {
        "content": "<p>Even better, you can subscribe only to part of it, which is basically how music evolves over time.</p>",
        "id": 232309982,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617040904
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276656\">Valeria de Paiva</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232261631\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232229241\">said</a>:</p>\n<blockquote>\n<p>Perhaps this does not come out so well in kripke modal logic. But the truth of a counterfactual statement depends very much on where the actual world is (counterfactuals are a <a href=\"https://ncatlab.org/nlab/show/graded+modality\">graded modality</a>) So if \"If Kangaroos had not tails they would topple over\" depends on what the closest world to the actual one is where they have no tails. Do they then have bigger feet?</p>\n</blockquote>\n<p>hmm, the maximum that I'm willing to accept is 'counterfactuals can be modeled as a <a href=\"https://ncatlab.org/nlab/show/graded+modality\">graded modality</a>', and even that is a tall order.</p>\n</blockquote>\n<p>The image on p11 from David Lewis' <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwj0lbb4iNbvAhUJnBQKHejAAFQQFjAAegQIBRAD&amp;url=http%3A%2F%2Fwww.andrewmbailey.com%2Fdkl%2FCounterfactuals_Comparative.pdf&amp;usg=AOvVaw1p7khi4DG99grWtt3WYOoR\">Counterfactuals</a> is a very helpful illustration of how counterfactuals are to be conceived. Ignore the red circles that I have added to start with. If we take his example with the following 4 propositions shown as areas on the map<br>\n<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ψ</mi></mrow><annotation encoding=\"application/x-tex\"> \\psi </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">ψ</span></span></span></span>: The party is Lively<br>\n<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>ϕ</mi><mn>1</mn></msub></mrow><annotation encoding=\"application/x-tex\"> \\phi_1</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>: Otto comes to the Party<br>\n<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>ϕ</mi><mn>2</mn></msub></mrow><annotation encoding=\"application/x-tex\"> \\phi_2</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>: Anna comes to the Party<br>\n<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>ϕ</mi><mn>3</mn></msub></mrow><annotation encoding=\"application/x-tex\"> \\phi_3</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">3</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>: Waldo Comes to the Party<br>\nThen we have from the actual world <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>i</mi></mrow><annotation encoding=\"application/x-tex\">i</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.65952em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">i</span></span></span></span> at the center of the black concentric circles that </p>\n<ul>\n<li>If Otto were to come it would be a lively party (because the closest grey area where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>ϕ</mi><mn>1</mn></msub></mrow><annotation encoding=\"application/x-tex\">\\phi_1</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> is true is a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ψ</mi></mrow><annotation encoding=\"application/x-tex\">\\psi</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">ψ</span></span></span></span> area)</li>\n<li>if Otto and Anna were to come it would be a dreary party (the is the second closest grey area)</li>\n<li>if Otto, Anna and Waldo were to come it would be a lively party (the third gray area)</li>\n</ul>\n<p>But now imagine that the person making that statement is wrong about the actual world being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>i</mi></mrow><annotation encoding=\"application/x-tex\">i</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.65952em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">i</span></span></span></span>. Perhaps the actual world is the center of the red concentric cicles. (A bit like Trump supporters were wrong about the result of the election). There the closest <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>ϕ</mi><mn>1</mn></msub></mrow><annotation encoding=\"application/x-tex\">\\phi_1</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">ϕ</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> worlds where Otto comes to the Party it is a dreary one  (ie a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">¬</mi><mi>ψ</mi></mrow><annotation encoding=\"application/x-tex\">\\lnot \\psi</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\">¬</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">ψ</span></span></span></span> world - perhaps he is depressed). But the closest worlds where  Otto and Anna come contain both dreary and non dreary worlds: i.e if Otto and Anna came to the Party it <strong>could</strong> be a lively party (perhaps some other turn of events happens that shows Otto's depression to be unfounded, and Anna gets on better with Otto).</p>\n<p>I think that this shows conclusively that in Lewis' analysis of Counterfactuals the truth of a counterfactual statement depends on the actual world. I am pretty sure that the proof theory at the end of the book would substantiate this.</p>\n<p><a href=\"/user_uploads/21317/E-Zyb5bWrBbYjvPkyUPilA7v/Counterfactuals.jpg\">Counterfactuals.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/E-Zyb5bWrBbYjvPkyUPilA7v/Counterfactuals.jpg\" title=\"Counterfactuals.jpg\"><img src=\"/user_uploads/21317/E-Zyb5bWrBbYjvPkyUPilA7v/Counterfactuals.jpg\"></a></div>",
        "id": 232317132,
        "sender_full_name": "Henry Story",
        "timestamp": 1617043933
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"318500\">ADITTYA CHAUDHURI</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232302529\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span>  Thank you  very much Sir for the references. What are the aspects of music  that  mathematical musical theory covers generally?   I am assuming that it must cover the formation of different scales as well as similarity in patterns between different scales in a mathematical way. </p>\n</blockquote>\n<p>It covers things like scales, chords, voice leadings, rhythms, etc.  In Western music there aren't so many scales as there in Indian music (ragas),  but there's also a lot more work on chords (bunches of notes within a scale, played simultaneously) and voice leadings (how to go from one chord to another chord).    </p>\n<p>So, a huge amount of mathematical music theory focuses on studying chords and voice leadings.   This is especially true for <a href=\"https://en.wikipedia.org/wiki/Neo-Riemannian_theory\">neo-Riemannian theory</a>, which has been studied using categories.   I pointed you to two papers on that.  If you want to get a feeling for what mathematical music theory using categories looks like, take a look at those papers:</p>\n<ul>\n<li>\n<p>Thomas Fiore and Thomas Noll, <a href=\"https://arxiv.org/abs/1102.1496\">Commuting groups and the topos of triads</a>.</p>\n</li>\n<li>\n<p>Alexandre Popoff, Moreno Andreatta and Andree Ehresmann, <a href=\"https://arxiv.org/abs/1801.02922\">Groupoids and wreath products of musical transformations: a categorical approach from poly-Klumpenhouwer networks</a>.</p>\n</li>\n</ul>",
        "id": 232331068,
        "sender_full_name": "John Baez",
        "timestamp": 1617049949
    },
    {
        "content": "<blockquote>\n<p>If each scale represents a particular set of emotions then naturally indirectly mathematical music theory should have a connection to the study of emotions. Am I misunderstanding anything here ?</p>\n</blockquote>\n<p>Most Western music in the \"<a href=\"https://en.wikipedia.org/wiki/Common_practice_period\">common practice period</a>\" from 1650 to 1900 used mainly just two scales: major and minor.   So, the mathematical music theory I know doesn't have a lot to say about scales and emotions.  Everyone says \"major is happy, minor is sad\".   That's an oversimplification, but it's not really a good basis for the study of emotions!   It's also not very interesting mathematically.</p>\n<p>There are probably music theorists who study emotions much more deeply.    But anyway, the use of <em>category theory</em> in music seems focused on neo-Riemannian theory, which is a detailed study of chords and voice leadings.</p>",
        "id": 232332009,
        "sender_full_name": "John Baez",
        "timestamp": 1617050372
    },
    {
        "content": "<p>So, I guess what I'm saying is that anyone who wants to apply category theory to psychology has a lot of work to do.  It's good to try, but it will require that some experts on psychology and some experts on category theory work together for a few years.   I don't think existing work on category theory and music will help a lot.</p>",
        "id": 232337648,
        "sender_full_name": "John Baez",
        "timestamp": 1617052653
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thank you Sir very much for the detailed explanation.</p>",
        "id": 232381973,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617087403
    },
    {
        "content": "<p>Has there been any approach to understand cognition or consciousness using the language of infinity categories ? At least to me it seems that the language of simplicial sets can be helpful in understanding any kind of network system involving higher dimensional networks.</p>",
        "id": 232412178,
        "sender_full_name": "ADITTYA CHAUDHURI",
        "timestamp": 1617105196
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232309557\">said</a>:</p>\n<blockquote>\n<p>I would <em>guess</em> that consonance and dissonance (which are mathematically definable) are universal-ish (but I'd be interested if anyone can correct me based on academic studies!)</p>\n</blockquote>\n<p>Ask and you shall receive: <a href=\"https://www.nature.com/articles/nature18635\">https://www.nature.com/articles/nature18635</a> (disclaimer: never read the paper, but I vaguely remembered it existed so I could google it fast)</p>",
        "id": 232427994,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1617112138
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232306728\">said</a>:</p>\n<blockquote>\n<p>Incidentally most people can't distinguish between the same piece transposed into different keys. You need at least approximate absolute pitch to be able to associate <em>anything</em> to keys, including emotions</p>\n</blockquote>\n<p>That's only if you are using equal temperament (e.g. as on a piano).  Such use is actually quite \"modern\", and isn't really a good reflection of music \"through the ages\"!  If interested, try this book: \"How Equal Temperament Ruined Harmony\" by Ross Duffin.  ($10 in Kindle on Amazon)</p>",
        "id": 232470546,
        "sender_full_name": "Robert Seely",
        "timestamp": 1617127506
    },
    {
        "content": "<p>The human voice can transpose music to any key without changing the ratios between tones; if you do this the different keys don't have different \"flavors\".   I bet most ordinary singers throughout the ages weren't well-trained enough to do anything else.  I think you need a bunch of well-tuned instruments around to associate different emotions to different keys.    I think most pianos in the world have generally been out of tune.</p>",
        "id": 232481585,
        "sender_full_name": "John Baez",
        "timestamp": 1617131799
    },
    {
        "content": "<p>Now that most (?) music is generated electronically, we're getting used to really precise tuning.  With high-quality electronic instruments it should be easy to explore different tuning systems, but most people don't.  </p>\n<p>My electronic piano has a bunch of different tuning system options.   I used to wonder if I could tell the difference, but it turns out to be easy: they all sound bad except for equal temperament.  And then, if I use another tuning system for a while, equal temperament sounds bad too.     When I reached the point where all tuning systems sounded bad, I decided I had to stop exploring this.</p>",
        "id": 232482619,
        "sender_full_name": "John Baez",
        "timestamp": 1617132214
    },
    {
        "content": "<p>I think you have this backwards, John, or else I misunderstand what you are saying.  Till the (late?) 19th century, equal temperament was unusual - the intervals between the semitones were not all equal.  That was a relatively \"modern\" development.   And so the keys did have different flavours till then.  One frequent misunderstanding is what Bach meant by \"Well Tempered Clavier\" - most scholars now agree that he didn't mean \"Equal Tempered Clavier\".  There were several different tunings around then which attempted to allow one to use different keys without sounding \"out of tune\", but were not intended to have the same equal semitones.  But one can dispute that! ;-)   One can actually prove this historical claim pretty convincingly by investigating church organs from before the 19C, and apparently they are differently tuned in different places.  Each town (or whatever) having its own \"preferred tuning\", it seems.</p>\n<p>And whatever this amounts to, certainly ordinary singers were well trained by all accounts - they gave each key its own flavour deliberately, as did (and do) players on instruments without fixed intervals (like the violin family) - I've been told by some violin-playing friends that when playing with other strings (like violas and cellos) that they do _not_ use equal temperament, because they get a better sound with \"natural\" intervals, and they prefer the sound.</p>",
        "id": 232483341,
        "sender_full_name": "Robert Seely",
        "timestamp": 1617132488
    },
    {
        "content": "<blockquote>\n<p>I think you have this backwards, John, or else I misunderstand what you are saying. Till the (late?) 19th century, equal temperament was unusual - the intervals between the semitones were not all equal. That was a relatively \"modern\" development.</p>\n</blockquote>\n<p>I didn't make myself clear. </p>\n<p>For different keys to have different flavors, we need a tuning system where individual notes (e.g. A, B, C, D,...) have specific frequencies attached to them.   Then a perfect fifth in the key of A will involve a different frequency ratio than a perfect fifth in the key of C.... unless we happen to use equal temperament.</p>\n<p>But I'm suggesting that for a lot of musicians throughout a lot of history, it would be hard to have a setup where individual notes have specific frequencies attached to them!</p>\n<p>Imagine the bare-bones situation: a group of people singing, with no instruments.   If they've got good ears it's easy for them to sing an octave, or a perfect fifth, etc.   So they can easily do something like Pythagorean tuning.   But unless they're really trying to make things complicated, their perfect fifth starting on one note will have the same ratio as their perfect fifth starting at any other note: 3/2.    That's because 3/2 is easy to do and it sounds great.   </p>\n<p>This is not equal temperament, but it <em>also</em> means that different keys won't have different flavors, unless they work to achieve that.   </p>\n<p>If they're singing in a church with an organ, then it's different: the organ will probably dictate the tuning system they use, as you suggest, and a song in the key of A will sound different than a song in the key of C.  But this is different from the highly mathematical approaches beloved by tuning freaks - you know, the kind who say \"Kirnberger III is better than meantone temperament\".  This is just people working with the instruments they have.    </p>\n<p>I've been to a village in Bali that had a gamelan with an unusual tuning system:  that is part of the charm of that village.   I think there's no real way to tune most of the instruments in a gamelan after they're built.   To what extent can you tune a pipe organ?</p>",
        "id": 232510236,
        "sender_full_name": "John Baez",
        "timestamp": 1617144810
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232510236\">said</a>:</p>\n<blockquote>\n<p>This is not equal temperament, but it <em>also</em> means that different keys won't have different flavors, unless they work to achieve that.   </p>\n</blockquote>\n<p>(Except to listeners with absolute pitch!)</p>",
        "id": 232512322,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617146101
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232510236\">said</a>:</p>\n<blockquote>\n<p>To what extent can you tune a pipe organ?</p>\n</blockquote>\n<p>Pretty sure it's impossible, you'd have to change the shape of every pipe individually. (I can imagine an organ design where every pipe has a \"piston\" and they're all attached to a rack whose height can be adjusted to pitch-bend every pipe at once. That might be something I just invented. Also it might sound terrible)</p>",
        "id": 232512609,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617146302
    },
    {
        "content": "<p>Indeed, organs have registries, that vary in tune and tone</p>",
        "id": 232513695,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617147135
    },
    {
        "content": "<p>So you do not tune them, but you can have multiple sets of the same thing tuned in different ways <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 232513734,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1617147164
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232512322\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232510236\">said</a>:</p>\n<blockquote>\n<p>This is not equal temperament, but it <em>also</em> means that different keys won't have different flavors, unless they work to achieve that.   </p>\n</blockquote>\n<p>(Except to listeners with absolute pitch!)</p>\n</blockquote>\n<p>Right!  But I was talking about a world without lots of precisely tuned instruments - the world of most people before electronics became cheap.   In that world, how much attention would people pay to absolute pitch?    If I'm an Inuit in ancient Greenland, or a poor peasant in medieval France, and I'm the only guy around with absolute pitch, am I going to complain that everyone else is singing a half-step sharp?   What does that even <em>mean?</em>    </p>\n<p>Am I going to think a song sounds really different if it's sung a half-step higher?   (Quite possibly.)</p>",
        "id": 232525717,
        "sender_full_name": "John Baez",
        "timestamp": 1617156626
    },
    {
        "content": "<p>Anyway, I'm getting a bit carried away talking about the Inuit.  A better example might be Gregorian chants, back before organs.  Did those monks have tuning forks, or did they just sort of wing it?  If the latter, they still could be really careful about getting the <em>relative</em> pitches within a chant exactly right.</p>",
        "id": 232526180,
        "sender_full_name": "John Baez",
        "timestamp": 1617157013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>, this playlist (in the Early Music Sources YT channel) may have what you are looking for...<br>\n<a href=\"https://www.youtube.com/playlist?list=PLWoQ_Z2-dWRmXI7KiHep_kG6BPqLEjl0K\">https://www.youtube.com/playlist?list=PLWoQ_Z2-dWRmXI7KiHep_kG6BPqLEjl0K</a></p>",
        "id": 232530711,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1617161221
    },
    {
        "content": "<p>Those looks nice!  Right now I'm talking about the dark realm of music where there aren't keyboards and tuning forks to firmly lock down tuning systems... but whether or not those YouTube videos get into that realm, they look really interesting.   I'm trying to learn more about early music and baroque music.</p>",
        "id": 232533623,
        "sender_full_name": "John Baez",
        "timestamp": 1617163835
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232533623\">said</a>:</p>\n<blockquote>\n<p>Those looks nice!  Right now I'm talking about the dark realm of music where there aren't keyboards and tuning forks to firmly lock down tuning systems... but whether or not those YouTube videos get into that realm, they look really interesting.   I'm trying to learn more about early music and baroque music.</p>\n</blockquote>\n<p>So this is where we disagree - I'll let you look up some authorities on tuning before the 19th century.  But here is my understanding.  This is not a question of having tuning forks, or other tuners, since it wasn't the exact frequencies that were important (it's a fact that something like \"middle C\" was interpreted as a different frequency in different locales - even within the same country or society - this has been verified by checking the tuning of organ pipes, which once in place are rather difficult to retune!)  The question was of relative intervals - what a mathematician would regard as ratios of frequencies (so e.g. an octave is 2:1, etc).  And there were several tuning systems in place during the period before the 19th C - And still today there are are different tuning systems (e.g. as I said before with string quartets, etc).  So the different keys actually had different intervals between the notes of an octave - and hence different \"qualities\" - some thing that was lost with equal temperament.  </p>\n<p>So, in short: we have nothing to teach musicians (say) before the 18th C - they knew how to tune their instruments \"perfectly\", and no electronic tuners were necessary - indeed, ask any solo guitarist today if they need such tuners!!  Certainly I never did - if the intervals between the strings were right (that can be done by ear), you're ready to go.  If you're playing with other guitarists, you all agree on (say) A, and go from there.  It gets more complicated the more instruments you're playing with, of course, and that's where a tuning fork or whatever is useful.  Or else just agree to agree with the violas!</p>",
        "id": 232697381,
        "sender_full_name": "Robert Seely",
        "timestamp": 1617246678
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276755\">@Robert Seely</span>, I think you and <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> are possibly talking past each other.  Either that or I'm misunderstanding what one or both of you are saying.  The tuning forks etc. nail down a base frequency to a particular note, and that nailing down, specifically, seems to be what John is avoiding.  If indeed \"middle C\" was interpreted as a different frequency in different locales, that would support not nailing down a base frequency to a particular note.  And I know enough European music history to know that you are absolutely correct that \"middle C\" was interpreted as a different frequency in different locales.</p>",
        "id": 232709500,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1617257873
    },
    {
        "content": "<p>Given a tempering and a base frequency for that tempering (e.g. the same equipment in the same conditions is used between trials), I'm sure many people could discern the differences when you transpose a piece to a neighboring key if the tempering is not equal.  I don't think there is any disagreement there.  I would also suggest that's not really the interesting phenomenon here – different things are perceived as different, which is practically useful, but not very interesting.</p>\n<p>Given a tempering, but allowing the base frequency to change between performances of a piece (suppose A is 425 Hz for one performance, but 440 Hz for another performance – perhaps you listen to an organ performance in one locale, then listen to it again in another locale) will probably give \"isomorphic\" performances to most people, since most people do not have absolute pitch.  As long as the relative frequencies are identical between performances, I don't think most people would notice a difference (especially if the piece features a positive number of changes in key).  By the way, I'm using the word isomorphism loosely here, hence the scare quotes.  I doubt there is an honest isomorphism here; see below.</p>\n<p><em>I</em> find this to be a more interesting phenomenon, as different things are perceived as the same.  It would be interesting to see what is the threshold ratio of frequencies before that \"isomorphism\" breaks.  I doubt most people would fail to recognize the difference if the transposition is by an octave, for instance!</p>",
        "id": 232709560,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1617257910
    },
    {
        "content": "<p>I have updated the picture from David Lewis' book with a morphism which would correspond to a change of belief, and which would have an accompanying emotional change, as possibilities and plans that were reachable from one state turn to be unreachable in another. For example a friend dies, and can no longer be spoken with. <br>\n(Note that the pictures don't show up on the archive)<br>\n<a href=\"/user_uploads/21317/74ijKf_6p5qNpCUJrIaGtIx-/Counterfactuals.jpg\">Counterfactuals.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/74ijKf_6p5qNpCUJrIaGtIx-/Counterfactuals.jpg\" title=\"Counterfactuals.jpg\"><img src=\"/user_uploads/21317/74ijKf_6p5qNpCUJrIaGtIx-/Counterfactuals.jpg\"></a></div>",
        "id": 232711417,
        "sender_full_name": "Henry Story",
        "timestamp": 1617259562
    },
    {
        "content": "<p>One can of course in this topological view of the space of possibilities, have points be possible worlds (a whole state of a universe). But it could also be temporal views with divergent futures and divergent pasts. David Lewis defines a counterpart relation on objects so that one can speak of objects that have some sort of identity relation across worlds.  The relation between Kripke and Lewis' notion of identity across worlds is analysed in Kohei Kishida's CT based thesis <a href=\"http://d-scholarship.pitt.edu/10224/\">Generalised Topological Semantics for First-Order Modal Logic</a>. (He does not look at Counterfactuals though, which brings a whole new dimension to the picture). One major interest is how Counterfactuals shows how non-monotonic reasoning works. And that is what we humans are best at. We are tuned for contextual shifts.</p>",
        "id": 232712003,
        "sender_full_name": "Henry Story",
        "timestamp": 1617260067
    },
    {
        "content": "<p>In <a href=\"https://t.co/gAUdGTxqmU?amp=1\">Man, Android, Machine</a> one can see how Philip K. Dick takes this counterpart view seriously. There are many of our counterparts that have exactly the same view and beliefs of the world. These are subjectively indistinguishable: that is you could not tell where on a map one is located. (This sounds like Homotopy Type Theory 's view of equality could be usefully applied here). One is streched out so to say across worlds, or over this space. (In classical view we are in exactly one world, but Lewis' view can easily take quantum indeterminacy into account).  Still beliefs being spaces of possbilities, reality may force us to the realisation that the world we thought we inhabited is just \"a dream\"). Such transformations correspond to such morphisms. And as I believe these can be seen to have an accompanying emotional value.</p>",
        "id": 232713032,
        "sender_full_name": "Henry Story",
        "timestamp": 1617260781
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276755\">Robert Seely</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232697381\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232533623\">said</a>:</p>\n<blockquote>\n<p>Those looks nice!  Right now I'm talking about the dark realm of music where there aren't keyboards and tuning forks to firmly lock down tuning systems... </p>\n</blockquote>\n<p>So this is where we disagree - I'll let you look up some authorities on tuning before the 19th century.  But here is my understanding.  This is not a question of having tuning forks, or other tuners...</p>\n</blockquote>\n<p>You keep saying things I agree with, and acting like I disagree.  I think our misunderstanding comes from the fact that I'm talking about the realm of music where <em>keyboards</em>, and tuning forks, and other such devices aren't available, so that it gets harder to lock down any sort of tuning system.   </p>\n<p>So: I'm not talking about 19th century or 18th century or 17th century or 16th century European art music, where they had keyboards easily available.   I'm talking about music like Gregorian chants, or pickup bands where a bunch of people start singing or playing the fiddle: <em>music where you get to decide on the tuning afresh each time you play a piece</em>.  I was trying to say most of the music played by most people for most of history was like this, and I was trying to say that in this situation it gets hard for different keys to have different \"personalities\".</p>\n<p>On a keyboard, the different keys will have different \"personalities\" (sets of frequency ratios) unless you adopt equal temperament.  Equal temperament lets you transpose any interval however you like and get another interval with the same frequency ratio.   But without equal temperament, a major third (for example) in some key must have a different frequency ratio than a major third in some other key.  So I completely agree that before the rise of equal temperament, keyboard music gave different keys different personalities.  This era goes back at least to 1511, it seems:</p>\n<p><a href=\"https://www.youtube.com/watch?v=nLa7GOKGMaQ\">https://www.youtube.com/watch?v=nLa7GOKGMaQ</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"nLa7GOKGMaQ\" href=\"https://www.youtube.com/watch?v=nLa7GOKGMaQ\"><img src=\"https://i.ytimg.com/vi/nLa7GOKGMaQ/default.jpg\"></a></div><p>But this is exactly <strong>not</strong> what I was trying to talk about.   I was talking about music where people strike up a tune purely with their voices, with no keyboard - or tuning fork, or anything else - to regiment them.  In this situation they can choose the tonic to be at any pitch they like, and choose to sing in Pythagorean tuning - or whatever tuning they like - starting from that tonic.   If they then sing starting from an A, a major third above that can have a frequency 4:3 as high... and if they sing starting from a B, a major third above that can have a frequency 4:3 as high... etc.   If they do this, different keys won't have different \"personalities\" (sets of frequency ratios).    </p>\n<p>Of course if they <em>want</em> they can choose to sing in such a way that different keys have different personalities, but without the aid of an instrument like a keyboard this seems harder.</p>",
        "id": 232713581,
        "sender_full_name": "John Baez",
        "timestamp": 1617261131
    },
    {
        "content": "<p>Continuing on the topological view of emotions above: <br>\n A very good example of such subjective trip through space, is from the famous computer animation <a href=\"https://en.wikipedia.org/wiki/Ratatouille_(film)\">Ratatouille</a>, where right at the end of the film the stern art critique tastes the dish made up by the mouse, and is transported back to his childhood, in a way reminscent to the famous work by Marcel Proust <a href=\"https://en.wikipedia.org/wiki/In_Search_of_Lost_Time\">In Search of Lost Time</a> where the whole book unfolds from his eating a <a href=\"https://fr.wikipedia.org/wiki/Madeleine_(pâtisserie)\">Madeleine</a>.  From there I think one could start tying this into music too.</p>",
        "id": 232713828,
        "sender_full_name": "Henry Story",
        "timestamp": 1617261291
    },
    {
        "content": "<p>I remember going to this talk at the Australian categories seminar, \"What can category theory say about cognition?\" by Steven Phillips. Abstract here: <a href=\"http://web.science.mq.edu.au/groups/coact/seminar/cgi-bin/abstract.cgi?talkid=1463\">http://web.science.mq.edu.au/groups/coact/seminar/cgi-bin/abstract.cgi?talkid=1463</a></p>",
        "id": 232765283,
        "sender_full_name": "Simon Burton",
        "timestamp": 1617287193
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232713581\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276755\">Robert Seely</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232697381\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232533623\">said</a>:</p>\n<blockquote>\n<p>Those looks nice!  Right now I'm talking about the dark realm of music where there aren't keyboards and tuning forks to firmly lock down tuning systems... </p>\n</blockquote>\n<p>So this is where we disagree - I'll let you look up some authorities on tuning before the 19th century.  But here is my understanding.  This is not a question of having tuning forks, or other tuners...</p>\n</blockquote>\n<p>You keep saying things I agree with, and acting like I disagree.  I think our misunderstanding comes from the fact that I'm talking about the realm of music where <em>keyboards</em>, and tuning forks, and other such devices aren't available, so that it gets harder to lock down any sort of tuning system.   </p>\n<p>...  I'm talking about music like Gregorian chants, or pickup bands where a bunch of people start singing or playing the fiddle: <em>music where you get to decide on the tuning afresh each time you play a piece</em>.  I was trying to say most of the music played by most people for most of history was like this, and I was trying to say that in this situation it gets hard for different keys to have different \"personalities\".</p>\n<p>...  I was talking about music where people strike up a tune purely with their voices, with no keyboard - or tuning fork, or anything else - to regiment them.  In this situation they can choose the tonic to be at any pitch they like, and choose to sing in Pythagorean tuning - or whatever tuning they like - starting from that tonic.   If they then sing starting from an A, a major third above that can have a frequency 4:3 as high... and if they sing starting from a B, a major third above that can have a frequency 4:3 as high... etc.   If they do this, different keys won't have different \"personalities\" (sets of frequency ratios).    </p>\n<hr>\n<p>Ok - this clarifies the point of difference, thanks!  But I would still beg to differ - I wasn't talking about keyboards (hence the explicit reference to guitars etc), but rather the intervals between tones.  And that remains the issue I think.  Singers, string players, and especially wind instruments (before keys!) all are very aware of the \"natural\" intervals between notes, and in the era of \"natural temperaments\", it really does make a difference where you put the various \"big\" and \"small\" semitones.  So: it really doesn't matter what your A is (as a frequency), but it does matter where the large and small semitone intervals occur.  And so different \"keys\" (even if they're not called that) will sound different.  They might not say they are singing in A or C or whatever, but different \"scales\" would still be something to be aware of.  </p>\n<p>But at this point I suspect we've drifted from the topics at hand .... ;-)   On this we'll agree, probably: different keys became a bigger deal with the advent of popular keyboard instruments.  (Remember my story of the harpsichordist who changed tuning  and so temperaments several times during her concert of Elizabethan music.)</p>\n</blockquote>",
        "id": 232792344,
        "sender_full_name": "Robert Seely",
        "timestamp": 1617297224
    },
    {
        "content": "<p>I really don't think we disagree about anything.</p>\n<blockquote>\n<p>it really does make a difference where you put the various \"big\" and \"small\" semitones. </p>\n</blockquote>\n<p>Since I play music, I know this.  It completely changes everything.</p>\n<blockquote>\n<p>So: it really doesn't matter what your A is (as a frequency), but it does matter where the large and small semitone intervals occur. And so different \"keys\" (even if they're not called that) will sound different. They might not say they are singing in A or C or whatever, but different \"scales\" would still be something to be aware of. </p>\n</blockquote>\n<p>I think I still haven't managed to convey my point.  </p>\n<p>I think you are trying to say this: different <a href=\"https://en.wikipedia.org/wiki/Mode_(music)#Modes_and_scales\">modes</a> sound extremely different: major, minor, Phrygian, Mixolydian, whatever.   Yes, because as you climb up any one mode the placement of tones and semitones differs!   But I was talking about something subtler.</p>",
        "id": 232803581,
        "sender_full_name": "John Baez",
        "timestamp": 1617301954
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232803581\">said</a>:</p>\n<blockquote>\n<p>I really don't think we disagree about anything. <br>\nI think I still haven't managed to convey my point.  </p>\n<p>I think you are trying to say this: different <a href=\"https://en.wikipedia.org/wiki/Mode_(music)#Modes_and_scales\">modes</a> sound extremely different: major, minor, Phrygian, Mixolydian, whatever.   Yes, because as you climb up any one mode the placement of tones and semitones differs!   But I was talking about something subtler.</p>\n</blockquote>\n<p>Well, I wasn't talking about different modes - without equal temperament, not all semitones are the same intervals, and so different keys (in the modern sense) actually do sound different, even with the same \"tone-semitone distribution\".  </p>\n<p>But maybe we've said all we can,  so maybe we can leave this till someday we meet again and can discuss this over a glass of beer or wine, or a cup of coffee!  ;-) </p>\n<p>(In the meantime, take a look at Duffin's book (if you've not already done so)).</p>",
        "id": 232808385,
        "sender_full_name": "Robert Seely",
        "timestamp": 1617303917
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232712003\">said</a>:</p>\n<blockquote>\n<p>The relation between Kripke and Lewis' notion of identity across worlds is analysed in Kohei Kishida's CT based thesis <a href=\"http://d-scholarship.pitt.edu/10224/\">Generalised Topological Semantics for First-Order Modal Logic</a>. (He does not look at Counterfactuals though, which brings a whole new dimension to the picture). </p>\n</blockquote>\n<p>Thanks, I did not know about the thesis and it's interesting. I guess I don't remember it, because I was not interested in FOL in 2011. now I am, so much appreciated, thanks! (about counterfactuals, my work is very different and adds more structure to Kripke models, as set-theoretical models.)</p>",
        "id": 232809917,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1617304546
    },
    {
        "content": "<p>Robert wrote:</p>\n<blockquote>\n<p>It really does make a difference where you put the various \"big\" and \"small\" semitones.   So: it really doesn't matter what your A is (as a frequency), but it does matter where the large and small semitone intervals occur.</p>\n</blockquote>\n<p>I wrote:</p>\n<blockquote>\n<p>I think you are trying to say this: different modes sound extremely different: major, minor, Phrygian, Mixolydian, whatever. Yes, because as you climb up any one mode the placement of tones and semitones differs!</p>\n</blockquote>\n<p>Robert wrote:</p>\n<blockquote>\n<p>Well, I wasn't talking about different modes - without equal temperament, not all semitones are the same intervals, and so different keys (in the modern sense) actually do sound different, even with the same \"tone-semitone distribution\". </p>\n</blockquote>\n<p>Well, you <em>were</em> just now talking about different modes, because you were talking about where the large and small semitone intervals occur.  Now you're saying something else, which I also agree with.</p>",
        "id": 232811111,
        "sender_full_name": "John Baez",
        "timestamp": 1617305035
    },
    {
        "content": "<p>Indeed I said the same thing a while back:</p>\n<blockquote>\n<p>On a keyboard, the different keys will have different \"personalities\" (sets of frequency ratios) unless you adopt equal temperament. Equal temperament lets you transpose any interval however you like and get another interval with the same frequency ratio. But without equal temperament, a major third (for example) in some key must have a different frequency ratio than a major third in some other key. So I completely agree that before the rise of equal temperament, keyboard music gave different keys different personalities.</p>\n</blockquote>",
        "id": 232811275,
        "sender_full_name": "John Baez",
        "timestamp": 1617305093
    },
    {
        "content": "<p>But this is well-known, and I only mentioned it to distinguish it from what I was <em>actually</em> trying to say.</p>",
        "id": 232811313,
        "sender_full_name": "John Baez",
        "timestamp": 1617305114
    },
    {
        "content": "<p>Do we have any string players here? I studied viola a bit, but on a very basic level... I remember spending many, many hours once trying to learn how to make a diminished fifth sound right, and then going to the next lesson feeling that I was totally incompetent - and then my teacher saying that I had made a huge progress and that my intonation was much better...</p>\n<p>I think that \"real\" string players should have lots of stories on how to find the right tuning for pieces - and it would be fun to hear how they tell these stories to an audience of mathematicians.</p>",
        "id": 232959190,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1617402478
    },
    {
        "content": "<p>I believe that category theory has a much higher than expected number of viola players</p>",
        "id": 232994967,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617443202
    },
    {
        "content": "<p>It's funny to explain it by saying that category theory plays a similar role in mathematics that violas play in an orchestra</p>",
        "id": 232994988,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617443248
    },
    {
        "content": "<p>Back to the general theme of this thread, I tried to use Chu spaces and related ideas for things relating to Information in a paper with J. Gratus,  A Spatial View of Information, Theoretical Computer Science, 365, (2006), pp. 206 - 215. Some of this has been picked up and taken much further by<br>\nChris Field and Jim Glazebrook,  eg. in  A mosaic of Chu spaces and Channel Theory I: Category-theoretic concepts and tools. J. Expt. Theor. Artif. Intell. 31(2), 177-213. doi:10.1080/0952813X.2018.1544282. They have other interesting papers in the same general direction.  I do not know if this helps.</p>",
        "id": 233610511,
        "sender_full_name": "Timothy Porter",
        "timestamp": 1617865465
    },
    {
        "content": "<p>Neat! Here's the arXiv link for the lazy:<br>\n<a href=\"https://arxiv.org/abs/1803.08874\">https://arxiv.org/abs/1803.08874</a></p>",
        "id": 233674827,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1617895808
    },
    {
        "content": "<p>Late to the discussion, but I play in string quartets a fair amount, and I have a faulty but nonnegligible sense of perfect pitch.</p>\n<p>Our default pitch tendency probably is equal temperament, but when we really sit down to tune a chord, it’s more about negotiating that particular chord at that moment in time (usually in the order of root, octave, fifth, third, seventh – i.e. more consonant intervals first). It’s much more dynamic than how a keyboard would be tuned: in a string quartet, the same note will sit in different places in different chords.</p>\n<p>So I don’t think we end up with markedly different characters in different keys, mostly because it isn’t globally coherent. But sometimes we do have to negotiate chords with open strings differently, and the relationship there would vary by key.</p>\n<p>Thus I tend to agree with John that I wouldn’t expect marked differences in different keys, unless the singers/performers were led to emulate it for some other reason than pure consonance/blending.</p>\n<p>Disclaimer: we cellists usually “get” to win the tuning disagreements ;)</p>",
        "id": 234015813,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1618116812
    },
    {
        "content": "<p>Musical anhedonia is a thing, so the way music interacts with the human brain seems to be a tad more complicated.</p>",
        "id": 235962965,
        "sender_full_name": "José Siqueira",
        "timestamp": 1619263407
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276692\">Bob Coecke</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232245517\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"318500\">ADITTYA CHAUDHURI</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/232185380\">said</a>:</p>\n<blockquote>\n<p>From our exposure to music we may  assume that  every scale (a sequence of musical notes ) when played in a particular time signature they somehow  expresses a particular human emotion. Though the converse may not be true that is whether every emotion can be expressed through some sequence of musical notes or not. If I assume that the converse is also true then in some sense studying human emotions will be same as studying different scale patterns in music. But I guess that  there are some good work on axiomatising music theory through category theory (for example <em>The Topos of Music</em> <a href=\"https://www.springer.com/gp/book/9783764357313\">https://www.springer.com/gp/book/9783764357313</a>). So in that case can the study of music theory will be considered as a study of human emotions(which is a part of human psychology)?</p>\n<p>I apologise priorly if I sound very naive. I am a music enthusiast and play some musical instruments. I always felt the connection of emotion and music. So I am just curious.</p>\n</blockquote>\n<p>We are currently using our quantum natural language framework, which is categorical, to generate music on quantum computers in collaboration with <a href=\"https://www.plymouth.ac.uk/staff/eduardo-miranda\">https://www.plymouth.ac.uk/staff/eduardo-miranda</a>  This must be the wildest thing I have ever done.</p>\n</blockquote>\n<p>I guess it would be interesting to have a music and mathematics thread. I'd be interested to know if there anyone has used the work from \"The Topos of Music\" to create new music that could not have been thought of before, or indeed if any music had come out of it. </p>\n<p>Not sure if the quantum computer work is related, but can one listen to anything? <br>\n(I know nothing about music theory so perhaps it is just that learning of it from the CT Side would be a good way to learn a new way to think of category theory)</p>",
        "id": 244962819,
        "sender_full_name": "Henry Story",
        "timestamp": 1625509103
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/244962819\">said</a>:</p>\n<blockquote>\n<p>I guess it would be interesting to have a music and mathematics thread. I'd be interested to know if there anyone has used the work from \"The Topos of Music\" to create new music that could not have been thought of before, or indeed if any music had come out of it. </p>\n</blockquote>\n<p>♩ <a href=\"https://mathematicswithoutapologies.wordpress.com/2021/05/05/does-mathematics-progress/#comment-21358\">On A Related Note</a> ♪ The Music Of The Primes ♫ <a href=\"https://oeis.org/wiki/Riffs_and_Rotes\">Riffs &amp; Rotes</a> ♬</p>\n<p>Now there’s a progression of progressions I could enjoy, musically speaking, ad infinitum, and yet this pilgrim would consider it progress, mathematically speaking, if he could understand <em>why</em> the sequentiae should be sequenced as they are.&nbsp; Would that understanding add to my enjoyment?&nbsp; On&nbsp;jugera …</p>",
        "id": 244963845,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1625510078
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306979\">Jon Awbrey</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/244963845\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/244962819\">said</a>:</p>\n<blockquote>\n<p>I guess it would be interesting to have a music and mathematics thread. I'd be interested to know if there anyone has used the work from \"The Topos of Music\" to create new music that could not have been thought of before, or indeed if any music had come out of it. </p>\n</blockquote>\n<p>♩ <a href=\"https://mathematicswithoutapologies.wordpress.com/2021/05/05/does-mathematics-progress/#comment-21358\">On A Related Note</a> ♪ The Music Of The Primes ♫ <a href=\"https://oeis.org/wiki/Riffs_and_Rotes\">Riffs &amp; Rotes</a> ♬</p>\n<p>Now there’s a progression of progressions I could enjoy, musically speaking, ad infinitum, and yet this pilgrim would consider it progress, mathematically speaking, if he could understand <em>why</em> the sequentiae should be sequenced as they are.&nbsp; Would that understanding add to my enjoyment?&nbsp; On&nbsp;jugera …</p>\n</blockquote>\n<p>There is also this blog I follow &#09758; <a href=\"https://alpof.wordpress.com/\">Alpof</a></p>\n<p>Jon</p>",
        "id": 244976806,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1625521808
    },
    {
        "content": "<p>Re: Math &amp; Music <span aria-label=\"1234\" class=\"emoji emoji-1f522\" role=\"img\" title=\"1234\">:1234:</span> <span aria-label=\"musical score\" class=\"emoji emoji-1f3bc\" role=\"img\" title=\"musical score\">:musical_score:</span> this just in &hellip; </p>\n<p><a href=\"https://alpof.wordpress.com/\">Alpof</a> &bull; <a href=\"https://alpof.wordpress.com/2021/07/16/strange-spaces-of-networks-and-chords/\">Strange Spaces of Networks and Chords </a></p>\n<p><a href=\"https://www.youtube.com/watch?v=wDWRFWb9Gqo\">https://www.youtube.com/watch?v=wDWRFWb9Gqo</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"wDWRFWb9Gqo\" href=\"https://www.youtube.com/watch?v=wDWRFWb9Gqo\"><img src=\"https://uploads.zulipusercontent.net/95ee10e7580c7eeb2ad8ba560a96b198908bf6a2/68747470733a2f2f692e7974696d672e636f6d2f76692f774457524657623947716f2f64656661756c742e6a7067\"></a></div>",
        "id": 246216030,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1626438298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306979\">Jon Awbrey</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/246216030\">said</a>:</p>\n<blockquote>\n<p>Re: Math &amp; Music <span aria-label=\"1234\" class=\"emoji emoji-1f522\" role=\"img\" title=\"1234\">:1234:</span> <span aria-label=\"musical score\" class=\"emoji emoji-1f3bc\" role=\"img\" title=\"musical score\">:musical_score:</span> this just in &hellip; </p>\n<p><a href=\"https://alpof.wordpress.com/\">Alpof</a> &bull; <a href=\"https://alpof.wordpress.com/2021/07/16/strange-spaces-of-networks-and-chords/\">Strange Spaces of Networks and Chords </a></p>\n<p><a href=\"https://www.youtube.com/watch?v=wDWRFWb9Gqo\">https://www.youtube.com/watch?v=wDWRFWb9Gqo</a></p>\n</blockquote>\n<p>Hey ! That's me ! :) I'm not sure I could follow most of the discussions here, but I'd be glad to discuss about math/music/category theory....</p>",
        "id": 246218695,
        "sender_full_name": "Alpofblog",
        "timestamp": 1626440112
    },
    {
        "content": "<p>I came across this <a href=\"https://hiddenbrain.org/podcast/one-head-two-brains/\">NPR interview of Ian McGilchrist</a> (<a href=\"https://en.wikipedia.org/wiki/Iain_McGilchrist\">wikipedia page</a>) on a book of his from 2010 \"The Master and His Emissary; The Divided Brain and the Making of the Western World\".  The author of the book <a href=\"https://paradigmexplorer.org/wp-content/uploads/2019/08/Network-Review-2009-101-final.pdf#page=5\">according to medical journal article</a>, was 2009 Fellow of the Royal College of Psychiatrists and fellow of All Souls College, Oxford. </p>\n<p>Let me assume that what he has written is generally correct - and I am sure there are people here who will have much better informed opinions on this. There is an interesting claim that the asymmetry in responsibility between left and right brain goes back 800 million years, that is that extremly simple creatures also have this asymetry.  The thesis is to simplify that the right part of the brain looks at generalities - one could call it context - and the left is geared more to precision, analytic, goal directed thought. The left hemisphere's focus helps the animal catch the prey, the right hemisphere helps the animal be aware of its surroundings to stop it from being prey.</p>\n<p>If this asymetry is so old, one may wonder if apart from being evolutionary based, which of course it has to be, if it is not also evolution discovering or using mathematical structures.</p>",
        "id": 247086885,
        "sender_full_name": "Henry Story",
        "timestamp": 1627150998
    },
    {
        "content": "<p>For example it seems remarkably close to dualities one finds between say monads focused inside a context, and comonads which have a position but operate on contexts.</p>",
        "id": 247087145,
        "sender_full_name": "Henry Story",
        "timestamp": 1627151420
    },
    {
        "content": "<p>Somewhat unrelatedly, the asymmetry in vertebrate anatomy can be traced back to the fact that <a href=\"https://royalsocietypublishing.org/doi/10.1098/rstb.2015.0410\">cilia twist in one direction, not another</a>.  There have been a lot of papers about this; I'm just linking to a random one.</p>",
        "id": 247092355,
        "sender_full_name": "John Baez",
        "timestamp": 1627159590
    },
    {
        "content": "<p>This of course does not deny that the way left-right asymmetry gets <em>used</em> by organisms is heavily affected by natural selection!</p>",
        "id": 247092363,
        "sender_full_name": "John Baez",
        "timestamp": 1627159639
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> Thanks for mentioning this. I agree &amp; also think it looks a lot like some kind of adjunction/duality.</p>\n<p>From what I've noticed there are two kinds of mathematical thinking: manipulating abstract syntax, versus direct experience/perception of concrete mathematics. These two are intertwined in various ways, but in my experience people generally excel in one of these two styles of thinking and not the other. I think that many famous collaborations between two mathematicians are divided along these lines.</p>",
        "id": 247135634,
        "sender_full_name": "Simon Burton",
        "timestamp": 1627233691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277321\">@Simon Burton</span> <a href=\"#narrow/stream/229111-general/topic/category.20theory.20in.20human.20psychology/near/247135634\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> Thanks for mentioning this. I agree &amp; also think it looks a lot like some kind of adjunction/duality.</p>\n<p>From what I've noticed there are two kinds of mathematical thinking: manipulating abstract syntax, versus direct experience/perception of concrete mathematics. These two are intertwined in various ways, but in my experience people generally excel in one of these two styles of thinking and not the other. I think that many famous collaborations between two mathematicians are divided along these lines.</p>\n</blockquote>\n<p>Dear Henry, Simon, et al.</p>\n<p><a href=\"https://scholar.google.com/citations?user=CguW_vwAAAAJ\">Susan Awbrey</a> and I have worked a lot and written a little on a variety of &ldquo;two-culture&rdquo; and &ldquo;cognitive style&rdquo; questions from a broadly pragmatic perspective informed by the work of C.S.&nbsp;Peirce, John Dewey, and like-minded thinkers.&nbsp; The three dimensional spaces of Peirce’s triadic sign relations afford a perspective on the ways diverse thinkers can specialize their thought to different planes or facets of a sign relation’s full volume. &nbsp; Sue has taught at all levels from middle school to graduate school and understands educational development and organizational diversity far better than I have any hopes of doing so I may try to talk her into joining in.&nbsp; Various issues along these lines are discussed in the following paper.</p>\n<ul>\n<li><a href=\"https://www.academia.edu/1266492/Conceptual_Barriers_to_Creating_Integrative_Universities\">Conceptual Barriers to Creating Integrative Universities</a></li>\n</ul>",
        "id": 247147616,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1627250146
    },
    {
        "content": "<p>Here is a complete different kind of possible relation between maths and psychology. This article argues that the fractal nature of the brain could allow it to make use of quantum states thus supporting Roger Penrose's hypothesis in \"The Emperor's New Mind\"<br>\nThe author gives a conversation overview <a href=\"https://theconversation.com/can-consciousness-be-explained-by-quantum-physics-my-research-takes-us-a-step-closer-to-finding-out-164582\">in this multimedia page on the web</a> and is based on this paper <a href=\"https://www.nature.com/articles/s41566-021-00845-4\">Quantum transport in fractal networks</a></p>",
        "id": 248185105,
        "sender_full_name": "Henry Story",
        "timestamp": 1627970711
    },
    {
        "content": "<p>&#x2205;</p>",
        "id": 248385200,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1628100026
    }
]