[
    {
        "content": "<p>hi everyone. I wanted to announce the existence of an interesting new community  code4math <a href=\"https://code4math.org/\">https://code4math.org/</a> which presumably you've heard about, if you watched the Topos Colloquium given by <span class=\"user-mention\" data-user-id=\"709799\">@Steven Clontz</span>  <a href=\"https://www.youtube.com/watch?v=SHkFslC7cew\">\"Sociotechnical infrastructure for mathematics research\"</a> two weeks ago.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"SHkFslC7cew\" href=\"https://www.youtube.com/watch?v=SHkFslC7cew\"><img src=\"https://uploads.zulipusercontent.net/300463324602f50cde0876d70809d6ccf46189ab/68747470733a2f2f692e7974696d672e636f6d2f76692f53486b46736c43376365772f64656661756c742e6a7067\"></a></div>",
        "id": 433045522,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1713013450
    },
    {
        "content": "<p>I think many of you will find the ideas interesting.</p>",
        "id": 433045582,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1713013522
    },
    {
        "content": "<p>Maybe you want to introduce yourself  and pi-base <span class=\"user-mention\" data-user-id=\"709799\">@Steven Clontz</span> ?</p>",
        "id": 433053128,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1713019905
    },
    {
        "content": "<p>Sure thing. I'm on the steering committee for <code>code4math</code> which came out of a recent <a href=\"http://AIMath.org\">AIMath.org</a> workshop on research cyberinfrastructure for mathematics. One of my interests is the use of <a href=\"https://arxiv.org/abs/2404.05778\">small semeantic mathematics databses</a> to support researchers, like <a href=\"https://houseofgraphs.org/\">House of Graphs</a>, that emphasize the curation of \"interesting\" objects (as opposed to brute-force calculating them).</p>\n<p>In particular, I've been asked to help create a version of the <a href=\"https://topology.pi-base.org\"><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>π</mi></mrow><annotation encoding=\"application/x-tex\">\\pi</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">π</span></span></span></span>-Base community database of topological counterexamples</a> for topos theory. We have a thread on the <code>code4math</code> Zulip if folks here are interested in that conversation: <a href=\"https://code4math.zulipchat.com/#narrow/stream/416467-pi-base/topic/pi-base.2C.20but.20toposes/near/432676630\">https://code4math.zulipchat.com/#narrow/stream/416467-pi-base/topic/pi-base.2C.20but.20toposes/near/432676630</a></p>\n<p>It's also been suggested that I plug a contributed paper session related to math education technology I'm co-organizing at MathFest, since abstracts are due on Monday. <a href=\"https://web.cvent.com/event/ed765988-92ef-48d0-a83c-fa653f09743c/websitePage:0af7504e-0dba-48b1-8956-1cb949778233?locale=en-US\">https://web.cvent.com/event/ed765988-92ef-48d0-a83c-fa653f09743c/websitePage:0af7504e-0dba-48b1-8956-1cb949778233?locale=en-US</a></p>\n<blockquote>\n<ol start=\"9\">\n<li>Open-Source Products for the Advancement of Math Education Research and Practice Description: This session will center open-source mathematics educational technologies and resources that ensure the right for scholars to innovate at no cost, sustained by the collaborations of open-source communities and ecosystems. Presentations will include original research enabled by such products, expository presentations on the use of such products in the classroom, and demonstrations showing how to use such products for the advancement of mathematics education research and practice.</li>\n</ol>\n</blockquote>",
        "id": 433055942,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1713022278
    },
    {
        "content": "<p>I don't know how relevant this is, but I am supporting a growing collection of mathematical software - Julia, Jupyter notebooks. Pluto notebooks, Lean4 and Coq. I'm disappointed at how difficult it is to install this software; I certainly find it challenging as an experienced systems administrator. Since I do have mathematician friends, it occurs to me to just get a Linux server and figure out how to install things in a single environment. Then I and others can have access to different software packages through the web and no one else has to learn how to manage the software end of things.</p>",
        "id": 433075244,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1713039215
    },
    {
        "content": "<p>My suggestion is to set up a devcontainer (I use GitHub Codespaces) so you don't even have to maintain your own server: <a href=\"https://g4m.clontz.org/ch-coding.html\">https://g4m.clontz.org/ch-coding.html</a></p>",
        "id": 433078422,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1713042171
    },
    {
        "content": "<p>But yeah the lack of DevOps in mathematics creates a lot of friction with computing assisted math.</p>",
        "id": 433078527,
        "sender_full_name": "Steven Clontz",
        "timestamp": 1713042267
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"709799\">@Steven Clontz</span>. I didn't know about Codespace, I love their support for Visual Studio Code and Jupyter notebooks. Visual Studio Code provides superior support for Jupyter notebooks, Julia, Lean4 and Coq. I already manage two servers and need to migrate them to better developer environments. I do this every few years to stay with the cheapest and most powerful environments.  It is unfortunate that many universities can only provide limited services to people because of security policies and such. I'm trying to find a cheap but powerful way to help mathematicians. For example I've made good use of Linode in the past to use packaged installations, so I could write my own package. I like the idea of creating \"distributions\" that others could easily get up and running for minimal money.</p>",
        "id": 433079878,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1713043780
    }
]