[
    {
        "content": "<p>I have a naive question. <br>\nDiffeomorphic manifolds have isomorphic de Rahm cohomology groups. De Rahm cohomology groups are also homotopic invariants - that is homotopically equivalent manifolds have isomorphic de Rahm cohomology groups.<br>\nIs there a categorical set up where later becomes immediate because of former?</p>",
        "id": 205021663,
        "sender_full_name": "Rama Kunapuli",
        "timestamp": 1595711162
    },
    {
        "content": "<p>The best way I know to show that homotopy equivalent but not necessarily diffeomorphic manifolds have isomorphic de Rham cohomology groups is to show that de Rham cohomology is isomorphic to ordinary cohomology, which is already known to be homotopy invariant.</p>",
        "id": 205022246,
        "sender_full_name": "John Baez",
        "timestamp": 1595712255
    },
    {
        "content": "<p>This is called <a href=\"https://ncatlab.org/nlab/show/de+Rham+theorem\">de Rham's theorem</a>, and you need to prove it anyway to understand de Rham cohomology.</p>",
        "id": 205022257,
        "sender_full_name": "John Baez",
        "timestamp": 1595712331
    },
    {
        "content": "<p>If you want category theory, you'll get some in the proof of de Rham's theorem: the nice proof uses sheaves!</p>",
        "id": 205022313,
        "sender_full_name": "John Baez",
        "timestamp": 1595712396
    },
    {
        "content": "<p>First of all thank you for pointing out Categorical aspects of de Rahm's theorem.</p>\n<p>SInce, smooth manifolds, cohomology groups categories exist and there are functors that map smooth manifolds and smooth maps to category of real vector spaces and linear maps, I was wondering if there is a categorical way of showing isomorphism of cohomology at least at the underlying topological spaces.</p>\n<p>Current method of showing using homotopy operators is nice and direct.  But instead of doing all this, if under certain conditions category theory can derive this results from already established proofs from de Rahm theorem. Looks like No, correct?</p>",
        "id": 205025568,
        "sender_full_name": "Rama Kunapuli",
        "timestamp": 1595718199
    },
    {
        "content": "<p>I don't know any \"categorical\" way of showing that de Rham cohomology is homotopy invariant without showing it's naturally isomorphic to ordinary cohomology, which <em>is</em> homotopy invariant.   This fact - that for smooth manifolds, de Rham cohomology is naturally isomorphic to ordinary cohomology - is de Rham's theorem.</p>",
        "id": 205026258,
        "sender_full_name": "John Baez",
        "timestamp": 1595719339
    },
    {
        "content": "<p>Perfect. Thank you.</p>",
        "id": 205026569,
        "sender_full_name": "Rama Kunapuli",
        "timestamp": 1595719825
    }
]