[
    {
        "content": "<p>Talking to Colin McLarty just now I learned he's writing two books:</p>\n<ul>\n<li>a history of the philosophy of mathematics, devoted mainly to the philosophical work of mathematicians.</li>\n<li>an introduction to categorical foundations: basically, category theory from scratch for people who are mainly interested in the foundations of mathematics.</li>\n</ul>",
        "id": 212243339,
        "sender_full_name": "John Baez",
        "timestamp": 1601848332
    },
    {
        "content": "<p>Very nice. Any hint when?</p>",
        "id": 212301730,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1601906041
    },
    {
        "content": "<p>A few years before they show up, I guess.</p>",
        "id": 212319788,
        "sender_full_name": "John Baez",
        "timestamp": 1601913489
    },
    {
        "content": "<p>Just yesterday I was asked what philosophies of mathematics are championed currently. I could point to some struggles tying to foundations and practice (and e.g. pointing towards some more structuralist conceptions of the notions of equality), but I feel those only indirectly tie to ontological/epistemological concepts. So yes, there's attitudes and all that comes with it (e.g. type-theory-grown-up folks will naturally live in another math world than, say, Hairer with his stochastic analysis research). But I'm not sure if there's many streams of thought - people that would write about their position explicitly in an argumentative way - among those that do the math. Like Weyl did, say. And the \"old\" terms (constructivists, Platonists etc.) still seem to be those words of classifications that apply, people still take on the roles as fleshed out 100 years ago?</p>",
        "id": 212325041,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1601915852
    },
    {
        "content": "<p>McLarty told me it was Felix Klein who introduced the formalist/logicist/intuitionist distinction in his <a href=\"http://www.gutenberg.org/ebooks/36154\">speech at the World's Fair in Chicago in 1893</a>.    (I always imagine him lecturing about mathematics in the midst of ferris wheels, but it seems he gave his speech at the University of Chicago.)</p>\n<p>But he considered them types of mathematicians, not philosophies.</p>",
        "id": 212325732,
        "sender_full_name": "John Baez",
        "timestamp": 1601916231
    },
    {
        "content": "<p>He starts: </p>\n<blockquote>\n<p>Among mathematicians in general, three main categories may be distinguished; and perhaps the names logicians, formalists, and intuitionists may serve to characterize them.</p>\n</blockquote>",
        "id": 212326062,
        "sender_full_name": "John Baez",
        "timestamp": 1601916403
    },
    {
        "content": "<p>If someone wants to see current issues in the philosophy of mathematics, you might point them to Elaine Landry's edited volume, <em><a href=\"https://global.oup.com/academic/product/categories-for-the-working-philosopher-9780198748991?cc=us&amp;lang=en&amp;\">Categories for the Working Philosopher</a></em>.</p>",
        "id": 212326698,
        "sender_full_name": "John Baez",
        "timestamp": 1601916736
    },
    {
        "content": "<p>I also like David Corfield's book, <em><a href=\"https://www.cambridge.org/core/books/towards-a-philosophy-of-real-mathematics/AA661F9049D69E6CDA3CD97DCCAD565F\">Towards a Philosophy of Real Mathematics</a></em>.</p>",
        "id": 212326869,
        "sender_full_name": "John Baez",
        "timestamp": 1601916830
    },
    {
        "content": "<p>I think it's really important for philosophers of mathematics to talk about new questions, not just the same old ones.</p>",
        "id": 212326960,
        "sender_full_name": "John Baez",
        "timestamp": 1601916864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Colin.20McLarty/near/212326062\">said</a>:</p>\n<blockquote>\n<p>He starts: </p>\n<blockquote>\n<p>Among mathematicians in general, three main categories may be distinguished; and perhaps the names logicians, formalists, and intuitionists may serve to characterize them.</p>\n</blockquote>\n</blockquote>\n<p>I take it that one or more of these words was used with a different meaning than we might give it today.</p>",
        "id": 212327260,
        "sender_full_name": "Reid Barton",
        "timestamp": 1601917021
    },
    {
        "content": "<p>Probably 'logicians' are a bit like what we call 'logicists', but we could easily read what Klein has to say about it.  I haven't read his speech.  I should, because I like Klein a lot.</p>",
        "id": 212328112,
        "sender_full_name": "John Baez",
        "timestamp": 1601917399
    },
    {
        "content": "<p>Well, it's easy to find:</p>\n<blockquote>\n<p>Among mathematicians in general, three main categories may be distinguished; and perhaps the names logicians, formalists, and intuitionists may serve to characterize them. (1) The word logician is here used, of course, without reference to the mathematical logic of Boole, Peirce, etc.; it is only intended to indicate that the main strength of<br>\nthe men belonging to this class lies in their logical and critical power, in their ability to give strict definitions, and to derive rigid deduction therefrom. The great and wholesome influence exerted in Germany by Weierstrass in this direction is well known. (2) The formalists among the mathematicians excel mainly in the skilful formal treatment of a<br>\ngiven question, in devising for it an \"algorithm.\" Gordan, or let us say Cayley and Sylvester, must be ranged in this group. (3) To the intuitionists, finally, belong those who lay particular stress on geometrical intuition (Anschauung), not in pure geometry only, but in all branches of mathematics. What Benjamin Peirce has called \"geometrizing a mathematical question\" seems to express the same idea. Lord Kelvin and von Staudt may be mentioned as types of this category.</p>\n</blockquote>",
        "id": 212328932,
        "sender_full_name": "John Baez",
        "timestamp": 1601917771
    },
    {
        "content": "<p>So, all three of the classifications are actually quite different from the logicists, formalists and intuitionists of later mathematical philosophy!</p>",
        "id": 212329051,
        "sender_full_name": "John Baez",
        "timestamp": 1601917810
    },
    {
        "content": "<p>In <em>The Man Who Knew Infinity</em>, the biographer calls Ramanujan a \"formalist\" - meaning he was very good at inventing <em>formulas</em>.  This is a bit like what Klein means by \"formalist\", though Klein actually says <em>algorithms</em>.</p>",
        "id": 212329162,
        "sender_full_name": "John Baez",
        "timestamp": 1601917888
    },
    {
        "content": "<p>The formalist/logician distinction sounds rather like the computer science theory A/B distinction we make these days. I wonder to what extent that's a fair analogy.</p>",
        "id": 212332951,
        "sender_full_name": "James Wood",
        "timestamp": 1601919925
    },
    {
        "content": "<p>Well I think you don't need to know much logic to be a formalist about mathematical objects.<br>\nBut John moreover just threw logicists into the mix, which I understand to relate to positivists.</p>",
        "id": 212340525,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1601923547
    },
    {
        "content": "<p>Logicists like Russell and Whitehead aimed to found mathematics on just \"logic\".   It led to an argument over where \"logic\" leaves off and where \"set theory\" starts.   For example, to what extent are sets just a way of dealing with predicates?     Quine had some strong opinions on what counts as \"logic\" and why second-order logic is set theory masquerading as logic.</p>",
        "id": 212351351,
        "sender_full_name": "John Baez",
        "timestamp": 1601929215
    },
    {
        "content": "<p>I tend to view set theories as as individually fine tuned higher-order logic as specified (by the axioms of ones desire) from a first-order vantage point.</p>",
        "id": 212367400,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1601939272
    },
    {
        "content": "<p>I'm hoping McLarty is still going to release the paper based on his 2018 ASL talk \"Class field theory in exponential function arithmetic (EFA)\" ....</p>",
        "id": 212390351,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1601967110
    },
    {
        "content": "<p>FWIW, here's the <a href=\"https://www.jstor.org/stable/26553110\">abstract</a>:</p>\n<blockquote>\n<p>Class field theory was the center of algebraic number theory from Dedekind and Hilbert right up until it led to, and merged with, current cohomological methods. While it is widely considered ‘abstract’ in the sense of being difficult to beginners to relate to arithmetic intuition, and many of its tools look to a naive glance to be third order arithmetic, it is logically quite concrete. This talk presents work on formalizing classical results and methods of class field theory in Exponential Function Arithmetic. This is so weak it lies below the thresh-old of current Reverse Mathematics. So this talk contributes to Harvey Friedman’s Grand Conjecture, saying all mainstream concrete mathematics lies inside EFA, and also to Angus Macintyre’s saying that (full) “Peano Arithmetic is far too strong for mathematics.”</p>\n</blockquote>",
        "id": 212390675,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1601967448
    },
    {
        "content": "<p>I'll try to remember to ask him about that sometime.</p>",
        "id": 212453060,
        "sender_full_name": "John Baez",
        "timestamp": 1602001934
    }
]