[
    {
        "content": "<p>Huh, there's an ACT discord now? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 208366167,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598632703
    },
    {
        "content": "<p>Yeah, it seemed like a silly split of the community.</p>",
        "id": 208366220,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1598632742
    },
    {
        "content": "<p>So much fragmentation</p>",
        "id": 208366242,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1598632752
    },
    {
        "content": "<p>My point exactly!  The intent is great, but the results might be sub-optimal.</p>",
        "id": 208366357,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1598632803
    },
    {
        "content": "<p>Specifically, we had an ACT Slack that sat around for a couple of years with very little activity, and a Telegram channel that occasionally gets activity but mostly migrated here</p>",
        "id": 208366398,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598632827
    },
    {
        "content": "<p>We must mend the great schism in applied category theory!</p>",
        "id": 208366454,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1598632862
    },
    {
        "content": "<p>My memory is hazy, but I <em>think</em> Christian's original idea was to create an ACT Zulip, and I argued that ACT is too small and he should make a general CT Zulip instead (and the rest is history)</p>",
        "id": 208366490,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598632880
    },
    {
        "content": "<p>The pre-creation planning was in fact done on the ACT Slack</p>",
        "id": 208366531,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598632902
    },
    {
        "content": "<p>Having just joined both groups and creeped them for a statistically significant 24 hours, there seems to be a marked difference between what is being said in each.  If you want to heal the schism one idea would be to start a stream or set of streams devoted to those of us brand-spanking new to the field and who have only self-study through books.  Just my opinion.  I myself look at the conversations here and lose all hope pretty quickly (this is not veiled criticism - it just reflects my newness and state of understanding categories).</p>",
        "id": 208432466,
        "sender_full_name": "Matt Wilbur",
        "timestamp": 1598705661
    },
    {
        "content": "<p>Is there an active invite link for the discord? The one on reddit has expired.</p>\n<p>editing to answer my own question: there's an up to date invite link in the discord server's twitter profile, <a href=\"https://twitter.com/appcats\">https://twitter.com/appcats</a> - I guess they'll keep that one up to date</p>",
        "id": 208433898,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1598707551
    },
    {
        "content": "<p>Nathaniel, try this one:</p>\n<p><a href=\"https://discord.gg/hTEpgYv\">https://discord.gg/hTEpgYv</a></p>",
        "id": 208458809,
        "sender_full_name": "Tharvanda",
        "timestamp": 1598742947
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"334732\">Matt Wilbur</span> <a href=\"#narrow/stream/229111-general/topic/Fresh.20invite.20link.3F/near/208432466\">said</a>:</p>\n<blockquote>\n<p>Having just joined both groups and creeped them for a statistically significant 24 hours, there seems to be a marked difference between what is being said in each.  If you want to heal the schism one idea would be to start a stream or set of streams devoted to those of us brand-spanking new to the field and who have only self-study through books.  Just my opinion.  I myself look at the conversations here and lose all hope pretty quickly (this is not veiled criticism - it just reflects my newness and state of understanding categories).</p>\n</blockquote>\n<p>Can you or anyone else suggest concrete-ish things we could do to be more welcoming to beginners? We talked about this quite a bit on <a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/stream/229122-general.3A-meta\">#general: meta</a> a while ago, specifically about the <a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> channel, which we \"rebranded\" at some point. It's still mostly pretty high level, it seems to be a self-perpetuating thing</p>",
        "id": 208684162,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598965803
    },
    {
        "content": "<p>Suggestion: someone needs to volunteer to be the idiot....</p>",
        "id": 208684828,
        "sender_full_name": "Simon Burton",
        "timestamp": 1598966186
    },
    {
        "content": "<p>You're right, Simon.  Someone just needs to ask simple questions.   People are too shy.  This is a friendly environment, there's no need to be shy if you're asking simple but more-or-less coherent questions about category theory (as opposed to \"how can I get my coffee machine to produce better espresso using category theory?\").</p>",
        "id": 209036653,
        "sender_full_name": "John Baez",
        "timestamp": 1599171991
    },
    {
        "content": "<p>I'm happy to carefully expose my ignorance whenever possible, so if people could ask more questions to give me opportunities to do that, it would be much appreciated. (not sarcasm; this is what I'm doing <a href=\"#narrow/stream/229199-learning.3A-questions/topic/D-modules/near/209070662\">here</a> right now)</p>",
        "id": 209071042,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1599210937
    },
    {
        "content": "<p>I'm not going to look on the discard because I don't want to make yet another account, could someone say how lively it is there? More or less lively than here?</p>",
        "id": 209077644,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1599215571
    },
    {
        "content": "<p>(Personally in my not at all biased opinion I think they should all just come over here as a group and continue doing exactly the same things but here, which is what happened with the very lively ACT telegram group)</p>",
        "id": 209077692,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1599215625
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Community.20Fragments/near/209077644\">said</a>:</p>\n<blockquote>\n<p>discard</p>\n</blockquote>\n<p>Freudian slip <span aria-label=\"speak no evil\" class=\"emoji emoji-1f64a\" role=\"img\" title=\"speak no evil\">:speak_no_evil:</span></p>",
        "id": 209102291,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1599231037
    },
    {
        "content": "<p>Yeah, I think the fact that discussions here are more high level can be frightening to absolute beginners, but really this is just a matter of perception. Up to now this community has been increadibly welcoming to answer any sort of question at any level, so I see no reason why people on discord shouldn't migrate over here <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 209103410,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1599231543
    },
    {
        "content": "<p>What do you think of creating streams where each topic is dedicated to a standard introduction book (Riehl's, MacLane's, Awodey's, etc...) ?</p>\n<p>I think many beginners self-study from these resources, so having a thread with material they have encountered or they know they will encounter soon might lead them to more readily open up. These topics would work kinda like asynchronous reading groups.</p>\n<p>As a proof of concept, the <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Joy.20of.20Cats\">Joy of Cats topic</a> has sparked lots of discussion on simpler results and definitions (compared to the rest of the topics in that stream.</p>",
        "id": 209118720,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1599239510
    },
    {
        "content": "<p>I looked a bit over there. It looks friendly. It may be a good place for beginners just coming to CT, who have not come over here, as there is less advanced stuff going on to frighten them. I found a few good intro videos posted there.  <br>\nIt may also be interesting to see how these different platforms compare. <br>\nI think one can be good here too as a novice, but one has to understand how to select one's firehose.</p>",
        "id": 209128126,
        "sender_full_name": "Henry Story",
        "timestamp": 1599245140
    },
    {
        "content": "<p>I think Zulip works better if you have less streams and use different topics within one stream, then you can only follow the topics you're interested in. It would definitely be reasonable to have a stream for books (good name to be determined) and a different topic for each book</p>",
        "id": 209138974,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1599252323
    },
    {
        "content": "<p>How about a general \"learning materials\" stream? Then we can recommend good pedagogical videos, papers etc. as well as books, and discuss them as well - I think that might be quite useful.</p>",
        "id": 209156294,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1599271603
    }
]