[
    {
        "content": "<p>I was thinking: It would be cool to have a stream/topic to chat in other languages, especially considering that many people that are into CT are also into languages. But I don't know what is the best way to do this. Any suggestions?</p>",
        "id": 191721137,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585130033
    },
    {
        "content": "<p>Yes, I had the same idea a couple of days ago to write in the constitution/whatever that folks are welcome/encouraged to create streams for discussion in other languages, and then forgot</p>",
        "id": 191728885,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585134218
    },
    {
        "content": "<p><a href=\"https://youtu.be/_T2-9MwA5JI?t=148\" title=\"https://youtu.be/_T2-9MwA5JI?t=148\">https://youtu.be/_T2-9MwA5JI?t=148</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"_T2-9MwA5JI\" href=\"https://youtu.be/_T2-9MwA5JI?t=148\" title=\"https://youtu.be/_T2-9MwA5JI?t=148\"><img src=\"https://i.ytimg.com/vi/_T2-9MwA5JI/default.jpg\"></a></div>",
        "id": 191730172,
        "sender_full_name": "Ash Shevlyakov",
        "timestamp": 1585134937
    },
    {
        "content": "<p><a href=\"https://github.com/marlon360/xr-graph\" title=\"https://github.com/marlon360/xr-graph\">https://github.com/marlon360/xr-graph</a></p>",
        "id": 191768115,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1585151716
    },
    {
        "content": "<p>It's probably good for starters to set up streams for different languages.  Unfortunately Zulip has just two levels in its hierarchy: \"streams\" and \"topics\".   So if there's a \"stream\" called \"French\", it cannot have two sublevels.</p>",
        "id": 191807975,
        "sender_full_name": "John Baez",
        "timestamp": 1585168747
    },
    {
        "content": "<p>Right. Is it okay if we create at least <em>streams</em> for different languages? I think it's the best we can do.</p>",
        "id": 191830188,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1585184492
    },
    {
        "content": "<p>I believe you have the power to create streams, <span class=\"user-mention\" data-user-id=\"275989\">@Paolo Perrone</span>.  Try going to STREAMS at left, then clicking on the little gear next to it.</p>",
        "id": 191832445,
        "sender_full_name": "John Baez",
        "timestamp": 1585187435
    },
    {
        "content": "<p>You'll get taken to a page with a bunch of streams listed.  The plus sign (+) there lets you create new streams.</p>",
        "id": 191832488,
        "sender_full_name": "John Baez",
        "timestamp": 1585187518
    },
    {
        "content": "<p>any updates on foreign-language streams? :-)</p>",
        "id": 192406264,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585668905
    },
    {
        "content": "<p>Update = there aren't any yet, feel free to create one</p>",
        "id": 192406736,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585669083
    },
    {
        "content": "<p>Make them, and people will start using them.   It takes 2 minutes to make one!  Go to STREAMS, click on the gear, then click on the faint plus sign to create a new stream.</p>\n<p>If someone wants a new stream but doesn't want to learn how to create one, just ask me.  I'm not going to do it until someone asks for a stream and tells me what it should be called.</p>",
        "id": 192416258,
        "sender_full_name": "John Baez",
        "timestamp": 1585673025
    },
    {
        "content": "<p>I took initiative and  just created a stream for Italian practicing/native speakers: <a class=\"stream\" data-stream-id=\"231111\" href=\"/#narrow/stream/231111-Italiano.2FItalian\">#Italiano/Italian</a></p>",
        "id": 192419565,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585674521
    },
    {
        "content": "<p>i just made a french one :-)</p>",
        "id": 192430844,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585679514
    },
    {
        "content": "<p>In social media, my friends and I routinely converse in a wide variety of languages ... sin dificultad para entenderse ... depuis plus d'une demi-décennie! Dans la plupart des cas, les services de traduction, fournis sur Internet, comblent largement le vide... Por ejemplo ... Google Translate has improved substantially over the years. It has made things quite transparent.</p>\n<p>The proper way to use the services, is with validation. For Google: that's what the double-arrow \"switch sides\" keys are for. Validation is done with the aid of reverse translation, accomplished by reversing direction; and using this you can refine and make corrections. Of course, it helps to know a bit of the target language; but as you go on you yourself become more proficient in it so that puoi apportare correzioni più intelligenti.</p>\n<p>As an exercise: Вы можете попытаться перевести это обратно на английский (Oops, the exercise is in Russian! Use the services to translate this or any other part of my reply, if you don't understand, and show us what you get.)</p>\n<p>And it's okay to be a little off; people see through that. We've had relationships with one another via the net that would be reduced to Neanderthal-speak and sign language were we face-to-face or on voice phone, though less so than before. And we've been in group chats where no two have the same native language; switching back and forth between each others', just for the fun of it. Two of my friends, male &amp; female have had an especially close relation throughout this time.</p>\n<p>The only warnings I would issue are that you need to be careful with pronouns (and their matching inflections) and be especially more vigilant with validation the less congruent the languages are (e.g. Mandarin and English). As an example: many of my FB friends are in the Arab world, and this requires extra care. I already have a head start in all the languages you see used here, with some proficiency in each, so this helps.</p>\n<p>So, feel free to mix it up to your heart's content! Wir sollten alle frei sein, uns so auszudrücken, wie es uns am besten passt.</p>",
        "id": 192623249,
        "sender_full_name": "Lydia Marie Williamson",
        "timestamp": 1585806483
    },
    {
        "content": "<p>I'm sorry, but j'comprends pas. Est-ce que vous comprendez tous les langues, or just that you have become really good at using google translate haha? Or both? По-моему, это прекрасно хаха, но I have to think there's probably a good chance of everyone getting lost. Aber vllt ist's der Punkt? Dass man kann was lernen? Meshe. B7ebbo! Debemos crear un stream por esto!</p>",
        "id": 192659824,
        "sender_full_name": "Bobby T",
        "timestamp": 1585831707
    },
    {
        "content": "<p>Personally I am a language enthusiast. I am quite familiar with 10-11 languages, but definitely not fluent in more than 3 or 4. Clearly knowing a lot of languages helps, but for instance I don't know German and I'm outright pathetic in Russian, and still the general meaning of your sentence is clear even without google translate <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 192660361,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585831989
    },
    {
        "content": "<p>But I have the feeling this may end up not working using non-indoeuropean languages. This interlinguistic ability of comprehend still relies, imho, on the fact that 90% of the languages we are using are indoeuropean</p>",
        "id": 192660456,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585832039
    },
    {
        "content": "<p>If I had to put Japanese, Hieroglyphic or Sumerian in a sentence (I still should figure out a way to write the last two here) I am pretty sure those bits would be unparsable</p>",
        "id": 192660581,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585832086
    },
    {
        "content": "<p>Actually I'd really like to create a topic/stream for aiding people with language learning. I'm talking learning techniques, not learning a language in particular. For instance, developing memory techniques really helped me big time to develop vocabulary, especially in languages that are far away from the ones I already know, where all the words sound different.</p>",
        "id": 192660807,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585832199
    },
    {
        "content": "<p>Actually, I did a bit of work on code-switching in my linguistics undergrad and you'd be surprised how much the language families don't really make a difference in being able to switch back and forth. There are going to be some language features that don't gel as well as others, but they're usually to do with word order, and those features aren't really distributed according to language family. Phylogenetic (family tree) distinctions have more to do with lexical similarities (which words for what concepts sound the same) than syntactic (word order) ones. That's not to say they don't sometimes have neat effects on code-switching, but they don't seem to interfere much</p>",
        "id": 192662659,
        "sender_full_name": "Bobby T",
        "timestamp": 1585833108
    }
]