[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280937\">@Archibald Juniper</span> <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> <br>\nI've been interested/curious about turning my research towards ecological networks. I just don't have the background in that or the energy to find someone who does. I was recently put in touch with someone though, so that might change. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> I'd be interested in hearing about your work.</p>",
        "id": 192605641,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1585783927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280937\">@Archibald Juniper</span> <a href=\"#narrow/stream/229111-general/topic/Introduce.20Yourself!/near/192602687\" title=\"#narrow/stream/229111-general/topic/Introduce.20Yourself!/near/192602687\">said</a>:</p>\n<blockquote>\n<p>Hi, I'm James,  a conjoint at the University of Newcastle of Newcastle, Australia. </p>\n</blockquote>\n<p>Hi James! </p>\n<blockquote>\n<p>As an economist with a passion for philosophy (in particular, Schelling, Deleuze, Whitehead, Peirce), I am interested in applications of category theory to macroeconomics, ecological economics, network analysis </p>\n</blockquote>\n<p>Paging <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span>: we really need an economics stream now.</p>\n<blockquote>\n<p>One aspect of this is would be the deployment of diagrammatic reasoning (especially, string diagrams) to regain control over machines for as Marx  observed, \"The hand tool makes the worker independent –posits him as proprietor. Machinery – as fixed capital – posits him as dependent, posits him as appropriated.\"</p>\n</blockquote>\n<p><del>Oooh... another Marxian,</del> this is gonna be fun! Jules is apparently a big fan of a planned economy, judging from his tweets.</p>",
        "id": 192613741,
        "sender_full_name": "(=_=)",
        "timestamp": 1585793380
    },
    {
        "content": "<p>Dear Joe (and other interested Zulip particpants),</p>\n<p>Please forgive this lengthy email, but it will take some effort to respond comprehensively to your question. My frustration is that most efforts at modelling have combined decent models of climate change with dodgy mainstream economic models like the Norhaus DICE model (e.g.<br>\nChristopher M. Kellet, Steven R.Weller, Timm Faulwasser, Lars Grune, Willi Semmler (2019) Feedback,Dynamics, and Optimal Control in Climate Economics?). As a result, the economic component of these models does not allow for insufficient effective demand, underutilization of labour and capacity, or meaningful financial interactions.</p>\n<p>Instead, I would like to develop models that draw on the Stock-Flow-Consistent (SFC) macroeconomic modelling tradition pioneered by Wynn Godley and Marc Lavoie. This includes researchers from the Bank of England (see <a href=\"https://www.bankofengland.co.uk/working-paper/2016/a-dynamic-model-of-financial-balances-for-the-uk\" title=\"https://www.bankofengland.co.uk/working-paper/2016/a-dynamic-model-of-financial-balances-for-the-uk\">https://www.bankofengland.co.uk/working-paper/2016/a-dynamic-model-of-financial-balances-for-the-uk</a> ) and the London Branch of the French Development Agency (<a href=\"https://www.afd.fr/en/ressources/modelling-small-open-developing-economies-financialized-world-stock-flow-consistent-prototype-growth-model\" title=\"https://www.afd.fr/en/ressources/modelling-small-open-developing-economies-financialized-world-stock-flow-consistent-prototype-growth-model\">https://www.afd.fr/en/ressources/modelling-small-open-developing-economies-financialized-world-stock-flow-consistent-prototype-growth-model</a> ). There's also a small group of Post-Keynesian ecological modellers at Greenwich University (Google Dafermos, Nikolaidi &amp; Galanni).</p>\n<p>I have supervised four PhD students who have developed SFC models and I'm trying to establish a network of modellers in Australia, such as Stephen Anthony, Chief Economist at Industry Super Australia ( <a href=\"https://www.industrysuper.com/media/the-matilda-model/\" title=\"https://www.industrysuper.com/media/the-matilda-model/\">https://www.industrysuper.com/media/the-matilda-model/</a> ). Modellers at the French Development Agency are also developing an ecological-cum-economic modelling suite called GEMMA.</p>\n<p>Many radical ecological economists are advocates of Latouche's \"Degrowth\". To my mind, this bodes ill for efforts to achieve both full empoyment and environmental sustainability. I am interested in the work of Soviet mathematical economists such as Kantorovich and Novozilov, who used Lagrangian methods to derive resource-efficiency metrics, which could be combined with input-output based techniques proposed by industrial ecologists, to reconcile these two objectives.</p>\n<p>Finally, I am interested in  your own work with the CASCADE team, which affords the opportunity to combine resource-efficiency (via Petri nets) with networks of differential equations (via signal-flow-graphs etc). To my mind, this has relevance for efforts by Post-Keynesian and evolutionary economists (e.g. Shiozawa, Yoshinori; Morioka, Masashi; Taniguchi, &amp;Kasuhisa, 2019, Microfoundations of Evolutionary Economics. Tokyo: Springer) to combine multi-industry modeling with the forecasting of macroeconomic aggregates.</p>\n<p>Does this prompt any interest on your part?</p>\n<p>Cheers,</p>\n<p>James</p>",
        "id": 192616108,
        "sender_full_name": "Archibald Juniper",
        "timestamp": 1585796813
    },
    {
        "content": "<p>James, this does interest me, but the econ is way outside what I know about.</p>",
        "id": 192624029,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1585807641
    },
    {
        "content": "<p>In terms of my work with CASCADE, I'm interested in turning the math we developed there towards ecological applications. I'm just looking for ways to do this.</p>",
        "id": 192624246,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1585808022
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280937\">@Archibald Juniper</span>: That's really interesting! I'm looking forward to interesting discussions with <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span>.</p>\n<p>Apologies for mislabelling you as a Marxian when you're a Post-Keynesian: I might have been a little presumptuous when I saw you quoting Marx.</p>",
        "id": 192625940,
        "sender_full_name": "(=_=)",
        "timestamp": 1585810168
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> I'll attempt a quick translation. The mainstream school of economics is <a href=\"https://en.wikipedia.org/wiki/Neoclassical_economics\" title=\"https://en.wikipedia.org/wiki/Neoclassical_economics\">neoclassical economics</a>, which makes a series of mathematically dodgy assumptions so that it can churn out the numbers using only linear programming and other 19th century mathematics. In particular, as James pointed out, it concludes that there cannot be a lack of demand, both for goods and for labour, and realistic money is not a built-in feature of their modelling. This was remedied by Keynes to some extent, and subsequently ignored or distorted by the mainstream: the torch is now carried by a school of economists known as <a href=\"https://en.wikipedia.org/wiki/Post-Keynesian_economics\" title=\"https://en.wikipedia.org/wiki/Post-Keynesian_economics\">Post-Keynesians</a>.</p>\n<p>James is interested in doing economic modelling using Post-Keynesian techniques to counter current models that marry climate change models with neoclassical economic models. In particular, he wants to use more rigorous techniques like the <a href=\"https://en.wikipedia.org/wiki/Stock-Flow_consistent_model\" title=\"https://en.wikipedia.org/wiki/Stock-Flow_consistent_model\">Stock-Flow consistent model</a> and (I guess) the <a href=\"https://en.wikipedia.org/wiki/Input%E2%80%93output_model\" title=\"https://en.wikipedia.org/wiki/Input%E2%80%93output_model\">input-output model</a>. He's not a fan of economists who say we have to kill the economy to save the world, and prefers a more sustainable approach that'd aim for full employment together with environmental sustainability.</p>",
        "id": 192627095,
        "sender_full_name": "(=_=)",
        "timestamp": 1585811254
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280937\">Archibald Juniper</span> Feel free to correct the above exposition. All that I know, I learned from Keen, and I'm sure I must have misremembered certain things.</p>",
        "id": 192627853,
        "sender_full_name": "(=_=)",
        "timestamp": 1585811666
    },
    {
        "content": "<p>I could create a stream for econ, it might be a bit narrow. Anything about econ that involves category theory should probably be in <a class=\"stream\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-applied-category-theory\">#applied category theory</a> though. My instinct is to broaden such a stream to include control theory, network science/complexity science etc, but then I don't know what to call it besides \"cybernetics\" which would mainly confuse everyone</p>",
        "id": 192645196,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585822531
    },
    {
        "content": "<p>Since my economic beliefs are being discussed, I'll clarify that my only fixed belief is \"economics is extremely difficult\"</p>",
        "id": 192645504,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585822747
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/economics.20stream/near/192645504\" title=\"#narrow/stream/229111-general/topic/economics.20stream/near/192645504\">said</a>:</p>\n<blockquote>\n<p>Since my economic beliefs are being discussed, I'll clarify that my only fixed belief is \"economics is extremely difficult\"</p>\n</blockquote>\n<p>Many apologies, Jules! <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n<p>I think \"economics is extremely difficult\" is a very sensible belief, because believing in the opposite has caused lots of intelligent people to engage in the over-optimisation of the economy, often to the detriment of many.</p>\n<blockquote>\n<p>Anything about econ that involves category theory should probably be in #applied category theory though.</p>\n</blockquote>\n<p>That stream has pretty diverse topics. It might be better to carve out a separate stream for things related to economics.</p>\n<blockquote>\n<p>My instinct is to broaden such a stream to include control theory, network science/complexity science etc, but then I don't know what to call it besides \"cybernetics\" which would mainly confuse everyone</p>\n</blockquote>\n<p>I think \"cybernetics\" is a fine name, mainly because it can remind people of <a href=\"https://en.wikipedia.org/wiki/Project_Cybersyn\" title=\"https://en.wikipedia.org/wiki/Project_Cybersyn\">this</a>. However, I think the topics you have in mind would be topics that <span class=\"user-mention\" data-user-id=\"280937\">@Archibald Juniper</span>  may find stimulating as well, so calling that stream \"economics\" would not be too confusing. Many non-mainstream schools of economics have certainly looked towards those areas for inspiration.</p>",
        "id": 192650742,
        "sender_full_name": "(=_=)",
        "timestamp": 1585826417
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/economics.20stream/near/192645196\" title=\"#narrow/stream/229111-general/topic/economics.20stream/near/192645196\">said</a>:</p>\n<blockquote>\n<p>I could create a stream for econ, it might be a bit narrow. Anything about econ that involves category theory should probably be in <a class=\"stream\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-applied-category-theory\">#applied category theory</a> though. My instinct is to broaden such a stream to include control theory, network science/complexity science etc, but then I don't know what to call it besides \"cybernetics\" which would mainly confuse everyone</p>\n</blockquote>\n<p>I am a multi-agent control theorist / roboticist (and part of the complexity and network science community) now running a firm that designs and analyzes OR and econ systems. It is <strong>cybernetics</strong> but frankly, that term confuses most people. A lot of the work in \"control\" (err steering) of social and economic systems is about structure and compositions of structures rather than explicitly forcing any particular behavior. As the social systems are increasingly entangled with computational systems it is important these structures get mapped and used to inform technology and policy decisions. My feeling is that there is a  lot of opportunity for CT to serve as a shared language capable of describing structure of the social processes and the technical processes, and furthermore, allows us to examine the structure of the system created by composing them.</p>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> for an econ stream (but maybe I am also advocating for calling it cybernetics) <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 192699182,
        "sender_full_name": "Michael Zargham",
        "timestamp": 1585848294
    },
    {
        "content": "<p>There is a cybernetics topic in <a class=\"stream\" data-stream-id=\"229179\" href=\"/#narrow/stream/229179-semiotics-and-semiosis\">#semiotics and semiosis</a>. And there was also some discussion in <a class=\"stream\" data-stream-id=\"229134\" href=\"/#narrow/stream/229134-philosophy\">#philosophy</a>. Maybe cybernetics is so general that it pops up at different places. I would actually like a cybernetics stream.</p>",
        "id": 192704568,
        "sender_full_name": "Johannes Drever",
        "timestamp": 1585850789
    },
    {
        "content": "<p>The creation of an economic stream would be marvellous. I’m familiar with The work of Jules and Victor in game theory and have been following the related literature on optics and profunctors. However, a lot of economic models, especially for macroeconomic research, use DEs (like much of the climate change modelling and predator-prey type analysis), which fits into a network analysis frame (signal flow graphs etc). Optimal control theory has been deployed in Economic policy analysis for a long time. The Von Neumann-Sraffa-Leontieff approach to multi-sectoral modelling Largely relies on  linear algebra. Integration across these domains is rare and difficult apart from research conducted within the  neoclassical computable general equilibrium modelling tradition. Of course, Post-Keynesians reject the principle of methodological individualism adopted by neoclassical economists.</p>",
        "id": 192739771,
        "sender_full_name": "Archibald Juniper",
        "timestamp": 1585869194
    },
    {
        "content": "<p>An <a class=\"stream\" data-stream-id=\"231468\" href=\"/#narrow/stream/231468-economics\">#economics</a>  stream now exists, thanks to <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span>. <span class=\"user-mention\" data-user-id=\"280937\">@Archibald Juniper</span>  <span class=\"user-mention\" data-user-id=\"275946\">@Johannes Drever</span> <span class=\"user-mention\" data-user-id=\"279778\">@Michael Zargham</span></p>",
        "id": 192746141,
        "sender_full_name": "(=_=)",
        "timestamp": 1585874254
    },
    {
        "content": "<p>There are aspects of economics that mathematicians are likely to find more believable than others would. For example: what happens when you take some money out of circulation (e.g. hide it under the bed). The answer is that it causes a minute amount of deflation, making all the other money worth a small amount more. Then when you remember the money under the bed and get it out to spend it, it gets its value back by causing a minute amount of inflation, making all the other money in circulation worth less.</p>",
        "id": 192753558,
        "sender_full_name": "Robert Smart",
        "timestamp": 1585883469
    },
    {
        "content": "<p>Have you read the \"markets are anti-inductive\" essay by Eliezer Yudkowski? <a href=\"https://www.lesswrong.com/posts/h24JGbmweNpWZfBkM/markets-are-anti-inductive\" title=\"https://www.lesswrong.com/posts/h24JGbmweNpWZfBkM/markets-are-anti-inductive\">https://www.lesswrong.com/posts/h24JGbmweNpWZfBkM/markets-are-anti-inductive</a><br>\nHow would you translate that in terms of games and categories?<br>\nIt's like there is always a meta-game such that any winning game that can be known (including by observing others who play it) thereby becomes a losing game as the knowledge is actively used.<br>\n<span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span></p>",
        "id": 193417354,
        "sender_full_name": "Faré",
        "timestamp": 1586418848
    }
]