[
    {
        "content": "<p>To write beautiful math, use double dollar sign to enter and leave mathmode.<br>\nTo focus on a stream or a topic, click on the name in the feed. Press escape to go back to the whole feed.<br>\nYou can subscribe to any streams, and make your own - public or private.</p>",
        "id": 191513308,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584986683
    },
    {
        "content": "<p>In general, let's try to keep things as organized as possible. Make streams at the right level of generality - for example, we could have one called #topos theory. Then within it, we can make topics like \"sheafification\". But topics are a little more loose; if you have some simple question, you can just ask.</p>",
        "id": 191513960,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584986908
    },
    {
        "content": "<p>You can tag people <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span> and streams <a class=\"stream\" data-stream-id=\"229111\" href=\"/#narrow/stream/229111-general\">#general</a> using \"@\" and \"#\". Of course you can share links and files.</p>",
        "id": 191514127,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584986982
    },
    {
        "content": "<p>Zulip opts for <em>two-level</em> organization, rather than one-level or infinite-level. This turns out to be really nice. When you want to simulate a thread within a topic, you can go up to a previous message, click the dropdown, and click \"quote and reply\".</p>",
        "id": 191514301,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584987045
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> <a href=\"#narrow/stream/229111-general/topic/tutorials/near/191514301\" title=\"#narrow/stream/229111-general/topic/tutorials/near/191514301\">said</a>:</p>\n<blockquote>\n<p>and click \"quote and reply\".</p>\n</blockquote>\n<p>It then copies the message inside a keyphrase \" <code>quote    </code> \", which you can then edit if you want to only quote part of a message.</p>",
        "id": 191514510,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584987135
    },
    {
        "content": "<p>You can always edit a message later. You can star some that you want to easily find later. In general the search bar at the top finds things very easily. [Though like every free version there is some limit; this chat only hold the most recent 10000 messages. If we want no limits, we can host one ourselves: <a href=\"https://zulip.readthedocs.io/en/stable/production/install.html\" target=\"_blank\" title=\"https://zulip.readthedocs.io/en/stable/production/install.html\">https://zulip.readthedocs.io/en/stable/production/install.html</a> .]</p>",
        "id": 191514882,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584987321
    },
    {
        "content": "<p>There's a zulip guide: <a href=\"help/getting-your-organization-started-with-zulip\" target=\"_blank\" title=\"help/getting-your-organization-started-with-zulip\">https://categorytheory.zulipchat.com/help/getting-your-organization-started-with-zulip</a>.<br>\nIf you want a feature, Zulip is open source. You can join the development channel at <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> , to either help or just ask.</p>",
        "id": 191515577,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584987624
    },
    {
        "content": "<p>You can customize a lot by the way, even the color of the streams.</p>",
        "id": 191519799,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584989564
    },
    {
        "content": "<p>great to see all of the introductions! so many people doing cool stuff.</p>",
        "id": 191521897,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584990570
    },
    {
        "content": "<p>my main message for the server: make it your own!<br>\nspeak up, make streams and topics about anything. this is an open and welcoming environment.</p>",
        "id": 191522029,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584990630
    },
    {
        "content": "<p>everyone is doing very different things, so don't worry about what people do and don't know. the server is for sharing.</p>",
        "id": 191522099,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584990680
    },
    {
        "content": "<p>If you want to see all streams that we have, go to settings (gear icon) and \"manage streams\". Then you can subscribe or unsubscribe to any.</p>",
        "id": 191523807,
        "sender_full_name": "Christian Williams",
        "timestamp": 1584991571
    },
    {
        "content": "<p>Announcement <span class=\"user-mention\" data-user-id=\"*\">@everyone</span> <br>\nYour email is visible to the members on this server. <a href=\"https://github.com/zulip/zulip/issues/11454\" target=\"_blank\" title=\"https://github.com/zulip/zulip/issues/11454\">https://github.com/zulip/zulip/issues/11454</a><br>\nIf you do not want this to be the case, you need to log in with another email. Sorry for the inconvenience.</p>",
        "id": 191657412,
        "sender_full_name": "Christian Williams",
        "timestamp": 1585076345
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"*\">@everyone</span>. Thank you for joining the Category Theory Community Server. It has grown so quickly; it's really amazing. The server is meant to be a home for everyone who loves categories. It's a place for open discussion, sharing work and ideas, advertising and participating in events and seminars, even collaborating on projects and more. </p>\n<p>We are still working to get everything organized and running smoothly. If you would like to help in general decisions, join the stream <a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/stream/229122-meta\">#meta</a> . Right now we just want to do a few things:</p>\n<ol>\n<li>\n<p>Make a guide to using this server - Everyone should get the most out of their experience here; first of course, everyone needs to know how to use all of the features of this platform. We encourage you to explore, reach out, and make yourself at home.</p>\n</li>\n<li>\n<p>Designate moderators - There will likely be little need for conflict resolution; moderators are just here to help members, keep things running smoothly in general.</p>\n</li>\n<li>\n<p>Draft a constitution - We want to keep this simple; there is a surplus of rationality on this server, so we don't need any more than some general guidelines.</p>\n</li>\n</ol>\n<p>I'll post the first soon (some of it is above), and the second and third are in progress. Please feel free to ask questions and share your thoughts. It's great that so many people have come together on here.</p>",
        "id": 191811957,
        "sender_full_name": "Christian Williams",
        "timestamp": 1585170861
    },
    {
        "content": "<p>Congratulations for setting this up, Christian!</p>\n<p>There will be little need for conflict resolution, but not none.  I've been moderating discussion forums since about 1992, and I've found that any interesting discussion forum eventually attracts 1) a few crazy people who are eager to have an audience, and 2) a few nasty people who take pleasure from insulting others.    In my experience, being quite prompt and unapologetic about kicking out both these kinds of people is required to keep a forum useful.   Otherwise people start spending their time arguing, and everyone gets more grumpy and rude.  </p>\n<p>The forum here is currently in its \"garden of Eden\" phase, where these problems haven't occurred yet.  Enjoy it while it lasts!</p>",
        "id": 191813035,
        "sender_full_name": "John Baez",
        "timestamp": 1585171484
    },
    {
        "content": "<p><strong>General</strong> Make yourself at home. Don't be afraid to reach out, ask questions, tell us about what you've learned and discovered. Start a new topic about whatever you think is great. Message someone if you share interests or just want to connect. We encourage members to have a profile picture, to help it feel more personal (doesn't have to be your face).</p>\n<p>There are so many amazing people here that it will take time and thought to coax all of that greatness onto a platform like this - so don't be afraid to get creative. If you think \"oh wow this expert is on here!\", maybe you could ask them to do an \"Ask Me Anything\" topic, so that everyone can share that knowledge.</p>\n<p><strong>Writing and Navigating</strong> To write beautiful math, use double dollar sign to enter and leave mathmode. To focus on a topic, click on the name in the feed. Press escape to go back to the whole feed. To quote something, do three backquotes and start typing \"quote\", and it will suggest the command and you can just press tab. To tag someone use \"@\" and to reference a stream or topic use \"#\". Share links and files as you would anywhere else.</p>\n<p>On any message, there is a dropdown on the right side which gives options such as \"quote and reply\"; this is to simulate threads, without having to deal with all the tree structure. When you do the dropdown on your own message, you can edit or delete anything you have written - for example if you make a small mistake in LaTeX, you can just go back and fix it.</p>\n<p><strong>Streams</strong> There are many channels or \"streams\" on this server. You choose which ones you subscribe to, by going to Menu (gear icon, top right) and then choosing \"Manage Streams\". In fact, everyone is free to make their own streams, and these can be both public (anyone can join) or private (invite people to join).</p>\n<ol>\n<li>We should try to make the streams at the right level of generality; \"math\" is too general, \"Yoneda lemma\" is too specific, but something like \"topos theory\" would be just right. Some may be more general than others, and that's okay.</li>\n<li>Give streams short, clear names in all lowercase, unless it is a proper title.</li>\n</ol>\n<p><strong>Topics</strong> Zulip uses a <em>two-level</em> structure, rather than having infinitely deep threads. This turns out to be ideal for in-depth conversation, where people are drawing ideas from each other and building a whole conversation together. As mentioned earlier, whenever you want to simulate threads you can use quote-and-reply.</p>\n<ol>\n<li>The server is mainly for discussion of math/computation/logic/science/philosophy. We are designating a stream called <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/stream/229451-off-topic\">#off-topic</a> for stuff that is not related to these. Of course since this is a very unusual time, please feel free to start topics such as <a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/stream/229451-off-topic\">#off-topic</a> : \"local situations\" (covid), or in <a class=\"stream\" data-stream-id=\"229111\" href=\"/#narrow/stream/229111-general\">#general</a> or a new stream, to share what is going on.</li>\n</ol>\n<p><strong>Customize</strong> We encourage everyone to make this place your own. In addition to subscribing, there are many aspects of the server that you can customize. Of course, appearance - text size, stream colors, etc. You control what notifications you get; maybe there's a couple streams that you want to stay updated on while the others are just in the background. This will be useful, because there is a lot going on here.</p>",
        "id": 191828357,
        "sender_full_name": "Christian Williams",
        "timestamp": 1585182545
    },
    {
        "content": "<p>we can update this guide as we go.</p>",
        "id": 191828701,
        "sender_full_name": "Christian Williams",
        "timestamp": 1585182847
    },
    {
        "content": "<p>Wrt. <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span>'s idea of asking your favourite famous professor to do an \"ask me anything\", keep in mind that your average lecturer is currently trying to bail out a sinking ship of online teaching. Ask politely, don't be too surprised if you get ignored</p>",
        "id": 191863977,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585218325
    },
    {
        "content": "<p>This might be of interest here :) <a href=\"/user_uploads/21317/Y9fbo6LLNuLH_U70Oi2-RU1z/DbCNzaPX4AATH1A.jpg\" title=\"DbCNzaPX4AATH1A.jpg\">DbCNzaPX4AATH1A.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Y9fbo6LLNuLH_U70Oi2-RU1z/DbCNzaPX4AATH1A.jpg\" title=\"DbCNzaPX4AATH1A.jpg\"><img src=\"/user_uploads/21317/Y9fbo6LLNuLH_U70Oi2-RU1z/DbCNzaPX4AATH1A.jpg\"></a></div>",
        "id": 192066611,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1585336328
    },
    {
        "content": "<p>I'm going to start some reorganizing - mainly just renaming streams to fit under categories, adding more categories and streams, and giving them explanatory descriptions. Please let me know whenever you have questions or suggestions.</p>",
        "id": 192996878,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586150985
    },
    {
        "content": "<p>I'll pause there, and brace for people to have feelings about the choice of categories. Just let me know what you think.</p>",
        "id": 192997837,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586152256
    },
    {
        "content": "<p>There are more \"creative\" categories/streams to be added, but they can be phased in as we test out the new ones in \"learning\". I'm looking forward to see some try out <a class=\"stream\" data-stream-id=\"232162\" href=\"/#narrow/stream/232162-learning.3A-show-and-tell\">#learning: show and tell</a>.</p>",
        "id": 192997935,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586152385
    },
    {
        "content": "<p>By default, streams are listed alphabetically. However, you can pin your favorite streams to the top.</p>",
        "id": 192998023,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586152506
    },
    {
        "content": "<p>Also just to say again: please check out all the streams and subscribe! Let's diversify and make lots of nice, well-defined microcosms. Yes, there are a lot of messages -- this place has become huge and it is inevitable. Each of us will learn to tune out what we don't care about. Don't be afraid to use the mute button, or if you know you'll never care about something you can always unsubscribe.</p>",
        "id": 192998343,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586152948
    },
    {
        "content": "<p>(Note how I made changes in what is for many members the dead of night.)</p>",
        "id": 192998422,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586153076
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> <a href=\"#narrow/stream/229111-general/topic/guide.2Fwelcome/near/192998422\" title=\"#narrow/stream/229111-general/topic/guide.2Fwelcome/near/192998422\">said</a>:</p>\n<blockquote>\n<p>(Note how I made changes in what is for many members the dead of night.)</p>\n</blockquote>\n<p>As someone in UTC+10, watching the changes happen live, my thought was \"Hmm, looks like Christian's doing all this right now to try to minimise disruption to users.\" :-)</p>",
        "id": 192998625,
        "sender_full_name": "Alexis Hazell",
        "timestamp": 1586153390
    },
    {
        "content": "<p>Oh haha, yep! Are you in Australia?</p>",
        "id": 192998761,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586153572
    },
    {
        "content": "<p>Yes, Melbourne. :-)</p>",
        "id": 192998901,
        "sender_full_name": "Alexis Hazell",
        "timestamp": 1586153792
    },
    {
        "content": "<p>We are now 1000 people. Amazing.</p>",
        "id": 196078766,
        "sender_full_name": "Christian Williams",
        "timestamp": 1588469264
    },
    {
        "content": "<p>Is the server private on purpose?</p>",
        "id": 196364309,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588711289
    },
    {
        "content": "<p>On the lean zulip chat, I can just copy the URL and give it to someone and they can join the conversation</p>",
        "id": 196364344,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588711303
    },
    {
        "content": "<p>here I need to dig up some kind of invitation link that somebody posted somewhere? (maybe I came here from a link on n-category cafe?)</p>",
        "id": 196364490,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588711355
    },
    {
        "content": "<p>Is this the intended state of affairs?</p>",
        "id": 196364497,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588711360
    },
    {
        "content": "<p>Talk to the boss, <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span>.</p>",
        "id": 196370106,
        "sender_full_name": "John Baez",
        "timestamp": 1588713803
    },
    {
        "content": "<p>It's possible we're trying to impose a little intelligence test.</p>",
        "id": 196370139,
        "sender_full_name": "John Baez",
        "timestamp": 1588713827
    },
    {
        "content": "<p>That's not insane; if Christian said that he thinks that's best for the CT community, I won't question it. </p>\n<p>My main motivation here is that I want to be able to show this place to people in other branches of mathematics to give them ideas about what's possible in online maths collaboration. But the Lean zulip chat already fulfills some of that purpose.</p>",
        "id": 196376727,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588717851
    },
    {
        "content": "<p>Hi, you can make an invite link by going up to settings and clicking \"invite users\". I don't think people have had that much trouble getting on here, considering that a sizable chunk of the global community has now joined.</p>",
        "id": 196384935,
        "sender_full_name": "Christian Williams",
        "timestamp": 1588724451
    },
    {
        "content": "<p>Great! Yeah, all the online math/CS communities can learn a lot from each other. Somewhere, probably on <a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/stream/229122-general.3A-meta\">#general: meta</a> we were talking about eventually consolidating these communities in a directory.</p>",
        "id": 196385092,
        "sender_full_name": "Christian Williams",
        "timestamp": 1588724558
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> <a href=\"#narrow/stream/229111-general/topic/guide.2Fwelcome/near/196384935\" title=\"#narrow/stream/229111-general/topic/guide.2Fwelcome/near/196384935\">said</a>:</p>\n<blockquote>\n<p>Hi, you can make an invite link by going up to settings and clicking \"invite users\". I don't think people have had that much trouble getting on here, considering that a sizable chunk of the global community has now joined.</p>\n</blockquote>\n<p>I don't think that's true. The only option I have is to generate an email invitation to someone whose email I know.<br>\n(I think people that are admins on this server can in fact generate a link by clicking the settings button.)</p>",
        "id": 196923265,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1588958053
    }
]