[
    {
        "content": "<p>When I am working it usually feels like every question I try to solve brings up three more, so that the thread of open questions I have becomes an ever growing tree. How do you choose what to prioritize?</p>\n<p>A related question - if you are writing up a paper, there may be many points at which you say \"At this point it would be natural to study these three other questions\" or \"at this point it is interesting to ask whether this is a special case of a more general theorem, we could conjecture that this is true.\" Supposing that you've decided to give up on pursuing those threads for the moment so that this work ends at some point, how many open questions like that is it reasonable to include? In my experience when I'm reading papers I rarely see the authors posing more questions than they answer, but in research it always feels like it's the case that you are posing far more questions than you can answer.</p>",
        "id": 338033287,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1677343769
    },
    {
        "content": "<p>It's funny; I've never felt this to be a big problem, and I guess it's because I have a strong sense that some questions are more \"important\" than others.  \"Important\" may secretly mean \"interesting to me\", but that's not how I perceive it: I perceive it as objective.  </p>\n<p>I usually write a paper when I've found something that seems like it will affect math or physics in a significant way.  I write the paper to emphasize this point and am pretty ruthless about suppressing other ideas, even interesting ones, if they seem to distract from this point.</p>",
        "id": 338037083,
        "sender_full_name": "John Baez",
        "timestamp": 1677345355
    },
    {
        "content": "<p>I think you should resist the temptation to include too much open questions. People want clear explanations and that's hard to explain very ongoing and undeveloped ideas. If you include too much of them it's going to look very messy. What I do is that I keep all the ideas in my head and pragmatically work on what is working. There are ideas that sound attracting but don't give much interesting outputs until you find the good way to approach them. And it can take a while. So I'd say that the best is to keep all the ideas in your head and once something produce clear results that are able to catch the interest of people, write a paper and make it very clear.  </p>\n<p>That's just my feeling of beginner researcher and I still haven't published anything. I think more experienced people are more able to keep their undeveloped ideas for themselves, classify their ideas by degree of development and publish the ideas in a good state <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> of development while mentioning in the paper the ideas in sate <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi><mo>−</mo><mn>1</mn></mrow><annotation encoding=\"application/x-tex\">n-1</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">n</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">−</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">1</span></span></span></span> which are more under the form of questions and don't mention the ideas in state <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>≤</mo><mi>n</mi><mo>−</mo><mn>2</mn></mrow><annotation encoding=\"application/x-tex\">\\le n-2</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7719em;vertical-align:-0.136em;\"></span><span class=\"mrel\">≤</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">n</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">−</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">2</span></span></span></span>.</p>\n<p>And I think you should prioritize the ideas that feel the easiest ones to bring to this state <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> without too much efforts but they should also be interesting and not too easy so I'd say prioritize the ideas that are the most able to produce new value for a minimal effort.</p>",
        "id": 338037192,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1677345399
    },
    {
        "content": "<p>There is maybe something also like there is so much to do in logic compared to older branches of math!</p>",
        "id": 338037877,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1677345763
    },
    {
        "content": "<p>Aristotle wrote <a href=\"https://plato.stanford.edu/entries/aristotle-logic/\">his works on logic</a> around 350 BC.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 338047580,
        "sender_full_name": "John Baez",
        "timestamp": 1677350786
    },
    {
        "content": "<p>That's true but there was a boom at the beginning of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi><msup><mi>X</mi><mrow><mi>t</mi><mi>h</mi></mrow></msup></mrow><annotation encoding=\"application/x-tex\">XX^{th}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8491em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8491em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\">t</span><span class=\"mord mathnormal mtight\">h</span></span></span></span></span></span></span></span></span></span></span></span> century when paradoxes appeared in math and computers were conceptualized (also categories appeared a little bit after). I think the first try to base mathematics on classical logic and set theory was a little bit unsuccessful and now we are progressively finding the good language with things like toposes, lambda-calculus, homotopy type theory and linear logic and there's lot to do to on one hand to develop these logical systems and on the other hand to re-express all mathematics in these languages (and also to relate this to the algorithms on computers).</p>",
        "id": 338048865,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1677351552
    },
    {
        "content": "<p>If I can offer a perspective not from within mathematics but from within health research (specifically, health informatics), here is what I generally do when I am publishing, toying around with ideas, and writing.</p>\n<p>You are very right that often, when you put ideas to paper, new ideas can arise rapidly. But to <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> 's point, yes, suppress the urge to go pursue these \"interesting\" or \"other\" ideas. In my situation, I work on grant monies and follow a proposal I had written that got this funding. Before any avenue of pursuit, whether paper or code or conversation, I always check myself against the proposal to make sure before pursuing an endeavor, I can answer these two questions: \"is this in direct alignment to what I had proposed?\" and \"does this particular endeavor best further the field's interests in X?\" where X is related to your research question. This does a very good job in weeding out 95% of distracting thoughts.</p>\n<p>There is a slight tension with this approach however: \"what if these new generated ideas feel 'too' important to be suppressed?\" In this situation, I take a slightly different, although within scope, tack. I write these ideas down like <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span> suggests -- that helps to provide an initial filter as when you have something written down, if you cannot articulate it well to yourself, it most likely (in my experience) is not worth pursuing. Then, I call up some of my trusted friends and colleagues familiar with this space and share these ideas. Whether in written or in verbal form we discuss some of the ideas to see if they actually are as important as I felt. Then, what could happen is you let some of these collaborators/friends pursue some of these ideas and thoughts, get good enough feedback to know this could be good to pursue for the future and write that down for future endeavors, or throw out the idea after review. In this process, I do not spend more than 6 - 10 hours socializing a list of ideas when there may be a slight lull with work.</p>\n<p>That latter paragraph may be more specific to healthcare as especially, some ideas that I stumble across could impact population healthcare. In that sense, there does feel for me a bit more of a moral responsibility to share when I discover a meaningful thread of thought that could be leading to adverse outcomes based on equity lines. But then, after this ad hoc review, I go right back to focusing on my tasks at hand. Moreover, generating above lists usually takes me several months of time and the result of many conversations. So, I wait until such a list gets rather long (maybe like 10 - 15 ideas in length) before I decide to take action in reviewing them. </p>\n<p>In short, I tackle the \"hydra problem\" by respecting each \"head\" as having its own line of thinking but continue to focus on the one that originally most interested me. Admittedly, as I mentioned in my field, there is a bit of a tension but most likely a similar tension could arise in mathematics as well -- still need to work on publishing something within maths someday to get a better feel! </p>\n<p>Does that help at all <span class=\"user-mention\" data-user-id=\"424412\">@Patrick Nicodemus</span> ? Apologies if this was too off base of your original question or incoherent!</p>",
        "id": 338049037,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1677351639
    },
    {
        "content": "<p>P.S. My above comments do not include however, the more unique situation in which these questions cause you to question, as a scientist, your own research path. That is an altogether different set of dilemmas!</p>",
        "id": 338049343,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1677351839
    },
    {
        "content": "<p>My own attitude is much more hydra-positive. Let the tale of how you vanquished your original head reach its epic conclusion, and then throw down a gauntlet of fresh hydra heads down for future adventures to tackle!</p>\n<p>I don't have time to work on all of the new research directions that arise, but I want someone to work on them, and the only way that will happen is if I point them out, in print or in person. The main thing you need to do is make sure that you separate the presentation of those things from the body of the paper so that they aren't too distracting. Also most people are more protective of their research ideas than I am, so bear in mind that pointing out a problem could result in someone solving it before you!</p>\n<p>(PS. since John has written a lot more papers than me, his advice may be wiser, but have a look at a paper of mine if you want to get an idea of my approach and see if you like it)</p>",
        "id": 338062164,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1677360431
    },
    {
        "content": "<p>Morgan, it seems like a very simple solution to organize such questions in a neat way at the tail of the paper. Good advice.</p>",
        "id": 338090817,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1677382404
    },
    {
        "content": "<p>I am somewhat protective of my research ideas but realistically I think will have to spend time and effort getting people to pay attention to things I have already figured out.</p>",
        "id": 338090948,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1677382481
    },
    {
        "content": "<p>I agree with the hydra phenomenon, but like Morgan I have a more positive attitude towards it and don't consider it problematic. It means that I will never be bored! <br>\nWhat I usually do is to try to write down these new questions. If I cannot write them down properly, they still need some maturation and I put them in a compartment in the back of my head. Then I try to spread these ideas. The ones that I found the more interesting I will include in the paper in a future work section. The others, I might try to share them here or discuss them with other researchers.<br>\nLike Morgan, I am not really protective of my research. First, other people that decide to pursue some ideas coming from my work definitely helps with my imposter syndrome: it means that what I do has some interest to it. Also, I don't lack ideas, but I lack time to tackle them. So if other people want to, it is great: less work for me and I can focus on other hydra heads. <br>\nFinally, it is possible that they are other researchers that are also working on these questions. If you don't share your ideas, you are creating a secret race where the winner (the first to publish) takes it all. If instead, you share your interest in these ideas, you might end up coauthoring a paper together.</p>",
        "id": 338157969,
        "sender_full_name": "Nicolas Blanco",
        "timestamp": 1677421743
    }
]