[
    {
        "content": "<p>Unfortunately, attempting an upper bound by math professors rules out a huge proportion of all category theorists! A substantial majority of category theorists are one or more of (1) more junior than that (2) not in academia (3) not in a math position. And there are already posts in this thread indicating that TAC authorship is not a very good upper bound. That said, you've repeat counted many authors in the TAC estimate, so I don't think <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">[</mo><mn>150</mn><mo separator=\"true\">,</mo><mn>2000</mn><mo stretchy=\"false\">]</mo></mrow><annotation encoding=\"application/x-tex\">[150,2000]</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">[</span><span class=\"mord\">150</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord\">2000</span><span class=\"mclose\">]</span></span></span></span> is a terrible estimate for \"professional mathematicians who would have self-identified as category theorists for some part of the last 20 years.\"</p>",
        "id": 554176409,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762458244
    },
    {
        "content": "<p>OK, so here was the estimates I was told: ~3000 category theorists, and ~300 applied category theorists.</p>",
        "id": 554199814,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762467679
    },
    {
        "content": "<p>I'd be amazed if there were as many as 3000 people who call themselves category theorists - as opposed to people who have written something that contributes to category theory, or the still more people who have used category theory in serious ways.  But I don't really know!  I'm just imagining 54 rows of seats, each with 54 seats in them, all full of people arguing about the best convention for what is a profunctor from C to D - and it seems a bit much!</p>",
        "id": 554203359,
        "sender_full_name": "John Baez",
        "timestamp": 1762469491
    },
    {
        "content": "<p>That's what I thought. Perhaps my title was badly chosen, the estimate was for \"category theorists\", not \"those who do/use category theory\" which is very much a bigger number. I wouldn't count all the people who do things like the theory of functional programming languages, for instance, among this number, though I could imagine a category theorist working on a problem adjacent to this.</p>",
        "id": 554205461,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762470582
    },
    {
        "content": "<p>I've changed the title of the topic to match the actual text of what I wrote. I think I was trying to be concise by using \"do CT\" instead of \"category theorists\"</p>",
        "id": 554205623,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762470656
    },
    {
        "content": "<p>But still, do you want to identify \"category theorists\" with \"people who call themselves category theorists?\" That makes a substantial difference, I think; for instance, I believe it would rule out Lurie as a category theorist.</p>",
        "id": 554205817,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762470777
    },
    {
        "content": "<p>To give a less ambiguous example, I wouldn't count Peter Scholze, for instance, despite the large amount of (infinity-)category theory that appears in his work. <br>\nI'd tend to classify Lurie as a homotopy theorist (keeping in mind Barwick's call to establish that field more firmly and not just as an attachment to topology, or, adding my own take, to (higher) category theory), given the focus of the theorems he proves, the 'school' of thought he came from and so on. But this is arbitrary. I'd call Emily Riehl a category theorist, though, despite the similarities. I think it's reasonable to say their work, while related, is not identical in focus.</p>\n<p>But this is splitting hairs. Say this changes the number by 50 or 100 either way, by nudging the boundary a little. If the number of category theorists is around 1500, or even 1000, this is not an earth-shattering difference.</p>",
        "id": 554206589,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762471212
    },
    {
        "content": "<p>Suppose one had to write something for the NSF giving a round number on the size of the international CT and ACT communities, for instance for funding. What figure would one pluck from the air?</p>",
        "id": 554206675,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762471253
    },
    {
        "content": "<p>we've used 300 as the number of ACT experts before for those purposes, based on looking at ACT conferences</p>",
        "id": 554208320,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1762472071
    },
    {
        "content": "<p>Well, but the thing is, I think it's really plausible that the number of people who \"are\" category theorists in more like the Lurie sense is several times the size of the number of people who identify as category theorists.</p>",
        "id": 554210062,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762473002
    },
    {
        "content": "<p>And someone like Lurie is surely \"in the international CT community\" in most reasonable senses, even if he doesn't publish in CT journals or attend (maybe?) CT conferences.</p>",
        "id": 554210113,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762473040
    },
    {
        "content": "<p>Yeah, I wouldn't really think of Lurie as a non-central example of a category theorist, whatever he primarily calls himself.</p>\n<p>EDIT: I think under any reasonable definition he's definitely a category theorist, whatever else he is, not someone who should be classified as \"maybe, maybe not\".</p>",
        "id": 554211647,
        "sender_full_name": "James Deikun",
        "timestamp": 1762473885
    },
    {
        "content": "<p>I can't quite parse your double negative, James...</p>",
        "id": 554213499,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762474814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span> if you had to pick a roundish figure for a report for CTists, what would it be? 150–2000 is a broad range! And I think 150 is too low, though I'm interested in active now, not over 20 years :-)</p>",
        "id": 554213753,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762474929
    },
    {
        "content": "<p>This is a bit of a silly discussion I know, but I've pondered it now and then just out of idle curiosity. It impacts thing like career expectations and community building etc</p>",
        "id": 554213883,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762474999
    },
    {
        "content": "<p>No, yeah, I also think it's quite interesting if not in some sense \"important.\" I wouldn't really want to pick a figure without first resolving some reasonably clear definition of \"category theorist\"...An operationalization I would find somewhat reasonable is \"count the number of distinct ArXiv authors posting a paper with primary or secondary subject Math.CT in the last five years.\"</p>",
        "id": 554214160,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762475130
    },
    {
        "content": "<p>...Having thus operationalized the question, I've gotten a robot to query the Arxiv API to help answer the question, which suggests a plausible answer of \"around 3000.\" Now, that includes some papers which are more or less fake, but also presumably misses some people who would genuinely qualify. So the \"3000\" answer may not be too bad. <br>\n<a href=\"/user_uploads/21317/ui0UTJRup2B7hflsZ6C3HbAV/math_ct_authors_plot.png\">math_ct_authors_plot.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/ui0UTJRup2B7hflsZ6C3HbAV/math_ct_authors_plot.png\" title=\"math_ct_authors_plot.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"3568x2068\" src=\"/user_uploads/thumbnail/21317/ui0UTJRup2B7hflsZ6C3HbAV/math_ct_authors_plot.png/840x560.webp\"></a></div>",
        "id": 554217774,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762477361
    },
    {
        "content": "<p>This is actually just for authors of papers with <em>primary</em> subject Math.CT.</p>",
        "id": 554217830,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762477396
    },
    {
        "content": "<p>Heh, was just looking at the arXiv api python package to see if I could get some bot to write some query for me....</p>",
        "id": 554217886,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762477431
    },
    {
        "content": "<p>You can just start with the bot and not even look up the python package first :)</p>",
        "id": 554217929,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762477450
    },
    {
        "content": "<p>Happy to share the Python code I didn't write if anyone wants to play with it.</p>",
        "id": 554218006,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762477492
    },
    {
        "content": "<p>I think that between attrition (early career) and retirement (late career), the underestimate that only asking for primary subject code gets you, and the extra you'd get from authors who <em>only</em> use math.CT as a  secondary code, it would all roughly even out.</p>",
        "id": 554218088,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762477541
    },
    {
        "content": "<p>Sure, send me that code :-D</p>",
        "id": 554218112,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762477555
    },
    {
        "content": "<p>The question is quite \"epidemiological\": determining the population of CTists, applied CTists. Implementing a model using AlgebraicJulia (maybe StockFlow.jl) would be a very ACTist way to close the loop.</p>",
        "id": 554242116,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1762494005
    },
    {
        "content": "<p>Are you proposing a \"susceptible-infected-resistant\" model of category theorists?   <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n<p>I actually think it's quite interesting to get a sense of the numbers of people working at different levels of intensity in this field... or any other field: people in any field should want to know what the field is actually like.</p>",
        "id": 554257490,
        "sender_full_name": "John Baez",
        "timestamp": 1762501950
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/How.20many.20category.20theorists.3F.20Applied.20CTists.3F/near/554257490\">said</a>:</p>\n<blockquote>\n<p>Are you proposing a \"susceptible-infected-resistant\" model of category theorists?   <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> was in the room with me when an old professor in Pisa called category theory \"an infectious disease\" <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 554257981,
        "sender_full_name": "fosco",
        "timestamp": 1762502112
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/How.20many.20category.20theorists.3F.20Applied.20CTists.3F/near/554217774\">said</a>:</p>\n<blockquote>\n<p><a href=\"/user_uploads/21317/ui0UTJRup2B7hflsZ6C3HbAV/math_ct_authors_plot.png\">math_ct_authors_plot.png</a></p>\n</blockquote>\n<p>Wow this is so cool. What a weirdly consistent logarithmic trend! Isn't it quite surprising?</p>",
        "id": 554730977,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1762788941
    },
    {
        "content": "<p>Anyway, I love this question. On this server there are 3592 users to this day, around 300 forthnightly active users. A 1:10 ratio of active to 'sleeper' CTist aligns with the rule of thumb for other communities on the internet.</p>",
        "id": 554732060,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1762789234
    },
    {
        "content": "<p>Not quite logarithmic, I suppose, since it seems to be accumulating at an asymptote? You would get a similar shape from partial sums of any geometric series, so it seems not unexpected if we have roughly constant annual relative growth.</p>",
        "id": 554760294,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762797165
    },
    {
        "content": "<p>I’m surprised the active to lurker rule of thumb ratio is so high, actually!</p>",
        "id": 554760496,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762797243
    },
    {
        "content": "<p>There was a jump in sign-ups when we hosted the CT4AI workshop chat. I'd wager most of those users never stuck, which means there is a ~700 excess to account for. Still, pretty high! <br>\n<a href=\"/user_uploads/21317/2LyEryQn08jMeODeEwCGCVjq/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/2LyEryQn08jMeODeEwCGCVjq/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"866x538\" src=\"/user_uploads/thumbnail/21317/2LyEryQn08jMeODeEwCGCVjq/image.png/840x560.webp\"></a></div>",
        "id": 554775715,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1762802895
    }
]