[
    {
        "content": "<p>Owen Lynch has started a list:</p>\n<ul>\n<li><a href=\"https://www.localcharts.org/t/learning-resources-for-applied-category-theory/8285\">Learning resources for applied category theory</a>.</li>\n</ul>\n<p>It's small but you can easily add to it, so please add your favorite articles, books, videos and other resources for learning applied category theory!</p>",
        "id": 393200168,
        "sender_full_name": "John Baez",
        "timestamp": 1695722094
    },
    {
        "content": "<p>I added <em>Sheaf Theory Through Example</em> under a <strong>Sheaf Theory</strong> header</p>",
        "id": 393231188,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1695734179
    },
    {
        "content": "<p>This seems like a good idea! I bookmarked the page for future reference, and added a couple resources.</p>",
        "id": 393258871,
        "sender_full_name": "David Egolf",
        "timestamp": 1695741421
    },
    {
        "content": "<p>By the way, I think it would be awesome if anyone knows of books that are introductions to applying category theory to areas of not traditionally \"applied\" mathematics. Probably this is not what we usually mean by applied category theory - which I think usually refers to applying category theory to areas like networked systems, computing science or very broadly science and engineering.</p>\n<p>However, I think it would be fascinating and instructive to read a book that explains how categorical ideas gradually worked their way into other areas of mathematics. Such a book could conceivably present a historical (non-categorical) approach to a topic parallel to a categorical treatment. Exercises could include practising translating statements between the two formalisms, and using insights from one approach to prove results stated in the language of the other approach.</p>\n<p>There are some introductory books to algebraic geometry that do a bit of this, I think? But these are still a bit too advanced for me to make much sense of.</p>",
        "id": 393268374,
        "sender_full_name": "David Egolf",
        "timestamp": 1695743491
    },
    {
        "content": "<p>That's a nice idea but the most definitive examples are algebraic topology and algebraic geometry, and indeed it's very hard, at least as far as experience shows thus far, to make those approachable, let alone via two paths at once. At least it would probably have to be an intuitive exposition, not a proper text for learning the subject, and I don't know whether such a thing exists.</p>",
        "id": 393287342,
        "sender_full_name": "Kevin Arlin",
        "timestamp": 1695748528
    },
    {
        "content": "<p>For some not-too-technical sources, you could look at the work of historians Leo Corry (Modern algebra and the rise of mathematical structures) or Ralf Krömer (Tool and object)</p>",
        "id": 393472314,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1695815837
    },
    {
        "content": "<p>Anyone who wants an \"approachable\"- or at least short - introduction to how categories get used in homotopy theory might try this informal thing I wrote:</p>\n<ul>\n<li><a href=\"https://math.ucr.edu/home/baez/calgary/homotopy.html\">A quick tour of basic concepts in simplicial homotopy theory</a>.</li>\n</ul>",
        "id": 393472574,
        "sender_full_name": "John Baez",
        "timestamp": 1695815927
    },
    {
        "content": "<p>Thanks for mentioning those! It's always fun to discover new resources.</p>",
        "id": 393521717,
        "sender_full_name": "David Egolf",
        "timestamp": 1695829469
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Looks very interesting. By the way, the  link to \"classifying spaces made easy\" is broken.</p>",
        "id": 400407383,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1699202248
    },
    {
        "content": "<p>I don't see the broken link but that page is here:</p>\n<p><a href=\"https://math.ucr.edu/home/baez/calgary/BG.html\">https://math.ucr.edu/home/baez/calgary/BG.html</a></p>",
        "id": 400424241,
        "sender_full_name": "John Baez",
        "timestamp": 1699220303
    },
    {
        "content": "<p>It's here: <br>\n<a href=\"/user_uploads/21317/JBC3O1StewesFmP09sB01Krl/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/JBC3O1StewesFmP09sB01Krl/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/JBC3O1StewesFmP09sB01Krl/image.png\"></a></div><p>The link points to <a href=\"https://math.ucr.edu/home/baez/BG.html\">https://math.ucr.edu/home/baez/BG.html</a> (slightly different address)</p>",
        "id": 400607525,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1699303452
    },
    {
        "content": "<p>Glad to see that the page isn't lost.</p>",
        "id": 400607550,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1699303474
    },
    {
        "content": "<p>Thanks very much!  I fixed the broken link.</p>",
        "id": 400689038,
        "sender_full_name": "John Baez",
        "timestamp": 1699345898
    }
]