[
    {
        "content": "<p>This is the first time I've seen phrases like \"up to coherent homotopy\" and \"<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord\">∞</span></span></span></span>-category\" in a paper on condensed matter physics:</p>\n<ul>\n<li>Eyal Cornfeld, Shachar Carmeli, <a href=\"https://arxiv.org/abs/2009.04486\">Tenfold topology of crystals</a>.</li>\n</ul>\n<blockquote>\n<p><strong>Abstract.</strong> The celebrated tenfold-way of Altland-Zirnbauer symmetry classes discern any quantum system by its pattern of non-spatial symmetries. It lays at the core of the periodic table of topological insulators and superconductors which provided a complete classification of weakly-interacting electrons' non-crystalline topological phases for all symmetry classes. Over recent years, a plethora of topological phenomena with diverse surface states has been discovered in crystalline materials. In this paper, we obtain an exhaustive classification of topologically distinct groundstates as well as topological phases with anomalous surface states of crystalline topological insulators and superconductors for key space-groups, layer-groups, and rod-groups. This is done in a unified manner for the full tenfold-way of Altland-Zirnbauer non-spatial symmetry classes. We establish a comprehensive paradigm that harnesses the modern mathematical framework of equivariant spectra; it allows us to obtain results applicable to generic topological classification problems. In particular, this paradigm provides efficient computational tools that enable an inherently unified treatment of the full tenfold-way.</p>\n</blockquote>",
        "id": 210588876,
        "sender_full_name": "John Baez",
        "timestamp": 1600475854
    },
    {
        "content": "<p>Woo! And this in the appendix: 'In the next sections, we shall discuss some “brave new algebra”, i.e., algebra done in the category of spectra.'</p>",
        "id": 210617980,
        "sender_full_name": "Simon Burton",
        "timestamp": 1600525861
    },
    {
        "content": "<p>Matter is wising up - learning new math.</p>",
        "id": 210619552,
        "sender_full_name": "John Baez",
        "timestamp": 1600527933
    }
]