[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/245502-general.3A-positions/topic/Sabbaticals.20in.20Tallinn/near/240879053\">said</a>:</p>\n<blockquote>\n<p>I'm gonna be on permanent sabbatical starting in one month.   That is, I won't be teaching anymore, but I'll still be a \"Professor of the Graduate Division\" at UCR.   I would love to visit your group for a while.</p>\n</blockquote>\n<p>you probably know jim jarmush' movie permanent vacation? it was after he dropped out of school. some of us took it seriously and followed suit. maybe i should consider the rest of my life as just faltering on that path. i am looking forward to hearing more about the permanence of permanent sabbaticals :)</p>",
        "id": 241656408,
        "sender_full_name": "dusko",
        "timestamp": 1622927515
    },
    {
        "content": "<p>I don't know about <em>Permanent Vacation</em>.</p>",
        "id": 241716962,
        "sender_full_name": "John Baez",
        "timestamp": 1623023892
    },
    {
        "content": "<p>Since I'm going to work for a month at the Topos Institute this summer, and I'll do lots of other stuff, I don't think of this next phase of life as a permanent vacation.   Permanent sabbatical is closer.  I actually think of it as \"freedom\".</p>",
        "id": 241716984,
        "sender_full_name": "John Baez",
        "timestamp": 1623023989
    },
    {
        "content": "<p>i didn't mean to suggest that you would be on a permanent vacation. it's a jim jarmush movie. the idea it might be interpreted that way didn't cross my mind. sorry. i only mentioned it because it's about our generation when they were very young, and the idea of permanence was kind of funny. permanent freedom sounds fantastic. congratulations :)</p>",
        "id": 241734652,
        "sender_full_name": "dusko",
        "timestamp": 1623047791
    },
    {
        "content": "<p>The phrase \"permanent vacation\" instantly made me scared because I've read, and I believe, that people who treat retirement as a vacation don't do well.   Most people can't really stand a permanent vacation, it seems.</p>",
        "id": 241986856,
        "sender_full_name": "John Baez",
        "timestamp": 1623186644
    },
    {
        "content": "<p>besides apologizing for clumsily using the phrase, i should perhaps explain that it didn't occur to me that i should be careful because the concept of \"retirement\" with respect to someone from my generation... not from my generation, maybe from my <em>context</em> --- the concept of retirement just  doesn't ring a bell. i would first need to identify with some job in order to be able to retire. John Baez has been a sort of a categorical concept since the times of Bob Dobbs. (i immediately said YESSS when i realized that the categorical narrative might resurrect on the web, after the unfortunate comedies and tragedies it went through. tho i confess that i didn't think that it could it work, so it was credo quia absurdum... but i guess it works.) in any case, it didn't cross my mind that some HR out there might make a difference for a categorical concept...</p>\n<p>i say this with full honesty and complete conviction. thou shalt not retire. no chance. worrying about that is a waste of energy.</p>",
        "id": 242034453,
        "sender_full_name": "dusko",
        "timestamp": 1623228834
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/245502-general.3A-positions/topic/Sabbaticals.20in.20Tallinn/near/241986856\">said</a>:</p>\n<blockquote>\n<p>Most people can't really stand a permanent vacation, it seems.</p>\n</blockquote>\n<p>well. the <em>second</em> time i quit academia was after i had to stop being a mathematician and become a computer scientist (family reasons) so i got a job at a CS dept and they have all these conferences, so i presented one paper in a hotel above the treeline in the amazonian rain forest, and the next one in pisa, and the next one on the ile de reunion off the coast of africa, and then again in italy, with a 7-course conference dinner in the village winery... so i said i don't want to travel <em>from vacation to vacation</em> to convince people that i had a good idea yesterday, i need to <em>build stuff</em> (like i did when i was a programmer). so i quit academia for the second time. it also quadrupled the salary. and then 10 years later i took a 65% pay cut to stop <em>building stuff</em>. that year we had a conference in moscow, and then in iceland... nothing is permanent, but i think it is fair to say that many scientists love vacations.</p>",
        "id": 242037110,
        "sender_full_name": "dusko",
        "timestamp": 1623230288
    },
    {
        "content": "<blockquote>\n<p>thou shalt not retire. no chance. worrying about that is a waste of energy.</p>\n</blockquote>\n<p>Thanks!  It's true I can't quit trying to do interesting stuff, at least not yet.  But I'm filling out lots of paperwork that says \"retirement\", and I'll stop teaching courses, which has been my main form of work for 30 years, and also ceasing to have grad students, at least for a while, and finishing up all my half-written papers with coauthors so I can make a fresh start: there's just one left.   So it feels like a big change.</p>",
        "id": 242090752,
        "sender_full_name": "John Baez",
        "timestamp": 1623255148
    },
    {
        "content": "<p>I don't think of conferences as vacations, but I know what you mean - they seem to be the way academics try to reward themselves.  It's bad to be zipping around the planet the way successful academics do; I realized a while back that was the biggest part of my carbon footprint, and I've tried, with partial success, to cut back.</p>",
        "id": 242092852,
        "sender_full_name": "John Baez",
        "timestamp": 1623255893
    },
    {
        "content": "<p>To quit going to conferences it helps to \"fall out of fashion\" and stop caring about the latest hot topics.   The older I get, the less I care about the latest fads, mainly because I've developed my ideas of what's interesting  - and I don't need a job, so I don't need to convince anyone that I'm doing something fashionable.  It helps that nobody has ever forced me to get grants.</p>",
        "id": 242093375,
        "sender_full_name": "John Baez",
        "timestamp": 1623256100
    },
    {
        "content": "<p>Well, recently they tried but then I quit.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 242093470,
        "sender_full_name": "John Baez",
        "timestamp": 1623256148
    },
    {
        "content": "<p>Hmm, can you say more?</p>",
        "id": 242133421,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623274239
    },
    {
        "content": "<p>I'm old, I can always say more. Just name a subject.</p>",
        "id": 242146119,
        "sender_full_name": "John Baez",
        "timestamp": 1623283563
    },
    {
        "content": "<p>This one:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242093470\">said</a>:</p>\n<blockquote>\n<p>Well, recently they tried but then I quit.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>\n</blockquote>",
        "id": 242187013,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623321636
    },
    {
        "content": "<p>Well, we have lots of committees to do the various kinds of work the department needs done.  As you advance, the chair of the department starts wanting you to head more and more of those committees.    For example, I've been in charge of hiring visiting assistant professors... and this year I was in charge of graduate courses.  I see why this sort of work needs to be done, and the work I've done so far has not been onerous compared to what <em>some</em> people do - but I could see which way this was heading, so I'm glad to jump ship.</p>\n<p>The ultimate sacrifice would be to become the chair of the department.</p>",
        "id": 242267766,
        "sender_full_name": "John Baez",
        "timestamp": 1623357690
    },
    {
        "content": "<p>Yat Sun Poon is a saint.</p>",
        "id": 242268010,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1623357799
    },
    {
        "content": "<p>But he's a saint who wants us all to work for the church.</p>",
        "id": 242268130,
        "sender_full_name": "John Baez",
        "timestamp": 1623357844
    },
    {
        "content": "<p>My department hasn't been able to appoint a head for the past three years or so. We tried, and the old person stayed on in an acting capacity...until he retired in February! We now have another acting head, who now has agreed to serve for a second six months, but I gather doesn't actually want the position.<br>\nIt doesn't help that Sydney University's maths department (much more prestigious than us) is now also advertising for a head, and louder.</p>",
        "id": 242279666,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623364246
    },
    {
        "content": "<p>And the university isn't actually advertising, yet, even after knowing for six months it needed to, but using a company that is probably best described as doing \"executive talent search\".</p>",
        "id": 242280474,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623364607
    },
    {
        "content": "<p>I don't understand why employers sometimes resort to using recruitment agencies instead of openly advertising openings... but as someone looking for a new job at the moment I have to say going through an agency is a lot more convenient than actually looking at lists of openings.</p>",
        "id": 242281020,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1623365018
    },
    {
        "content": "<p>I suppose in this situation the university might be thinking that they need to solicit people not actively seeking new employment and that it would be better that such solicitation happens at arms length for some reason.</p>",
        "id": 242281352,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1623365231
    },
    {
        "content": "<p>Personally I think it's because we just won't get someone if we don't hire an agency to go and cosy up to some people and convince them privately they might want the job. Things have been, shall we say, slightly less than functional here for a little bit.</p>",
        "id": 242291658,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623375353
    },
    {
        "content": "<p>It's not so much an agency as a head-hunting outfit.</p>",
        "id": 242291709,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1623375388
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242267766\">said</a>:</p>\n<blockquote>\n<p>Well, we have lots of committees to do the various kinds of work the department needs done.  As you advance, the chair of the department starts wanting you to head more and more of those committees.    For example, I've been in charge of hiring visiting assistant professors... and this year I was in charge of graduate courses.  I see why this sort of work needs to be done, and the work I've done so far has not been onerous compared to what <em>some</em> people do - but I could see which way this was heading, so I'm glad to jump ship.</p>\n<p>The ultimate sacrifice would be to become the chair of the department.</p>\n</blockquote>\n<p>when i become a grad student, my first salary was 1503 gulden, and my previous feelance programmer salary was 7500 gulden, so my thesis advisor was sort of stunned that i accepted it.  he thought about it and said: \"i know what you mean. you want to be an academic. you don't want to be rich. you don't want to sit in meetings, to manage budgets and sort out conflicts. you don't want to play political games and hate your enemies. as your academic career advances, you will be spending more and more time in meetings, you will be managing more and more money and people. political games will catch up with you, and to prevent your enemies from doing terrible things you will be spending most of your time in meetings, on management, budgets and conflicts. the only one of your original commitments that you will fulfill will be that you won't get rich.\"</p>",
        "id": 242306946,
        "sender_full_name": "dusko",
        "timestamp": 1623394144
    },
    {
        "content": "<p>Lol <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 242320915,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623403829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"294557\">@dusko</span> What would you say today? Was your thesis advisor right?</p>",
        "id": 242572881,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1623663408
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"383799\">Tom Hirschowitz</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242572881\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> What would you say today? Was your thesis advisor right?</p>\n</blockquote>\n<p>it is a surprisingly difficult question, even if restricted to a single sample.</p>\n<p>that science as a social process that dwindles back to politics (just done by blundering amateurs) seems largely true. i am not happy to say this. most of my best friends are influential academics. they are good honest people. but there is no denying that most research communities behave like political parties, and many of the people wielding most power in science are those who replace their  research programs by strategic behaviors. (science as an evolutionary interaction between our species and nature seems to develop a level above. or behind our backs: the internet was developed for the case of nuclear war; the web to distribute physics preprints; CRISPR arose from classifying antiviral mechanisms...)</p>\n<p>is the sinkhole of politics inescapable for individual scientists? that is where the question becomes difficult. people like grothendieck and perlman simply say no. jon beck (of monadicity theorem) said no in a different way. simon norton (of monster group and monstrous moonshine) was a bit like perlman. is it possible to do science without participating in the politics of it? grothendieck's work after he quit seems to be nowadays more read and more influential than the SGAs. but if he was happy and did not write all his desperate letters and esquisses, we would never know.</p>\n<p>on the opposite end of the gamut is jh simons (of chern-simons and the simons foundation), who said no and got rich. some will say that he quit doing math. others will say that he took the notion of applied math seriously. both are right in their way. there are other examples of people who got reasonably rich applying their math, esp in the bay area, and remained happy. descartes started using his coordinates to fortify breda, to get paid. and there are surely many other people who followed their own paths, and we never heard of them.</p>\n<p>i am tempted to pontificate that it is possible to escape the sinkhole by remaining honest and following the logic, not the herd. that seems to have been possible for my generation, with some luck. but everything seems harder now...</p>\n<p>sorry, you got me going. its a life of brian.</p>",
        "id": 242636002,
        "sender_full_name": "dusko",
        "timestamp": 1623693279
    },
    {
        "content": "<p>I got lucky and found an institution where I could do what I want, earn a good living, not be pressured to get grants.   There are definitely problems with a \"second-rate\" institution like UCR, and problems with not getting a lot of grant money to support my grad students, but overall I think it was better to take that route than to struggle to get a job at a \"first-rate\" institution and get grants all the time.</p>",
        "id": 242637466,
        "sender_full_name": "John Baez",
        "timestamp": 1623693972
    },
    {
        "content": "<p>In short: not trying to be near the top of the heap frees up more time to actually think.</p>",
        "id": 242637557,
        "sender_full_name": "John Baez",
        "timestamp": 1623694017
    },
    {
        "content": "<p>My grad students are having a lot more trouble in academia than I am.   Two of the most ambitious, who could easily do quite well in academia I think - Nina Otter and Brendan Fong - are trying to set up their own institutes.</p>",
        "id": 242637788,
        "sender_full_name": "John Baez",
        "timestamp": 1623694120
    },
    {
        "content": "<p>So they are boldly trying to make academia better by expanding the definition of academia.</p>",
        "id": 242637837,
        "sender_full_name": "John Baez",
        "timestamp": 1623694149
    },
    {
        "content": "<p>And then of course David Spivak is also setting up the Topos Institute, along with Brendan.</p>",
        "id": 242638622,
        "sender_full_name": "John Baez",
        "timestamp": 1623694507
    },
    {
        "content": "<p>One thing I'm curious about is this: is <span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span> still taking students (at Oxford or anywhere)?    Will Oxford still produce a lot of PhD students interested in applying category theory?</p>",
        "id": 242638783,
        "sender_full_name": "John Baez",
        "timestamp": 1623694581
    },
    {
        "content": "<p>If David Spivak and Bob Coecke and I aren't taking grad students, I'm wondering what are good places for grad students interested in applied category theory to go.</p>",
        "id": 242638924,
        "sender_full_name": "John Baez",
        "timestamp": 1623694657
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242638924\">said</a>:</p>\n<blockquote>\n<p>If David Spivak and Bob Coecke and I aren't taking grad students, I'm wondering what are good places for grad students interested in applied category theory to go.</p>\n</blockquote>\n<p>I am still supervising students, although gonna do that mostly in Maths and Physics in the future, and in in CS department there are of course also Aleks Kissinger and Sam Staton.  In fact, we bring in some PhD money.  Some also just come work with me at CQC, rather than PhD.  It made it a bit difficult this year as what qualifies as a PhD paper.  Expanding the definition of academia is good, and necessary!  We are doing that as well.  (one floor in our new offices is Topos-Oxford btw)</p>",
        "id": 242647162,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1623698687
    },
    {
        "content": "<p>For what is worth, my goal for the next few years is bridging Applied Category Theory with the Crypto community. There is a lot of research going on in Crypto that is not \"classically\" academic. But there is also a lot of money available, and they are in great need of categorical tools, even if they don't know about it. I'm involved in a big project at the moment, if everything goes according to plan I think we will be able to hire a few applied category theorists in a few months. It's not exactly \"revolutionizing the space\" but this is the best I'm able to do at the moment.</p>",
        "id": 242656172,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623703194
    },
    {
        "content": "<p>Also, politics in Crypto is very different. Stuff like grants basically doesn't count, but you must be ready to argue/discuss on twitter all the time: You can build your reputation from zero, but there are no instituional channels and you'll have to be your own social media manager, if that makes any sense.</p>",
        "id": 242656320,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623703273
    },
    {
        "content": "<p>(Also a month in Crypto is like two years in normal tech, things really go VERY fast. This means that rewards can come pretty quickly, but learning to navigate such a fast transforming environment may feel frustrating initially)</p>",
        "id": 242656547,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623703398
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242638924\">said</a>:</p>\n<blockquote>\n<p>If David Spivak and Bob Coecke and I aren't taking grad students, I'm wondering what are good places for grad students interested in applied category theory to go.</p>\n</blockquote>\n<p>They can come to Glasgow :)</p>",
        "id": 242656564,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1623703409
    },
    {
        "content": "<p>The rate of new non-university research labs being created in our immediate circle alone does look like quite the vote of no confidence in universities</p>",
        "id": 242658041,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1623704200
    },
    {
        "content": "<p>It may just be a side effect of interest rates being so low for so long so that a bunch of rich people are practically giving away money, rather than anything particularly to do with universities</p>",
        "id": 242658175,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1623704281
    },
    {
        "content": "<p>I think universities are showing how heavy bureaucracy is a weakness. Doing something via the uni usually takes way more time than doing it with a private corp. This is not an option in fast-growing sectors like tech</p>",
        "id": 242658330,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623704357
    },
    {
        "content": "<p>Or it could be that we're a bunch of weirdos and nobody wants to hang out with us...</p>",
        "id": 242658337,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1623704372
    },
    {
        "content": "<p>Also, in tech it is very easy to turn ideas into profitable businesses. Many universities are absolutely predatory in this respect. They can demand up to 20% of your shares, if not more, if you incorporate while working at a uni. No wonder people run away as fast as they can</p>",
        "id": 242658447,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623704424
    },
    {
        "content": "<p>Notice that this predatory behavior is by no means justified: Unis are often publicly funded, moreover they rely on student taxes, grants and other stuff. Why should they be interested in ownership of empoyees' private companies? It makes no sense at all, it's just greed.</p>",
        "id": 242658597,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623704524
    },
    {
        "content": "<p>Zooming out, probably the real problem here is that in the last decades we had this mind-shift of \"unis ran as they were companies\". This is absolute garbage for a lot of reasons. Practically, you also get universities that often act like they are competing with companies. They are doomed to fail tho because all the involved bureaucracy makes them totally uncompetitive. I'm pretty sure things would be different if unis would just fullfill their real purpose: Being public institutions that do research for the common good.</p>",
        "id": 242658860,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623704698
    },
    {
        "content": "<p>The very idea that universities are competing with each other is already absurd.  They are noting like companies in that their level of incompetence wouldn't let them survive a day in the real world.</p>",
        "id": 242661882,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1623706369
    },
    {
        "content": "<p>but where should the people who are now in high schools go study? is the generalized academia going to teach any cal I classes? or do we not need that any more?</p>",
        "id": 242696333,
        "sender_full_name": "dusko",
        "timestamp": 1623741718
    },
    {
        "content": "<p>I think most people do not need a degree to be good at the job they want. But it has become the accepted thing that many employers want to see an undergraduate degreeat least. So much so that students (or their parents, or whoever) will pay a great deal to go to university. </p>\n<p>I think changing this could help universities be less like corporations, competing with each other, etc, and focus more on research (and teaching, which keeps research going from one generation to the next). Probably making other pathways is a good place to start: apprenticeships, etc.</p>\n<p>There is also the \"problem\" that most people want the social experience of university life, but maybe alternative pathways could offer a similar experience in time.</p>\n<p>Of course, the bureaucratic side of universities wouldn't like any such change, because that's their business gone.</p>",
        "id": 242701685,
        "sender_full_name": "Sam Speight",
        "timestamp": 1623745335
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242656320\">said</a>:</p>\n<blockquote>\n<p>Also, politics in Crypto is very different. Stuff like grants basically doesn't count, but you must be ready to argue/discuss on twitter all the time: You can build your reputation from zero, but there are no instituional channels and you'll have to be your own social media manager, if that makes any sense.</p>\n</blockquote>\n<p>Is it just me or does this sound far worse?</p>",
        "id": 242723267,
        "sender_full_name": "Nick Hu",
        "timestamp": 1623759288
    },
    {
        "content": "<p>A weirdly simultaneous discussion is happening on HN right now: <a href=\"https://news.ycombinator.com/item?id=27510836\">https://news.ycombinator.com/item?id=27510836</a> . Apparently a bunch of universities are getting together to form a patent troll conglomerate... yikes</p>",
        "id": 242727503,
        "sender_full_name": "Simon Burton",
        "timestamp": 1623761726
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242723267\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242656320\">said</a>:</p>\n<blockquote>\n<p>Also, politics in Crypto is very different. Stuff like grants basically doesn't count, but you must be ready to argue/discuss on twitter all the time: You can build your reputation from zero, but there are no instituional channels and you'll have to be your own social media manager, if that makes any sense.</p>\n</blockquote>\n<p>Is it just me or does this sound far worse?</p>\n</blockquote>\n<p>Not better, nor worse. It's just different. Clearly less bureaucracy means also less certainty and safety nets, in a way</p>",
        "id": 242740011,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767002
    },
    {
        "content": "<p>But things can happen a lot faster. The point is that if you have a good research project in mind and you can shill it in the right way you can get money to work on it very quickly, whereas for many grant applications it's a process that takes months.</p>",
        "id": 242740157,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767053
    },
    {
        "content": "<p>The main downside is where the money goes actually. When you get a grant, it goes through the uni and you are not receiving the money directly, so tax-wise everything is taken care of. With crypto you have two choices:</p>\n<ul>\n<li>Go through unis, that usually demand a (big) share of the money for the simple fact that you exist within them. This also means you need to already have a university affiliation.</li>\n<li>The money goes directly to yourself. This can be immensely good or immensely bad depending on the juristiction you live in. The main problem is that in many country (in Italy for sure) there is no way of justifying money coming into your account in any other way than as income</li>\n</ul>",
        "id": 242740511,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767183
    },
    {
        "content": "<p>So does the money usually come from individuals or from institutions?</p>",
        "id": 242740628,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1623767233
    },
    {
        "content": "<p>Also, very interesting question. The ethos of crypto is mainly about being decentralized and unregulated wrt traditional law. So it can be both, or none of them</p>",
        "id": 242740780,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767283
    },
    {
        "content": "<ul>\n<li>The ethereum foundation gives you money -&gt; It comes from an institution</li>\n<li>Vitalik thinks you are cool and gives you money -&gt; It comes from an individual</li>\n<li>Someone sees some post on twitter about a cool project, and sends you an anonymous donation -&gt; It comes from \"no-one\", as in \"we cannot ascertain who's the sender\"</li>\n</ul>",
        "id": 242740944,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767351
    },
    {
        "content": "<p>I guess that the main problem is that I don't know what institutions  like the ETH foundation are, legally. For sure, their standard way of doing things is that they send money to you directly, they don't manage the money for you as unis do.</p>",
        "id": 242741130,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767412
    },
    {
        "content": "<p>I guess in situations like this the line between individual and institution can be quite blurry - especially when it comes to oversight and transparency</p>",
        "id": 242741259,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1623767465
    },
    {
        "content": "<p>Probably the worst tax scenario is that a crypto foundation that happens to be incorporated in some shady place finances your project, and then the tax authority sees money coming on your bank account from some random tax heaven lol</p>",
        "id": 242741265,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767467
    },
    {
        "content": "<p>(Which is not to say that universities or traditional academic institutions are bastions of transparency either)</p>",
        "id": 242741306,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1623767489
    },
    {
        "content": "<p>(which is also why many people prefer to be paid in coins)</p>",
        "id": 242741322,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767496
    },
    {
        "content": "<p>There's a maxim that says that the cryptocurrency world is doomed to reinvent traditional finance, one crisis at a time. It's just a matter of time before they reinvent funding agencies and research councils too...</p>",
        "id": 242741475,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1623767545
    },
    {
        "content": "<p>The real problem here is that crypto is a truly global financial network, so local jurisdictions are often ill-prepared in dealing with it. For instance, Bitcoin is not a legal entity, it's more similar to a common good. If someone steals your money, who do you sue? What jurisdiction is responsible for chasing the criminals? Bitcoin being incorporated nowhere, I guess the answer would be \"the country you live in\", but everything is very murky</p>",
        "id": 242741561,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767587
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"416301\">Zhen Lin Low</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242741475\">said</a>:</p>\n<blockquote>\n<p>There's a maxim that says that the cryptocurrency world is doomed to reinvent traditional finance, one crisis at a time. It's just a matter of time before they reinvent funding agencies and research councils too...</p>\n</blockquote>\n<p>In some respect they already do. The ETH foundation is running a grant program since a few years, for instance</p>",
        "id": 242741646,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767617
    },
    {
        "content": "<p>But to avoid the jurisdiction nightmare they just prefer to pay you directly and then it's your responsibility to be tax-compliant, which can be good or bad depending on where you live in</p>",
        "id": 242741818,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767666
    },
    {
        "content": "<p>In any case when you really start thinking deeply about the legal implications of such decentralized research projects it becomes a massive headache very quickly. My gut feeling is that in the next few years tax authorities worldwide will start really incorporating the tracking of blockchain transactions in their routine checks, and at that point A LOT of people will find out that they are in trouble with tax authorities</p>",
        "id": 242742072,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767763
    },
    {
        "content": "<p>Maybe this is one of the best reasons to justify the existence of unis atm, at least for such fringe tech projects</p>",
        "id": 242742151,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623767807
    },
    {
        "content": "<p>Let me put it this way: would you be comfortable being paid only in BTC/ETH/flavour-of-the-month?</p>",
        "id": 242742752,
        "sender_full_name": "Nick Hu",
        "timestamp": 1623768058
    },
    {
        "content": "<p>One of the values of money is that it can buy you stability, which I'm not sure anything cryptocurrency related can do</p>",
        "id": 242742838,
        "sender_full_name": "Nick Hu",
        "timestamp": 1623768097
    },
    {
        "content": "<p>In theory, the small research institutes springing up could be the happy middle ground. They're normal legal entities and pay you in normal money, but hopefully with a lot less BS than is involved in universities. Whether this actually happens in practice, I'm waiting to see</p>",
        "id": 242752084,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1623771241
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242723267\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242656320\">said</a>:</p>\n<blockquote>\n<p>Also, politics in Crypto is very different. Stuff like grants basically doesn't count, but you must be ready to argue/discuss on twitter all the time: You can build your reputation from zero, but there are no instituional channels and you'll have to be your own social media manager, if that makes any sense.</p>\n</blockquote>\n<p>Is it just me or does this sound far worse?</p>\n</blockquote>\n<p>Some people may like it - but I'm damn glad I was able to make my living teaching calculus, differential equations, and such for about 15-20 hours a week and spend the rest of my time teaching grad courses and doing research.</p>",
        "id": 242774630,
        "sender_full_name": "John Baez",
        "timestamp": 1623780387
    },
    {
        "content": "<p>Anything that requires use of twitter sounds horrific to me.  Twitter is the scourge of the 21st century.</p>",
        "id": 242778351,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1623781930
    },
    {
        "content": "<p>I like Twitter.  I use it to explain math to a bunch of people who might otherwise not bump into it.  I like to write a blog article with details, and then a tweet-series that links to that.</p>",
        "id": 242784626,
        "sender_full_name": "John Baez",
        "timestamp": 1623784500
    },
    {
        "content": "<p>I also use it to advertise conferences, summer schools and stuff.</p>",
        "id": 242784705,
        "sender_full_name": "John Baez",
        "timestamp": 1623784527
    },
    {
        "content": "<p>I've got 35,000 \"followers\".   But I would not <em>at all</em> like my career to depend on tweeting!</p>",
        "id": 242784777,
        "sender_full_name": "John Baez",
        "timestamp": 1623784560
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242742752\">said</a>:</p>\n<blockquote>\n<p>Let me put it this way: would you be comfortable being paid only in BTC/ETH/flavour-of-the-month?</p>\n</blockquote>\n<p>YES</p>",
        "id": 242804309,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623793774
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242742838\">said</a>:</p>\n<blockquote>\n<p>One of the values of money is that it can buy you stability, which I'm not sure anything cryptocurrency related can do</p>\n</blockquote>\n<p>You can convert in stablecoins and then it's like having fiat currency</p>",
        "id": 242804388,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623793807
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242778351\">said</a>:</p>\n<blockquote>\n<p>Anything that requires use of twitter sounds horrific to me.  Twitter is the scourge of the 21st century.</p>\n</blockquote>\n<p>This is very true. But it's the natural outcome of living in a society where social media is pervasive. If it can make you feel better, it's going to be much worse in the future!</p>",
        "id": 242804471,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623793867
    },
    {
        "content": "<p>I really wouldn't be surprised if <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> years from now some unis would start hiring faculty also by evaluating their \"impact on the social media\". It sounds awful because it is, but it also seems to be a natural evolution of what we have now.</p>",
        "id": 242804616,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623793944
    },
    {
        "content": "<p>one possible interpretation is that the social media thing is not so particularly new. </p>\n<p>for a better part of history, the social influencers competed for followers, converting them from the dionysian to the hadean cults, from judaism to christianity, from christianity to islam... the scope of the broadcasts was different when the influencers had to travel from village to village, or yell from a hill, but the type of communication was similar. then various factors (people with horses instead of religions, pandemics...) drew attention to the reality, so science got invented, which sort of says that the information content should be selected not by how effectively it can be compressed to influence people, but how effectively it can be expanded to influence the reality. which requires longer messages, studying, passing messages from generation to generation, avoiding testable lies. but that seems to have worked to well, so they made a hammer so big that they hit themselves on the head, and started believing in elon musk flying to mars and digging tunnels, and remembered how much fun it was to get drunk in dionysian cults, and to believe in the hadean stories. especially when you get paid real money for telling them...</p>\n<p>the only thing that is new is that all the unreasonable effectiveness of the mathematics in science, and of the science in reality, are <em>behind</em> us, and that the hammer is in the process of falling on our head from roughly that direction.</p>\n<p>i hope this is just another bulshit story, just slightly too long for social media.</p>",
        "id": 242808512,
        "sender_full_name": "dusko",
        "timestamp": 1623796711
    },
    {
        "content": "<p>Why on earth would it make me feel better to tell me that things will be worse in the future?  I'm not so pessimistic about the future as that; society has recovered from worse scourges in the past.</p>",
        "id": 242815614,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1623802273
    },
    {
        "content": "<p>Lol, I was joking, obviously there's nothing to be cheerful about</p>",
        "id": 242815817,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623802447
    },
    {
        "content": "<p>sorry, i didn't mean to make anyone feel better or worse. all that i was trying to say was that the social media thing might not be all that new. the hammer part entered the story just as a thing that is new with respect to the times when people last mainly concerned with talking to themselves, before science. </p>\n<p>speaking of which, brian eno had a pretty good album \"before and after science\". i think john baez posted it on twitter the other day :)</p>",
        "id": 242821237,
        "sender_full_name": "dusko",
        "timestamp": 1623808043
    },
    {
        "content": "<p>That was the album that blew my mind in high school and made me want to start doing music.  It has nothing to do with what we're talking about now, I think!</p>",
        "id": 242828187,
        "sender_full_name": "John Baez",
        "timestamp": 1623816395
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242804388\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242742838\">said</a>:</p>\n<blockquote>\n<p>One of the values of money is that it can buy you stability, which I'm not sure anything cryptocurrency related can do</p>\n</blockquote>\n<p>You can convert in stablecoins and then it's like having fiat currency</p>\n</blockquote>\n<p>Is this satire?</p>",
        "id": 242889288,
        "sender_full_name": "Nick Hu",
        "timestamp": 1623853946
    },
    {
        "content": "<p>Nope, they are literally pegged to dollars.</p>",
        "id": 242896685,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623856960
    },
    {
        "content": "<p>So if you worry about volatility, that protects you from price swings</p>",
        "id": 242896729,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623856981
    },
    {
        "content": "<p>If you worry that \"all the cryptoecosystem is a bubble and will collapse and everything will go to zero eventually\" well, I wouldn't suggest you to look for research money from a Crypto institution in the first place.</p>",
        "id": 242896827,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623857021
    },
    {
        "content": "<p>(Also because, quite reasonably, they won't give you any lol)</p>",
        "id": 242896912,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623857048
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242896685\">said</a>:</p>\n<blockquote>\n<p>Nope, they are literally pegged to dollars.</p>\n</blockquote>\n<p>I wouldn't trust the USDT peg to hold: <a href=\"https://www.singlelunch.com/2021/05/19/the-tether-ponzi-scheme/\">https://www.singlelunch.com/2021/05/19/the-tether-ponzi-scheme/</a> If the other stablecoins don't have better reserves, I'd worry about those too.</p>",
        "id": 242906435,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1623861160
    },
    {
        "content": "<p>Personally I use DAI/USDC, which are algorithmic and much better</p>",
        "id": 242907959,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623861790
    },
    {
        "content": "<p>The DAI peg held extraordinarily well even when ETH lost like 70% in a week.</p>",
        "id": 242908052,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623861810
    },
    {
        "content": "<p>DAI is completely based on fine-tuned game theory. It's a fairly complicated system that for now has held really well in the most absurd conditions, and it's completely trustless. But you shouldn't take my word for it, you should see the docs. And then it wouldn't be a matter of  \"trusting this or that\", but in believing that the boundary conditions of their model are or aren't appropriate, as it should be.</p>",
        "id": 242908309,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623861924
    },
    {
        "content": "<p>(USDT is completely against the whole ethos of crypto. There is no point in having a decentralized system that is based on a \"hey, trust me, we have one dollar in our vault for every USDT we mint\". At that point you can just use a bank account, the level of trust is similar and it probably comes with more protection for the clients.)</p>",
        "id": 242908526,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623862028
    },
    {
        "content": "<p>Does the word \"crypto\" in this entire discussion refer to \"cryptocurrency\"?  I grew up in a world where unadorned \"crypto\" meant \"cryptography\".</p>",
        "id": 242913226,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1623863991
    },
    {
        "content": "<p>Yes <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 242915536,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623865074
    },
    {
        "content": "<p>I hate it, but it's true that crypto now means cryptocurrency instead of cryptography.  The amount of money and attention just completely overwhelmed the previous meaning.  Cryptography doesn't even make the first two pages of Google hits for \"crypto\".  </p>\n<p>I guess it brings up the interesting etymological question of whether there are other words that completely changed meaning over the course of just a few years.</p>",
        "id": 242919676,
        "sender_full_name": "Mike Stay",
        "timestamp": 1623866913
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276048\">Mike Stay</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242919676\">said</a>:</p>\n<blockquote>\n<p>Cryptography doesn't even make the first two pages of Google hits for \"crypto\".  </p>\n</blockquote>\n<p>Sounds like google has <em>hidden</em> that meaning of \"crypto\".  <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span></p>",
        "id": 243008954,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1623932486
    },
    {
        "content": "<p><em>groan</em></p>",
        "id": 243462153,
        "sender_full_name": "Mike Stay",
        "timestamp": 1624323952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276048\">Mike Stay</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/242919676\">said</a>:</p>\n<blockquote>\n<p>I hate it, but it's true that crypto now means cryptocurrency instead of cryptography.  The amount of money and attention just completely overwhelmed the previous meaning.  Cryptography doesn't even make the first two pages of Google hits for \"crypto\".  </p>\n<p>I guess it brings up the interesting etymological question of whether there are other words that completely changed meaning over the course of just a few years.</p>\n</blockquote>\n<p>I still live in a world where it definitely doesn't mean \"cryptocurrency\" LOL. I think a lot of people are going to feel pretty silly when that fad dies down. sorry!</p>",
        "id": 243470003,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1624334357
    },
    {
        "content": "<p>If we have to abolish cryptography in order to abolish cryptocurrency, I guess I am willing to make the sacrifice. LOL</p>",
        "id": 243470021,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1624334401
    },
    {
        "content": "<p>I'm fairly confident that before the end of my career, crypto will revert to its original meaning. So I'm not in a hurry to change</p>",
        "id": 243496564,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1624357539
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297784\">Jonathan Sterling</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/243470021\">said</a>:</p>\n<blockquote>\n<p>If we have to abolish cryptography in order to abolish cryptocurrency, I guess I am willing to make the sacrifice. LOL</p>\n</blockquote>\n<p>Another adept of the Stephen Diel's cult, I see</p>",
        "id": 243502755,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1624361558
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/243502755\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"297784\">Jonathan Sterling</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/243470021\">said</a>:</p>\n<blockquote>\n<p>If we have to abolish cryptography in order to abolish cryptocurrency, I guess I am willing to make the sacrifice. LOL</p>\n</blockquote>\n<p>Another adept of the Stephen Diel's cult, I see</p>\n</blockquote>\n<p>Let's not talk about cults. I like what Stephen has to say, but I think he despises me.</p>",
        "id": 243518518,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1624369732
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/life.20in.20academia/near/243496564\">said</a>:</p>\n<blockquote>\n<p>I'm fairly confident that before the end of my career, crypto will revert to its original meaning. So I'm not in a hurry to change</p>\n</blockquote>\n<p>To be honest I don't think there is any need for it to 'revert'... I have only heard gold-rushers using crypto in this sense --- so the rest of us can use it as a 'reverse shibboleth'. I think it still means the usual thing among both cryptographers and non-cryptographers.</p>",
        "id": 243518800,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1624369820
    },
    {
        "content": "<p>But I don't want to get into a flamewar on this channel. I'm content to wait until the goldrushers have moved onto breathlessly evangelizing the next thing, once cryptocurrency is forgotten.</p>",
        "id": 243518966,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1624369895
    },
    {
        "content": "<p>It's difficult not getting into a flamewar after you described crypto as a fraud and the countless people that work with it (many of them with the best intentions) as goldrushers. I'm curious to know if you had the same opinion with the early Internet. One should be able to separate the value of the technology with the countless endeavors to exploit it that pop up like mushrooms.</p>\n<p>About Diel, he for sure despises me, but at least in my case it's fully reciprocal.</p>",
        "id": 243554731,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1624384627
    },
    {
        "content": "<p>Fwiw, I'm working on <a href=\"http://radicle.xyz\">radicle.xyz</a> which is attempting to create an economic ecosystem (as well as a decentralized one) for FOSS (free open source software) using a token called RAD. The first economic feature is to give patronage to others but the token also acts as a voting mechanism to deploy smart contracts that affect the token itself. I'm not deep into the cryptocurrency scene but I think this is at least a good mission to be working on <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 243561106,
        "sender_full_name": "Fintan Halpenny",
        "timestamp": 1624387343
    },
    {
        "content": "<p>It is, but you know, crypto has no real value and it's a Ponzi scheme, so your argument is invalid.</p>",
        "id": 243589903,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1624403350
    },
    {
        "content": "<p>(The funniest thing to me is that these comments come almost exclusively from academics, that seem to fail to recognize that academia is one of the biggest cults in the world right now)</p>",
        "id": 243590028,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1624403440
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 243902814,
        "sender_full_name": "Chad Nester",
        "timestamp": 1624620339
    }
]