[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> <a href=\"https://julesh.com/2019/11/27/categorical-cybernetics-a-manifesto/\">wrote in his blog</a> about the possibility of applying category theory to cybernetics.  I think a potentially good goal for this application would be <a href=\"https://www.kybernetik.ch/en/fs_intromankyb.html\">management cybernetics</a>.  Looking over the literature on this, it seems like the best place to start is still the founder of the field, Stafford Beer, who made the <a href=\"https://www.esrad.org.uk/resources/vsmg_3/screen.php?page=introduction\">Viable Systems Model</a> (VSM).  <a href=\"https://www.kybernetik.ch/dwn/Ten_Pints_of_Beer.pdf\">Here is an annotated bibliography of his major works, mostly on this model.</a>  The VSM is supposed to be a general model of what makes a system (of any sort) viable.  It is supposed to be general enough to apply to the brain, social systems, ecology, etc.</p>\n<p>I see how much ACT has caught on in CS, especially for multi-agent systems (e.g. concurrency).  Any application involving many human agents (I am not claiming all agents are human) is basically some sort of human system, which is the domain of management cybernetics (management cybernetics applies to any human system, from multinationals to governments to networks like this Zulip).  It would be great if the software we develop would keep in mind the structure of the human systems that it is inevitably mediating, and I propose that CT could be used here too in an application to management cybernetics.</p>\n<p>In fact, Beer himself applied the VSM to a <a href=\"https://en.wikipedia.org/wiki/Project_Cybersyn\">computer system managing the state-run sector of the Chilean economy</a> under the newly-elected Salvador Allende.  However, it was destroyed in the CIA-backed coup which deposed Allede's government.</p>\n<p>There doesn't seem to be much work on management cybernetics --- see this <a href=\"https://dacemirror.sci-hub.tw/journal-article/322e1388d0e1227a735062c500363a6d/vahidi2019.pdf#view=FitH\">literature review of work on the VSM</a> --- but it's hard to say because there aren't any journals strictly for management cybernetics:  they are often for cybernetics in general, or for more-or-less related fields such as systems science and complex systems, which all kind of have similar names and I'm not sure yet how they're related to each other.  Perhaps \"cybernetics\" as a term is out of fashion, and the people doing \"management cybernetics\" are scattered among many different fields.  However Beer's VSM was very successful and important and I feel like I should be able to find \"management cybernetics\" by searching among work that cites it, the fields that that work is in, the work that cites those fields, etc.  <a href=\"https://en.wikipedia.org/wiki/Management_cybernetics\">Wikipedia</a> cites this <a href=\"https://www.youtube.com/watch?v=6V4lFsHsFY8\">video</a> (which I haven't watched yet) (in citation 12) which seems like a more up-to-date thing about the VSM.  The wikipedia article also talks about lots of other related fields (apparently there is a connection to autopoeisis, which <span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> is already working on).</p>",
        "id": 200838232,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1592176657
    },
    {
        "content": "<p>That's really interesting, <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>.  The idea of a \"viable systems model\" seems insanely ambitious but also something worth learning about.  I've been thinking that I want something like a mathematical way of understand what counts as a \"thriving system\", so that we can come up with economics that pursues a \"thriving ecosystem\" instead of \"growth\" or the other silly things our economics is so obsessed with now.</p>",
        "id": 200852838,
        "sender_full_name": "John Baez",
        "timestamp": 1592201845
    },
    {
        "content": "<p>This is very much in line with how I think. I'm part way through reading Forrester's Industrial Dynamics, which I think would later be called management cybernetics (in contrast to his later books). My interest unfortunately has to be taken modulo the very weird political situation in the UK which I won't go into here</p>",
        "id": 200871152,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592216515
    },
    {
        "content": "<p>Expect more on CyberCat pretty soon!</p>",
        "id": 200871269,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592216607
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Management.20Cybernetics/near/200871269\">said</a>:</p>\n<blockquote>\n<p>Expect more on CyberCat pretty soon!</p>\n</blockquote>\n<p>Looking forward to more on CyberCat! We've been using the Conversations for Action and other conversational protocols influenced by Stafford Beers' VSN, and have had a bunch of conversations with people who are trying to revive that, but we don't do the whole nine yards:<br>\n<a href=\"https://github.com/valueflows/forum.valueflo.ws/issues/131\">https://github.com/valueflows/forum.valueflo.ws/issues/131</a></p>\n<p>We are not so interested in management per se, more interested in mutual coordination, for which conversations for action works well.</p>",
        "id": 200892433,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1592229676
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/229111-general/topic/Management.20Cybernetics/near/200892433\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Management.20Cybernetics/near/200871269\">said</a>:</p>\n<blockquote>\n<p>Expect more on CyberCat pretty soon!</p>\n</blockquote>\n<p>Looking forward to more on CyberCat! We've been using the Conversations for Action and other conversational protocols influenced by Stafford Beers' VSN, and have had a bunch of conversations with people who are trying to revive that, but we don't do the whole nine yards:<br>\n<a href=\"https://github.com/valueflows/forum.valueflo.ws/issues/131\">https://github.com/valueflows/forum.valueflo.ws/issues/131</a></p>\n<p>We are not so interested in management per se, more interested in mutual coordination, for which conversations for action works well.</p>\n</blockquote>\n<p>This is really cool!</p>",
        "id": 200901614,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1592233627
    },
    {
        "content": "<p>I'd be interested to hear what anyone  thinks about Algorithmic Information Dynamics: <a href=\"http://www.scholarpedia.org/article/Algorithmic_Information_Dynamics\">http://www.scholarpedia.org/article/Algorithmic_Information_Dynamics</a>.  I stumbled onto it about a month ago and haven't had time to really dive in yet--but looks extremely interesting. I don't know if there is a way to look at this through the lens of category theory (I'm a novice).</p>",
        "id": 201161073,
        "sender_full_name": "Grant Roy",
        "timestamp": 1592409000
    }
]