[
    {
        "content": "<p>It is with great pleasure that I share the following news with you: <br>\nThe Institute of Mathematics and Statistics of University of São Paulo (USP) has received a spectacular donation of books from Marta Bunge's library <a href=\"https://www.ime.usp.br/en/professor-marta-bunges-personal-library-is-donated-to-the-ime-usp-library/\">https://www.ime.usp.br/en/professor-marta-bunges-personal-library-is-donated-to-the-ime-usp-library/</a> </p>\n<p>I completed my doctorate at USP and I am happy to know that new generations will be able to benefit from this material. It is an honor for the entire Brazilian category theory community. </p>\n<p>On behalf of my doctoral advisor Hugo Luiz Mariano, professor and researcher in Category Theory at the institute, we thank everyone involved. In particular, we would like to thank <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> for recommending USP. I believe this will greatly contribute to the training of more researchers in CT in Brazil and South America.</p>",
        "id": 442088051,
        "sender_full_name": "Ana Luiza Tenorio",
        "timestamp": 1717353834
    },
    {
        "content": "<p>Woah, that's really cool. USP should now be one of the universities in the world with the largest number of category theory books! For instance, a research (<a href=\"https://solo.bodleian.ox.ac.uk/discovery/search?query=sub,exact,Categories%20(Mathematics),AND&amp;tab=Everything&amp;search_scope=MyInst_and_CI&amp;vid=44OXF_INST:SOLO&amp;mfacet=tlevel,include,available_p,1&amp;mfacet=topic,include,Categories%20(mathematics),1&amp;mode=advanced&amp;offset=0\">here</a>) on the website of Oxford libraries says that they \"only\" have 243 physical resources on the subject \"Categories (Mathematics)\" (which is already impressive ahah).</p>",
        "id": 442089506,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1717354657
    },
    {
        "content": "<p>Many thanks <span class=\"user-mention\" data-user-id=\"384989\">@Ana Luiza Tenorio</span>  for the note and to Prof Hugo Mariano and Stela Madruga for completing the project! Most thanks, of course, to Silvia and Eric Bunge for the big \"present\"!</p>",
        "id": 442151281,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1717392292
    }
]