[
    {
        "content": "<p>Hi I have an account on Mathstodon. <a href=\"https://mathstodon.xyz/@bblfish\">https://mathstodon.xyz/@bblfish</a><br>\nDo you?</p>",
        "id": 310821725,
        "sender_full_name": "Henry Story",
        "timestamp": 1668778120
    },
    {
        "content": "<p>Mathstodon does seem to be a bit slow today. It even was down a few minutes earlier.</p>",
        "id": 310842870,
        "sender_full_name": "Henry Story",
        "timestamp": 1668784267
    },
    {
        "content": "<p>More users are being driven by the news about Twitter losing more employees (also some weird news about them being locked out of buildings).<br>\n<a href=\"/user_uploads/21317/iJSErceiXLuVOn-Sh4-cL2Sp/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/iJSErceiXLuVOn-Sh4-cL2Sp/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/iJSErceiXLuVOn-Sh4-cL2Sp/image.png\"></a></div>",
        "id": 310843933,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1668784561
    },
    {
        "content": "<p>I hope it's not the Ruby code Mastodon is written in that is causing the problems. Twitter had uptime problems at the beginning too when they were written in Ruby, then moved to Scala.</p>",
        "id": 310845960,
        "sender_full_name": "Henry Story",
        "timestamp": 1668785122
    },
    {
        "content": "<p>On the whole it has been working nicely though the last week.</p>",
        "id": 310846626,
        "sender_full_name": "Henry Story",
        "timestamp": 1668785292
    },
    {
        "content": "<p>I don't think Ruby will be much of a problem at mathstodon's size. It's more of a problem for the larger instances.</p>",
        "id": 310846637,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1668785297
    },
    {
        "content": "<p>Do you know what it takes to run a Mastodon instance? How easy is it to create a new instance? Do you have a server at home, or rent a server on a cloud? How much responsibility does it take? What is the burden on those running it?</p>",
        "id": 310853496,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1668787049
    },
    {
        "content": "<p>It's Christian Lawson-Perfect who runs mathstodon. He wrote a blog post about it here: <a href=\"https://checkmyworking.com/posts/2022/11/mastodon-admin-experiences/\">https://checkmyworking.com/posts/2022/11/mastodon-admin-experiences/</a></p>",
        "id": 310855846,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1668787680
    },
    {
        "content": "<p>Thanks, this looks like a good starting point ... I joined Mastodon recently but I dont find much interesting discussion there ... so I am wondering whether it could be worth creating my own instance and gathering like-minded people.</p>",
        "id": 310971459,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1668841168
    },
    {
        "content": "<p>At this point you have to find the people you already know - perhaps they write their mastodon ID on twitter or in this channel, or somewhere else. Then you look at their follows and followers list, and search for people you already know, and follow those. So you build your social network. Of course here you just follow John Baez, and he knows everyone already important in Category Theory (I guess at least) <a href=\"https://mathstodon.xyz/@johncarlosbaez\">https://mathstodon.xyz/@johncarlosbaez</a> . If you want to find political science scholars, I just found this  <a href=\"https://scholar.social/@SamCrawley/109366587884501943\">https://scholar.social/@SamCrawley/109366587884501943</a> where he links to a huge list of scholars in that field. Sound interesting and dangerous to click on those.</p>\n<p>Being on Mathstodon there is already more  Math discussion than what I could follow in a lifetime.  But I have also found a lot of people on other servers that I follow. The nice thing is I can look at the discussion on mathstodon and that in my personal list and compare the quality.  </p>\n<p>If you follow me you'll find my list is related to programming decentralised social networks, so I follow category theory, scala especially cats libs, open source in general, w3c and ietf standards, security, knowledge engineers, philosophers... It is very likely much too eclectic to build a big following.</p>",
        "id": 310972960,
        "sender_full_name": "Henry Story",
        "timestamp": 1668842570
    },
    {
        "content": "<p>I actually started worked on the w3c activity pub standards behind Mastodon when they started, but I did not say around long, as I was more interested in the project that Tim Berners-Lee calls Solid which should go even further in helping create any number of decentralised apps. </p>\n<p>Then I got lost in CT for 4 years or so. I was looking around to see how modal logic fit into category theory to see if it could help me understand security.  The first really intersting thing I found that amazed me was when I read this article \"Modal Logics are Coalgebraic\" on which I think you are a co-author <span class=\"user-mention\" data-user-id=\"276830\">@Alexander Kurz</span> :-)  So I asked Corina Cirstea to be my supervisor as I was at Southampton.  But I ran out of money and have been building Solid tools in the last few year sponsored by the EU.<br>\n<a href=\"https://academic.oup.com/comjnl/article-abstract/54/1/31/336864?login=false\">https://academic.oup.com/comjnl/article-abstract/54/1/31/336864?login=false</a></p>",
        "id": 310973161,
        "sender_full_name": "Henry Story",
        "timestamp": 1668842779
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276830\">Alexander Kurz</span> <a href=\"#narrow/stream/229111-general/topic/mathstodon/near/310971459\">said</a>:</p>\n<blockquote>\n<p>Thanks, this looks like a good starting point ... I joined Mastodon recently but I dont find much interesting discussion there ... so I am wondering whether it could be worth creating my own instance and gathering like-minded people.</p>\n</blockquote>\n<p>John Baez has this thread where he lists some of his friends with Mastodon accounts: <a href=\"https://mathstodon.xyz/@johncarlosbaez/109262546588286591\">https://mathstodon.xyz/@johncarlosbaez/109262546588286591</a>. That's probably a good place to start.</p>",
        "id": 310979353,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1668847172
    },
    {
        "content": "<p>So far I feel there's not as much interesting conversation on Mathstodon as there is <em>here</em>.</p>",
        "id": 310990545,
        "sender_full_name": "John Baez",
        "timestamp": 1668853171
    },
    {
        "content": "<p>But with the arrival of the people I listed, things are getting better.  In particular Martin Escardo:</p>\n<p><a href=\"https://mathstodon.xyz/@MartinEscardo\">https://mathstodon.xyz/@MartinEscardo</a></p>\n<p>is regularly writing nice multi-part posts on constructive mathematics, type theory etc.   I wish some of you folks who know more about these things that I do would reply to his posts!</p>",
        "id": 310990779,
        "sender_full_name": "John Baez",
        "timestamp": 1668853293
    },
    {
        "content": "<p>I am currently at <a href=\"https://mastodonapp.uk/web/@alexhkurz\">https://mastodonapp.uk/web/@alexhkurz</a> but now I am thinking of switching to .xyz</p>",
        "id": 311215460,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1669006172
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span>  ... I follow now some of the social scientists ... and I also subscribed to those I found on John Baez's list ...</p>",
        "id": 311215513,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1669006204
    },
    {
        "content": "<p>In terms of running my own mastodon instance, I spend quite some time on the internet discussing politics. One does meet quite a lot of interesting people who seem to want to stay anonymous ... I was wondering whether a Mastodon instance could be the right place to bring together such people and continue the conversation ... it maybe the right middle ground between something private like email and something public like twitter ... any comments or experiences?</p>",
        "id": 311215769,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1669006472
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> Thanks for the compliment ... super glad to hear that you liked the paper ... I am very much interested in your expertise in building social networks. Since I moved to Chapman University, I am morphing more and more into a software engineer (not really, but I dont have students in logic and category theory here) and social networks, blockchain, smart contracts looks like the most interesting area to me ... so that is where I am heading. Only problem is that I am not a software engineer ... :-)</p>",
        "id": 311216194,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1669006943
    },
    {
        "content": "<p>Looks like we have complimentary skill sets :-) I only have 4 years or so of category theory, but a lot of software engineering (which is what brought me to CT). I was leaving some ideas on how the Web and CT in the <a href=\"#narrow/stream/229156-practice.3A-applied-ct\">Applied CT</a> web-cats and security streams. I have not had time to really look at Blockchain,... which I can now think of as a coalgebra of the transformations of the blockchain (an algebraic construct). The social web could certainly do with some of it (I think global consensus on everything is usually not needed, local consensus is enough), but it's difficult to keep up with all that is going on.</p>",
        "id": 311217383,
        "sender_full_name": "Henry Story",
        "timestamp": 1669007960
    },
    {
        "content": "<p>There's now a bot that toots out arXiv math.CT postings and updates that mathstodon people can follow: <a href=\"https://mathstodon.xyz/@j824h_arXiv_math_CT\">https://mathstodon.xyz/@j824h_arXiv_math_CT</a></p>",
        "id": 311235775,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019419
    },
    {
        "content": "<p>It just started today, and so it's only got one toot so far</p>",
        "id": 311235844,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019463
    },
    {
        "content": "<p>That feels like it could be a firehose... But I'll try :-)</p>",
        "id": 311235967,
        "sender_full_name": "Henry Story",
        "timestamp": 1669019525
    },
    {
        "content": "<p>No. It's only a few a day. The math.NT or math.AG feeds are more like firehoses.</p>",
        "id": 311236276,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019697
    },
    {
        "content": "<p>I've been following the @mathCTb bot account on Twitter and it's not bad at all.</p>",
        "id": 311236340,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019726
    },
    {
        "content": "<p>One category theory paper a day is a firehose ;-)</p>",
        "id": 311236370,
        "sender_full_name": "Henry Story",
        "timestamp": 1669019740
    },
    {
        "content": "<p>I don't <em>read</em> them all :-)</p>\n<p>It's just nice to see the general drift of progress.</p>",
        "id": 311236549,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019790
    },
    {
        "content": "<p>I get DG, AT, NT and AG in my daily arXiv email, and it's a scroll-fest, trying to find the CT papers. All of those are rather big subjects, with dozens of papers a day.</p>",
        "id": 311236773,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1669019883
    },
    {
        "content": "<p>The story of Twitter banning a number of links to social networks including Mastodon has been quite amazing to see. They even had a policy page on it that was removed but is up on <a href=\"http://archive.org\">archive.org</a> <a href=\"https://mathstodon.xyz/@bblfish/109539643494673669\">https://mathstodon.xyz/@bblfish/109539643494673669</a></p>",
        "id": 316704991,
        "sender_full_name": "Henry Story",
        "timestamp": 1671444566
    },
    {
        "content": "<p>It's a crazy business... as is this \"poll\" about whether Musk should quit running Twitter.</p>",
        "id": 316844602,
        "sender_full_name": "John Baez",
        "timestamp": 1671489586
    },
    {
        "content": "<p>I'm so glad I quit doing anything serious on Twitter and moved to Mathstodon.</p>",
        "id": 316844719,
        "sender_full_name": "John Baez",
        "timestamp": 1671489639
    },
    {
        "content": "<p>I really wish Mr. Musk would take the time to do a little self-reflection.</p>",
        "id": 317088080,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1671602455
    },
    {
        "content": "<p>I pinned my research work to Mathstodon here: <a href=\"https://mathstodon.xyz/@bblfish/109739532794504676\">https://mathstodon.xyz/@bblfish/109739532794504676</a>  and I pinned that to my profile. <br>\nThen I added my mathstodon address to my Zulip Profile (I hope folks can see it). It would be helpful if more people linked to mastodon from their Profile. <br>\nI see <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> has not yet (or I can't see it). :-)</p>",
        "id": 323081068,
        "sender_full_name": "Henry Story",
        "timestamp": 1674495942
    },
    {
        "content": "<p>Okay, I did it.</p>",
        "id": 323179834,
        "sender_full_name": "John Baez",
        "timestamp": 1674544937
    },
    {
        "content": "<p>I'm here:</p>\n<p><a href=\"https://mathstodon.xyz/@johncarlosbaez\">https://mathstodon.xyz/@johncarlosbaez</a></p>",
        "id": 323179878,
        "sender_full_name": "John Baez",
        "timestamp": 1674544946
    }
]