[
    {
        "content": "<p>There's a nice discussion of military funding here:</p>\n<ul>\n<li>Tom Leinster, <a href=\"https://golem.ph.utexas.edu/category/2020/12/the_lie_of_its_just_math.html\">The lie of 'it's just math'</a>.</li>\n</ul>\n<p>Looking around, I was interested to learn that Mac Lane thanks the US military for funding in the introductions to his books <em>Homology</em> and <em>Categories for the Working Mathematician</em>.</p>",
        "id": 219806118,
        "sender_full_name": "John Baez",
        "timestamp": 1607929264
    },
    {
        "content": "<p>I think the unfortunate reality is that a lot of scientific funding is, and always has been, tied to the military. The Cold War was one of the primary reasons why so much scientific development happened around that time in the US and in Russia - even development in fields not a priori related to the war.</p>",
        "id": 219819577,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607939798
    },
    {
        "content": "<p>This is a tradition going back at least as far as Napoleon, Fourier and the École Polytechnique</p>",
        "id": 219822902,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1607941717
    },
    {
        "content": "<p>Yeah exactly</p>",
        "id": 219824983,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607943030
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> <a href=\"#narrow/stream/229111-general/topic/military.20funding.20of.20category.20theory/near/219819577\">said</a>:</p>\n<blockquote>\n<p>I think the unfortunate reality is that a lot of scientific funding is, and always has been, tied to the military.</p>\n</blockquote>\n<p>Is this an appeal to tradition to suggest that accepting military funding is somehow unavoidable..?</p>",
        "id": 219825526,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1607943436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> totally agree. Yes, a lot of funding is tied to the military. Always has been (meme reference intended). Still, I think it is a moral imperative for us to say and keep saying that this is not how things are supposed to be. I understand how for some people military funding is the only form of funding available, but there's still a big difference imho between just accepting it and accepting it while  being vocal about finding an altenative.</p>",
        "id": 219827273,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1607944645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> No, of course not. Just pointing out the state of affairs.</p>",
        "id": 219827949,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945107
    },
    {
        "content": "<p>I don’t know whether or not it’s unavoidable at the macro scale. That’s a sociological and political question.</p>",
        "id": 219828063,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945171
    },
    {
        "content": "<p>It’s probably avoidable at the individual level but surely at personal cost. But what’s an ethical decision anyway if it has no repercussions?</p>",
        "id": 219828118,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945220
    },
    {
        "content": "<p>It also depends a lot on the country you are in. In the US a lot of state funded development and research is tied to the military. In the EU the role of the military in society is way more marginal</p>",
        "id": 219828124,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1607945225
    },
    {
        "content": "<p>(And also on the sector you work in. I guess aerospace engineering is much more funded by the military than, say, cancer research?)</p>",
        "id": 219828184,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1607945274
    },
    {
        "content": "<p>Yeah sure but there are still ethical dilemmas regarding funding if one wants to look into it properly. Take for example the Huawei programme with the IHES. That is not directly military related, but Huawei works very closely with the Chinese military.</p>",
        "id": 219828298,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945360
    },
    {
        "content": "<p>Basically, what I’m saying is that the situation is much less black and white.</p>",
        "id": 219828385,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945411
    },
    {
        "content": "<p>Organisations that are able to think strategically will be interested in advanced fields like pure maths. Hence the military, as long as they are not decadent, will be among those interested. The others, in so far as they think strategically will look somewhat like the military.</p>",
        "id": 219828418,
        "sender_full_name": "Henry Story",
        "timestamp": 1607945461
    },
    {
        "content": "<p>The military furthermore is not one thing, just like capitalism is not one thing. It can be implemented in many different ways. Eg. In Switzerland every male citizen goes every year to the military for a week or two for over 20 years. They have guns at home to defend themselves, bunkers against nuclear attack. But it is a non-aggressive force (which led them not to take sides in the second WW for which they still get a barage of criticism), and is built on fundamental democratic principles.</p>",
        "id": 219828684,
        "sender_full_name": "Henry Story",
        "timestamp": 1607945651
    },
    {
        "content": "<p>Sure, I totally agree. It’s just a conversation worth having.</p>",
        "id": 219829046,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607945900
    }
]