[
    {
        "content": "<p>It's not exactly a new journal - more like a new <em>subjournal</em> of <em>Theory and Applications of Categories</em>.  </p>\n<blockquote>\n<p>The editors of TAC (Theory and Applications of Categories) are pleased to announce a new series of the journal entitled \"TAC Expositions\".  This is a separate series from the standard journal, with a specific focus on expository articles in the theory and applications of categories.  The editorial policy of the new series states:</p>\n<p>\"Expositions in Theory and Applications of Categories ('TAC Expositions') is a special series specifically designed for publication of well-written and novel expository articles on topics of current research interest in the theory and/or applications of categories.  While a TAC Exposition article need not include new results, it must be novel in either its arrangement or viewpoint, providing a new perspective or context for known results.  Authors considering submitting an expository paper are advised to consult an editor on its suitability for TAC Expositions.\"</p>\n<p>For more information, see <a href=\"http://www.tac.mta.ca/tac/expositions/index.html\">http://www.tac.mta.ca/tac/expositions/index.html</a>.</p>\n<p>We look forward to receiving your contributions for this new series!</p>\n<p>All the best,<br>\nGeoff Cruttwell<br>\nTAC Managing Editor</p>\n</blockquote>",
        "id": 220410198,
        "sender_full_name": "John Baez",
        "timestamp": 1608315859
    },
    {
        "content": "<p>Here's their submissions policy:</p>\n<blockquote>\n<p>Expositions in Theory and Applications of Categories (\"TAC Expositions\") is a special series specifically designed for publication of well-written and novel expository articles on topics of current research interest in the theory and/or applications of categories. While a TAC Exposition article need not include new results, it must be novel in either its arrangement or viewpoint, providing a new perspective or context for known results. Authors considering submitting an expository paper are advised to consult an editor on its suitability for TAC Expositions.</p>\n<p>To maintain a high standard in the TAC Expositions series, articles in this series must be approved by two TAC editors. </p>\n</blockquote>",
        "id": 220410291,
        "sender_full_name": "John Baez",
        "timestamp": 1608315926
    },
    {
        "content": "<p>This is great! I've also been thinking for a while CT needs expository articles of the same level as <a href=\"https://distill.pub/\">https://distill.pub/</a> I really hope to get around to doing something like this, eventually...</p>",
        "id": 220464441,
        "sender_full_name": "Bruno Gavranović",
        "timestamp": 1608374489
    }
]