[
    {
        "content": "<p>Is there a standard idiom on the nlab for finding a page on the category of all structures of a given kind?  There's <a href=\"https://ncatlab.org/nlab/show/MonCat\">MonCat</a> for monoidal categories, but there's no SymMonCat or SMCCat for symmetric monoidal closed categories. And the MonCat page doesn't give any properties of MonCat: is it a monoidal category? symmetric? cartesian? monoidal closed? cartesian closed? There's a page for quantales, but no page for Quant. Am I missing something, or does all that work still need doing?</p>",
        "id": 209009466,
        "sender_full_name": "Mike Stay",
        "timestamp": 1599157380
    },
    {
        "content": "<p>I believe it's simply that no-one has created those pages, or filled in those details.</p>",
        "id": 209011972,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1599158533
    },
    {
        "content": "<p>Yes, I think people need to start creating those pages!</p>",
        "id": 209036493,
        "sender_full_name": "John Baez",
        "timestamp": 1599171852
    },
    {
        "content": "<p>Maybe we could try to set a standard that each page for a concept, like monoidal closed category, should include a section of the structure they form, e.g. the 2-category MCC.</p>",
        "id": 209188180,
        "sender_full_name": "Christian Williams",
        "timestamp": 1599327561
    },
    {
        "content": "<p>It seems like there are many useful facts about the structures of these categories (\"is there an interesting noncartesian tensor of monoidal closed categories?\") that are known in the literature, but haven't been put on the nLab.</p>",
        "id": 209188245,
        "sender_full_name": "Christian Williams",
        "timestamp": 1599327676
    },
    {
        "content": "<p>I will take this conversation seriously when someone puts something on the nLab.  It's so, so easy to spend one's energy writing <em>about</em> writing.</p>",
        "id": 209189990,
        "sender_full_name": "John Baez",
        "timestamp": 1599330649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span> just LaTeXed weeks 101-150 of <em>This Week's Finds.</em>  That's 378 pages!   That's what I call real work.   (We're going to put the first 300 weeks on the arXiv.)</p>",
        "id": 209190190,
        "sender_full_name": "John Baez",
        "timestamp": 1599331080
    },
    {
        "content": "<p>I'm sorry if I sound critical, but I've seen a lot of projects on the internet succeed - and many more fail.  Probably the main reason projects fail is that people don't start actually doing them.  The main reason the nLab is as good as it is is that people put a lot of time into actually writing material.   If you notice a piece of missing information, you can fill that hole in less than 5 minutes.</p>",
        "id": 209190317,
        "sender_full_name": "John Baez",
        "timestamp": 1599331315
    },
    {
        "content": "<p>Organizing webpages is also good... but just go ahead and start!  It's easy to change things if you change your mind.</p>",
        "id": 209190359,
        "sender_full_name": "John Baez",
        "timestamp": 1599331342
    },
    {
        "content": "<p>(it’s quite slow work, but pandoc and some sneaky regexes have done a lot of heavy lifting for me 😉)</p>",
        "id": 209191278,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1599332742
    },
    {
        "content": "<p>I have no idea what pandoc and sneaky regexes are - you must be a wizard and these must be your familiars.</p>",
        "id": 209191815,
        "sender_full_name": "John Baez",
        "timestamp": 1599333432
    },
    {
        "content": "<p>Keep feeding them.</p>",
        "id": 209191828,
        "sender_full_name": "John Baez",
        "timestamp": 1599333454
    }
]