[
    {
        "content": "<p>From a sociologist friend:</p>\n<blockquote>\n<p>This is Ontological Gerrymandering. By using \"typed systems\" the developers have built a world where only certain types of data are allowed to exist. The social scientist would investigate what is excluded by these rigid technical pipes.</p>\n</blockquote>",
        "id": 571603663,
        "sender_full_name": "ww",
        "timestamp": 1770109115
    },
    {
        "content": "<p>An interesting idea, and I appreciate the post-modernist inspiration; it reminds me of the notion of \"organisational knowledge/ignorance\", which I learned about from <a href=\"https://www.youtube.com/watch?v=rLfzO7Sbdc4\">PhilosophyTube</a>. It's curious that they use \"ontological\" rather than \"epistemological\". Types don't control what data is allowed to exist, only what data a system is able to talk about.<br>\nHowever, I feel that this idea exaggerates the rigidity of typed systems. It's true that types impose fundamental limits in the above sense, and sometimes these limits are an advantage because they enable more powerful results that would not be true of a more expressive system, but for typed systems used in practice any form of data that is excluded or can only be included through a complex encoding that is difficult to reason about within the system is a problem usually addressed by expanding the type system.<br>\nThe meta version of this question is more substantial: which type <em>constructors</em> are considered admissible or important, either in the abstract or in a given programming language paradigm? How might your friend name that kind of restriction?</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"rLfzO7Sbdc4\" href=\"https://www.youtube.com/watch?v=rLfzO7Sbdc4\"><img src=\"https://uploads.zulipusercontent.net/d619335ae6d16897fad2fff7771504180ecbd1d9/68747470733a2f2f692e7974696d672e636f6d2f76692f724c667a4f3753626463342f6d7164656661756c742e6a7067\"></a></div>",
        "id": 571611140,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1770111350
    },
    {
        "content": "<p>Certainly typing is more akin to the existence of electoral districts themselves, as opposed to allowing everyone to vote in any election and hoping that a person in rural Ohio will simply not bother voting in a local election in Los Angeles. Gerrymandering would be more like the definition of \"unnatural\" types designed to exclude undesirable values, which certainly is already considered bad practice.</p>",
        "id": 571658358,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1770124614
    },
    {
        "content": "<p>I say this in the most peaceful tone: what the hell are you talking about?</p>",
        "id": 571674109,
        "sender_full_name": "fosco",
        "timestamp": 1770128338
    },
    {
        "content": "<p>I really don't understand what's going on in this thread, is it me?</p>",
        "id": 571674176,
        "sender_full_name": "fosco",
        "timestamp": 1770128356
    },
    {
        "content": "<p>is this how a non mathematician feels like when we discuss and we mumble \"ah, yeah, of course, it's a filtered colimit, yes yes\"?</p>",
        "id": 571674453,
        "sender_full_name": "fosco",
        "timestamp": 1770128422
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/Ontological.20Gerrymandering/near/571674453\">said</a>:</p>\n<blockquote>\n<p>is this how a non mathematician feels like when we discuss and we mumble \"ah, yeah, of course, it's a filtered colimit, yes yes\"?</p>\n</blockquote>\n<p>Yes it might be <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span> What don’t you get: philosophy, or electoral stuff?</p>",
        "id": 571680765,
        "sender_full_name": "Vincent R.B. Blazy",
        "timestamp": 1770129923
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/Ontological.20Gerrymandering/near/571658358\">said</a>:</p>\n<blockquote>\n<p>Certainly typing is more akin to the existence of electoral districts themselves, as opposed to allowing everyone to vote in any election and hoping that a person in rural Ohio will simply not bother voting in a local election in Los Angeles. Gerrymandering would be more like the definition of \"unnatural\" types designed to exclude undesirable values, which certainly is already considered bad practice.</p>\n</blockquote>\n<p>Indeed, typing is rather the design of the districts, would it be fair, or the worst gerrymandering. Now… Would there be a relevant analogy with voting systems without districts, like proportional representation? <span aria-label=\"face with monocle\" class=\"emoji emoji-1f9d0\" role=\"img\" title=\"face with monocle\">:face_with_monocle:</span></p>",
        "id": 571681267,
        "sender_full_name": "Vincent R.B. Blazy",
        "timestamp": 1770130041
    },
    {
        "content": "<p>It reads to me like the quoted friend is making a metaphor to convey they believe type systems inhibit perfectly good data, just like Gerrymandering inhibits perfectly good voters. Which, to them, implies you should look at what data is excluded to get a complete picture.</p>\n<p>This comparison feels forced, that's why folks are spending energy fixing the metaphor</p>",
        "id": 571681528,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1770130115
    },
    {
        "content": "<p>I think it was brought about by an amusing misunderstanding.</p>",
        "id": 571685454,
        "sender_full_name": "ww",
        "timestamp": 1770130993
    },
    {
        "content": "<p>But it's an interesting turn of phrase :)</p>",
        "id": 571685495,
        "sender_full_name": "ww",
        "timestamp": 1770131003
    },
    {
        "content": "<p>I dunno, it kind of makes sense to me. I've spent most of my career thinking about living organisms, but I've no idea what a living organism is, mathematically. I wish I did. But I don't think there's any typed system where living organisms are a term. So maybe they are excluded by ontological gerrymandering. [tone: mostly joking around, but also slightly hoping someone makes sense of this and says something insightful]</p>",
        "id": 571686115,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1770131148
    },
    {
        "content": "<p>I think it's an interesting way to misunderstand the nature of \"data types\" in, at least, computer science. </p>\n<p>It's true that raw, unstructured information is in some sense more basic than its \"typed\" counterpart, but I don't think types are actually about filtering this raw information according to some scheme. They are much more about <em>interpreting</em> it according to some scheme. A crucial point is that a given piece of raw, unstructured information can be interpreted in may ways, and so can \"have many types\".</p>",
        "id": 571686719,
        "sender_full_name": "Chad Nester",
        "timestamp": 1770131297
    },
    {
        "content": "<p>To be clear I think it's worth thinking about whether typing omits interesting systems.</p>\n<p>But if someone gave me this metaphor I'd want them to clarify how they were trying to use it.</p>",
        "id": 571687829,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1770131575
    },
    {
        "content": "<p>Gerrymandering does not prevent things to exist though, it forces a result by contorting data flow (if you really want to sound like a tech bro). It's a form of statistical torture, if anything. I don't quite see the connection... <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 571881131,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1770203431
    }
]