[
    {
        "content": "<p>I got a nice email today saying my book <em>Gauge Fields, Knots and Gravity</em> will become available open-access through CERN:</p>\n<blockquote>\n<p>Dear Prof. Baez and Dr Muniain,</p>\n<p>I am writing to you (as the team leader for physics) regarding your bestselling book with World Scientific - <em>Gauge Fields, Knots, and Gravity</em> published in 1994. </p>\n<p>Apparently, CERN has selected a few of our books that they wish to include in their Open Access package. We will be charging them an amount, and if agreed, we shall allocate the due percentage of royalty as per your contract with us.</p>\n<p>Print on demand will continue as usual. Please let us know if you are agreeable with this arrangement. </p>\n<p>Looking forward to your response.<br>\nBest regards, Lakshmi</p>\n<p>NB: Also, if you are interested in updating the contents as a separate project, feel free to write to me. Thank you!</p>\n<hr>\n<p>Lakshmi Narayanan<br>\nDeputy Director (Physics)<br>\nWorld Scientific Singapore</p>\n</blockquote>",
        "id": 203149824,
        "sender_full_name": "John Baez",
        "timestamp": 1594150588
    },
    {
        "content": "<p>A bunch of Springer book in various subjects were made public a few months ago here</p>\n<p><a href=\"https://hnarayanan.github.io/springer-books/#Mathematics%20and%20Statistics\">https://hnarayanan.github.io/springer-books/#Mathematics%20and%20Statistics</a></p>",
        "id": 203245018,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1594198543
    },
    {
        "content": "<p>Nowadays, there are also options to publish books as open access resources in the first place :) If only more people could follow the example of the HoTT book!</p>",
        "id": 203551932,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1594411219
    },
    {
        "content": "<p>Of course you could always \"publish\" a book on arXiv, as several are. Only downside is your promotion committee are in the pockets of Big Book and won't count it</p>",
        "id": 203552353,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594411472
    },
    {
        "content": "<p>Yeah, if people are fine with publishing books to add lines on their CV rather than to be read, it's not my problem ^^</p>",
        "id": 203552742,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1594411687
    },
    {
        "content": "<p>The problem with publishing a book on the arxiv is that there is no editors at all.  But then again, many publishers don't do any actual editting either.</p>",
        "id": 203552963,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1594411838
    },
    {
        "content": "<p>The HoTT Book has been \"edited\" by numerous drive-by github contributors who have fixed lots of mistakes and typos.  I would venture to say that taken together they've probably done as good a job as a professional editing house.  Of course due to hype it's probably had more readers overall than the average math book.</p>",
        "id": 203576200,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1594434579
    },
    {
        "content": "<p>Yeah, the HoTT book is probably the best example of collaborative, \"open source\" academic writing I can think of</p>",
        "id": 203576272,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1594434665
    },
    {
        "content": "<p>And on the other hand, my experience interacting with \"professional\" copyeditors for journal articles and book chapters has NOT made me at all enthusiastic about going to the mat with them for an entire book.</p>",
        "id": 203576283,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1594434695
    },
    {
        "content": "<p>I think that contributing to open source projects is largely a thankless endeavour, and should be considered by hiring committees in the same regard as writing books---because of the positive effect is has on research.  For example, how much time has the nlab saved mathematicians.</p>",
        "id": 203581685,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1594444972
    },
    {
        "content": "<p>Whereas the typically published book has one or two, maybe up to four, authors, the HoTT Book had dozens of authors. I imagine this was crucial in them each doing it basically for free.</p>",
        "id": 203590586,
        "sender_full_name": "James Wood",
        "timestamp": 1594463395
    },
    {
        "content": "<p>Then again, wasn't it the case that Voevodsky really didn't like how the more computational community took that over and put their spin on the HoTT brand? I remember reading he was upset and then tried hard to coin Univalent Foundations for the related notion he had in mind.</p>",
        "id": 203605959,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1594488881
    },
    {
        "content": "<p><em>Topology: A Categorical Approach</em> by Tai-Danae Bradley, Tyler Bryson, and John Terilla has been made available for free access <a href=\"https://topology.pubpub.org/\">here</a>.</p>",
        "id": 207367869,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1597809383
    }
]