[
    {
        "content": "<p>I just heard <a href=\"https://www.joh.cam.ac.uk/my-tears-are-tears-joy-because-i-cannot-believe-how-lucky-i-am-have-survived-covid-19\">some news about Peter Johnstone</a>.   Maybe everyone else already knew this?   The whole interview is worth reading, but here are some quotes:</p>\n<blockquote>\n<p>The 71-year-old is a tenor with The Bach Choir, one of the world’s leading choruses, and on March 4 they travelled to America to sing with the Yale Schola Cantorum, from Yale University, and to give a series of joint concerts at major US cities. Not long after they arrived in the US, the Yale authorities pulled the plug on the tour in response to the evolving coronavirus situation - but not before the choirs had rehearsed together. “It was a really positive experience singing with them. But we were suddenly left without the concert and without the tour.”</p>\n</blockquote>\n<blockquote>\n<p>Peter flew back to the UK and travelled home to St John’s. For a while he felt ‘absolutely fine’ and carried on with his normal life, including going to London to rehearse with the choir again, but his health was slowly deteriorating. It was fellow academics and his bedder who raised the alarm when they felt he was not himself and needed urgent medical help. Peter was admitted to Addenbrooke’s Hospital on March 19 suffering from a cough, confusion, and breathing difficulties. His condition was so serious he was swiftly sedated and put on a ventilator. </p>\n</blockquote>\n<blockquote>\n<p>He now believes he contracted Covid-19 in America. “The rehearsal room we used at Yale had been extensively used by a Yale faculty member who subsequently fell ill with Covid-19. A significant number of members of the Schola Cantorum as well as many members of The Bach Choir developed Covid symptoms so it seems highly likely we all picked up the virus in that room.”</p>\n</blockquote>\n<blockquote>\n<p>Peter can’t remember much apart from some strange dreams, but a diary from his medical team shows he suffered repeated seizures, worryingly low blood pressure, developed pneumonia and his temperature spiked dangerously over the first few weeks. This was all while a ventilator was breathing for him as his body fought the Covid-19 infection. Finally in May the medical team was able to successfully take him off the ventilator, a few earlier attempts were aborted when Peter’s condition worsened. But coming off the ventilator was only the first step on the long road to recovery. “I only remember being asked if I consented to having a tracheotomy and then I mostly slipped into what I now know to be very vivid dreams, some of which included being looked after back home at John’s. I was incredibly lucky that there was space for me in Addenbrooke’s and the medical team were outstanding. I can see from my notes that they played music to me and I will always be grateful for their specialist care.</p>\n</blockquote>",
        "id": 218177920,
        "sender_full_name": "John Baez",
        "timestamp": 1606592176
    },
    {
        "content": "<p>I find it funny that I only heard this news a day or two after spotting what must have been his letter in the latest Private Eye.</p>",
        "id": 218226339,
        "sender_full_name": "James Wood",
        "timestamp": 1606678026
    },
    {
        "content": "<p>thank you for sharing, john. is there any way we could make peter aware that there is a chat list of his fans? at a department one would normally buy a gigantic card and go from office to office for signatures. if we could find a corresponding chat-list procedure, and then a bridge into the physical world to materialize and mail an actual letter or card to st johns. i think each of us owes him at least a lemma that we used, some most of the cortex, and i think it would mean to him to know that. </p>\n<p>and also, it seems that Moirae agree (or whichever god mathematicians believe in), since i think the odds for getting off the ventilator once you have been intubated at that age are against you. </p>\n<p>so the next big question in applied category practice is: how to compile and realize some fan mail for peter johnstone?</p>",
        "id": 218919570,
        "sender_full_name": "dusko",
        "timestamp": 1607145957
    },
    {
        "content": "<p>We could send him <a href=\"https://images.fineartamerica.com/images/artworkimages/mediumlarge/2/the-get-well-elephant-kathy-barney.jpg\">a big card with an elephant on it</a>.</p>\n<div class=\"message_inline_image\"><a href=\"https://images.fineartamerica.com/images/artworkimages/mediumlarge/2/the-get-well-elephant-kathy-barney.jpg\" title=\"a big card with an elephant on it\"><img src=\"https://images.fineartamerica.com/images/artworkimages/mediumlarge/2/the-get-well-elephant-kathy-barney.jpg\"></a></div>",
        "id": 218920885,
        "sender_full_name": "John Baez",
        "timestamp": 1607148420
    },
    {
        "content": "<ol>\n<li>Create a thread for the purpose, 2. Everybody writes in it, 3. Export to html format (?), 4. somebody (probably a local) prints it from their web browser and posts it to him</li>\n</ol>",
        "id": 218929974,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1607165688
    },
    {
        "content": "<p>Or a collaborative Google Doc?</p>",
        "id": 218937571,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1607179041
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Peter.20Johnstone/near/218920885\">said</a>:</p>\n<blockquote>\n<p>We could send him <a href=\"https://images.fineartamerica.com/images/artworkimages/mediumlarge/2/the-get-well-elephant-kathy-barney.jpg\">a big card with an elephant on it</a>.</p>\n</blockquote>\n<p>Featuring pachiderms is something I would encourage</p>",
        "id": 218937578,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1607179066
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229111-general/topic/Peter.20Johnstone/near/218937571\">said</a>:<br>\nideas so far:</p>\n<ol>\n<li>john: a card with a sketch of an elephant</li>\n<li>jules: workflow on collecting the messages within the chatlist</li>\n<li>matteo: maybe a google doc?</li>\n</ol>\n<p>next questions: <br>\n** how to encourage/attract as many as possible of the 1000 or so categorical chatters to contribute?<br>\n((i guess the answer determines the choice between 1 and 2?))</p>\n<p>hmm, if we get a 1000 signatures, maybe the elephant should have a 1000 blind people touching its various, uhm, toposes?</p>",
        "id": 218955057,
        "sender_full_name": "dusko",
        "timestamp": 1607204665
    },
    {
        "content": "<p>hmm bis: i used the word \"chatter\" to mean \"someone who chats\". but the word is taken for something else. it means \"the chat space\". can it be that there is no word for \"someone who chats\" among the 600K words of the english language? maybe generalize \"the chat space\" to \"chatos\"?</p>",
        "id": 218955274,
        "sender_full_name": "dusko",
        "timestamp": 1607205080
    },
    {
        "content": "<p>Btw, I don't really think there are 1000 people paying serious attention to this Zulip.  If there are, most of them are staying very quiet.</p>",
        "id": 218957839,
        "sender_full_name": "John Baez",
        "timestamp": 1607208982
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture)\">https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture)</a></p>",
        "id": 218982390,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1607254018
    },
    {
        "content": "<p>\"According to the 1% rule, about 1% of Internet users are responsible for creating content, while 99% are merely consumers of that content.\"</p>",
        "id": 218982405,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1607254049
    }
]