[
    {
        "content": "<p>Very sad news. Philip Scott has just passed away. You probably knew him through the famous \"Lambek-Scott\" book on categorical logic. He was still showing up on Zoom at our logic seminar at the University of Ottawa during the previous weeks. I knew that he was seriously sick but he never told us, his students, at any time that he had any issue. He was my supervisor together with Richard Blute. He was very supportive of me. I wish I had been able to help him in any way as well and I'm very sad to learn this. I guess a more official message will appear on the CT list. I'm sorry for being incomplete. Rest in peace Phil.</p>",
        "id": 408778068,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1702962441
    },
    {
        "content": "<p>I am heartbroken about Phil's passing. Phil was my friend and a very important mentor to me. Phil was also one of the nicest persons I have ever met. </p>\n<p>I met Phil when I was an undergraduate student at the University of Ottawa in my first year, I took group theory from him. After that I took various other classes from him like linear algebra and history of mathematics, which was a very fun class! Near the end of undergrad when I deciding what area of research to study, Phil was the one who first mentioned category theory to me. Afterwards, through all of my grad school, Phil was still a mentor to me: always supporting my research and listening to my ideas. But more importantly, Phil became a friend. We would often catch up at the FMCS conference or whenever I was passing through Ottawa again. We also both visited Edinburgh at the same time, and often went on hikes together then. Even this past year, Phil was still encouraging me. </p>\n<p>I will miss Phil truly.  Thank you for all the support, encourage, guidance, mentorship, friendship, and kindness you have shown me over the years. May you rest in peace.</p>",
        "id": 408926003,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1702989736
    }
]