[
    {
        "content": "<p>Sad news in the category theory community. I'm certain most of you received this email on the ct mailing list.</p>",
        "id": 281073528,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1651610346
    },
    {
        "content": "<p>\"It is with great sadness that we announce that our dear friend and<br>\ncolleague Pieter Hofstra (1975-2022) passed away unexpectedly on May 1.<br>\nPieter obtained his PhD from Utrecht University, under Jaap van Oosten,<br>\nstudying realizability toposes. His research interests included general<br>\ntopos theory, realizability, inverse semigroups and groupoids, abstract<br>\ncomputability, and homotopy type theory. Among his recent works, with J.<br>\nFunk he introduced the notion of isotropy groups of toposes, which he was<br>\nactively developing with students and colleagues.</p>\n<p>While Pieter was a brilliant researcher, a kind teacher and a caring<br>\nsupervisor, we will most remember him as a friend. When we have any<br>\ndetails for a memorial service, we will pass them along.</p>\n<p>Richard Blute, Simon Henry, Philip Scott  (University of Ottawa)\"</p>",
        "id": 281073540,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1651610353
    },
    {
        "content": "<p>I am extremely sad learning Pieter's sudden passing. I did my undergrad at the University of Ottawa. I did my first research project with Pieter and Pieter was the one who taught me category theory.</p>",
        "id": 281073661,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1651610415
    },
    {
        "content": "<p>Over the year, I got to hangout with Pieter at numerous conferences and seminars. I got to work with Pieter and also become friends with him. I always enjoyed having a chat with Pieter and going for food and drinks.</p>",
        "id": 281073905,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1651610496
    },
    {
        "content": "<p>Pieter will be missed in our community. His passing is shocking. My condolences to his friends and family.</p>",
        "id": 281074256,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1651610569
    },
    {
        "content": "<p>He was a mentor for ACT 2019, and it was a great experience. He was very kind and encouraging and fun.</p>",
        "id": 281076228,
        "sender_full_name": "Christian Williams",
        "timestamp": 1651611448
    },
    {
        "content": "<p>I've worked with Pieter at uOttawa since August 2019. I really liked working with him and he taught me a lot.  He was great at explaining things, asked insightful questions, and was also good company outside of work. I went on occasional bike rides with him and Phil Scott during summer 2020 when most things were closed, before I moved to Montreal and mostly met him online. We were very close to arxiving &amp; submitting the first paper (of two?) based on this work, and I will do the final edits he suggested and complete the paper very soon. To say that this was a shock would be an understatement.</p>",
        "id": 281079842,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1651613337
    },
    {
        "content": "<p>He was on my PhD committee and asked some insightful questions during my defence that I hope one day will result in an interesting paper. It's a shame he won't see it. I wish I could have known him better.</p>",
        "id": 281082384,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1651614833
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span> <a href=\"#narrow/stream/229111-general/topic/Pieter.20Hofstra/near/281076228\">said</a>:</p>\n<blockquote>\n<p>He was a mentor for ACT 2019, and it was a great experience. He was very kind and encouraging and fun.</p>\n</blockquote>\n<p>Yeah this has shaken me. The one time we where at the park he gave me some really sage advice, not sure I'd be where I am without it. I was planning on sending him a thank you note if I ever got an academic post. Guess, I shouldn't have waited. Life sucks sometimes.</p>",
        "id": 281160615,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1651673425
    },
    {
        "content": "<p>I've been thinking about Pieter all day. He spent some months with us at Carnegie Mellon University, visiting Steve Awodey during the early stages of my PhD. During that time he taught me many things, and also gave me some sage advice. I will miss the kind and generous way that he would explain things, and I am shaken that I will never get to talk with him again.</p>",
        "id": 281175926,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1651679763
    },
    {
        "content": "<p>He was extremely kind, and never one to judge people by their titles or affiliations or the like -- he treated everyone well and with respect. He was also very excitable and passionate when describing his research, and always curious about the work of others. It is a huge loss.</p>",
        "id": 281226343,
        "sender_full_name": "Gershom",
        "timestamp": 1651701945
    }
]