[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192763868\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192763868\">said</a>:</p>\n<blockquote>\n<ul>\n<li><a href=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\" title=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\">First-order categorical logic</a>.</li>\n</ul>\n<p>I haven't gotten far enough to give a really clear explanation yet.</p>\n</blockquote>\n<p>I have a question about first-order categorical logic, that <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  partially touches in his notes quoted above. I often see people mention that Lawvere solved a problem that people working in polyadic algebras or cylindrical algebras had, when he explained that quantifiers are just adjoints to the substitution map. For example, here is what Awodey says in his Category Theory textbook:</p>\n<blockquote>\n<p>Traditionally, the main obstacle to the further development of algebraic logic has been the treatment of the quantiﬁers. Categorical logic solves this problem beautifully with the recognition (due to F.W. Lawvere in the 1960s) that they, too, are adjoint functors.</p>\n</blockquote>\n<p>However, I never saw anybody explaining what is \"the problem\" that polyadic algebras couldn't solve. Any thoughts? Thank you!</p>",
        "id": 192829017,
        "sender_full_name": "Tomáš Jakl",
        "timestamp": 1585931038
    },
    {
        "content": "<p>I don't know what the problem was.  Maybe they had trouble figuring out a good way to understand how quantifiers worked?   <a href=\"https://en.wikipedia.org/wiki/Cylindric_algebra\" title=\"https://en.wikipedia.org/wiki/Cylindric_algebra\">Cylindric algebras</a> do include a treatment of quantifiers and equality.</p>",
        "id": 192858081,
        "sender_full_name": "John Baez",
        "timestamp": 1585944765
    },
    {
        "content": "<p>From what I understand, they worked out the definition in the fifties and Henkin, Monk and Tarski published a book in 1971 encompassing the rich theory of cylindric algebras. This is still before Lawvere. I can't figure out what could be \"the main obstacle to the further development\" at the time of Lawvere.</p>",
        "id": 192864666,
        "sender_full_name": "Tomáš Jakl",
        "timestamp": 1585948412
    },
    {
        "content": "<p>I found the explanation given by Marquis and Reyes in their \"The history of categorical logic\" satisfying. They wrote <a href=\"/user_uploads/21317/YHy7BgnY8p_D5wdyLvdKFOx3/part1.jpg\" title=\"part1.jpg\">the following:</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/YHy7BgnY8p_D5wdyLvdKFOx3/part1.jpg\" title=\"the following:\"><img src=\"/user_uploads/21317/YHy7BgnY8p_D5wdyLvdKFOx3/part1.jpg\"></a></div>",
        "id": 192866272,
        "sender_full_name": "Tomáš Jakl",
        "timestamp": 1585949385
    },
    {
        "content": "<p>That makes sense to me.  That may be the real obstacle: the lack of a visible connection between cylindric and polyadic algebras and other branches of math.</p>",
        "id": 192867621,
        "sender_full_name": "John Baez",
        "timestamp": 1585950280
    },
    {
        "content": "<p>Yes, I agree, it's a neat explanation. Still, I recall multiple sources claiming that algebraic logic was stuck when trying to capture quantification. Maybe, more politically correct would be to say that algebraic logic didn't capture quantifiers it in an \"explanatory\" way, so that we would learn something new we didn't know before.</p>",
        "id": 192868338,
        "sender_full_name": "Tomáš Jakl",
        "timestamp": 1585950770
    },
    {
        "content": "<p>Maybe.  If they don't explain, and we don't talk to someone who was paying attention back then, we can only guess.</p>",
        "id": 192868374,
        "sender_full_name": "John Baez",
        "timestamp": 1585950812
    },
    {
        "content": "<p>From a PL semantics point of view, cylindric algebras are not a 'syntax independent' semantics because they don't really 'get rid' of variables in the syntax, they just push them into the semantics.  syntax independent and something called full abstraction are traditionally considered the two criteria for a 'good' denotational semantics of a programming language</p>",
        "id": 192874092,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1585955007
    }
]