[
    {
        "content": "<p>I'm not sure where this news belongs, but it's interesting that Bob Coecke's company Quantinuum, which makes use of category theory, is raising a lot of capital.  He wrote:</p>\n<blockquote>\n<p>We at Quantinuum are pleased to announce the closing of a $300 million equity fundraise at a $5 billion pre-money valuation. The investors in this funding round are JP Morgan Chase, Mitsui Group, biotech company Amgen, and Honeywell.</p>\n</blockquote>\n<blockquote>\n<p><a href=\"https://www.quantinuum.com/news/honeywell-announces-the-closing-of-300-million-equity-investment-round-for-quantinuum-at-5b-pre-money-valuation\">https://www.quantinuum.com/news/honeywell-announces-the-closing-of-300-million-equity-investment-round-for-quantinuum-at-5b-pre-money-valuation</a></p>\n</blockquote>",
        "id": 415392436,
        "sender_full_name": "John Baez",
        "timestamp": 1705451594
    },
    {
        "content": "<p>To be precise, Bob is the \"Chief Scientist, Head of Quantum-Compositional Intelligence\".</p>",
        "id": 415392785,
        "sender_full_name": "John Baez",
        "timestamp": 1705451749
    },
    {
        "content": "<p>Golly $5 billion? That's a hell of a valuation.</p>",
        "id": 415934106,
        "sender_full_name": "Kevin Arlin",
        "timestamp": 1705456295
    },
    {
        "content": "<p>What is a \"pre-money valuation\"?</p>",
        "id": 415937962,
        "sender_full_name": "John Baez",
        "timestamp": 1705458479
    },
    {
        "content": "<p>This is a notional value for the company, decided before a fundraising round.  Basically, you can think of it like this: the pre-money valuation and all the capital raised during the round get thrown in a pot, and everyone gets equity proportional to how much they contributed to the pot.  So the pre-money valuation has the practical effect of determining how much each dollar (or whatever) of new investment dilutes the existing ownership.</p>\n<p>You can also set a \"post-money valuation\" instead which is a price to buy 100% of the equity in the company.  This isn't as popular because it doesn't make as much sense.  Not only does it put a cap on how much money you can raise before everyone loses their existing investment, but also, when someone buys in, the recipient of the money is the company, which they own, so indirectly they still own their investment.  The more you invest, the more valuable the company becomes, at least starting out.  A lemonade stand with $1 billion in the bank is worth $1 billion dollars, more or less, even though the stand itself is worth almost nothing.  The math here works out to match the idea of fixed pre-money valuation, not fixed post-money valuation.</p>",
        "id": 415940507,
        "sender_full_name": "James Deikun",
        "timestamp": 1705459865
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 415940946,
        "sender_full_name": "John Baez",
        "timestamp": 1705460078
    },
    {
        "content": "<p>So to be clear this announcement contains 2 things: (1) the company was valued at $5b, and (2) they have raised $300m in investment ?</p>",
        "id": 416011290,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1705492629
    },
    {
        "content": "<p>There's something a bit theoretical about these valuations, especially the pre-money ones.  The fact that they raised their target amount for the round indicates that the market accepted the valuation to a certain extent, though.</p>",
        "id": 416034534,
        "sender_full_name": "James Deikun",
        "timestamp": 1705500134
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Quantinuum/near/416011290\">said</a>:</p>\n<blockquote>\n<p>So to be clear this announcement contains 2 things: (1) the company was valued at $5b, and (2) they have raised $300m in investment ?</p>\n</blockquote>\n<p>I think that's true.  There's more detail here:</p>\n<p><a href=\"https://www.quantinuum.com/news/honeywell-announces-the-closing-of-300-million-equity-investment-round-for-quantinuum-at-5b-pre-money-valuation\">https://www.quantinuum.com/news/honeywell-announces-the-closing-of-300-million-equity-investment-round-for-quantinuum-at-5b-pre-money-valuation</a></p>",
        "id": 416065781,
        "sender_full_name": "John Baez",
        "timestamp": 1705508000
    },
    {
        "content": "<blockquote>\n<p>CHARLOTTE, NC January 16, 2024 – Honeywell (NASDAQ: HON) today announced the closing of a $300 million equity fundraise for Quantinuum, the world’s leading integrated quantum computing company, at a pre-money valuation of $5 billion. The round is anchored by Quantinuum’s strategic partner JPMorgan Chase, with additional participation from Mitsui &amp; Co., Amgen and Honeywell, which remains the company’s majority shareholder. This investment brings the total capital raised by Quantinuum since inception to approximately $625 million.</p>\n<p>This capital raise represents Quantinuum’s first equity funding round since Cambridge Quantum Computing and Honeywell Quantum Solutions merged in November 2021. The funds will be used to accelerate the path towards achieving the world’s first universal fault-tolerant quantum computers, while also extending Quantinuum’s software offering to enhance commercial applicability.</p>\n<p>JPMorgan Chase has one of the world’s most highly regarded specialist teams working on quantum technologies within the financial services industry and has been working with Quantinuum and its predecessor companies since 2020. The company was one of the earliest experimental users of Quantinuum’s H-Series quantum processor and is also one of the most active corporate partners that employs Quantinuum’s software development kit, known as “TKET.”</p>\n<p>Lori Beer, Global Chief Information Officer at JPMorgan Chase said: “Financial services has been identified as one of the first industries that will benefit from quantum technologies. As such, we have been investing in quantum research and our team of experts – led by Dr. Marco Pistoia – have made groundbreaking discoveries, partnering with quantum computing leaders like Quantinuum. We look forward to continuing to work together to positively impact our businesses, customers and the industry at large.”</p>\n</blockquote>",
        "id": 416066181,
        "sender_full_name": "John Baez",
        "timestamp": 1705508068
    },
    {
        "content": "<p>The specs for Quantinuum's H-Series quantum processor are <a href=\"https://assets.website-files.com/62b9d45fb3f64842a96c9686/654528cf9dd7824353bd9b56_Quantinuum%20H1%20Product%20Data%20Sheet%20v6.0%2030Oct23.pdf\">here</a>.</p>",
        "id": 416067896,
        "sender_full_name": "John Baez",
        "timestamp": 1705508389
    },
    {
        "content": "<p>As far as I understand, prospective use cases in every domain besides perhaps physics simulation are narrow and years if not decades away. Am I wrong here?</p>",
        "id": 416071510,
        "sender_full_name": "JR",
        "timestamp": 1705509103
    },
    {
        "content": "<p>I believe you're correct.  Simulating quantum aspects of molecules is a good domain to try, since one can try to use a fairly crude quantum computer to simulate a fairly simple quantum system and gain advantages from this idea: \"to simulate quantum mechanics, use quantum mechanics\".   But this counts as physics simulation.</p>",
        "id": 416072613,
        "sender_full_name": "John Baez",
        "timestamp": 1705509338
    },
    {
        "content": "<p>Maybe someone at JPMorgan (no relation) has developed an efficient quantum algorithm for making financial predictions and they're trying to accelerate the hardware development so they can put it into action...</p>",
        "id": 416094896,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1705516453
    },
    {
        "content": "<p>Well, Markowitz/min variance optimization a la <a href=\"https://doi.org/10.1038/s41598-023-45392-w\">https://doi.org/10.1038/s41598-023-45392-w</a> is kind of legit I guess if I squint hard enough? But i) easy to do classically and ii) with no practical quantum speedup I can imagine without appealing to QRAM with reuse of assets and handwaving. <span class=\"user-mention\" data-user-id=\"367398\">@Eric Forgy</span> am I missing something?</p>",
        "id": 416096404,
        "sender_full_name": "JR",
        "timestamp": 1705516949
    },
    {
        "content": "<p>Quantum mechanics does a great job of predicting the interference pattern on the other side of the double slit, but it tells you nothing about where the next photon is going to strike the screen.</p>\n<p>Your portfolio is like the photon. Maybe (just maybe) you can get an approximate sense of the distribution of possible future outcomes, but it will never tell you where the photon is going to strike.</p>\n<p>Quantum computing doesn't change this. It embodies it.</p>",
        "id": 416339110,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1705527018
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"658891\">JR</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Quantinuum/near/416071510\">said</a>:</p>\n<blockquote>\n<p>As far as I understand, prospective use cases in every domain besides perhaps physics simulation are narrow and years if not decades away. Am I wrong here?</p>\n</blockquote>\n<p>Fortunately investors do sometimes work with decades-long time horizons, If they didn't, some important technologies might never have happened, for example large scale domestic electricity distribution</p>",
        "id": 416561013,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1705580969
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Quantinuum/near/416561013\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"658891\">JR</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/Quantinuum/near/416071510\">said</a>:</p>\n<blockquote>\n<p>As far as I understand, prospective use cases in every domain besides perhaps physics simulation are narrow and years if not decades away. Am I wrong here?</p>\n</blockquote>\n<p>Fortunately investors do sometimes work with decades-long time horizons, If they didn't, some important technologies might never have happened, for example large scale domestic electricity distribution</p>\n</blockquote>\n<p><a href=\"https://asia.nikkei.com/Business/Masayoshi-Son-s-300-year-plan\">https://asia.nikkei.com/Business/Masayoshi-Son-s-300-year-plan</a></p>",
        "id": 416574054,
        "sender_full_name": "JR",
        "timestamp": 1705585416
    }
]