[
    {
        "content": "<p>It may be of interest to know for people here that we just released a new book that presents quantum theory in terms of monoidal string diagrams, but which is readable for pretty much anyone.  We've been getting lots of reactions from people without a mathematics background acknowledging - e.g. business people and young teenagers - that they understood complex quantum concepts through it. </p>\n<p><a href=\"/user_uploads/21317/UHYm74pnEKx5LGo7DucMCkm_/QuantumInPictures-Paperback-Blackboard-20221117-2.jpg\">QuantumInPictures-Paperback-Blackboard-20221117-2.jpg</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/UHYm74pnEKx5LGo7DucMCkm_/QuantumInPictures-Paperback-Blackboard-20221117-2.jpg\" title=\"QuantumInPictures-Paperback-Blackboard-20221117-2.jpg\"><img src=\"/user_uploads/21317/UHYm74pnEKx5LGo7DucMCkm_/QuantumInPictures-Paperback-Blackboard-20221117-2.jpg\"></a></div><p>Of all branches of category theory, what we mostly use is \"Australian CT\", with Kelly's compact closed categories, Carboni-Walters Frobenius algebras, and Lack's interacting Props playing a key role, and of course Joyal-Street that justifies the string diagrams.</p>\n<p>The main takeaway here is that it is thanks to category theory, usually conceived as very difficult, that complex quantum concepts can be made available to a broad audience, resulting in a much more inclusive quantum technology ecosystem.</p>\n<p>The book “Quantum in Pictures” is available at Amazon via print-on-demand, and published by the quantum computing company Quantinuum that I am with now, so that we could retain full control of the content and presentation.  The cover is attached.  (not trying to make any money here as we are selling without profit, in order to maximise economic inclusivity)</p>\n<p><a href=\"https://www.amazon.com/Quantum-Pictures-New-Understand-World/dp/1739214714/ref=zg_bsnr_14581_sccl_1/135-9717816-7117826?psc=1\">https://www.amazon.com/Quantum-Pictures-New-Understand-World/dp/1739214714/ref=zg_bsnr_14581_sccl_1/135-9717816-7117826?psc=1</a></p>\n<p>We also video'd lectures of the entire book and I'll post again here when they are released on Youtube.    </p>\n<p>As an aside, those monoidal quantum pictures are not only enabling inclusivity, but they are now also used by many quantum computing companies like Google, IBM, PsiQuantum, and of course ourselves, for lots of technical challenges.</p>",
        "id": 338306490,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1677498780
    },
    {
        "content": "<p>Are there people already working on translations?</p>",
        "id": 338319027,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1677502443
    },
    {
        "content": "<p>Actually, me.  Don't want the Belgium-Holland version to be \"Northern Dutch\".  :)  We've been looking around for other translators too.</p>",
        "id": 338330064,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1677505311
    }
]