[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279564\">Bobby T</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192371482\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192371482\">said</a>:</p>\n<blockquote>\n<p>let's say I'm comfortable talking about group theory, but know nearly nothing about topology as such. If I'm being taught about limits and the first example is from group theory, but the second is about topological spaces, I might just not catch the pattern, and then it becomes harder to follow everything. If that happens enough, you might just throw your hands up and say \"it's abstract nonsense!\"</p>\n</blockquote>\n<p>There are plenty of detractors of CT I've met who work in group theory, which is funny because they do use homological algebra. I think it's because many workers in that area work on very specific concrete problems that may not need the level of abstraction that CT offers.</p>",
        "id": 192383260,
        "sender_full_name": "(=_=)",
        "timestamp": 1585658624
    },
    {
        "content": "<p>Personally, resistance to CT has always felt like the an echo within mathematics of the inertia that exists at all levels of society against new ways of understanding things that are already familiar. People don't realise when what they're doing is \"secretly\" category theory because category theory feels foreign to them.<br>\nMy own solution to this issue as a researcher is twofold. First, to work long and hard enough that one catches a big fish: a result which has eluded algebraists or geometers or number theorists working classically, but whose obstacles are circumvented by the abstraction of category theory. Rehashing known results or categorifying classical methods and proofs is (usually) straightforward but necessary and time-consuming work even once the \"right\" abstract context has been identified. It's only after that has been done that one can leverage the advantages of the more abstract framework, which is why until the net gets pulled in, mathematicians in the target fields are difficult to sway.<br>\nThe second aspect is to teach and share the joy of category theory with any keen young mathematician, computer scientist, or student in another discipline. Categories abound, but it is only by introducing them to students and budding researchers that the necessary work mentioned above can be completed, in order for them to emerge (and ultimately be taught) as the modern foundation of mathematics that many of us in this community believe they should be.</p>",
        "id": 192397263,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585665018
    },
    {
        "content": "<blockquote>\n<p>The second aspect is to teach and share the joy of category theory with any keen young mathematician, computer scientist, or student in another discipline.</p>\n</blockquote>\n<p>As a keen young student from another discipline, I'm all in favor <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 192409818,
        "sender_full_name": "Bobby T",
        "timestamp": 1585670272
    },
    {
        "content": "<p>Jules wrote:</p>\n<blockquote>\n<p>Reasoning with points is definitely partly cultural, but I have a strong feeling that it's also partly innate as well - reasoning without points and only with morphisms feels like an \"unnatural\" thing that needs to be learned and practiced, to me.</p>\n</blockquote>\n<p>If your mental image of a morphism is a function of some sort between sets with some structure, then it's indeed unnatural to reason without using points - at least if you imagine a set as made of points, as most of us do.   But if you think of a morphism as an action like \"pour water in the pot\", \"put the carrots in the pot\", etc., then we naturally reason using composition and tensoring of morphisms without points.  So, it's good to teach people examples of categories where the morphisms aren't functions!</p>",
        "id": 192414278,
        "sender_full_name": "John Baez",
        "timestamp": 1585672099
    },
    {
        "content": "<p>Applied category theory is actually very good for this.</p>",
        "id": 192414320,
        "sender_full_name": "John Baez",
        "timestamp": 1585672127
    },
    {
        "content": "<p>Bobby wrote:</p>\n<blockquote>\n<p>As someone who's come into this field with a pretty limited maths background, I think that there are probably two main reasons why category theory can get a bad rap:</p>\n</blockquote>\n<p>I agree with those.   </p>\n<p>I think the <em>psychological</em> reason many people dislike category theory is that it makes them feel dumb.  This is also the reason many people dislike mathematics.  In this way category theory is a kind of \"metamathematics\": it's a kind of mathematics that even makes mathematicians feel dumb.</p>",
        "id": 192414931,
        "sender_full_name": "John Baez",
        "timestamp": 1585672402
    },
    {
        "content": "<p>One reason people feel dumb when learning category theory is that it forces you to think in new ways.  You have to literally rewire your neurons, and this creates a kind of ache in the mind.</p>",
        "id": 192415165,
        "sender_full_name": "John Baez",
        "timestamp": 1585672494
    },
    {
        "content": "<p>I tell people that this ache is good, not bad.</p>",
        "id": 192415215,
        "sender_full_name": "John Baez",
        "timestamp": 1585672522
    },
    {
        "content": "<p>Of course you have to stop after a while and relax and let it soak in while you're doing something else.</p>",
        "id": 192415261,
        "sender_full_name": "John Baez",
        "timestamp": 1585672545
    },
    {
        "content": "<p>Another reason category theory makes people feel dumb is that (like most math) it's often poorly explained.</p>",
        "id": 192415344,
        "sender_full_name": "John Baez",
        "timestamp": 1585672577
    },
    {
        "content": "<p>one of these days i need to commit my yoneda lecture to paper</p>",
        "id": 192415525,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672681
    },
    {
        "content": "<p>it seems to work quite well</p>",
        "id": 192415575,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672691
    },
    {
        "content": "<p>Another reason is that category theorists use phrases like \"just\", as in \"the Eilenberg-Moore category of a monad is just a lax equalizer\".    This sort of phrase always means: \"once you understand things this new way, it will allow you to see what you knew in as a special case of something that's simple in its own way.\"   But it makes you feel dumb at first.</p>",
        "id": 192415736,
        "sender_full_name": "John Baez",
        "timestamp": 1585672773
    },
    {
        "content": "<p>i do think there's an extent to which \"just\" has a technical meaning when used by category theorists, but i also think that it's just a bad choice of word for that a lot of the time too, and like...</p>",
        "id": 192415923,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672859
    },
    {
        "content": "<p>i think there's also some fluidity between \"expressing a useful alternate point of view\" and \"being dismissive\"</p>",
        "id": 192416006,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672914
    },
    {
        "content": "<p>and the fact that \"just\" is a word of choice exacerbates that fluidity</p>",
        "id": 192416085,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672938
    },
    {
        "content": "<p>personally, i often like to say \"precisely\" or \"exactly\" instead of \"just\" if i wanna point out that things are the same, and try to reserve \"just\" for if i really am trying to communicate that i expect the listener to feel some kind of relief or \"oh hey that's simpler!\"</p>",
        "id": 192416192,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585672985
    },
    {
        "content": "<p>Often people use \"just\" when <em>they</em> are feeling relief or \"oh hey that's simpler!\"  But their listener often doesn't feel this relief.  At least, not for a few days.</p>",
        "id": 192416849,
        "sender_full_name": "John Baez",
        "timestamp": 1585673291
    },
    {
        "content": "<p>this is true</p>",
        "id": 192417253,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585673508
    },
    {
        "content": "<p>ive for sure said shit before, or occasionally, when exercisign good judgment, <em>caught myself before</em> saying shit, like \"X is just Y!\" when a connection clicks when i know for a fact that more people understand X than Y</p>",
        "id": 192417413,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585673573
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192415575\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192415575\">said</a>:</p>\n<blockquote>\n<p>one of these days i need to commit my yoneda lecture to paper<br>\nit seems to work quite well</p>\n</blockquote>\n<p>Is this available online somewhere? I'm studying the Yoneda lemma right now so that'd be super helpful.</p>",
        "id": 192420235,
        "sender_full_name": "Vinay Madhusudanan",
        "timestamp": 1585674803
    },
    {
        "content": "<p>it's not sorry</p>",
        "id": 192420366,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585674845
    },
    {
        "content": "<p>just a schtick i've delivered to people a few times</p>",
        "id": 192420386,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585674856
    },
    {
        "content": "<p>Oh, okay. Then I do hope you write it up soon!</p>",
        "id": 192420411,
        "sender_full_name": "Vinay Madhusudanan",
        "timestamp": 1585674864
    },
    {
        "content": "<p>:)</p>",
        "id": 192420417,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585674869
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414278\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414278\">said</a>:</p>\n<blockquote>\n<p>If your mental image of a morphism is a function of some sort between sets with some structure, then it's indeed unnatural to reason without using points - at least if you imagine a set as made of points, as most of us do.   But if you think of a morphism as an action like \"pour water in the pot\", \"put the carrots in the pot\", etc., then we naturally reason using composition and tensoring of morphisms without points.  So, it's good to teach people examples of categories where the morphisms aren't functions!</p>\n</blockquote>\n<p>As someone coming to this area with more of controls and signal processing background, a lot  of my intuition already comes from composition. The wiring diagrams look a lot like formal generalizations of block diagrams which represent compositions. Is there anyone else from such a background and do they have commentary on the experience, as it compares to someone starting from reasoning about categories in terms of maps in point set topology?</p>",
        "id": 192421336,
        "sender_full_name": "Michael Zargham",
        "timestamp": 1585675253
    },
    {
        "content": "<p>A very good introduction to the Yoneda Lemma for beginners is the 3-part blog post starting here:</p>\n<ul>\n<li>Tai-Danae Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\" title=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>\n<p>Make sure to also read parts 2 and 3, \"The Yoneda embedding\" and \"The Yoneda Lemma\".</p>",
        "id": 192421732,
        "sender_full_name": "John Baez",
        "timestamp": 1585675464
    },
    {
        "content": "<p>I completely second that! Everything by Tai-Danae Bradley has been super helpful to me!</p>",
        "id": 192422012,
        "sender_full_name": "Bobby T",
        "timestamp": 1585675611
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192421732\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192421732\">said</a>:</p>\n<blockquote>\n<p>A very good introduction to the Yoneda Lemma for beginners is the 3-part blog post starting here:</p>\n<ul>\n<li>Tai-Danae Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\" title=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>\n<p>Make sure to also read parts 2 and 3, \"The Yoneda embedding\" and \"The Yoneda Lemma\".</p>\n</blockquote>\n<p>\"mathematical objects are completely determined by their relationships to other objects.\"</p>\n<p>This statement is wonderful but also interesting in that complex systems science takes this as an assumption about the world without necessarily having formal support for the claim, and in particular model based systems engineering practice also requires this assumption (again irrespective of its formal support).</p>\n<p>It is compelling that this is a basic result of CT.</p>",
        "id": 192422244,
        "sender_full_name": "Michael Zargham",
        "timestamp": 1585675705
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414931\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414931\">said</a>:</p>\n<blockquote>\n<p>I think the <em>psychological</em> reason many people dislike category theory is that it makes them feel dumb.  This is also the reason many people dislike mathematics.  In this way category theory is a kind of \"metamathematics\": it's a kind of mathematics that even makes mathematicians feel dumb.</p>\n</blockquote>\n<p>This makes sense. However, I find that category theory interests me at least partially <em>because</em> it makes me feel dumb. I prefer to think of it as providing a sense of wonder: there is so much more to math than I thought, and it's all so much more connected than I guessed.</p>",
        "id": 192429970,
        "sender_full_name": "David Egolf",
        "timestamp": 1585679122
    },
    {
        "content": "<p>I have a very low understanding of CT but had read discussions in old books and papers by N Rashevsky and R Rosen in theoreticl biology, and P Kainen and Ehresmann in neuroscience, and looked up a few things by  S MacLane and had a paper given to me by an ex-grad student of Lawvere.  I am mostly interested in applications to  ecological, chemical reaction, economic, and social networks, but i am more familiar with the approach to these using graph theory and statistical physics.   The 'dialect' of CT is quite different --it may be like learning how to build a rocket when all you need is a bicycle.</p>",
        "id": 192449945,
        "sender_full_name": "ishi crew",
        "timestamp": 1585688967
    },
    {
        "content": "<p>If you're doing just fine without category theory, carry on!</p>",
        "id": 192451083,
        "sender_full_name": "John Baez",
        "timestamp": 1585689555
    },
    {
        "content": "<p>A colleague of mine used a very similar phrase for exactly the same thing, \"using a space shuttle to get to the second floor\", I think it's great</p>",
        "id": 192454639,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585691490
    },
    {
        "content": "<p>That being said, I always recommend 7 Sketches in Compositionality by Brendan Fong and David Spivak (a book, but also free on arXiv) for getting started from an applied motivation</p>",
        "id": 192456340,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585691656
    },
    {
        "content": "<p>it's all about marginal costs... i could take a space shuttle to the moon, but if I can have a worm hole generator, i'd probably test it by going to the moon before I used it to go to alpha centauri.  (here CT is the worm hole generator)</p>\n<p>Speaking of which,  <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> again provided the answers i sought above by providing more mappings of CT to concepts dynamical systems and control engineers know well  with this: <a href=\"https://arxiv.org/pdf/1504.05625.pdf\" title=\"https://arxiv.org/pdf/1504.05625.pdf\">https://arxiv.org/pdf/1504.05625.pdf</a> and I am cutting my teeth on analogue circuits because they already have wiring diagrams and I already know how to make filters and controllers by composing primitive processes.</p>\n<p>Circuits and signal processing are great entry points for engineers (as opposed to mathematicians and computer scientists) to CT. I am firmly of the opinion (now) that we need CT in Cyberphysical Systems precisely because of the challenge of composing higher and higher order systems with less and less control of the associated subsystems. At that point the only thing you can hope to model (or design) is structure.</p>\n<p>Today's big realization (conjecture, actually) is that Lyapunov stability can be thought of as the property that the system's structure is isomorphic to a passive system with the Lyapunov function as its notion of energy.</p>",
        "id": 192458587,
        "sender_full_name": "Michael Zargham",
        "timestamp": 1585691925
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192397263\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192397263\">said</a>:</p>\n<blockquote>\n<p>Personally, resistance to CT has always felt like the an echo within mathematics of the inertia that exists at all levels of society against new ways of understanding things that are already familiar. </p>\n</blockquote>\n<p>As William Gibson once put it, \"<a href=\"https://quoteinvestigator.com/2012/01/24/future-has-arrived/\" title=\"https://quoteinvestigator.com/2012/01/24/future-has-arrived/\">The future is already here — it's just not very evenly distributed</a>\". You can see it in the reactions to the current pandemic as well. </p>\n<blockquote>\n<p>People don't realise when what they're doing is \"secretly\" category theory because category theory feels foreign to them.</p>\n</blockquote>\n<p>The best thing is when algebraic geometers are resistant to category theory: like, your entire discipline is full of category theory for goodness sake! </p>\n<p>I think what people feel foreign about is CT for CT's sake. Homological algebra is part of CT, but most people don't think that, because it feels like a concrete calculating tool.</p>\n<p>And this isn't restricted to CT either. Set theory has the same problem: you literally use set-theoretic notation every day, and yet most people don't care for set theory itself.</p>",
        "id": 192472652,
        "sender_full_name": "(=_=)",
        "timestamp": 1585702783
    },
    {
        "content": "<p>In the case of set theory, a lot of what set theorists study involve ways in which ZFC doesn't determine all the properties of \"the\" universe of sets, which is precisely what most mathematicians would rather not hear about.</p>",
        "id": 192472885,
        "sender_full_name": "John Baez",
        "timestamp": 1585702985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192472885\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192472885\">said</a>:</p>\n<blockquote>\n<p>In the case of set theory, a lot of the stuff that set theorists study are ways in which ZFC doesn't determine all the properties of \"the\" universe of sets, which is precisely what most mathematicians would rather not hear about.</p>\n</blockquote>\n<p>You can phrase it as avoidance. The alternative view is this: that set theorists haven't produced any striking examples that are commonplace enough that most mathematicians' work would be adversely and unavoidably affected.</p>",
        "id": 192473134,
        "sender_full_name": "(=_=)",
        "timestamp": 1585703215
    },
    {
        "content": "<p>The same goes for CT. If I'm an analyst -- hypothetically, of course, I couldn't produce an estimate if my life depended on it -- does CT give me tools for my specific research problems that I couldn't have obtained otherwise from a deeper study of analysis? We both know someone for whom the answer is: No.</p>",
        "id": 192473162,
        "sender_full_name": "(=_=)",
        "timestamp": 1585703273
    },
    {
        "content": "<p>To continue in this vein, here's a question: In another thread, you mentioned your work on entropy that involves some good old-fashioned analysis. Could that analysis have been replaced with CT? If so, how? If not, why not?</p>",
        "id": 192473267,
        "sender_full_name": "(=_=)",
        "timestamp": 1585703390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414931\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192414931\">said</a>:</p>\n<blockquote>\n<p>I think the <em>psychological</em> reason many people dislike category theory is that it makes them feel dumb.  This is also the reason many people dislike mathematics.  In this way category theory is a kind of \"metamathematics\": it's a kind of mathematics that even makes mathematicians feel dumb.</p>\n</blockquote>\n<p>This is why I feel that I really need to challenge this view. Detractors of CT feel dumb on a regular basis: that's literally part and parcel of doing maths. So why does this instance of feeling \"dumb\" put them off?</p>",
        "id": 192473661,
        "sender_full_name": "(=_=)",
        "timestamp": 1585703763
    },
    {
        "content": "<p>Rongmin wrote:</p>\n<p>\"The alternative view is this: that set theorists haven't produced any striking examples that are commonplace enough that most mathematicians' work would be adversely affected.\"</p>\n<p>That's probably how it feels to lots of mathematicians.   Here's a question: suppose an abelian group <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> has the property that every short exact sequence of abelian groups</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mn>0</mn><mo>→</mo><mi mathvariant=\"double-struck\">Z</mi><mo>→</mo><mi>B</mi><mo>→</mo><mi>A</mi><mo>→</mo><mn>0</mn></mrow><annotation encoding=\"application/x-tex\"> 0 \\to \\mathbb{Z} \\to B \\to A \\to 0</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">0</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">Z</span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">0</span></span></span></span></p>\n<p>splits.  Is <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> necessarily free?  </p>\n<p>The answer to this question is <a href=\"https://en.wikipedia.org/wiki/Whitehead_problem\" title=\"https://en.wikipedia.org/wiki/Whitehead_problem\">independent of ZFC</a>.   So, a certain line of research in algebra is blocked until we choose axioms extending ZFC that settle this question, and hopefully others, one way or the other.</p>\n<p>But it seems not many algebraists are motivated to dig in this direction.   For one thing, it would require a lot of work!</p>",
        "id": 192473900,
        "sender_full_name": "John Baez",
        "timestamp": 1585704029
    },
    {
        "content": "<p>\"In another thread, you mentioned your work on entropy that involves some good old-fashioned analysis. Could that analysis have been replaced with CT? If so, how? If not, why not?\"</p>\n<p>I have no idea!   <a href=\"https://arxiv.org/abs/1402.3067\" title=\"https://arxiv.org/abs/1402.3067\">This result</a> involved a blend of category theory and analysis.  It was so hard to prove that when we were done we were just happy we succeeded.  We didn't try to find <em>another</em> proof.</p>",
        "id": 192473982,
        "sender_full_name": "John Baez",
        "timestamp": 1585704126
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192473900\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192473900\">said</a>:</p>\n<blockquote>\n<p>The answer to this question is <a href=\"https://en.wikipedia.org/wiki/Whitehead_problem\" title=\"https://en.wikipedia.org/wiki/Whitehead_problem\">independent of ZFC</a>.   So, a certain line of research in algebra is blocked until we choose axioms extending ZFC that settle this question, and hopefully others, one way or the other.</p>\n<p>But it seems not many algebraists are motivated to dig in this direction.   For one thing, it would require a lot of work!</p>\n</blockquote>\n<p>Yup, and unless that work is rewarded, it won't be done, or you'll get workarounds.</p>\n<p>In real life, if a certain line of research is blocked, people will route around it and ignore it. At least the career-minded ones would.</p>",
        "id": 192474167,
        "sender_full_name": "(=_=)",
        "timestamp": 1585704318
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192473982\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192473982\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://arxiv.org/abs/1402.3067\" title=\"https://arxiv.org/abs/1402.3067\">This result</a> involved a blend of category theory and analysis.  It was so hard to prove that when we were done we were just happy we succeeded.  We didn't try to find <em>another</em> proof.</p>\n</blockquote>\n<p>Let me rephrase my question so that it's clearer: is there a way for you to translate the analysis you've done into CT terms? Not another strategy or another approach, but just rewriting all the analysis you've actually done in the language of CT.</p>",
        "id": 192474351,
        "sender_full_name": "(=_=)",
        "timestamp": 1585704499
    },
    {
        "content": "<p>It sounds hard.   I never considered doing it.</p>",
        "id": 192474953,
        "sender_full_name": "John Baez",
        "timestamp": 1585705086
    },
    {
        "content": "<p>Tom Leinster has a nice <a href=\"https://golem.ph.utexas.edu/category/2014/07/the_categorical_origins_of_leb.html\" title=\"https://golem.ph.utexas.edu/category/2014/07/the_categorical_origins_of_leb.html\">categorical approach to Lebesgue integration</a>, so it's possible one could take large chunks of real analysis and make them more categorical.</p>",
        "id": 192475298,
        "sender_full_name": "John Baez",
        "timestamp": 1585705474
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275967\">Vinay Madhusudanan</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192420235\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192420235\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192415575\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192415575\">said</a>:</p>\n<blockquote>\n<p>one of these days i need to commit my yoneda lecture to paper<br>\nit seems to work quite well</p>\n</blockquote>\n<p>Is this available online somewhere? I'm studying the Yoneda lemma right now so that'd be super helpful.</p>\n</blockquote>\n<p>Hi Vinay, take a look at this too...<br>\n<a href=\"http://angg.twu.net/math-b.html#notes-yoneda\" title=\"http://angg.twu.net/math-b.html#notes-yoneda\">http://angg.twu.net/math-b.html#notes-yoneda</a><br>\nIt's about the gory details .</p>",
        "id": 192475460,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1585705643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275967\">Vinay Madhusudanan</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192344267\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192344267\">said</a>:</p>\n<blockquote>\n<p>Hi Gabo! What sort of undergraduate degree is seven years long… <em>on the average</em>? And if it has an inflexible curriculum, which aspect makes the time vary about the average?</p>\n</blockquote>\n<p>(This is not very on-topic now that the conversation has been moved from \"Introduce Youerself!\" to \"learning CT\", but I'm answering here because I don't know where else I would and also I find it fun to share how different our degree system is. Ignore this if you don't care about university in Argentina!)</p>\n<p>Hi! It's as <span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>  points out (I feel understood!). Our system is similar to the pre-Bologna European one, or so they say. It might sound weird: for engeneering, for example, the degree is literally \"Engineer\". For most disciplines, the standard degree is the Licentiate degree, but its length also varies from one discipline to the other. In my case, the Physics Licentiate degree is 6 years in paper, though the usual is 7.</p>\n<p>There are many reasons why the time varies, but as a clarification, what I meant by \"inflexible curriculum\" is that you have almost no choice about what classes you must take, and not that you are required to complete the degree in a fixed amount of time (which you aren't). I would say the main reason for the variability is that most classes have very hard final exams, which you are not required to take at the end of the semester. Instead, you can take them any time as soon as you pass the rest of the class. It's almost universal for people to accumulate some of those, because you need a lot of time to prepare well for them and there's a balance to be kept between how much \"final debt\" you have and how good you want your grades to be. Keep in mind that for all these classes I'm referring to, the final exam determines 100% of your grade.</p>\n<p>There are other things too, such as the fact that there's no tuition of any sort for undergraduate degrees (at least for public universities, which are the only ones you'll care about anyway if you're interested in Physics or Mathematics). All in all it's a different world around here <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 192477214,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1585707838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> and <span class=\"user-mention\" data-user-id=\"279564\">@Bobby T</span> : Thanks for the kind words! I actually feel like I will understand stuff if I put serious time on it, especially given the nice resources that are available now such as Paolo Perrone's notes and Seven Sketches---it's more like feeling frustrated because of never finding time for it, or having my energy consumed by other things that I'd rather not be studying. I think I just need more time working through stuff on my own. Having a nice community here might make it more enjoyable though!</p>",
        "id": 192477504,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1585708211
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279564\">Bobby T</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192367365\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192367365\">said</a>:</p>\n<blockquote>\n<p>Also, I also got interested in category theory partly from an interest in complex systems! We should set up a stream if there isn't one already!</p>\n</blockquote>\n<p>Cool! About setting up a complex systems stream, my current understanding is that a lot of the work currently going under the name of Applied Category Theory would fit pretty well the name \"complex systems from a CT viewpoint\". So I'm not sure what could be the purpose of a separate stream. Perhaps I could see a need for translating questions and ideas back and forth between some established \"complex systems\" vocabulary and ACT, but I'm not sure. In any case <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> 's question at <a class=\"stream\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-applied-category-theory\">#applied category theory</a> -&gt; \"measuring non-compositionality\" seems crucial to developing that relationship</p>",
        "id": 192478114,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1585709226
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275967\">Vinay Madhusudanan</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192420411\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192420411\">said</a>:</p>\n<blockquote>\n<p>Oh, okay. Then I do hope you write it up soon!</p>\n</blockquote>\n<p>okay i actually did go and start working on writing it up a while after you suggested</p>",
        "id": 192478195,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585709400
    },
    {
        "content": "<p>although i wouldn't hold your breath, i lose focus on things suuuper easily <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span></p>",
        "id": 192478237,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585709411
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/0H226DTEO6pYIWgurchazvqB/Screenshot_2020-03-31_22-35-20.png\" title=\"Screenshot_2020-03-31_22-35-20.png\">Screenshot_2020-03-31_22-35-20.png</a><br>\nheres the imagery ive ended up liking for presheaves after a few times around explaining yoneda :-)</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/0H226DTEO6pYIWgurchazvqB/Screenshot_2020-03-31_22-35-20.png\" title=\"Screenshot_2020-03-31_22-35-20.png\"><img src=\"/user_uploads/21317/0H226DTEO6pYIWgurchazvqB/Screenshot_2020-03-31_22-35-20.png\"></a></div>",
        "id": 192478290,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585709522
    },
    {
        "content": "<p>well, that particular diagram is maybe not the best possible illustration of it, but</p>",
        "id": 192478309,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585709536
    },
    {
        "content": "<p>Wow. When I was looking for a proof of the Yoneda Lemma that was clear enough for me to implement, the best I found was by the Unapologetic Mathematician (<a href=\"https://unapologetic.wordpress.com/2007/06/06/yonedas-lemma/\" title=\"https://unapologetic.wordpress.com/2007/06/06/yonedas-lemma/\">https://unapologetic.wordpress.com/2007/06/06/yonedas-lemma/</a>). This doesn't include the naturality conditions that are not always regarded as being part of the lemma proper. It ends with the claim that the two procedures it constructs are \"clearly\" inverses. I hope that means that I can assert that and the compiler will auto verify it. That should be the definition of \"clearly\" for some definition of \"compiler\".</p>",
        "id": 192480164,
        "sender_full_name": "Robert Smart",
        "timestamp": 1585712155
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/9PtdMaQREE6W4pxRehIqJ0qV/main.pdf\" title=\"main.pdf\">main.pdf</a><br>\nhere's what i've written up so far—mostly an explanation of the idea of what a presheaf is, not so much touching on yoneda at all yet<br>\nid guess this is probably like a third of the way into my usual schtick</p>",
        "id": 192480664,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585712924
    },
    {
        "content": "<p>all else aside, i am not going to fucking rest until it is standard pedagogical practice to use this kind of description for explaining what a presheaf is</p>",
        "id": 192481198,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585713721
    },
    {
        "content": "<p>hahahaaaaa i just opened the nlab page on \"presheaf\" to double check that this <em>isn't</em> how they explain it for some reason, saw that this explanation actually <em>does</em> exist over on \"space and quantity\" and remembered that id seen that before, and oops of <em>course</em> the citation is lawvere</p>",
        "id": 192481276,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585713821
    },
    {
        "content": "<p><strong><em>how</em></strong> have i barely read any of his actual work</p>",
        "id": 192481335,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585713885
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192474953\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192474953\">said</a>:</p>\n<blockquote>\n<p>It sounds hard. I never considered doing it.</p>\n</blockquote>\n<p>Exactly. That's probably how the thought process of many analysts who've encountered CT ended. They may play around it for a while, but once they got around to considering what I've just asked you to consider, they'd inevitably come to the same conclusion you just did: it sounds hard.</p>\n<p>And that's why people avoid CT. Not because it's hard, but because it doesn't offer any clear advantage over the tools they currently have in their field. Yet.</p>",
        "id": 192482232,
        "sender_full_name": "(=_=)",
        "timestamp": 1585715073
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192475298\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192475298\">said</a>:</p>\n<blockquote>\n<p>Tom Leinster has a nice <a href=\"https://golem.ph.utexas.edu/category/2014/07/the_categorical_origins_of_leb.html\" title=\"https://golem.ph.utexas.edu/category/2014/07/the_categorical_origins_of_leb.html\">categorical approach to Lebesgue integration</a>, so it's possible one could take large chunks of real analysis and make them more categorical.</p>\n</blockquote>\n<p>That's a nice start, but that's only the chunk related to Lebesgue integration. Most analysts would probably only be convinced once you can do the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi></mrow><annotation encoding=\"application/x-tex\"> \\epsilon </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">ϵ</span></span></span></span>-<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi></mrow><annotation encoding=\"application/x-tex\"> \\delta </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span></span></span></span> argument in CT, and probably only if it's sleeker than the old style.</p>",
        "id": 192482257,
        "sender_full_name": "(=_=)",
        "timestamp": 1585715150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278867\">Gabriel Goren</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192477214\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192477214\">said</a>:</p>\n<blockquote>\n<p>This is not very on-topic now that the conversation has been moved from \"Introduce Yourself!\" to \"learning CT\"</p>\n</blockquote>\n<p>Funny how that happened.</p>\n<blockquote>\n<p>It's as <span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span>  points out (I feel understood!). Our system is similar to the pre-Bologna European one, or so they say. </p>\n</blockquote>\n<p>De nada. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<p>Your system follows the pre-Bologna Spanish system, which is similar to the other systems in continental Europe. In particular:</p>\n<blockquote>\n<p>There are other things too, such as the fact that there's no tuition of any sort for undergraduate degrees</p>\n</blockquote>\n<p>I'm not sure which sense of tuition you meant here -- fees, or classes outside of lectures -- but that's true in Germany AFAIK. The final exam determining 100% of your grade was also true in the old continental system, and perhaps even of the Oxbridge universities.</p>",
        "id": 192482818,
        "sender_full_name": "(=_=)",
        "timestamp": 1585715989
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278867\">@Gabriel Goren</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192478114\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192478114\">said</a>:</p>\n<blockquote>\n<p>Perhaps I could see a need for translating questions and ideas back and forth between some established \"complex systems\" vocabulary and ACT, but I'm not sure. In any case <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> 's question at <a class=\"stream-topic\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-applied-category-theory/topic/measuring.20non-compositionality\">#applied category theory &gt; measuring non-compositionality</a> seems crucial to developing that relationship</p>\n</blockquote>\n<p>I think that's a nice topic to set up: a dictionary between current complex systems terminology and ACT. I don't know much about the study of complex systems and would like to learn more.</p>",
        "id": 192483946,
        "sender_full_name": "(=_=)",
        "timestamp": 1585717449
    },
    {
        "content": "<blockquote>\n<p>Most analysts would probably only be convinced once you can do the ϵ-δ argument in CT, and probably only if it's sleeker than the old style.</p>\n</blockquote>\n<p>Probabily true.  Just to be clear:  I wasn't mentioning Tom's idea as something that would convince anyone to change how they do anything.   I just think it's a cool result.</p>",
        "id": 192485553,
        "sender_full_name": "John Baez",
        "timestamp": 1585719827
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192485553\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192485553\">said</a>:</p>\n<blockquote>\n<p>I wasn't mentioning Tom's idea as something that would convince anyone to change how they do anything.   I just think it's a cool result.</p>\n</blockquote>\n<p>Agreed, but it'd be nicer if more people worked on this neglected aspect of CT. Either to develop the capability, or to hit a brick wall so that we can reasonably say, \"Well, that's something CT can't do\".</p>",
        "id": 192493087,
        "sender_full_name": "(=_=)",
        "timestamp": 1585727183
    },
    {
        "content": "<p>I believe it's misleading to think CT can be useful to (say) analysts only if we are able to prove estimates using categorical tools. That's actually the most useless way CT could enter a field, because it doesn't add anything new and it recasts everything in a language most people there don't understand, let alone master. Eventually, people will 'meh' it and go back to their usual methods. <br>\nWhat CT is great at is unraveling patterns. This enables cross-pollination between subjects, and that's where we should go looking for new results. If I can show the analyst I can open new fronts to attack a problem, using ideas from analogous but not-yet-related parts of math, this might at least sound like honest, working mathematics, and not just general abstract nonsense.</p>",
        "id": 192504565,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585734609
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192482257\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192482257\">said</a>:</p>\n<blockquote>\n<p>Most analysts would probably only be convinced once you can do the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi></mrow><annotation encoding=\"application/x-tex\"> \\epsilon </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">ϵ</span></span></span></span>-<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi></mrow><annotation encoding=\"application/x-tex\"> \\delta </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span></span></span></span> argument in CT, and probably only if it's sleeker than the old style.</p>\n</blockquote>\n<p>Here is an <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi></mrow><annotation encoding=\"application/x-tex\">\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">ϵ</span></span></span></span>-<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi></mrow><annotation encoding=\"application/x-tex\">\\delta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span></span></span></span> argument in category theory. I don't think it will impress analysts, though!</p>\n<p>Let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">F</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">F</span></span></span></span></span> be the category of finite sets. It plays the role of the ground field for objective linear algebra. For any set <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span> (possibly infinite), the slice category <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">F</mi><mi mathvariant=\"normal\">/</mi><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}/S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"mord\">/</span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span> plays the role of the free vector space spanned by $S$, and the presheaf category <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>S</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.05764em;\">S</span></span></span></span></span></span></span></span></span></span></span> plays the role of the profinite-dimensional vector space of functions on <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span>. The profinite structure comes from the fact that since <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span> is the inductive limit of its finite subsets <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi><mo>⊂</mo><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">\\epsilon\\subset S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mord mathdefault\">ϵ</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">⊂</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span>, the function space is the projective limit of the finite function spaces <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>ϵ</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.664392em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\">ϵ</span></span></span></span></span></span></span></span></span></span></span>. Continuity with respect to the profinite topology means to preserve these projective limits. Use Greek letters to denote finite sets.</p>\n<p>PROPOSITION. A linear functor <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>T</mi></msup><mo>→</mo><msup><mi mathvariant=\"double-struck\">F</mi><mi>S</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^T \\to \\mathbb{F}^S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.13889em;\">T</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.05764em;\">S</span></span></span></span></span></span></span></span></span></span></span> is continuous if and only if for every <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi><mo>⊂</mo><mi>S</mi></mrow><annotation encoding=\"application/x-tex\">\\epsilon \\subset S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mord mathdefault\">ϵ</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">⊂</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05764em;\">S</span></span></span></span> there exists <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi><mo>⊂</mo><mi>T</mi></mrow><annotation encoding=\"application/x-tex\">\\delta\\subset T</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.73354em;vertical-align:-0.0391em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">⊂</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.13889em;\">T</span></span></span></span> such that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>T</mi></msup><mo>→</mo><msup><mi mathvariant=\"double-struck\">F</mi><mi>S</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^T \\to \\mathbb{F}^S</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.13889em;\">T</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.05764em;\">S</span></span></span></span></span></span></span></span></span></span></span> factors through <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>δ</mi></msup><mo>→</mo><msup><mi mathvariant=\"double-struck\">F</mi><mi>ϵ</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^\\delta \\to \\mathbb{F}^\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.849108em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.849108em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.03785em;\">δ</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.664392em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\">ϵ</span></span></span></span></span></span></span></span></span></span></span> via the projections <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>T</mi></msup><mo>→</mo><msup><mi mathvariant=\"double-struck\">F</mi><mi>δ</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^T \\to \\mathbb{F}^\\delta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.13889em;\">T</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.849108em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.849108em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.03785em;\">δ</span></span></span></span></span></span></span></span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">F</mi><mi>S</mi></msup><mo>→</mo><msup><mi mathvariant=\"double-struck\">F</mi><mi>ϵ</mi></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{F}^S \\to \\mathbb{F}^\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8413309999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8413309999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\" style=\"margin-right:0.05764em;\">S</span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbb\">F</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.664392em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathdefault mtight\">ϵ</span></span></span></span></span></span></span></span></span></span></span>.</p>\n<p>This is from the paper [Gálvez-Kock-Tonks, <em>Homotopy linear algebra</em>]. (The 'homotopy' in the title refers to the fact that all this works the same for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord\">∞</span></span></span></span>-groupoids instead of sets.) 'Linear functor' means sum-preserving. These are representable by spans, in the same way as in ordinary linear algebra linear maps can be expressed as matrices.</p>",
        "id": 192508910,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1585737230
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192480664\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192480664\">said</a>:</p>\n<blockquote>\n<p><a href=\"/user_uploads/21317/9PtdMaQREE6W4pxRehIqJ0qV/main.pdf\" title=\"main.pdf\">main.pdf</a><br>\nhere's what i've written up so far—mostly an explanation of the idea of what a presheaf is, not so much touching on yoneda at all yet<br>\nid guess this is probably like a third of the way into my usual schtick</p>\n</blockquote>\n<p>Cool. So a presheaf can be seen as a profunctor to (or is it from?) the terminal category. I'm looking forward to the rest of these notes.</p>",
        "id": 192509752,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1585737781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span> <span class=\"user-mention\" data-user-id=\"276773\">@Eduardo Ochs</span> Thank you, thank you! Really helpful.<br>\n<span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span>  The presheaf idea is new to me (I've seen the word before and seen some definition whose import I couldn't understand at the time, but that's it). Waiting for more!</p>",
        "id": 192518239,
        "sender_full_name": "Vinay Madhusudanan",
        "timestamp": 1585743431
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278867\">@Gabriel Goren</span> Even my bachelor's offered no choices in the curriculum, but it was only three years. The examination pattern (especially the 100% weighted final) also sounds strange indeed. Can't help wondering what the implications are in terms of how effective it is — I suppose only really interested students take up these courses? (Which is not the case here)</p>",
        "id": 192518743,
        "sender_full_name": "Vinay Madhusudanan",
        "timestamp": 1585743754
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192504565\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192504565\">said</a>:</p>\n<blockquote>\n<p>I believe it's misleading to think CT can be useful to (say) analysts only if we are able to prove estimates using categorical tools. That's actually the most useless way CT could enter a field, because it doesn't add anything new and it recasts everything in a language most people there don't understand, let alone master. Eventually, people will 'meh' it and go back to their usual methods. <br>\nWhat CT is great at is unraveling patterns. This enables cross-pollination between subjects, and that's where we should go looking for new results. If I can show the analyst I can open new fronts to attack a problem, using ideas from analogous but not-yet-related parts of math, this might at least sound like honest, working mathematics, and not just general abstract nonsense.</p>\n</blockquote>\n<p>You need both, and Grothendieck is the historical example. CT probably enabled him to transfer the thinking in functional analysis, which he acquired while working under Schwartz and Dieudonne, into algebraic geometry. </p>\n<p>(A brief timeline: </p>\n<ul>\n<li>CT was initiated in 1942-1945</li>\n<li>Grothendieck did functional analysis in 1950-1953</li>\n<li>He switched to algebraic geometry by 1957)</li>\n</ul>\n<p>This cross-pollination changed the face of algebraic geometry, but it also recast the tools of algebraic geometry in a language that many people there today still don't fully understand. On top of that, it improved those tools and corrected errors that were generated by the previous techniques.</p>\n<p>Algebraic geometers could have said \"meh\" and carried on with their old intuitive techniques, but they didn't, because their old tools had been replaced with better ones. That's why they couldn't have said \"meh\".</p>\n<p>I don't see the prospect of CT doing that for analysis yet, because the current tools are pretty rigorous and powerful, and what CT can do now seems to pale in comparison.</p>",
        "id": 192526177,
        "sender_full_name": "(=_=)",
        "timestamp": 1585747363
    },
    {
        "content": "<p>What some analysts (and some group theorists, and other detractors) who are engaged in research into concrete problems don't really appreciate about CT is that they don't really feel that the capabilities of the tools in their domain have been exhausted yet to justify bringing in the big machinery of CT. They don't see the need for \"cross-pollination between subjects\", because many of them don't work between subjects. </p>\n<p>As <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span>  said <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192451083\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192451083\">upstream</a>:</p>\n<blockquote>\n<p>If you're doing just fine without category theory, carry on!</p>\n</blockquote>\n<p>I agree.</p>\n<p>But I'd argue it's still a big gap in our knowledge if we can't (or don't know if we can) simulate analysis using CT. I'm probably woefully under-informed, since <span class=\"user-mention silent\" data-user-id=\"276625\">Joachim Kock</span> just contributed a reference upstream, but then perhaps if we can somehow already do analysis using CT, it's not really common knowledge and perhaps we should make that knowledge more common.</p>",
        "id": 192526817,
        "sender_full_name": "(=_=)",
        "timestamp": 1585747665
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276625\">@Joachim Kock</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192508910\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192508910\">said</a>:</p>\n<blockquote>\n<p>Here is an <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi></mrow><annotation encoding=\"application/x-tex\">\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">ϵ</span></span></span></span>-<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi></mrow><annotation encoding=\"application/x-tex\">\\delta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span></span></span></span> argument in category theory. I don't think it will impress analysts, though!</p>\n</blockquote>\n<p>I would clarify that I meant the reformulation of the standard <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ϵ</mi></mrow><annotation encoding=\"application/x-tex\">\\epsilon</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">ϵ</span></span></span></span>-<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>δ</mi></mrow><annotation encoding=\"application/x-tex\">\\delta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03785em;\">δ</span></span></span></span> argument in category-theoretic terms, but I think what you have in that paper is pretty impressive -- to me, anyway. That makes me hopeful.</p>",
        "id": 192533169,
        "sender_full_name": "(=_=)",
        "timestamp": 1585750110
    },
    {
        "content": "<p>Category theory can be good in figuring out patterns and straightening out concepts in analysis.   One very simple and fundamental example: instead of metric spaces, it's often better to use Lawvere metric space.</p>",
        "id": 192543839,
        "sender_full_name": "John Baez",
        "timestamp": 1585754122
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192482232\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192482232\">said</a>:</p>\n<blockquote>\n<p>And that's why people avoid CT. Not because it's hard, but because it doesn't offer any clear advantage over the tools they currently have in their field. Yet.</p>\n</blockquote>\n<p>cf my \"big fish\" comment earlier. Rehashing the basics of (in this example) analysis is time-consuming work that yields few initial rewards in terms of new results until it's complete. Like how one can't put on a performance at a theatre until it's built.</p>",
        "id": 192545453,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585754686
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192545453\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192545453\">said</a>:</p>\n<blockquote>\n<p>cf my \"big fish\" comment earlier. Rehashing the basics of (in this example) analysis is time-consuming work that yields few initial rewards in terms of new results until it's complete. Like how one can't put on a performance at a theatre until it's built.</p>\n</blockquote>\n<p>I think I rehashed that <a href=\"#narrow/stream/229111-general/topic/learning.20CT/near/192526177\" title=\"#narrow/stream/229111-general/topic/learning.20CT/near/192526177\">here</a>. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> I'm also reminded of Kevin Buzzard's exhortation to others to chip in to formalise known mathematical results in Lean or other automated theorem provers, so that there's a base on top of which more automated systems reasoning about mathematics can be built.</p>",
        "id": 192561916,
        "sender_full_name": "(=_=)",
        "timestamp": 1585761351
    },
    {
        "content": "<p>I think I'd derailed this thread from its purported topic of \"learning CT\". I might shift the discussion to another topic.</p>",
        "id": 192580827,
        "sender_full_name": "(=_=)",
        "timestamp": 1585769417
    },
    {
        "content": "<p>You can shift the discussion starting at any comment...</p>",
        "id": 192581138,
        "sender_full_name": "John Baez",
        "timestamp": 1585769547
    },
    {
        "content": "<p>And I did. It's now \"Resistance to CT\".</p>",
        "id": 192581233,
        "sender_full_name": "(=_=)",
        "timestamp": 1585769607
    },
    {
        "content": "<p>bwahaha</p>",
        "id": 192582688,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585770305
    },
    {
        "content": "<p>Oh, good.  Yes, everyone: you can retroactively decide a discussion has drifted from its original topic, and go back and change the topic starting where the digression began!</p>",
        "id": 192582710,
        "sender_full_name": "John Baez",
        "timestamp": 1585770317
    },
    {
        "content": "<p>I'll make the obvious \"resistance is futile\" joke before anyone else</p>",
        "id": 192582741,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585770332
    },
    {
        "content": "<p>You beat me by 3 seconds.  <span aria-label=\"angry devil\" class=\"emoji emoji-1f47f\" role=\"img\" title=\"angry devil\">:angry_devil:</span></p>",
        "id": 192582784,
        "sender_full_name": "John Baez",
        "timestamp": 1585770354
    },
    {
        "content": "<p>resistance to CT is inversely proportional to current of CT</p>",
        "id": 192582787,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585770357
    },
    {
        "content": "<p>Hah, that sounds about right!</p>",
        "id": 192582934,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1585770420
    },
    {
        "content": "<p>Also, the word \"inertia\" as used by <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers</span> is accurate.</p>",
        "id": 192582996,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1585770453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192582787\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192582787\">said</a>:</p>\n<blockquote>\n<p>resistance to CT is inversely proportional to current of CT</p>\n</blockquote>\n<p>I lol'd.</p>",
        "id": 192583628,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1585770790
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192582787\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192582787\">said</a>:</p>\n<blockquote>\n<p>resistance to CT is inversely proportional to current of CT</p>\n</blockquote>\n<p>But unless CT is a superconductor, there will always be resistance.</p>\n<p>So, how do you categorify a <a href=\"https://en.wikipedia.org/wiki/Conductor_(class_field_theory)\" title=\"https://en.wikipedia.org/wiki/Conductor_(class_field_theory)\">conductor</a> and impose a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">Z</mi><mi mathvariant=\"normal\">/</mi><mn>2</mn></mrow><annotation encoding=\"application/x-tex\"> \\mathbb{Z}/2 </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">Z</span></span><span class=\"mord\">/</span><span class=\"mord\">2</span></span></span></span>-grading?</p>",
        "id": 192614216,
        "sender_full_name": "(=_=)",
        "timestamp": 1585793998
    },
    {
        "content": "<p>A while ago, <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192473900\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192473900\">said</a>:</p>\n<blockquote>\n<p>suppose an abelian group <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> has the property that every short exact sequence of abelian groups</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mn>0</mn><mo>→</mo><mi mathvariant=\"double-struck\">Z</mi><mo>→</mo><mi>B</mi><mo>→</mo><mi>A</mi><mo>→</mo><mn>0</mn></mrow><annotation encoding=\"application/x-tex\"> 0 \\to \\mathbb{Z} \\to B \\to A \\to 0</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">0</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">Z</span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">0</span></span></span></span></p>\n<p>splits.  Is <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> necessarily free?  </p>\n<p>The answer to this question is <a href=\"https://en.wikipedia.org/wiki/Whitehead_problem\" title=\"https://en.wikipedia.org/wiki/Whitehead_problem\">independent of ZFC</a>.   So, a certain line of research in algebra is blocked until we choose axioms extending ZFC that settle this question.</p>\n</blockquote>\n<p>That's not how I would describe the situation.  By analogy, let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">G</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">G</span></span></span></span> be a group and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo separator=\"true\">,</mo><mi>y</mi><mo>∈</mo><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">x,y\\in G</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7335400000000001em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">G</span></span></span></span>; is it necessarily the case that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mi>y</mi><mo>=</mo><mi>y</mi><mi>x</mi></mrow><annotation encoding=\"application/x-tex\">xy=yx</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mord mathdefault\">x</span></span></span></span>?  The answer to this question is independent of the axioms of a group.  But would you say that a certain line of research in group theory is blocked until we choose axioms extending the definition of a group that settle this question?  Of course not; any particular person just has to choose whether they want to study abelian groups or nonabelian groups.  That's the only thing it can possibly mean to \"settle this question\".</p>\n<p>Similarly, the answer to the Whitehead problem is yes in some toposes and no in in others.  That settles the question; now anyone can choose for themselves whether they want to work in Whitehead-toposes or non-Whitehead-toposes.</p>",
        "id": 192616391,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585797260
    },
    {
        "content": "<p>That's a nice way to look at it, <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>, thanks! </p>\n<p>That's what I was referring to when I say people will look for workarounds. </p>\n<p>The classical example is the insolubility of the quintic. Sure, now we have group theory and we can study groups and talk about <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mtext>Symmetries</mtext><mtext>TM</mtext></msup></mrow><annotation encoding=\"application/x-tex\"> \\textrm{Symmetries}^{\\textrm{TM}} </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.109001em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord text\"><span class=\"mord textrm\">Symmetries</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.914561em;\"><span style=\"top:-3.1362300000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord text mtight\"><span class=\"mord textrm mtight\">TM</span></span></span></span></span></span></span></span></span></span></span></span></span>  every time we talk to the press. </p>\n<p>However, there's another school that says, hang on, is this really a no-go theorem, the be-all and end-all on quintics, or can there be other ways of solving certain classes of quintics? It turns out the answer is yes.</p>\n<p>When many people resist CT, they tend to think of the first approach: look at all the symmetries, isn't maths beautiful, blablabla. CT can do the second, of course, and many detractors take the second approach: more concrete and constrained problems. But these kinds of problems are not usually arenas where CT, right now, seems to perform as well as the existing domain-specific techniques. </p>\n<p>The point I want to make is, why, and can we do better?</p>",
        "id": 192617179,
        "sender_full_name": "(=_=)",
        "timestamp": 1585798367
    },
    {
        "content": "<p>Well, I wouldn't describe the situation as any kind of \"workaround\".  To me the fact that there are both Whitehead toposes and non-Whitehead toposes is a beautiful discovery to be celebrated.</p>",
        "id": 192617510,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585798759
    },
    {
        "content": "<p>Mike wrote:</p>\n<blockquote>\n<p>The answer to this question is independent of the axioms of a group. But would you say that a certain line of research in group theory is blocked until we choose axioms extending the definition of a group that settle this question? Of course not; any particular person just has to choose whether they want to study abelian groups or nonabelian groups. </p>\n</blockquote>\n<p>But choosing that is exactly choosing axioms that extend the definition of group!  You're either adding the axiom <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∀</mi><mi>x</mi><mi mathvariant=\"normal\">∀</mi><mi>y</mi><mo stretchy=\"false\">(</mo><mi>x</mi><mi>y</mi><mo>=</mo><mi>y</mi><mi>x</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\forall x \\forall y( xy = yx)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">∀</span><span class=\"mord mathdefault\">x</span><span class=\"mord\">∀</span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mopen\">(</span><span class=\"mord mathdefault\">x</span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mord mathdefault\">x</span><span class=\"mclose\">)</span></span></span></span> or its negation.</p>",
        "id": 192622721,
        "sender_full_name": "John Baez",
        "timestamp": 1585805816
    },
    {
        "content": "<p>And in the case of groups we feel perfectly comfy with doing this.  But when it comes to Whitehead's problem I fear <em>most</em> mathematicians would tend to say \"oh, it's undecidable in ZFC, I won't mess with this issue any further\".  That's the way in which research gets blocked.</p>",
        "id": 192622818,
        "sender_full_name": "John Baez",
        "timestamp": 1585805938
    },
    {
        "content": "<p>If my fear is misguided - if plenty of mathematicians are willing to extend ZFC with extra axioms to settle Whitehead's conjecture one way or another, or choose a topos in which the conjecture either holds or doesn't... well, then I'm happy to hear that!</p>",
        "id": 192622944,
        "sender_full_name": "John Baez",
        "timestamp": 1585806104
    },
    {
        "content": "<p>In short, I don't see that we really disagree here.</p>",
        "id": 192623074,
        "sender_full_name": "John Baez",
        "timestamp": 1585806243
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192617510\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192617510\">said</a>:</p>\n<blockquote>\n<p>Well, I wouldn't describe the situation as any kind of \"workaround\".  To me the fact that there are both Whitehead toposes and non-Whitehead toposes is a beautiful discovery to be celebrated.</p>\n</blockquote>\n<p>Implying that workarounds can't be beautiful. Workarounds are frequently creative, because you need to think outside the box in order to bypass the roadblock.</p>",
        "id": 192623408,
        "sender_full_name": "(=_=)",
        "timestamp": 1585806712
    },
    {
        "content": "<p>In fact, Grothendieck's metaphor of <a href=\"https://ncatlab.org/nlab/show/The+Rising+Sea\" title=\"https://ncatlab.org/nlab/show/The+Rising+Sea\">the rising sea</a> is an accurate description of how a good workaround behaves, as well as the many workarounds in mathematics that have littered its history.</p>",
        "id": 192623662,
        "sender_full_name": "(=_=)",
        "timestamp": 1585807052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> If you actually <em>understand</em> something at a deeper level, as in the rising sea, I would not describe the resulting solution as a \"workaround\".</p>",
        "id": 192669705,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585836372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> I certainly agree that in practice mathematicians have trouble with this for ZFC.  But I think it's important to emphasize that the problem is with their psychology, not with the mathematics, and not to imply that there's a \"solution\" out there that will tell us <em>which</em> of the two possibilities is \"true\".</p>",
        "id": 192669920,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585836489
    },
    {
        "content": "<p>Maybe the latter isn't what you meant, but I think it would be easy to read \"choose axioms extending ZFC that settle this question\" that way.</p>",
        "id": 192674943,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585838546
    },
    {
        "content": "<p>Yes, this thread was about psychological resistance to category theory... and someone (Rongmin?) compared it to the psychological resistance that mathematicians have learning set theory beyond the basics.  I feel the two cases are quite different, but still worth comparing.   I raised Whitehead's Conjecture as an example of a question that <em>could</em> push algebraists into learning some serious set theory, but as far I can tell, for the most part <em>hasn't</em>.  </p>\n<p>For example, I don't see books on homological algebra saying \"In this chapter we'll assume the axiom of constructiblity, so that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mrow><mi mathvariant=\"normal\">E</mi><mi mathvariant=\"normal\">x</mi><mi mathvariant=\"normal\">t</mi></mrow><mn>1</mn></msup><mo stretchy=\"false\">(</mo><mi>A</mi><mo separator=\"true\">,</mo><mi mathvariant=\"double-struck\">Z</mi><mo stretchy=\"false\">)</mo><mo>=</mo><mn>0</mn></mrow><annotation encoding=\"application/x-tex\">\\mathrm{Ext}^1(A,\\mathbb{Z}) = 0</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.137338em;vertical-align:-0.25em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathrm\">E</span><span class=\"mord mathrm\">x</span><span class=\"mord mathrm\">t</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.887338em;\"><span style=\"top:-3.1362300000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span></span></span></span></span></span><span class=\"mopen\">(</span><span class=\"mord mathdefault\">A</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">Z</span></span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.64444em;vertical-align:0em;\"></span><span class=\"mord\">0</span></span></span></span> implies <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> is free and also...\"</p>\n<p>I'm sure <em>someone</em> must be doing research like this, but I feel it's not in the mainstream.  My feeling is that for most algebraists, the perceived pain of learning serious set theory outweighs the perceived advantages of being able to march ahead exploring algebra in multiple axiom systems extending ZFC.</p>",
        "id": 192689047,
        "sender_full_name": "John Baez",
        "timestamp": 1585843594
    },
    {
        "content": "<p>I think the difference is that in general mathematics, axioms of group theory are understood to be chosen to fix a framework with many models/examples, while the axioms of set theory are understood to be chosen to do the opposite: Capture and thus pin down one example/model. Logical categoricity is in contrast to abstraction, and thus an abstract algebraist works in a different framework than a set theorist that fine-tunes his theory to his aesthetic.<br>\nThe \"real world\" was pinned down by the logicans 100 years ago, promoted as providing the monic substance for other theories. This relation makes it so that their axioms of group theory or manifolds, etc. are not understood as expressions capturing mathematical objects out of the aether, but are seemingly just conditions that select from among the objects in the \"real world.\" In other words, for the so called practical mathematician, to specify groups and other axioms at the beginning of a mathematical text is not conceiving mathematical objects in a broad sense, but instead the act of stating the axioms is merely the act of declaring the focus of the investigation at hand. In that mindset, to choose axioms which are known to concern the people who provided rules of set theory may seems as breaking away from the \"real world,\" the actual mathematical truth.</p>",
        "id": 192696112,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1585846707
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281274\">@Nikolaj Kuntner</span> Yes.  The problem is that that mindset is wrong.  (-:</p>",
        "id": 192697228,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585847243
    },
    {
        "content": "<blockquote>\n<p>But I think it's important to emphasize that the problem is with their psychology, not with the mathematics, and not to imply that there's a \"solution\" out there that will tell us which of the two possibilities is \"true\".</p>\n</blockquote>\n<p>Okay, fine.  But I'm sick of emphasizing this, because it's so obvious to me and I've spent so much time trying to tell people this.   I don't want to become a boring old fart who keeps saying the same thing over and over.  </p>\n<p>I mainly talk about the case of Peano arithmetic, where it's even harder to get people to accept that this has many different models just like the axioms for a group - and not one \"true\" model and a bunch of \"nonstandard\" ones, like the true king and a bunch of pretenders to the throne.</p>",
        "id": 192698047,
        "sender_full_name": "John Baez",
        "timestamp": 1585847671
    },
    {
        "content": "<p>Wait... and here I've always been thinking that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mrow><mi mathvariant=\"normal\">G</mi><mi mathvariant=\"normal\">L</mi></mrow><mn>2</mn></msub><mo stretchy=\"false\">(</mo><mi mathvariant=\"double-struck\">Z</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\mathrm{GL}_2(\\mathbb{Z})</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathrm\">G</span><span class=\"mord mathrm\">L</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.30110799999999993em;\"><span style=\"top:-2.5500000000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mopen\">(</span><span class=\"mord\"><span class=\"mord mathbb\">Z</span></span><span class=\"mclose\">)</span></span></span></span> is the one true group, and all others are pretenders...</p>",
        "id": 192698474,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1585847922
    },
    {
        "content": "<p>Right!   It's fun to imagine people thinking that the axioms of a group have one true model.  Why do they do it for the axioms of set theory?   Something about the foundations of mathematics drives people crazy - maybe it's the word \"foundations\".  I prefer the word \"entrances\".  A building can have many entrances.</p>",
        "id": 192699284,
        "sender_full_name": "John Baez",
        "timestamp": 1585848336
    },
    {
        "content": "<p>Well the people that go crazy at least must have had enough exposure to come to different conclusions. When it comes to foundational theories, I think the issue is not just that non-logic minded mathematicans think there is \"one true\" theory among others, but that people don't even think the others are notions that can be made concrete. E.g., that studying \"set that can contain themselves\" were similar to studying that one algorithm that solves the Halting problem.</p>",
        "id": 192699755,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1585848529
    },
    {
        "content": "<p>They don't want to Turing jump out of their own department.</p>",
        "id": 192699949,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1585848614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> But people don't usually think about non-standard models of natural numbers, even though those also exist, at least in first-order logic.  In second order logic, you can uniquely define the natural numbers as well as various set theories.  In fact this happens all the time doing math in Coq, which is higher order.</p>",
        "id": 192717403,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1585857340
    },
    {
        "content": "<p>Personally, I think different models of Peano arithmetic inside a given topos are also less interesting than different toposes.  The latter arise naturally in other areas of mathematics, whereas I don't know any such applications of the form.</p>",
        "id": 192718108,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585857673
    },
    {
        "content": "<p>That's a good illustration of how axiomatization is done to taste: sometimes I want to axiomatize a class of things, sometimes I want  to axiomatize one thing uniquely.  And whether I can get what I want depends not only on the 'things' in an intuitive sense, but on the logic and meta-logic I'm working in.  FWIW, I think the resistance to CT from programmers stems not so much from the fact that the CT axioms are somehow harder to understand than say group theory, but that programmers would resist group theory as well, and since category theory is more applicable to functional programming that most other axiomatic algebraic theories, it is category theorists stuck bearing the burden of proof in that domain.</p>",
        "id": 192719703,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1585858364
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192698047\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192698047\">said</a>:</p>\n<blockquote>\n<p>I mainly talk about the case of Peano arithmetic, where it's even harder to get people to accept that this has many different models just like the axioms for a group - and not one \"true\" model and a bunch of \"nonstandard\" ones, like the true king and a bunch of pretenders to the throne.</p>\n</blockquote>\n<p>So despite not believing in the \"true\" model of PA, you do believe that PA is consistent.  [Since you assert that  it has \"many different models\".]   That's a curious combination of scepticism and belief.  I wonder what convinces you of Con(PA).   Gentzen's proof by epsilon_0 induction, or the double negation proof that PA is consistent relative to Heyting arithmetic? </p>\n<p>[This is off topic admittedly.]</p>",
        "id": 192746466,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585874525
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\">said</a>:</p>\n<blockquote>\n<p>[This is off topic admittedly.]</p>\n</blockquote>\n<p>Shhhhh... don't tip off the moderator. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 192747318,
        "sender_full_name": "(=_=)",
        "timestamp": 1585875436
    },
    {
        "content": "<p>I think it's on-topic because apparently this thread is all about psychology, so it's a great place to talk about \"scepticism and belief\".</p>",
        "id": 192747346,
        "sender_full_name": "(=_=)",
        "timestamp": 1585875471
    },
    {
        "content": "<p>That being said...</p>\n<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192689047\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192689047\">said</a>:</p>\n<blockquote>\n<p>Yes, this thread was about psychological resistance to category theory... and someone (Rongmin?) compared it to the psychological resistance that mathematicians have learning set theory beyond the basics.</p>\n</blockquote>\n<p>I want to push back on the notion that the resistance is psychological because:</p>\n<ul>\n<li>None of us here, as far as I can tell, is a trained psychologist.</li>\n<li>Projecting what may be one's genuine psychological insecurities onto other people is a sure-fire way to alienate them. There is a reason why it's called self-<em>deprecation</em>. Self-deprecation may be charming. Deprecating others is not.</li>\n<li>It distracts us from focusing on areas where CT is not actually effective enough to solve the problems that are of interest to researchers (see my <a href=\"http://(https://categorytheory.zulipchat.com/#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192474351)\" title=\"http://(https://categorytheory.zulipchat.com/#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192474351)\">question</a> and your <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192474953\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192474953\">reply</a> about analytical methods in your paper on entropy).</li>\n</ul>",
        "id": 192747812,
        "sender_full_name": "(=_=)",
        "timestamp": 1585875866
    },
    {
        "content": "<p>I think there's a productive conversation to be had about identifying the <em>pragmatic</em> reasons for resistance to CT, because it'd lead us to think about what CT can and can't do <em>currently</em>, so that we can identify areas for future work. I don't think it's productive to engage in armchair psychology.</p>",
        "id": 192748045,
        "sender_full_name": "(=_=)",
        "timestamp": 1585876107
    },
    {
        "content": "<p>Some people are put off category theory by the size issues.  And I can hardly blame them.  The issues are more serious than many category theorists are willing to admit.</p>",
        "id": 192748408,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585876491
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281326\">Ryan Wisnesky</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192719703\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192719703\">said</a>:</p>\n<blockquote>\n<p>FWIW, I think the resistance to CT from programmers stems not so much from the fact that the CT axioms are somehow harder to understand than say group theory, but that programmers would resist group theory as well, and since category theory is more applicable to functional programming that most other axiomatic algebraic theories, it is category theorists stuck bearing the burden of proof in that domain.</p>\n</blockquote>\n<p>Anecdotally, many programmers I know <em>hate</em> mathematics. For some reason, the way of thinking that we take for granted is very alien and uncomfortable to them, whereas the way of thinking that pays off in programming comes more naturally for them.</p>",
        "id": 192748422,
        "sender_full_name": "(=_=)",
        "timestamp": 1585876515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748408\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748408\">said</a>:</p>\n<blockquote>\n<p>Some people are put off category theory by the size issues.  And I can hardly blame them.  The issues are more serious than many category theorists are willing to admit.</p>\n</blockquote>\n<p>I hear you. I recently gave a talk about Lawvere's fixed point theorem and some ultrafinitist in the crowd started peppering me with questions about size issues. Fun times. Admittedly, what was I thinking in giving that talk?!</p>",
        "id": 192748517,
        "sender_full_name": "(=_=)",
        "timestamp": 1585876616
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\">said</a>:</p>\n<blockquote>\n<p>So despite not believing in the \"true\" model of PA, you do believe that PA is consistent.  [Since you assert that  it has \"many different models\".]   That's a curious combination of scepticism and belief.</p>\n</blockquote>\n<p>Why is it curious to believe that there are many of something but that no single one of them is particularly special?</p>\n<blockquote>\n<p>I wonder what convinces you of Con(PA).</p>\n</blockquote>\n<p>Perhaps the fact that it has many models?  (-:O</p>",
        "id": 192749893,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585878477
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192669705\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192669705\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> If you actually <em>understand</em> something at a deeper level, as in the rising sea, I would not describe the resulting solution as a \"workaround\".</p>\n</blockquote>\n<p>A \"workaround\", as I understand it, is a bypass, or a routing, <em>around</em> an obstruction. We may eventually understand something deeper, the obstruction may eventually shrivel from a mountain to a pebble, but there is no denying the obstruction still remains in the examples that have come up. That's the rising sea.</p>\n<p>Let's agree to disagree.</p>",
        "id": 192750128,
        "sender_full_name": "(=_=)",
        "timestamp": 1585878725
    },
    {
        "content": "<p>Sure.  Let me give one parting shot: a workaround is defined as \"a method for overcoming a problem or limitation in a program or system.\"  But when you deeply understand what is going on, it frequently happens that the situation is no longer viewed as a \"problem\" or a \"limitation\", but rather an opportunity to discover new realms of beautiful mathematics.</p>",
        "id": 192750325,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585879009
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748422\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748422\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281326\">Ryan Wisnesky</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192719703\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192719703\">said</a>:</p>\n<blockquote>\n<p>FWIW, I think the resistance to CT from programmers stems not so much from the fact that the CT axioms are somehow harder to understand than say group theory, but that programmers would resist group theory as well, and since category theory is more applicable to functional programming that most other axiomatic algebraic theories, it is category theorists stuck bearing the burden of proof in that domain.</p>\n</blockquote>\n<p>Anecdotally, many programmers I know <em>hate</em> mathematics. For some reason, the way of thinking that we take for granted is very alien and uncomfortable to them, whereas the way of thinking that pays off in programming comes more naturally for them.</p>\n</blockquote>\n<p>as a programmer, can second this anecdote, there's a lot to unpack</p>",
        "id": 192753727,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585883731
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748517\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748517\">said</a>:</p>\n<blockquote>\n<p>I hear you. I recently gave a talk about Lawvere's fixed point theorem and some ultrafinitist in the crowd started peppering me with questions about size issues. Fun times. Admittedly, what was I thinking in giving that talk?!</p>\n</blockquote>\n<p>ooh, cool. Can you give me more info privately? (I don't want to derail this conversation more than it has been ;-)</p>",
        "id": 192753919,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585883996
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281326\">Ryan Wisnesky</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192717403\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192717403\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> But people don't usually think about non-standard models of natural numbers, even though those also exist, at least in first-order logic.  In second order logic, you can uniquely define the natural numbers as well as various set theories.  In fact this happens all the time doing math in Coq, which is higher order.</p>\n</blockquote>\n<p>I think the notion that you can uniquely define the natural numbers in set theory is a kind of illusion.  There's indeed a theorem saying that in ZFC there's a unique-up-to-isomorphism 'standard' model of the natural numbers - I'm not denying that.  But there are many different models of ZFC, and if we look at the 'standard' model of the natural numbers <em>in these different models</em> we find that different sentences in the language of arithmetic hold.   In short, the ambiguity has just been pushed back one notch.</p>\n<p>A similar thing is true for second-order logic.</p>\n<p>For much more on this:</p>\n<ul>\n<li>John Baez, <a href=\"https://golem.ph.utexas.edu/category/2019/06/nonstandard_models_of_arithmet.html\" title=\"https://golem.ph.utexas.edu/category/2019/06/nonstandard_models_of_arithmet.html\">Nonstandard models of arithmetic</a>.</li>\n</ul>",
        "id": 192754260,
        "sender_full_name": "John Baez",
        "timestamp": 1585884367
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\">said</a>:</p>\n<blockquote>\n<p>So despite not believing in the \"true\" model of PA, you do believe that PA is consistent.  [Since you assert that  it has \"many different models\".]   That's a curious combination of scepticism and belief.  I wonder what convinces you of Con(PA).   Gentzen's proof by epsilon_0 induction, or the double negation proof that PA is consistent relative to Heyting arithmetic? </p>\n</blockquote>\n<p>There are several reasons to believe Peano arithmetic is consistent; you mentioned two, and a third more important one is that we haven't found an inconsistency yet.   This is like why I believe that I can't fly by flapping my arms: I haven't succeeded yet.   </p>\n<p>But more importantly, I don't really <em>need</em> to believe in the consistency of PA: I just act like I do when I'm studying models of PA, so I don't have to keep saying \"if PA is consistent, so that models exist...\"</p>",
        "id": 192754862,
        "sender_full_name": "John Baez",
        "timestamp": 1585885148
    },
    {
        "content": "<p>sometimes i wish nelson's inconsistency proof had gone through</p>",
        "id": 192754966,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585885309
    },
    {
        "content": "<p>just to shake things up</p>",
        "id": 192754968,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585885312
    },
    {
        "content": "<p>plus it would've been extra hilarious that he'd developed internal set theory and given these incredibly infinitary ultrapower-based models for it and then went on and broken something waaaay further down in the foundations</p>",
        "id": 192755041,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585885411
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192749893\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192749893\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\">said</a>:</p>\n<blockquote>\n<p>So despite not believing in the \"true\" model of PA, you do believe that PA is consistent.  [Since you assert that  it has \"many different models\".]   That's a curious combination of scepticism and belief.</p>\n</blockquote>\n<p>Why is it curious to believe that there are many of something but that no single one of them is particularly special?</p>\n</blockquote>\n<p>I don't find it curious in the case of groups, because I can see specific nonisomorphic examples of groups, such as S_4 and S_7.  By contrast, I'm not aware of any examples of PA models other than those that are derived from my a priori belief (based on intuition) in the true model.  This leaves me unable to understand why someone would believe in the existence of PA models without believing in the true model, unless they derive that belief from a prior belief in Con(PA), which prompted my question of where <em>that</em> belief would come from.</p>",
        "id": 192758600,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585890179
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192754862\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192754862\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192746466\">said</a>:</p>\n<blockquote>\n<p>So despite not believing in the \"true\" model of PA, you do believe that PA is consistent.  [Since you assert that  it has \"many different models\".]   That's a curious combination of scepticism and belief.  I wonder what convinces you of Con(PA).   Gentzen's proof by epsilon_0 induction, or the double negation proof that PA is consistent relative to Heyting arithmetic? </p>\n</blockquote>\n<p>There are several reasons to believe Peano arithmetic is consistent; you mentioned two, </p>\n</blockquote>\n<p>I did, but each of them would be seen as problematic by at least some finitists, those who accept only Primitive Recursive Arithmetic.  By asking this question I was trying to probe your position.  Since you find these proofs acceptable, I reckon that you accept PRA + epsilon-induction as valid, and also System T (i.e. PRA + higher-order functions).  Right?</p>\n<blockquote>\n<p>and a third more important one is that we haven't found an inconsistency yet</p>\n</blockquote>\n<p>By this argument we should believe that the Goldbach conjecture is true but independent of PA, since we haven't found an inconsistency in PA + Goldbach, nor in PA + not-Goldbach.</p>",
        "id": 192760561,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585892799
    },
    {
        "content": "<p>Since from one PA model you can construct many others, as soon as you believe in one PA model you must believe in lots of them.  But once you realize that, it's natural to come to suspect that whatever PA model you started from might have been constructed from some other one, so there's no reason to expect it to be the \"true\" on either.  (I believe this is a PA version of Hamkin's argument for the \"Wellfoundedness Mirage\" axiom of the set-theoretic multiverse.)</p>\n<p>Compare to the theory of relativity.  In Galilean physics we may imagine we are in the global rest frame and other frames of reference are moving with respect to us.  But in Einsteinian physics we realize that the moving reference frames (at least the inertial ones) appear, to those inside them, identical to our global rest frame.  Then it's hard to avoid taking the step of realizing that in fact there is no such thing as a \"global rest frame\", since from the perspective of other frames it is moving.</p>",
        "id": 192760570,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585892826
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760561\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760561\">said</a>:</p>\n<blockquote>\n<p>By this argument we should believe that the Goldbach conjecture is true but independent of PA, since we haven't found an inconsistency in PA + Goldbach, nor in PA + not-Goldbach.</p>\n</blockquote>\n<p>Note that to those of us who don't believe in one \"true\" model of PA, it doesn't even make sense to say that the Goldbach conjecture is \"true\" distinct from its provability.</p>",
        "id": 192760717,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585893009
    },
    {
        "content": "<p>(pedantic complaint: the lack of a rest frame works perfectly well in galilean relativity too)</p>",
        "id": 192761498,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585894134
    },
    {
        "content": "<p>(...or is that a point about galileo's conceptual framework? i don't know what he thought about absolute motion)</p>",
        "id": 192761525,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585894165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span> Doesn't that break when you introduce electromagnetism?  Since all speeds in a moving Galilean frame are additive in the direction of motion, I thought that you could distinguish the global rest frame as the one in which the speed of light is the same in all directions.  (Of course, I'm sure that various other things about electromagnetism also break in Galilean physics.)</p>",
        "id": 192761782,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585894502
    },
    {
        "content": "<p>oh, yeah it does</p>",
        "id": 192761856,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585894591
    },
    {
        "content": "<p>i was only thinking about mechanics</p>",
        "id": 192761860,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585894599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760570\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760570\">said</a>:</p>\n<blockquote>\n<p>Since from one PA model you can construct many others,</p>\n</blockquote>\n<p>Yes.  For example, ones that prove not-Con(PA).</p>\n<blockquote>\n<p>as soon as you believe in one PA model you must believe in lots of them.</p>\n</blockquote>\n<p>Yes.  And where does that initial belief come from?  From my intuition of the actual totality of natural numbers.  I can just about imagine doubting that intuition.  But then I would have no model, rather than many models, and Con(PA) would be thrown into doubt.</p>\n<blockquote>\n<p>But once you realize that, it's natural to come to suspect that whatever PA model you started from might have been constructed from some other one,</p>\n</blockquote>\n<p>I cannot understand this.  Your sentence seems to assume that I did actually start with a PA model, i.e. I was not mistaken in thinking that I did.  That your phrase \"whatever PA model you started with\" denotes.  So let's call it the \"true model\".  Or the \"starting model\" if it makes you happier.  </p>\n<blockquote>\n<p>so there's no reason to expect it to be the \"true\" on either.</p>\n</blockquote>\n<p>Let me take this further.  Does your multiverse of equally legitimate models include ones that validate not-Con(PA), even though you believe Con(PA)?  Or does it include only models that validate the same sentences as the starting model, such as Con(PA)?  (Your relativistic analogy appears to suggest the latter.)  Or neither?</p>",
        "id": 192762089,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585894886
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760717\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760717\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760561\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192760561\">said</a>:</p>\n<blockquote>\n<p>By this argument we should believe that the Goldbach conjecture is true but independent of PA, since we haven't found an inconsistency in PA + Goldbach, nor in PA + not-Goldbach.</p>\n</blockquote>\n<p>Note that to those of us who don't believe in one \"true\" model of PA, it doesn't even make sense to say that the Goldbach conjecture is \"true\" distinct from its provability.</p>\n</blockquote>\n<p>Surely a finitist will say that a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msubsup><mi mathvariant=\"normal\">Π</mi><mn>1</mn><mn>0</mn></msubsup></mrow><annotation encoding=\"application/x-tex\">\\Pi^0_1</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.0622159999999998em;vertical-align:-0.24810799999999997em;\"></span><span class=\"mord\"><span class=\"mord\">Π</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141079999999999em;\"><span style=\"top:-2.4518920000000004em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">0</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.24810799999999997em;\"><span></span></span></span></span></span></span></span></span></span> sentence that cannot be refuted in PRA is true.</p>",
        "id": 192762319,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585895185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276699\">@Paul Blain Levy</span> wrote:</p>\n<blockquote>\n<p>I did, but each of them would be seen as problematic by at least some finitists, those who accept only Primitive Recursive Arithmetic. By asking this question I was trying to probe your position. Since you find these proofs acceptable, I reckon that you accept PRA + epsilon-induction as valid, and also System T (i.e. PRA + higher-order functions). Right?</p>\n</blockquote>\n<p>No, I never really rendered a judgement on whether these proofs are \"acceptable\".   I don't know what it would <em>mean</em> for me to \"accept  PRA + epsilon-induction as valid\".  What does \"acceptance\" involve, exactly?   Is this some sort of psychological state, or maybe a willingness to bet a lot of money on something?   How would such a bet be settled?   It's all too complicated for me.   Luckily I don't feel I need to sort out these issues: they don't impact how I do math.</p>\n<p>When I said this:</p>\n<blockquote>\n<p>I mainly talk about the case of Peano arithmetic, where it's even harder to get people to accept that this has many different models just like the axioms for a group - and not one \"true\" model and a bunch of \"nonstandard\" ones, like the true king and a bunch of pretenders to the throne.</p>\n</blockquote>\n<p>I wasn't trying to say I accepted something or not, or believed in some mathematical entity or not.   I was all-too-briefly alluding to a project I have cooking on the back burner with Michael Weiss, here:</p>\n<ul>\n<li><a href=\"https://diagonalargument.com/mathnotes/nonstandard-models-of-arithmetic-the-series/\" title=\"https://diagonalargument.com/mathnotes/nonstandard-models-of-arithmetic-the-series/\">Non-standard models of arithmetic</a></li>\n</ul>\n<p>and here:</p>\n<ul>\n<li><a href=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\" title=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\">First-order categorical logic</a>.</li>\n</ul>\n<p>I haven't gotten far enough to give a really clear explanation yet.</p>",
        "id": 192763868,
        "sender_full_name": "John Baez",
        "timestamp": 1585896857
    },
    {
        "content": "<p>tbh i personally find that mulling over that kind of issue <em>produces</em> super interesting math, which is certainly an impact c:</p>",
        "id": 192764509,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585897434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192753919\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192753919\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748517\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748517\">said</a>:</p>\n<blockquote>\n<p>I hear you. I recently gave a talk about Lawvere's fixed point theorem and some ultrafinitist in the crowd started peppering me with questions about size issues. Fun times. Admittedly, what was I thinking in giving that talk?!</p>\n</blockquote>\n<p>ooh, cool. Can you give me more info privately? (I don't want to derail this conversation more than it has been ;-)</p>\n</blockquote>\n<p>Let's do it here. This conversation has already completely derailed into a discussion about finitism and other set-theoretic issues anyway. Also, I'd like the others to chip in with their comments.</p>\n<p>So, ask away! Details will be a bit hazy because of the lag, but I did a second talk and size issues cropped up again.</p>",
        "id": 192767598,
        "sender_full_name": "(=_=)",
        "timestamp": 1585899869
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192750325\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192750325\">said</a>:</p>\n<blockquote>\n<p>Sure.  Let me give one parting shot: a workaround is defined as \"a method for overcoming a problem or limitation in a program or system.\"  But when you deeply understand what is going on, it frequently happens that the situation is no longer viewed as a \"problem\" or a \"limitation\", but rather an opportunity to discover new realms of beautiful mathematics.</p>\n</blockquote>\n<p>That's semantics. Much of the history of mathematics is a history of creative workarounds that overcame the limitations of the prior understanding and opened up new vistas of beautiful mathematics. The other half isn't really exciting for the people here, and is what <span class=\"user-mention silent\" data-user-id=\"281274\">Nikolaj Kuntner</span> has described above, namely fixing a set of assumptions and working out the mathematical consequences.</p>",
        "id": 192768205,
        "sender_full_name": "(=_=)",
        "timestamp": 1585900338
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192753727\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192753727\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748422\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748422\">said</a>:</p>\n<blockquote>\n<p>Anecdotally, many programmers I know <em>hate</em> mathematics. For some reason, the way of thinking that we take for granted is very alien and uncomfortable to them, whereas the way of thinking that pays off in programming comes more naturally for them.</p>\n</blockquote>\n<p>as a programmer, can second this anecdote, there's a lot to unpack</p>\n</blockquote>\n<p>Please unpack, the floor is yours.</p>",
        "id": 192768414,
        "sender_full_name": "(=_=)",
        "timestamp": 1585900492
    },
    {
        "content": "<p>aaa maybe later it's 4am i need to go to sleep soon</p>",
        "id": 192768460,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585900530
    },
    {
        "content": "<p>🥱</p>",
        "id": 192768463,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585900535
    },
    {
        "content": "<p>Good night!</p>",
        "id": 192768615,
        "sender_full_name": "(=_=)",
        "timestamp": 1585900645
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192699284\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192699284\">said</a>:</p>\n<blockquote>\n<p>Something about the foundations of mathematics drives people crazy - maybe it's the word \"foundations\".  I prefer the word \"entrances\".  A building can have many entrances.</p>\n</blockquote>\n<p>It drives people crazy because they're not interested in becoming architects. </p>\n<p>Unless I'm an architect, I'm not going to walk into a building and gawk at the entrances. Unless I'm a structural engineer, I'm not going to be terribly interested in a building's foundations. What I want from a building is to do things <em>in</em> it, not to study how it's built.</p>\n<p>The same goes for maths to the general public, or PL theory to programmers. Yes, they are \"woven into the fabric of our existence\": this is precisely why people ignore them!</p>",
        "id": 192769579,
        "sender_full_name": "(=_=)",
        "timestamp": 1585901201
    },
    {
        "content": "<p>And it's probably no coincidence that CT in CS finds the most use in architectural issues in software development. This is probably ACT's greatest strength, and well may it capitalise on that to spread the knowledge developed in CS to other disciplines. But there are other areas in which CT isn't as strong, and perhaps some people may like to look at that and build CT up in those areas.</p>",
        "id": 192769723,
        "sender_full_name": "(=_=)",
        "timestamp": 1585901301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276699\">@Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748408\" title=\"#narrow/stream/229111-general/topic/Resistance.20to.20CT/near/192748408\">said</a>:</p>\n<blockquote>\n<p>Some people are put off category theory by the size issues.  And I can hardly blame them.  The issues are more serious than many category theorists are willing to admit.</p>\n</blockquote>\n<p>Can you give some examples of the size issues that you're concerned about? That might perhaps also refresh my memory of what the size issues were that cropped up in my talks.</p>",
        "id": 192770308,
        "sender_full_name": "(=_=)",
        "timestamp": 1585901744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> Yes, arguing about whether a particular word is appropriate is more or less the definition of \"semantics\".  (-:</p>",
        "id": 192770468,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585901878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276699\">@Paul Blain Levy</span> Personally, I don't believe that any models of PA \"exist\" in a Platonic sense, since I don't believe that any mathematical objects exist in a Platonic sense.  Mathematical existence only makes sense within a framework, like first-order logic or dependent type theory, in which there is a quantifier called \"there exists\" that can be proven to hold.  But I can sort of imagine what it might be like to believe that mathematical objects exist Platonically, and I was trying to argue from that perspective.</p>\n<p>Clearly <em>you</em> believe that models of PA exist because of your intuition for \"the\" totality of natural numbers.  But what I'm saying is that <em>another person</em> might believe in lots of models of PA for different reasons.  They might have an intuition for \"a\" totality of natural numbers admitting more than one possible model, that compels belief as strongly as your intuition for a unique totality of natural numbers does for you.</p>",
        "id": 192771159,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585902374
    },
    {
        "content": "<p>I enjoy the theological parallels that could be drawn from that last comment. Personally I think this is why foundations drive people crazy: it's because once you dig down into them it's impossible to ignore the old bones of philosophy that are revealed, and at that point there are no fundamentally right answers. The best you can do is to build a framework that seems(!) robust enough to carry the maths you want to do on top of it. But that's okay because on a finer scale it's how maths works at all levels!</p>",
        "id": 192775467,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585904685
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192775467\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192775467\">said</a>:</p>\n<blockquote>\n<p>I enjoy the theological parallels that could be drawn from that last comment. Personally I think this is why foundations drive people crazy: it's because once you dig down into them it's impossible to ignore the old bones of philosophy that are revealed, and at that point there are no fundamentally right answers. The best you can do is to build a framework that seems(!) robust enough to carry the maths you want to do on top of it. But that's okay because on a finer scale it's how maths works at all levels!</p>\n</blockquote>\n<p>Yes, most people want to just do the maths on top of that framework, not worry about whether or not the planet would suddenly vanish beneath their feet! That's kind of what <span class=\"user-mention silent\" data-user-id=\"281274\">Nikolaj Kuntner</span> was pointing out <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192696112\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192696112\">here</a>: many mathematicians fix a set of axioms and proceed from there using tools that were built within that framework.</p>\n<p>Another thing that I've found that puts people off CT: some proponents don't understand that many working mathematicians aren't trying to organise stuff, they just want to calculate stuff. And CT <em>at the moment</em> isn't very suited to perform the kinds of calculations that they need. </p>\n<p>It's like, I want to know that 1+1=2, and you show me several hundred pages of Principia Mathematica. That's not very appealing, to put it mildly.</p>",
        "id": 192776783,
        "sender_full_name": "(=_=)",
        "timestamp": 1585905369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span>  The proof of the diagonal argument (yes, not Lawvere's FPT) holds in any pointed magmoidal category with diagonals. The proof requires only equational logic, no power sets needed, no proper classes; technically, not even infinite sets (though then it's less surprising a result, maybe). I really can't imagine how size issues would come up. What were the main objections?</p>",
        "id": 192784287,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585909575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276424\">@Rongmin Lu</span> hmm, you gave a number of talks in that group! Would have been interesting, for sure.</p>",
        "id": 192786389,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585910944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192784287\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192784287\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span>  The proof of the diagonal argument (yes, not Lawvere's FPT) holds in any pointed magmoidal category with diagonals. The proof requires only equational logic, no power sets needed, no proper classes; technically, not even infinite sets (though then it's less surprising a result, maybe). I really can't imagine how size issues would come up. What were the main objections?</p>\n</blockquote>\n<p>I wish I knew all this going in. Yes, I did point out that no infinite sets were involved. That was the size issue. I know, it's pretty trivial, most of the audience was pretty annoyed too. <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 192792316,
        "sender_full_name": "(=_=)",
        "timestamp": 1585914765
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192786389\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192786389\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> hmm, you gave a number of talks in that group! Would have been interesting, for sure.</p>\n</blockquote>\n<p>Oh yeah. It can get tedious, because programmers are <em>very</em> detail-oriented, but I learned a lot (of patience).</p>\n<p>I gave another talk about profunctor optics, based on a recent paper that's part of the thesis of <span class=\"user-mention\" data-user-id=\"278171\">@Mario Román</span>. This time the size issue was less trivial, because coends were involved.</p>",
        "id": 192792819,
        "sender_full_name": "(=_=)",
        "timestamp": 1585915129
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192771159\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192771159\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> Personally, I don't believe that any models of PA \"exist\" in a Platonic sense, since I don't believe that any mathematical objects exist in a Platonic sense.  </p>\n</blockquote>\n<p>Let me check that I understand you correctly.  You don't think that (for example) associativity of natural number addition is a \"true\" statement.  For you it's merely a theorem of certain formal systems (e.g. PRA).  So you wouldn't be surprised to find a counterexample.  Right?</p>\n<blockquote>\n<p>Clearly <em>you</em> believe that models of PA exist because of your intuition for \"the\" totality of natural numbers.  But what I'm saying is that <em>another person</em> might believe in lots of models of PA for different reasons.  They might have an intuition for \"a\" totality of natural numbers admitting more than one possible model, that compels belief as strongly as your intuition for a unique totality of natural numbers does for you.</p>\n</blockquote>\n<p>Including models that validate not-Con(PA)?</p>",
        "id": 192822870,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585928414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276699\">@Paul Blain Levy</span> What do you mean by \"counterexample\"?  Do you mean some collections of actual objects in the world that gave different answers when grouped in different ways?  I would be very surprised by that, because the formal system of the natural numbers, although it is only an idea rather than a Platonic entity that exists in the same sense as apples do, has been designed to be a good model of the real world, so that we expect its conclusions to be applicable to the real world.</p>\n<p>As for your second question -- sure, why not?  The thing about intuition and belief is that something that's intuitive for one person can be highly non-intuitive for another one.</p>",
        "id": 192823666,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1585928774
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192763868\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192763868\">said</a>:</p>\n<blockquote>\n<p>When I said this:</p>\n<blockquote>\n<p>I mainly talk about the case of Peano arithmetic, where it's even harder to get people to accept that this has many different models just like the axioms for a group - and not one \"true\" model and a bunch of \"nonstandard\" ones, like the true king and a bunch of pretenders to the throne.</p>\n</blockquote>\n<p>I wasn't trying to say I accepted something or not, or believed in some mathematical entity or not. </p>\n</blockquote>\n<p>Then I misunderstood you - sorry.</p>\n<blockquote>\n<p>I was all-too-briefly alluding to a project I have cooking on the back burner with Michael Weiss, here:</p>\n<ul>\n<li><a href=\"https://diagonalargument.com/mathnotes/nonstandard-models-of-arithmetic-the-series/\" title=\"https://diagonalargument.com/mathnotes/nonstandard-models-of-arithmetic-the-series/\">Non-standard models of arithmetic</a></li>\n</ul>\n<p>and here:</p>\n<ul>\n<li><a href=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\" title=\"https://diagonalargument.com/mathnotes/first-order-categorical-logic-the-series/\">First-order categorical logic</a>.</li>\n</ul>\n<p>I haven't gotten far enough to give a really clear explanation yet.</p>\n</blockquote>\n<p>Thanks for the links!</p>",
        "id": 192823872,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1585928866
    },
    {
        "content": "<p>There's a paper by Sergei Artemov (The Provability of Consistency, I think) that argues that the Gödel statement of consistency is actually not appropriate for capturing what we mean. I.E. by quantifying over the natural numbers, it must hold uniformly in all models of arithmetic, including the non-standard ones.</p>\n<p>So, possibly one way to think about not-Con(PA) models is that they also contain non-standard notions of proof that you would not really agree are real proofs, but you've tricked yourself into equating them with the normal proofs you think about. This angle is also kind of similar to some work on formal systems for ultrafinitism. They include 'inconsistent' axioms, but the proofs you'd have to construct to demonstrate the inconsistency are too large to actually perform, so the ultrafinitist doesn't agree that they actually exist.</p>",
        "id": 192830111,
        "sender_full_name": "Dan Doel",
        "timestamp": 1585931504
    },
    {
        "content": "<p>But, to flip things around on the ultrafinitists (to illustrate Mike's point), there's a question on mathoverflow (I think) about how if we count things twice, do we get the same answer? The question asserts that we only believe this because formal systems assume it, but I think that's backwards.</p>\n<p>We use formal systems where counting is reliable because we have learned it is a reliable tool. If you counted something earlier, and you count it now and get a different number, you don't just say, \"oh, well, that's how things work.\" Instead, you start trying to figure out why your two counts didn't match.</p>",
        "id": 192831016,
        "sender_full_name": "Dan Doel",
        "timestamp": 1585931879
    },
    {
        "content": "<p>That doesn't mean a system where counting is unreliable wouldn't be useful, necessarily, but there's a reason why we usually take it to be reliable.</p>",
        "id": 192831188,
        "sender_full_name": "Dan Doel",
        "timestamp": 1585931937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192748408\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192748408\">said</a>:</p>\n<blockquote>\n<p>Some people are put off category theory by the size issues.  And I can hardly blame them.  The issues are more serious than many category theorists are willing to admit.</p>\n</blockquote>\n<p>Since we ended up talking about some size issues anyways I'm curious to hear about what kind of issues you have in mind here. I've heard the same sort of thing before but my impression is that for the most part category theorists are pretty careful about size issues. But I will grant that quite a lot of this happens below the level at which we communicate so you might not see the issues addressed explicitly.</p>",
        "id": 192852436,
        "sender_full_name": "Reid Barton",
        "timestamp": 1585941750
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192831016\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192831016\">said</a>:</p>\n<blockquote>\n<p>If you counted something earlier, and you count it now and get a different number, you don't just say, \"oh, well, that's how things work.\" Instead, you start trying to figure out why your two counts didn't match.</p>\n</blockquote>\n<p><a href=\"/user_uploads/21317/k2R-xGURDN2QrYWULRoycLNH/6465.jpg\" title=\"6465.jpg\">6465.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/k2R-xGURDN2QrYWULRoycLNH/6465.jpg\" title=\"6465.jpg\"><img src=\"/user_uploads/21317/k2R-xGURDN2QrYWULRoycLNH/6465.jpg\"></a></div>",
        "id": 192876928,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1585957428
    },
    {
        "content": "<p>Hi, my favourite model for PA is the Toy Model, where 2+2=4 and all cardinals bigger than 20 are large :-)</p>",
        "id": 192877000,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1585957493
    },
    {
        "content": "<p>(This is not to make fun of the ongoing discussion. It is mostly to make fun of myself. I wish I could follow the discussion.)</p>",
        "id": 192877031,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1585957528
    },
    {
        "content": "<p>I just read that there's an issue with declaring the category of categories, just as there is an issue with declaring the set of sets. Could someone explain the issues with declaring the category of categories? Does this act to make higher category theory more difficult?</p>",
        "id": 192884419,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1585966646
    },
    {
        "content": "<p>The category <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"sans-serif\">C</mi><mi mathvariant=\"sans-serif\">a</mi><mi mathvariant=\"sans-serif\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathsf{Cat}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathsf\">C</span><span class=\"mord mathsf\">a</span><span class=\"mord mathsf\">t</span></span></span></span></span> of all <a href=\"https://ncatlab.org/nlab/show/small+category\" title=\"https://ncatlab.org/nlab/show/small+category\">small categories</a> is itself a <a href=\"https://ncatlab.org/nlab/show/large+category\" title=\"https://ncatlab.org/nlab/show/large+category\">large category</a> - the links will explain those concepts.    If one wishes to get serious about working with large categories, it's good to assume the axiom of universes, which states that every set is contained in a <a href=\"https://en.wikipedia.org/wiki/Grothendieck_universe\" title=\"https://en.wikipedia.org/wiki/Grothendieck_universe\">Grothendieck universe</a>.</p>\n<p>None of this makes higher category theory more difficult.</p>",
        "id": 192884945,
        "sender_full_name": "John Baez",
        "timestamp": 1585967332
    },
    {
        "content": "<p>It's already so difficult that this doesn't matter. <span aria-label=\"mischievous\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"mischievous\">:mischievous:</span></p>",
        "id": 192885048,
        "sender_full_name": "Dan Doel",
        "timestamp": 1585967478
    },
    {
        "content": "<p>In other related news, <a href=\"https://www.nature.com/articles/d41586-020-00998-2\" title=\"https://www.nature.com/articles/d41586-020-00998-2\">this</a> just happened, and I'm sure I'll unleash a firestorm here if someone notices this. This long-running controversy is exactly the kind of scenario that Voevodsky feared would become more common in the future. In fact, it started barely after HoTT became a thing.</p>",
        "id": 192894434,
        "sender_full_name": "(=_=)",
        "timestamp": 1585984643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192894434\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192894434\">said</a>:</p>\n<blockquote>\n<p>In other related news, <a href=\"https://www.nature.com/articles/d41586-020-00998-2\" title=\"https://www.nature.com/articles/d41586-020-00998-2\">this</a> just happened, and I'm sure I'll unleash a firestorm here if someone notices this. This long-running controversy is exactly the kind of scenario that Voevodsky feared would become more common in the future. In fact, it started barely after HoTT became a thing.</p>\n</blockquote>\n<p>\"Acceptance of the work in Publications of the Research Institute for Mathematical Sciences (RIMS) — a journal of which Mochizuki is chief editor, published by the institute where he works at Kyoto University — is the latest development in a long and acrimonious controversy over the mathematicians' proof.\"... If no one else believes you, just use your own platform I guess <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span></p>",
        "id": 192901485,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585996687
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192901485\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192901485\">said</a>:</p>\n<blockquote>\n<p>\"Acceptance of the work in Publications of the Research Institute for Mathematical Sciences (RIMS) — a journal of which Mochizuki is chief editor, published by the institute where he works at Kyoto University — is the latest development in a long and acrimonious controversy over the mathematicians' proof.\"... If no one else believes you, just use your own platform I guess <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span></p>\n</blockquote>\n<p>You've conveniently omitted this paragraph, which shows that this is a common occurrence:</p>\n<blockquote>\n<p>Mathematicians often publish papers in journals where they are editors. As long as the authors recuse themselves from the peer-review process “such a case is not a violation of any rule, and is common”, says Hiraku Nakajima, a mathematician at the Kavli Institute for the Physics and Mathematics of the Universe in Tokyo formerly part of Publications of RIMS’s editorial board. Mehrmann confirms that this would not violate EMS guidelines.</p>\n</blockquote>",
        "id": 192912119,
        "sender_full_name": "(=_=)",
        "timestamp": 1586013181
    },
    {
        "content": "<p>It's kinda orthogonal but interesting to note that in HoTT, univalent categories only form a univalent 2-category, and there is no map from there to univalent 1-categories without truncating stuff. So in a sense, when you take higher categories seriously, there may well not be a 1-category of all (small) 1-categories.</p>",
        "id": 192914552,
        "sender_full_name": "James Wood",
        "timestamp": 1586016242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192912119\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192912119\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192901485\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192901485\">said</a>:</p>\n<blockquote>\n<p>\"Acceptance of the work in Publications of the Research Institute for Mathematical Sciences (RIMS) — a journal of which Mochizuki is chief editor, published by the institute where he works at Kyoto University — is the latest development in a long and acrimonious controversy over the mathematicians' proof.\"... If no one else believes you, just use your own platform I guess <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span></p>\n</blockquote>\n<p>You've conveniently omitted this paragraph, which shows that this is a common occurrence:</p>\n<blockquote>\n<p>Mathematicians often publish papers in journals where they are editors. As long as the authors recuse themselves from the peer-review process “such a case is not a violation of any rule, and is common”, says Hiraku Nakajima, a mathematician at the Kavli Institute for the Physics and Mathematics of the Universe in Tokyo formerly part of Publications of RIMS’s editorial board. Mehrmann confirms that this would not violate EMS guidelines.</p>\n</blockquote>\n</blockquote>\n<p>\"Since others won't accept my proof, I'll just publish it in the journal I'm in charge of,\" says Mochizuki.<br>\n\"This is okay,\" says member of staff on same journal.<br>\n\"This is technically allowed, but if they go ahead with this it will reflect badly on them,\" says president of European society responsible for distributing said publication.<br>\nAnyway, it's not the fact that he's publishing it this way that's the problem, it's the fact that he's refusing to acknowledge the community's problems with his work.</p>",
        "id": 192917343,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586020006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192830111\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192830111\">said</a>:</p>\n<blockquote>\n<p>So, possibly one way to think about not-Con(PA) models is that they also contain non-standard notions of proof </p>\n</blockquote>\n<p>As long as you accept that there's a distinction between standard and nonstandard, I don't think we disagree.  (And  a nonstandard model certainly gives rise to a nonstandard notion of proof.  Nothing controversial about that.)   The hypothetical person that Mike is trying to get me to understand, who directly intuits many nonisomorphic models, does not accept this distinction.</p>",
        "id": 192946750,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586072598
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192917343\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192917343\">said</a>:</p>\n<blockquote>\n<p>Anyway, it's not the fact that he's publishing it this way that's the problem, it's the fact that he's refusing to acknowledge the community's problems with his work.</p>\n</blockquote>\n<p>The \"community\" is not a monolith: there's a pro-M faction, an anti-M faction, some people are running for cover, and some of us would like the warring factions to calm down and focus on clarifying the mathematics.</p>\n<p>I won't rehearse the history too much, but suffice it to say that he had addressed promptly some (minor?) problems with his work soon after it was released. It was only after a workshop was held in the UK that things broke down terminally, and then Scholze-Stix stepped in.</p>",
        "id": 192947450,
        "sender_full_name": "(=_=)",
        "timestamp": 1586073712
    },
    {
        "content": "<p>The point of mentioning M's work is this: If M had released his work 2 decades after HoTT was released, we may not have had this debacle, because we may have built the tools that could have made the checking of his work a lot less laborious. Unfortunately, M released his work in Aug 2012 and the HoTT book came out in 2013.</p>",
        "id": 192947514,
        "sender_full_name": "(=_=)",
        "timestamp": 1586073738
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192823666\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192823666\">said</a>:</p>\n<blockquote>\n<p>As for your second question -- sure, why not?</p>\n</blockquote>\n<p>Because this hypothetical person believes that PA is actually consistent.  Thinking about this makes your hypothetical person's views even less comprehensible to me; they intuit these \"models of PA\" but this notion relies on a notion of natural number.</p>\n<blockquote>\n<p>The thing about intuition and belief is that something that's intuitive for one person can be highly non-intuitive for another one.</p>\n</blockquote>\n<p>For me, the existence of PA models that validate not-Con(PA) is just as intuitive as  the compositeness of 1147.   Each of these was easy for me to believe after I saw a proof, but the proofs were needed because I don't intuit the statements <em>directly</em>.  I find the idea that another person could intuit them directly, and therefore have no need of proof, to be far-fetched.</p>",
        "id": 192948263,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586075055
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192823666\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192823666\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> What do you mean by \"counterexample\"?  Do you mean some collections of actual objects in the world that gave different answers when grouped in different ways? </p>\n</blockquote>\n<p>Yes, but maybe my associativity example was too trivial.  Take more advanced <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msubsup><mi mathvariant=\"normal\">Π</mi><mn>1</mn><mn>0</mn></msubsup></mrow><annotation encoding=\"application/x-tex\">\\Pi^0_1</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.0622159999999998em;vertical-align:-0.24810799999999997em;\"></span><span class=\"mord\"><span class=\"mord\">Π</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141079999999999em;\"><span style=\"top:-2.4518920000000004em;margin-left:0em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">1</span></span></span><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">0</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.24810799999999997em;\"><span></span></span></span></span></span></span></span></span></span> theorems of PA (or PRA if you prefer).</p>\n<blockquote>\n<p>I would be very surprised by that, because the formal system of the natural numbers, although it is only an idea rather than a Platonic entity that exists in the same sense as apples.</p>\n</blockquote>\n<p>Natural numbers certainly don't exist in the same sense that apples do.  I don't think anyone ever claimed this.<br>\nThe ontological status of apples is much shakier than that of natural numbers.</p>\n<blockquote>\n<p>has been designed to be a good model of the real world, so that we expect its conclusions to be applicable to the real world.</p>\n</blockquote>\n<p>I admit this PA includes small natural numbers such as you might encounter in the \"real world\".  But also large natural numbers such as googolplex that apparently are not realizable in the \"real world\".  So I don't see why one would think that it correctly predicts the properties of the former, unless one believes in the totality of natural numbers.</p>",
        "id": 192949199,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586076820
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276480\">Reid Barton</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192852436\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192852436\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192748408\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192748408\">said</a>:</p>\n<blockquote>\n<p>Some people are put off category theory by the size issues.  And I can hardly blame them.  The issues are more serious than many category theorists are willing to admit.</p>\n</blockquote>\n<p>Since we ended up talking about some size issues anyways I'm curious to hear about what kind of issues you have in mind here. </p>\n</blockquote>\n<p>The basic problem is that the most important category of all, viz. the category of sets, doesn't exist.  None of the proposed workarounds is entirely satisfactory.   (I learnt a lot on this subject from Mike Shulman's paper \"Set theory for category theory.\")</p>\n<blockquote>\n<p>I've heard the same sort of thing before but my impression is that for the most part category theorists are pretty careful about size issues. But I will grant that quite a lot of this happens below the level at which we communicate so you might not see the issues addressed explicitly.</p>\n</blockquote>\n<p>I suppose you mean that some people say one thing, which doesn't really make sense, but secretly think another, which does.  Not saying what one means is hardly an ideal situation.</p>",
        "id": 192949937,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586078135
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192949937\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192949937\">said</a>:</p>\n<blockquote>\n<p>The basic problem is that the most important category of all, viz. the category of sets, doesn't exist.  None of the proposed workarounds is entirely satisfactory.   (I learnt a lot on this subject from Mike Shulman's paper \"Set theory for category theory.\")</p>\n</blockquote>\n<p>Interested to hear why you say this. <br>\nZFC people say \"classes don't exist\", but one can write down the syntactic category of definable classes in ZFC, and get a perfectly good infinitary pretopos, and indeed a model of Algebraic Set Theory. I would assume a similar syntactic category could exist for sets (isSet(x) is something you can say about a class x, no?), but I'm no expert. Unless working with such formal objects doesn't count as 'existence'?</p>",
        "id": 192951159,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1586080182
    },
    {
        "content": "<p>I think the reason why many people are \"at ease\" with maths not being super strict about proof verification is that it is extraordinarily resilient. It's very difficult to explain this properly but basically \"correct arguments tend to stay so also when the proofs are incorrect\".  Giancarlo Rota provides an example of what I mean here:<br>\n\"When the Germans were planning to publish Hilbert’s collected papers and to present him with a set on the occasion of one of his later birthdays, they realized that they could not publish the papers in their original versions because they were full of errors, some of them quite serious. Thereupon they hired a young unemployed mathematician, Olga Taussky-Todd, to go over Hilbert’s papers and correct all the mistakes. Olga labored for three years; it turned out that all the mistakes could be corrected without any major changes in the statement of the theorems. There was one exception: ...  At last on Hilbert's birthday a freshly printed set of Hilbert's collected papers was presented to the Geheimrat. Hilbert leafed through them carefully and did not notice anything.\" <a href=\"https://books.google.it/books?id=QV51CQAAQBAJ&amp;pg=PA36&amp;lpg=PA36&amp;dq=hilbert+birthday+papers+errors&amp;source=bl&amp;ots=dZzU6uzKN5&amp;sig=ACfU3U1lqXkqaUzzIK1yB6yRZ7RNeEbQXg&amp;hl=it&amp;sa=X&amp;ved=2ahUKEwitvqSpjNHoAhVow8QBHQIFAfMQ6AEwCnoECAoQLg#v=onepage&amp;q=hilbert%20birthday%20papers%20errors&amp;f=false\" title=\"https://books.google.it/books?id=QV51CQAAQBAJ&amp;pg=PA36&amp;lpg=PA36&amp;dq=hilbert+birthday+papers+errors&amp;source=bl&amp;ots=dZzU6uzKN5&amp;sig=ACfU3U1lqXkqaUzzIK1yB6yRZ7RNeEbQXg&amp;hl=it&amp;sa=X&amp;ved=2ahUKEwitvqSpjNHoAhVow8QBHQIFAfMQ6AEwCnoECAoQLg#v=onepage&amp;q=hilbert%20birthday%20papers%20errors&amp;f=false\">Source</a><br>\nI found this remarkable. Concepts can remain right even if proofs are wrong, while the opposite (right proofs for wrong concepts) is much rarer. This is related with what someone else said above, that is, when something is not correct, if widely used it won't survive for long in maths. Indeed, it has to be noted that the majority of maths discussed in this conversation is controversial, meaning that very few mathematicians would actually  assume such results for granted in a paper right now. Contrast this with statements like P!=NP: we do not have any proof of this, nevertheless it is common to assume it to hold in many contexts, such as cryptography. People believe this holds even without proof and so they use it, without caring too much. When you think about it it's crazy, but somehow it works. So \"social environment\" in mathematics does not just refer to how people behave around publications and proofs. It's also very much about having a collective intuition that, albeit not often verified, and albeit not always correct, it is right 99% of the time. I think this gives people peace of mind, and I wouldn't necessarily disregard it as dangerous. It's like doing pobabilistic computation, and it has its perks.</p>",
        "id": 192953560,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586083931
    },
    {
        "content": "<p>Indeed, the interaction between ideas-community-formal proofs is central to mathematics. One couldn't dispense with any one of them!</p>",
        "id": 192953908,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1586084557
    },
    {
        "content": "<p>P ≠ NP seems like quite a different assumption from usual believed-to-be-true results. For one thing, while a P algorithm for SAT does not exist, P ≠ NP is as good as true for practical purposes. For another, there's great incentive to make such an algorithm, and given that we don't know of one, that's some good empirical evidence.</p>",
        "id": 192953965,
        "sender_full_name": "James Wood",
        "timestamp": 1586084654
    },
    {
        "content": "<p>Yes, I was referring to the fact that nearly everyone believes P to be not equal to NP. The only notable exception I know of is Donald Knuth, which anyway believes that \"P = NP, but an algorithm to reduce a NP-complete problem to a P one is too complicated for humans to be ever able to find it\", which means, in practice, that for many things he still believes you can safely rely on what P != NP implies</p>",
        "id": 192954064,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586084841
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281583\">James Wood</span> <a href=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192953965\" title=\"#narrow/stream/229111-general/topic/CS.20and.20Math(s)/near/192953965\">said</a>:</p>\n<blockquote>\n<p>P ≠ NP seems like quite a different assumption from usual believed-to-be-true results. For one thing, while a P algorithm for SAT does not exist, P ≠ NP is as good as true for practical purposes. For another, there's great incentive to make such an algorithm, and given that we don't know of one, that's some good empirical evidence.</p>\n</blockquote>\n<p>That's the reason why I part company with Fabrizio et al. on the so-called \"resilience\" of mathematics. \"For practical purposes\" is good enough for the working computer scientist, but it isn't good enough for the working mathematician.</p>\n<p>The Riemann hypothesis is just as good as true for practical purposes, and many papers have been written assuming its truth, yet we'd still demand a correct proof before we'd promote it to a theorem (unlike FLT, tsk tsk <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> ).</p>\n<p>The thing is, false positives (\"right proofs for the wrong concepts\", i.e. a purported proof of a widely believed proposition that is actually false) can happen, and have happened before: here's a <a href=\"https://en.wikipedia.org/wiki/List_of_incomplete_proofs\" title=\"https://en.wikipedia.org/wiki/List_of_incomplete_proofs\">list</a> containing some false positives and <a href=\"https://mathoverflow.net/questions/35468/widely-accepted-mathematical-results-that-were-later-shown-to-be-wrong\" title=\"https://mathoverflow.net/questions/35468/widely-accepted-mathematical-results-that-were-later-shown-to-be-wrong\">another list of false positives</a> on Mathoverflow.</p>",
        "id": 192958566,
        "sender_full_name": "(=_=)",
        "timestamp": 1586091915
    },
    {
        "content": "<p>Also, I find it very disturbing that some here have taken to opine that it is the computer scientist who's more obsessed with the validity of a mathematical proof than the mathematician. I'm sure many mathematicians would find this to be news to them.</p>",
        "id": 192958843,
        "sender_full_name": "(=_=)",
        "timestamp": 1586092319
    },
    {
        "content": "<p>Should this be migrated somewhere else after all? I can clearly see some more mileage in this coversation</p>",
        "id": 192959435,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586092969
    },
    {
        "content": "<p>I'd move it back to Shaky foundations. Seems more appropriate.</p>",
        "id": 192959468,
        "sender_full_name": "(=_=)",
        "timestamp": 1586093021
    },
    {
        "content": "<p>\"Computer scientists are more obsessed with mathematical correctness than mathematicians\" is also my experience. To some extent I think it's justified. If a pure mathematician has a bug in their proof, the worst case is that someone gets egg on their face. If a computer scientist has a bug in their proof, the worst case is that people die</p>",
        "id": 192959469,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586093023
    },
    {
        "content": "<p>(I mean, off #general and out of everyone's way)</p>",
        "id": 192959516,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586093068
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192959469\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192959469\">said</a>:</p>\n<blockquote>\n<p>If a pure mathematician has a bug in their proof, the worst case is that someone gets egg on their face. If a computer scientist has a bug in their proof, the worst case is that people die</p>\n</blockquote>\n<p>Then I worry for ACT, because the \"A\" bit means it can be more than egg on face.</p>",
        "id": 192959533,
        "sender_full_name": "(=_=)",
        "timestamp": 1586093124
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192959516\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192959516\">said</a>:</p>\n<blockquote>\n<p>(I mean, off #general and out of everyone's way)</p>\n</blockquote>\n<p>You can't move to a different stream. At least, nobody seems to know how.</p>",
        "id": 192959580,
        "sender_full_name": "(=_=)",
        "timestamp": 1586093168
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192946750\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192946750\">said</a>:</p>\n<blockquote>\n<p>As long as you accept that there's a distinction between standard and nonstandard, I don't think we disagree.</p>\n</blockquote>\n<p>I don't think Mike was arguing that there is no actual difference between any model of PA. They're obviously different, or they'd all be the same model.</p>\n<p>One of the differences is that different models will match different applications of PA better (similar to how different theories can be more or less useful for different applications). The \"standard\" model (probably) matches what  we're doing when we write symbols on a page. \"Non-standard\" models probably don't. That doesn't mean the first one is \"the right\" model of PA; it means it's the right one for this application.</p>\n<p>Also this shows that it can be dubious to give informal descriptions of formal statements based on privileging one model. We call the proposition Con(PA) because it maps to what we think of as consistency <em>in the page model</em>. But PA is not only a theory of symbols on a page.</p>",
        "id": 192964272,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586100150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192964272\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192964272\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192946750\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192946750\">said</a>:</p>\n<blockquote>\n<p>As long as you accept that there's a distinction between standard and nonstandard, I don't think we disagree.</p>\n</blockquote>\n<p>I don't think Mike was arguing that there is no actual difference between any model of PA. They're obviously different, or they'd all be the same model.</p>\n<p>One of the differences is that different models will match different applications of PA better (similar to how different theories can be more or less useful for different applications). The \"standard\" model (probably) matches what  we're doing when we write symbols on a page. \"Non-standard\" models probably don't. That doesn't mean the first one is \"the right\" model of PA; it means it's the right one for this application.</p>\n<p>Also this shows that it can be dubious to give informal descriptions of formal statements based on privileging one model. We call the proposition Con(PA) because it maps to what we think of as consistency <em>in the page model</em>. But PA is not only a theory of symbols on a page.</p>\n</blockquote>\n<p>If you prefer the phrase \"page model of PA\" rather than \"true model of PA\" or \"standard model of PA\", that's fine by me.  As long as you accept that there is just one page model (up to isomorphism at least).  Mike's hypothetical person would not accept this (if I understand Mike correctly).</p>",
        "id": 192964614,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586100690
    },
    {
        "content": "<p>That doesn't look like what he said at all.</p>",
        "id": 192964919,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586101226
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192964919\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192964919\">said</a>:</p>\n<blockquote>\n<p>That doesn't look like what he said at all.</p>\n</blockquote>\n<p>You mean that, on your reading of Mike's messages, his hypothetical person <em>would</em> accept that there is just one page model (up to isomorphism at least)?</p>",
        "id": 192965085,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586101498
    },
    {
        "content": "<p>Yes, because models are just objects in <em>another</em> mathematical theory where we're trying to mathematically model our application of theories to concrete scenarios. The point isn't that there are multiple \"standard models\". The point is that there are many models, and none of them deserves to be called \"standard.\"</p>",
        "id": 192965282,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586101789
    },
    {
        "content": "<p>And by multiple standard models, I mean multiple non-isomorphic things that are somehow the same model (whatever that means).</p>",
        "id": 192965340,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586101851
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965282\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965282\">said</a>:</p>\n<blockquote>\n<p>Yes, because models are just objects in <em>another</em> mathematical theory where we're trying to mathematically model our application of theories to concrete scenarios. The point isn't that there are multiple \"standard models\". The point is that there are many models, and none of them deserves to be called \"standard.\"</p>\n</blockquote>\n<p>But one of them deserves to be called \"page\"?</p>",
        "id": 192965351,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586101889
    },
    {
        "content": "<p>Yes. Writing symbols on a page is particular concrete activity. Calling it the \"standard\" model suggests that writing symbols in a page is the \"correct\" interpretation of what PA formulas mean, and other applications of PA are wrong, or similar.</p>",
        "id": 192965563,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586102265
    },
    {
        "content": "<p>Or, like, homotopy types are the 'wrong' model of Martin-löf type theory.</p>",
        "id": 192965631,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586102342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> , who is interpreting you correctly?</p>",
        "id": 192965651,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586102376
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277270\">@Dan Doel</span>  I'm assuming it's not your intention that the \"page\" is bounded by the number of atoms in the universe.  For with such a bound we couldn't obtain a PA model at all.</p>",
        "id": 192965809,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586102574
    },
    {
        "content": "<p>Right. It's more idealized than the reality it's allegedly representing.</p>",
        "id": 192965981,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586102790
    },
    {
        "content": "<p>Although the formal system for ultrafinite mathematics I mentioned earlier are pretty similar to PA, I think. It's like PA + '∀n. log(log n) &lt; 100' - cut.</p>",
        "id": 192966083,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586102989
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966083\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966083\">said</a>:</p>\n<blockquote>\n<p>Although the formal system for ultrafinite mathematics I mentioned earlier are pretty similar to PA, I think. It's like PA + '∀n. log(log n) &lt; 100' - cut.</p>\n</blockquote>\n<p>I guess that what is \"pretty similar\" is somewhat subjective <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 192966157,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586103071
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965351\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965351\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965282\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192965282\">said</a>:</p>\n<blockquote>\n<p>Yes, because models are just objects in <em>another</em> mathematical theory where we're trying to mathematically model our application of theories to concrete scenarios. The point isn't that there are multiple \"standard models\". The point is that there are many models, and none of them deserves to be called \"standard.\"</p>\n</blockquote>\n<p>But one of them deserves to be called \"page\"?</p>\n</blockquote>\n<p>it's the \"page model\" precisely the syntactic model?</p>",
        "id": 192966259,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1586103244
    },
    {
        "content": "<p>in which case, it's the initial model</p>",
        "id": 192966261,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1586103251
    },
    {
        "content": "<p>which is canonical in some respect, though still not necessarily deserving of the name \"standard\"</p>",
        "id": 192966271,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1586103293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966261\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966261\">said</a>:</p>\n<blockquote>\n<p>in which case, it's the initial model</p>\n</blockquote>\n<p>What notion of morphism do you have in mind?  The usual notion of morphism between models of a first order theory is \"elementary embedding\".  The category of PA models and elementary embeddings does not have an initial object.</p>",
        "id": 192966398,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586103471
    },
    {
        "content": "<p>Perhaps you mean \"initial algebra\" for the signature {Zero, Successor}.</p>",
        "id": 192966560,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586103694
    },
    {
        "content": "<p>I was thinking of treating PA as an algebraic theory and considering some category of models</p>",
        "id": 192966567,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1586103721
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966560\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966560\">said</a>:</p>\n<blockquote>\n<p>Perhaps you mean \"initial algebra\" for the signature {Zero, Successor}.</p>\n</blockquote>\n<p>yes, something like this</p>",
        "id": 192966609,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1586103754
    },
    {
        "content": "<p>No, it's the 'standard model'.</p>",
        "id": 192966864,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586104172
    },
    {
        "content": "<p>Although I don't know what the syntactic model of PA is like, or how it's defined exactly, so maybe it's the same thing.</p>",
        "id": 192966991,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586104435
    },
    {
        "content": "<p>My hypothetical person does not believe that any model of PA deserves to be called \"standard\" (or \"page\" or what have you).</p>\n<p>I also never suggested that a person could intuit anything without proof.  Seeing proofs is how we develop our intuition.</p>\n<p>Just because a model contains more than the objects it was designed to model is no reason to doubt its efficacy at reaching conclusions about the objects it <em>was</em> designed to model; after all the designers probably knew what they were doing.</p>\n<p>ALl that said, I've just about lost track of, and interest in, this conversation.  It seems much better suited to talk about over a beer some evening after the pandemic is over than to try to reach a conclusion in this spaghetti thread.  (-:</p>",
        "id": 192967055,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1586104538
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192951159\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192951159\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276699\">Paul Blain Levy</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192949937\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192949937\">said</a>:</p>\n<blockquote>\n<p>The basic problem is that the most important category of all, viz. the category of sets, doesn't exist.  None of the proposed workarounds is entirely satisfactory.   (I learnt a lot on this subject from Mike Shulman's paper \"Set theory for category theory.\")</p>\n</blockquote>\n<p>Interested to hear why you say this. <br>\nZFC people say \"classes don't exist\", but one can write down the syntactic category of definable classes in ZFC, and get a perfectly good infinitary pretopos, and indeed a model of Algebraic Set Theory. I would assume a similar syntactic category could exist for sets (isSet(x) is something you can say about a class x, no?), but I'm no expert. Unless working with such formal objects doesn't count as 'existence'?</p>\n</blockquote>\n<p>You answered your own question <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 192974320,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586115428
    },
    {
        "content": "<p>Maybe a bit off-topic for the current discussion in this stream, but it does fit \"shaky foundations\". Is it just me or is there a (slight, easily fixable) mistake in condition (iv) in the definition of universe given in Borceux vol 1? Namely, in def 1.1.2 a universe is defined as a set <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> satisfying (i) transitivity, (ii) closure under unions of families, provided the indexing set and each member of the family is in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>, (iii) closure under powersets (iv) <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo>∈</mo><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">x\\in \\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mspace></mspace><mspace width=\"0.1111111111111111em\"></mspace><mo lspace=\"0em\" rspace=\"0.17em\"></mo><mtext> ⁣</mtext><mo lspace=\"0em\" rspace=\"0em\">:</mo><mspace width=\"0.3333333333333333em\"></mspace><mi>x</mi><mo>→</mo><mi>y</mi></mrow><annotation encoding=\"application/x-tex\">f\\colon x\\to y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace nobreak\"></span><span class=\"mspace\" style=\"margin-right:0.1111111111111111em;\"></span><span class=\"mpunct\"></span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mspace\" style=\"margin-right:-0.16666666666666666em;\"></span><span class=\"mord\"><span class=\"mrel\">:</span></span><span class=\"mspace\" style=\"margin-right:0.3333333333333333em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span></span></span></span> surjective function  <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>⇒</mo><mi>y</mi><mo>∈</mo><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\Rightarrow y\\in \\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.36687em;vertical-align:0em;\"></span><span class=\"mrel\">⇒</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.7335400000000001em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>  (v) contains the naturals. It seems to me that (iv) should also require that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>y</mi></mrow><annotation encoding=\"application/x-tex\">y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span></span></span></span> is a subset of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> (otherwise any singleton is in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> by (iv) and (v), whence by transitivity <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> contains all sets, a contradiction)</p>",
        "id": 192974762,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1586116064
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192974762\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192974762\">said</a>:</p>\n<blockquote>\n<p>Maybe a bit off-topic for the current discussion in this stream, but it does fit \"shaky foundations\". Is it just me or is there a (slight, easily fixable) mistake in condition (iv) in the definition of universe given in Borceux vol 1? Namely, in def 1.1.2 a universe is defined as a set <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> satisfying (i) transitivity, (ii) closure under unions of families, provided the indexing set and each member of the family is in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>, (iii) closure under powersets (iv) <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo>∈</mo><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">x\\in \\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.5782em;vertical-align:-0.0391em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mspace></mspace><mspace width=\"0.1111111111111111em\"></mspace><mo lspace=\"0em\" rspace=\"0.17em\"></mo><mtext> ⁣</mtext><mo lspace=\"0em\" rspace=\"0em\">:</mo><mspace width=\"0.3333333333333333em\"></mspace><mi>x</mi><mo>→</mo><mi>y</mi></mrow><annotation encoding=\"application/x-tex\">f\\colon x\\to y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace nobreak\"></span><span class=\"mspace\" style=\"margin-right:0.1111111111111111em;\"></span><span class=\"mpunct\"></span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mspace\" style=\"margin-right:-0.16666666666666666em;\"></span><span class=\"mord\"><span class=\"mrel\">:</span></span><span class=\"mspace\" style=\"margin-right:0.3333333333333333em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span></span></span></span> surjective function  <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>⇒</mo><mi>y</mi><mo>∈</mo><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\Rightarrow y\\in \\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.36687em;vertical-align:0em;\"></span><span class=\"mrel\">⇒</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.7335400000000001em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>  (v) contains the naturals. It seems to me that (iv) should also require that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>y</mi></mrow><annotation encoding=\"application/x-tex\">y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span></span></span></span> is a subset of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> (otherwise any singleton is in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> by (iv) and (v), whence by transitivity <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span> contains all sets, a contradiction)</p>\n</blockquote>\n<p>You're right.</p>",
        "id": 192975204,
        "sender_full_name": "Paul Blain Levy",
        "timestamp": 1586116629
    },
    {
        "content": "<p>That does sound like a mistake to me.  This definition is fairly different from the <a href=\"https://en.wikipedia.org/wiki/Grothendieck_universe\" title=\"https://en.wikipedia.org/wiki/Grothendieck_universe\">definition on Wikipedia</a>, which lacks (iv) and (v) and includes the requirement that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo separator=\"true\">,</mo><mi>y</mi><mo>∈</mo><mi mathvariant=\"script\">U</mi><mtext>  </mtext><mo>⟹</mo><mtext>  </mtext><mo stretchy=\"false\">{</mo><mi>x</mi><mo separator=\"true\">,</mo><mi>y</mi><mo stretchy=\"false\">}</mo><mo>∈</mo><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">x,y \\in \\mathcal{U} \\implies \\{x,y\\} \\in \\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7335400000000001em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\">x</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.70733em;vertical-align:-0.024em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">⟹</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">{</span><span class=\"mord mathdefault\">x</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">y</span><span class=\"mclose\">}</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∈</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>.</p>\n<p>By omitting the requirement that the set of natural numbers is in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">U</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{U}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathcal\" style=\"margin-right:0.09931em;\">U</span></span></span></span></span>, the Wikipedia definition includes two very small universes, namely the empty set and the set of all hereditarily finite sets.   But they point this out; most people usually do something to exclude these very small universes.  Axiom (v) is one way to do that.</p>",
        "id": 192976816,
        "sender_full_name": "John Baez",
        "timestamp": 1586118836
    },
    {
        "content": "<p>Regarding Borceaux, I pointed this out recently on the nCafé: <a href=\"https://golem.ph.utexas.edu/category/2020/02/2dimensional_categories.html#c057336\" title=\"https://golem.ph.utexas.edu/category/2020/02/2dimensional_categories.html#c057336\">https://golem.ph.utexas.edu/category/2020/02/2dimensional_categories.html#c057336</a></p>",
        "id": 192982822,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1586128269
    },
    {
        "content": "<p>I think this erratum should be added to the nLab, but I'm feeling a little lazy at the moment.</p>",
        "id": 192982876,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1586128335
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277270\">Dan Doel</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966083\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192966083\">said</a>:</p>\n<blockquote>\n<p>Although the formal system for ultrafinite mathematics I mentioned earlier are pretty similar to PA, I think. It's like PA + '∀n. log(log n) &lt; 100' - cut.</p>\n</blockquote>\n<p>bruh</p>",
        "id": 192994119,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586146748
    },
    {
        "content": "<p>the idea being that even tho u can prove this inconsistent traditionally, good luck exhibiting an actual proof of false in normal form?</p>",
        "id": 192994147,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586146787
    },
    {
        "content": "<p>The 'proofs' of inconsistency that your false mathematics says there will be are too big to be real proofs.</p>",
        "id": 192994198,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586146869
    },
    {
        "content": "<p>It doesn't sound pleasant to use, though.</p>",
        "id": 192994206,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586146913
    },
    {
        "content": "<p>I'm not sure it was a serious suggestion, though. More a demonstration of what considerations would be in play in a formal system for ultrafinitism. The idea that the usual notion of consistency is irrelevant is more important than the specific formal system, I think.</p>",
        "id": 192994495,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586147355
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192480664\" title=\"#narrow/stream/229111-general/topic/Shaky.20foundations/near/192480664\">said</a>:</p>\n<blockquote>\n<p><a href=\"/user_uploads/21317/9PtdMaQREE6W4pxRehIqJ0qV/main.pdf\" title=\"main.pdf\">main.pdf</a><br>\nhere's what i've written up so far—mostly an explanation of the idea of what a presheaf is, not so much touching on yoneda at all yet<br>\nid guess this is probably like a third of the way into my usual schtick</p>\n</blockquote>\n<p>I think that a common convention - I learned it when I was studying fibrations - for drawing things like your presheaves and copreshaves is to draw each Hom(A,X) above the corresponding A, and to omit the upward-pointing `|-&gt;'s connecting each A to its Hom(A,X). Here's an example: <a href=\"/user_uploads/21317/O9IDLP0qrTLY1p54FCaP6YGe/sa.png\" title=\"sa.png\">sa.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/O9IDLP0qrTLY1p54FCaP6YGe/sa.png\" title=\"sa.png\"><img src=\"/user_uploads/21317/O9IDLP0qrTLY1p54FCaP6YGe/sa.png\"></a></div>",
        "id": 194575194,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1587264164
    },
    {
        "content": "<p>yeah ive seen things like that</p>",
        "id": 194575433,
        "sender_full_name": "sarahzrf",
        "timestamp": 1587264617
    }
]