[
    {
        "content": "<p><a href=\"https://arxiv.org/abs/gr-qc/0407094\">Here we see Panangaden and Martin</a> showing that hyperbolic spacetimes are equivalent to interval domains.  <a href=\"https://arxiv.org/abs/gr-qc/0109053\">Here we see Panangaden Blute and Ivanov</a> showing that you might want to put density matrices at the nodes of your domains which you see as the causal domain of discrete hyperbolic spacetimes.  To me, this means that A) a map of a spacetime is a domain map, and B) those domains can be seen as diagrams in the category of Hilbert Spaces.</p>\n<p>Functors can be seen as \"the interpretation of systems of type A in the context of systems of type B\".  Though it has not been stated in the literature yet, I claim that an apparatus, being a construction, is an arbitrary category (though I am working on defining what category structure an apparatus should have).  I claim that in our local universe, which is flat and cold and basically static, an appropriate choice of the category of the apparatus is Set.  Though it has not been stated in the literature yet, I claim that we interpret the events in our casual history in our apparatus via a functor from the system being observed to the category of the apparatus.   This is because there is a domain map from parts of our causal history into our local universe.  Especially, though, I claim that during an experiment, we map diagrams in the system under study to diagrams in the category of our apparatus.  I further claim that the functors of our experiments are adjunctions which generate data monads like the list monad and the multiset monad.</p>\n<p><a href=\"https://arxiv.org/abs/gr-qc/0509120\">Here we see Hardy</a> providing a cosmological thought experiment that holds data and how we handle data at it's core.  Part of the information he refers to is exactly the causal structure of the cosmos that connects various laboratories.  Though it has not been stated in the literature, I claim that the handling of the data surrounding an experiment can be modeled with monads which means we need something like a casual structure monad.  I further claim that the causal structure data can be combined with the local data via the composition of some kind of causal data monad with the multiset monad.  I also, further, claim that the theory for this physics is the Eilenberg-Moore category of this composite of monads.</p>\n<p>One might be tempted to formulate an interval domain monad.  Instead though, we might focus on the Category diagrams and try to get a monad or comonad of category diagrams.  <a href=\"https://arxiv.org/abs/2005.01894\">Here we see Spivak</a> showing that categories are equal to polynomial comonads on Set.  Since diagrams are just index categories, it looks like we have our comonad. So cosmological experiments are the composite of the category-comonads on Set with the multiset monad… Or something like that.</p>\n<p>I was hoping someone would like to discuss this.</p>",
        "id": 211208505,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1600996328
    },
    {
        "content": "<p>This looks indeed interesting. But it's almost 4am here, so I'd like to come back to this tomorrow with a rested mind. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 211210013,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1600998010
    }
]