[
    {
        "content": "<p>Urs Schreiber wants messages pertaining to spam and crackpots in the nCafe to be hosted elsewhere rather than the nForum, and David Corfield suggested the Category Theory Zulip as an alternative location where these can be hosted:</p>\n<p><a href=\"https://nforum.ncatlab.org/discussion/2339/spam-and-crackpots-in-ncafe/?Focus=99350#Comment_99350\">https://nforum.ncatlab.org/discussion/2339/spam-and-crackpots-in-ncafe/?Focus=99350#Comment_99350</a></p>",
        "id": 525555223,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1750782402
    },
    {
        "content": "<p>It seems strange to report nCafé spam on Zulip. Why not contact one of the moderators directly?</p>",
        "id": 525557068,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1750783131
    },
    {
        "content": "<p>Why the hell should this Zulip be burdened with discussion of spam and crackpots on the nCafé ?</p>",
        "id": 525558776,
        "sender_full_name": "John Baez",
        "timestamp": 1750783751
    },
    {
        "content": "<p>Yeah, this isn't a good solution. The only people posts about spam on the nCafe here could possibly be relevant to are the moderators of the nCafe, so the moderators should be contacted directly (whether via DM here, via email, or via some other means.)</p>",
        "id": 525559096,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1750783855
    },
    {
        "content": "<p>By the way: one particular childish fellow has posted the same silly comments on my nCafé posts, my Azimuth posts, and my Mastodon posts in recent days.   I don't think there's any special need to discuss it anywhere.  It would be sort of like talking about a malign puppy that shits on my stretch of the sidewalk - one might talk it about if there's nothing else to do, but otherwise why bother?   I'm trying to deal with it, working with people who can help.</p>\n<p>I didn't know people were talking about this on the nForum.</p>",
        "id": 525559518,
        "sender_full_name": "John Baez",
        "timestamp": 1750783983
    },
    {
        "content": "<p>But yes, they were.  </p>\n<p>As I said there:</p>\n<p>Anyone who sees spam on the nCafé is free to either email me about it or DM me on the category theory Zulip. David Corfield, Tom Leinster and Mike Shulman are also able to delete spam on the nCafé.</p>\n<p>Posting about it on the nForum is unhelpful. Posting about it publicly on the category theory Zulip is similarly unhelpful.</p>\n<p>Some jerk is spamming my articles on the n-Café now, and Jacques Distler is attempting to help me block it. I’ve known about this for 2 days. Any spam on my articles automatically goes into my inbox and I see it</p>",
        "id": 525603983,
        "sender_full_name": "John Baez",
        "timestamp": 1750803440
    },
    {
        "content": "<p>Yes, the front page of the Café shows a string of profanities as recent comments in the right-hand column, though the comments themselves are deleted. Somehow the software is not quite in-synch.</p>",
        "id": 525605945,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1750804608
    },
    {
        "content": "<p>You probably just have to refresh the page.   But better yet: ignore the whole thing.</p>",
        "id": 525606148,
        "sender_full_name": "John Baez",
        "timestamp": 1750804737
    },
    {
        "content": "<p>Refreshing (even a force refresh) didn't change it. I will ignore it and it will go away, I just thought the phenomenon should be noted for Jacques' information.</p>",
        "id": 525606407,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1750804897
    },
    {
        "content": "<p>Okay, thanks.  The comments are gone for me, now.   The guy will post more....</p>",
        "id": 525606550,
        "sender_full_name": "John Baez",
        "timestamp": 1750804993
    },
    {
        "content": "<p>I never saw the in-situ comments. Merely the 'Recent Comments' panel containing the links to them</p>",
        "id": 525607158,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1750805387
    },
    {
        "content": "<p>Right, I get what you mean.  I see no comments there.  Anyway, discussing this is almost as tiresome as dealing with the spam itself.  I'd rather talk about math.</p>",
        "id": 525608442,
        "sender_full_name": "John Baez",
        "timestamp": 1750806275
    },
    {
        "content": "<p>Speaking of which, did the nCafe disable comments to its posts?</p>",
        "id": 527099946,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1751598608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"671813\">@Madeleine Birchfield</span>  maybe just John's posts? <a href=\"https://golem.ph.utexas.edu/category/2025/02/potential_functions_and_the_ma_1.html#comments\">https://golem.ph.utexas.edu/category/2025/02/potential_functions_and_the_ma_1.html#comments</a> by Tom Leinster has \"reply to comment\" buttons, still.</p>",
        "id": 527100041,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1751598710
    },
    {
        "content": "<p>The nCafe doesn't do anything - people like Tom Leinster, Jacques Distler and do.   I disabled comments on 3 posts that served as lecture notes for the minicourse I just finished teaching in Athens.  I did this for reasons that would be obvious if you regularly look at the n-Cafe.</p>",
        "id": 527145940,
        "sender_full_name": "John Baez",
        "timestamp": 1751622505
    }
]