[
    {
        "content": "<p>I think there's been some very good expositions of category theory.  So, some of you may want to nominate someone for this prize.   It would be nice to get a category theorist to win this prize:</p>\n<blockquote>\n<p>Dear colleagues,</p>\n<p>We are seeking nominations for the inaugural Elias M. Stein Prize for Transformative Exposition to be awarded by the AMS in January 2025.  This prize seeks to recognize mathematicians at any career stage who, like Stein, have invested in writing a book or manuscript that transforms how their research community, or the next generation, understands the current state of knowledge in their area.    We emphasize that there are <em>no</em> restrictions on the area of mathematics.   Moreover, undergraduate and graduate texts , as well as expositions targeted towards the research community are all eligible.   We are seeking a strong and diverse pool of nominees.     </p>\n<p>We encourage you to consider making a nomination.    Alternatively, if you are aware of a strong potential candidate but are not able to provide the nomination yourself, please send me your suggestion by replying to this email.  In this case, I would also appreciate any suggestions of possible nominators for the candidate.   The AMS accepts nominations  through May 31.   For more information as well as the nomination form, please visit </p>\n<p><a href=\"https://www.ams.org/prizes-awards/paview.cgi?parent_id=57\">https://www.ams.org/prizes-awards/paview.cgi?parent_id=57</a></p>\n<p>We also encourage you to circulate this request to your colleagues.</p>\n<p>Thank you,</p>\n<p>Carolyn Gordon</p>\n<p>On behalf of the Elias Stein Prize committee</p>\n</blockquote>",
        "id": 431451011,
        "sender_full_name": "John Baez",
        "timestamp": 1712296132
    },
    {
        "content": "<p>Does anyone know if this is the first year of the prize? I looked for previous winners and couldn't find anything.</p>",
        "id": 431501225,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1712315511
    },
    {
        "content": "<p>I’m the word inaugural is used in the quoted message.</p>",
        "id": 431512446,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1712319707
    },
    {
        "content": "<p>I guess I should read the OP...</p>",
        "id": 431513536,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1712320086
    }
]