[
    {
        "content": "<p>hi does anyone know of good educational tools for promoting discussion and study groups among like-minded students (people on an intersecting learning mission)? i was thinking of a diagrammatic way like a tree of representing math knowledge (an existing example is the Mathematics Subject Classification, although i see this starting as more of a free for all, community built tree), and little markers of where participants are at like in a board game, and every node in the tree will have it's own chat room/channel kind of thing?</p>\n<p>i was thinking of starting a git repo, where initially anyone can edit, adding to the tree what they are studying. maybe there could be features such as a notification when someone new has added themselves to your subject area. essentially kind of how people react to roles on discord channels, people would place themselves somewhere on the tree that they are studying, a subject that they are trying to learn, and then they can see what's going on in that thread or channel. if there end up being lots of users, then the tree (structure of the expert-recommended learning paths) could be managed similarly to how open source projects such as linux are.</p>\n<p>the benefit of this would be a great study group organizational tool. you would instantly have access to study groups full of people trying to learn exactly the same thing you. what do you think?</p>",
        "id": 476546941,
        "sender_full_name": "David Sprayberry",
        "timestamp": 1728761211
    },
    {
        "content": "<p>Sounds like fun, but I don't see how the logistics of communication or learning would work. How is learning guided in this set-up?<br>\nThere are already communities (such as this one, or groups on Discord) for specific subjects, but to be honest it's rare in advanced mathematics discussions for multiple people to be at the same level and working at the same pace for long enough to hold a study group together. It's more reasonable to collect people in a reading group or seminar series so that you can examine a text or discuss a subject in a pre-determined format together. That way each participant can pull out details that are relevant to their level or interest.</p>",
        "id": 476633033,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1728850001
    },
    {
        "content": "<p>It is fun to fantasize about an MMO-style learning environment (which is what your description brought to mind for me), but aligning game designers with motivated experts to enough depth to get people learning deep maths is a tall order</p>",
        "id": 476633270,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1728850093
    },
    {
        "content": "<p>It is not exactly what you are describing, but there was a talk at the Topos institute by Po-Shen Loh, who tries to develop a MMO-style learning environment</p>\n<p><a href=\"https://www.youtube.com/live/5J1vit-3Y0U?si=4RgOssNbkRjvdvgT\">https://www.youtube.com/live/5J1vit-3Y0U?si=4RgOssNbkRjvdvgT</a></p>",
        "id": 476637777,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1728853756
    },
    {
        "content": "<p>(I found the title a bit misleading, but I also found the actual content quite interesting)</p>",
        "id": 476637803,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1728853795
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/study.20group.20organization.20software.20.28maybe.20git.3F.29/near/476633033\">said</a>:</p>\n<blockquote>\n<p>Sounds like fun, but I don't see how the logistics of communication or learning would work. How is learning guided in this set-up?<br>\nThere are already communities (such as this one, or groups on Discord) for specific subjects, but to be honest it's rare in advanced mathematics discussions for multiple people to be at the same level and working at the same pace for long enough to hold a study group together. It's more reasonable to collect people in a reading group or seminar series so that you can examine a text or discuss a subject in a pre-determined format together. That way each participant can pull out details that are relevant to their level or interest.</p>\n</blockquote>\n<p>reply to 'How is learning guided in this set-up?':</p>\n<p>well this tool (i was thinking of a git repo as the DAG-like tree, and people as branches, as an initial version of the tool)  would essentially be just to be able to find a group of people studying any given math subject, and from there it would be essentially up to that group how to organize their study or post their material/notes or have video conference study sessions.</p>\n<p>so essentially <strong>the learning is not guided</strong>. <br>\nwhat i meant by \"if there end up being lots of users, then the tree (structure of the expert-recommended learning paths) could be managed similarly to how open source projects such as linux are\" is that<br>\n<strong>the organization of the tree is guided</strong> by the most-expert users.<br>\nlike when it starts to get chaotic user permissions to edit the tree become just permission to suggest  the addition of a subject which is then moderated by a more expert user who knows exactly what that subject entails. <br>\nfor example, Linus Torvalds is the head of his linux operating system which a lot of expert coders contribute to. <br>\nit stays organized somehow. <br>\nfor example this math tree could be headed by a democratically voted-in committee of math experts.</p>\n<p>reply to 'It's more reasonable to collect people in a reading group or seminar series so that you can examine a text or discuss a subject in a pre-determined format together.':<br>\nthis is exactly what i envision an effective study group as. what is a study group to you?</p>",
        "id": 476639498,
        "sender_full_name": "David Sprayberry",
        "timestamp": 1728855637
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"619003\">Peva Blanchard</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/study.20group.20organization.20software.20.28maybe.20git.3F.29/near/476637777\">said</a>:</p>\n<blockquote>\n<p>It is not exactly what you are describing, but there was a talk at the Topos institute by Po-Shen Loh, who tries to develop a MMO-style learning environment</p>\n<p><a href=\"https://www.youtube.com/live/5J1vit-3Y0U?si=4RgOssNbkRjvdvgT\">https://www.youtube.com/live/5J1vit-3Y0U?si=4RgOssNbkRjvdvgT</a></p>\n</blockquote>\n<p>thanks for this, very informative! yes that is an interesting math-problem <a href=\"http://chess.com\">chess.com</a> kind of idea. it's intended for early education like middle school, but i'll investigate this more. the site is <a href=\"https://live.poshenloh.com/\">https://live.poshenloh.com/</a></p>",
        "id": 476650697,
        "sender_full_name": "David Sprayberry",
        "timestamp": 1728867814
    },
    {
        "content": "<p>I find the comparison to linus hard to reconcile with a learning format. Linux developers generate content, namely code that adds features to Linux. This is necessarily content that doesn't already exist, and the people producing it are already experts in this activity for the most part, in particular having developed an understanding of how their contributions fit into the code base.<br>\nIt seems like you're proposing that students will generate their own learning resources and somehow self-organize without that expertise?<br>\nAnd on the other hand, structured learning resources for unsupervised study do already exist, in the form of books, online courses and even series of blog posts.</p>",
        "id": 476712755,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1728893527
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"761633\">@David Sprayberry</span> , I shouldn't have come down so hard on your idea. I saw in another topic that you're just trying to figure out where to find people to learn with and resources to learn from. I know the feeling of wishing that all of this knowledge was more accessible and pre-structured to enable student exploration.<br>\nI think a more realistic version of what you're imagining may eventually come about from a concerted effort from domain experts (rather than students) in concert with software developers and education experts. There are already one-sided attempts to organize knowledge such as nLab or Kerodon, which are useful as references for experts or experienced non-experts, but which still don't give students direct access to the organisational structure of their respective domains. I think there are people (active here) working on other approaches.</p>",
        "id": 476827428,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1728926642
    }
]