[
    {
        "content": "<p>Does anyone now why <a href=\"http://www.tac.mta.ca/tac/expositions/index.html\">TAC Expositions</a> has only 1 paper out? It's been 3.5 years since its launch!<br>\nFor a chronically under-explained subject like ours, with people constantly complaining about folklore and lack of rewarding of expository content, this is weird.</p>\n<p>My first explanation is that it isn't well-known, so this post doubles as an advertisement: I want to read your expositions! The second is that TAC's worth in beans is quite low, so perhaps people prefer to spend their time publishing original research on high-impact journals.</p>\n<p>For the record, here's the editorial policy of TACE:</p>\n<blockquote>\n<p><em>Expositions in Theory and Applications of Categories</em> (\"TAC Expositions\") is a special series specifically designed for publication of well-written and novel expository articles on topics of current research interest in the theory and/or applications of categories. While a TAC Exposition article need not include new results, it must be novel in either its arrangement or viewpoint, providing a new perspective or context for known results. Authors considering submitting an expository paper are advised to consult an editor on its suitability for TAC Expositions.<br>\nTo maintain a high standard in the TAC Expositions series, articles in this series must be approved by two TAC editors.</p>\n</blockquote>",
        "id": 433510548,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1713270411
    },
    {
        "content": "<p>Another explanation, related to your first one, might be that the one TAC Exposition so far sets an intimidatingly high standard, so people don't feel confident that their own expositions would be accepted.</p>",
        "id": 433517754,
        "sender_full_name": "John Baez",
        "timestamp": 1713272655
    },
    {
        "content": "<p>Another reason is that expository papers are less valued according to typical metrics in general, and so people feel discouraged spending time writing expository work when they could be writing original research.</p>",
        "id": 433519296,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1713273099
    },
    {
        "content": "<p>I don't know, if a metric is based on citations, expositions that become standard references should do well in the medium term...</p>",
        "id": 433519536,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713273165
    },
    {
        "content": "<p>Much to my chagrin, my most cited paper is an expository paper.</p>",
        "id": 433523911,
        "sender_full_name": "John Baez",
        "timestamp": 1713274462
    },
    {
        "content": "<p>I'm not really chagrined.  But if you want a lot of citations in a journal with impact factor about 2.2, publish a good expository article in the <em>Bulletin of the American Mathematical Society</em>.</p>",
        "id": 433524839,
        "sender_full_name": "John Baez",
        "timestamp": 1713274726
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433517754\">said</a>:</p>\n<blockquote>\n<p>...the one TAC Exposition so far sets an intimidatingly high standard...</p>\n</blockquote>\n<p>Another factor that I think is related: our <em>advice about writing</em> also sets an intimidating standard.  For example,  <a href=\"https://golem.ph.utexas.edu/category/2024/03/why_mathematics_is_boring_1.html\">your recent admonitions</a> about math writing.  I've been puzzling over this for a while, because your advice is good, but also impossible for a young person to follow.  </p>\n<p>For example, my 2-categories book with Donald would never have been written if we tried to write it as a grand narrative.  So, there must be some different kind of advice for reference writing.  Maybe <em>Let it be boring!</em>??  When one wants to reference a result or construction, the most bone-dry textbook is much easier to navigate.  I don't think your advice there was intended to apply to a reference like ours (was it?!).</p>\n<p>For less personal examples, I think Gurski's book <em>Coherence for Tricategories</em> lack's a narrative structure, although it does have a 2-dimensional \"warm-up\".  I wonder how people assess the 1-category books by Mac Lane and Riehl: they definitely have more examples, and something more like a narrative, but is <em>that</em> what makes them good??</p>",
        "id": 433534024,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1713277291
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433510548\">said</a>:</p>\n<blockquote>\n<p>Does anyone now why <a href=\"http://www.tac.mta.ca/tac/expositions/index.html\">TAC Expositions</a> has only 1 paper out? It's been 3.5 years since it's launch!</p>\n</blockquote>\n<p>For what it's worth <span class=\"user-mention\" data-user-id=\"306459\">@Joshua Wrigley</span> and I have recently had a paper accepted to TAC Expositions, so that number should become 2 in the near future. Hopefully, once there are a few papers out, people will be more likely to try publish things there.</p>",
        "id": 433552424,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1713281916
    },
    {
        "content": "<p>Some coauthors and I submitted a paper to TAC Expositions recently, but the referees said they thought it made novel research contributions, so the editors moved it into TAC proper.  I don't know if anyone else has had such an experience, but I think sometimes it can be difficult to write a <em>purely</em> expository paper, for me personally at least -- often if I'm explaining something, it's because I feel like existing explanations don't suffice, and often working out the details of the way I would want to explain it actually involves doing some new mathematics.</p>",
        "id": 433568506,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713286707
    },
    {
        "content": "<p>Very interesting Mike. I actually wrote that as a possible additional reason but reading the editorial policy again I thought 'well, maybe not after all'.</p>",
        "id": 433606293,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1713301223
    },
    {
        "content": "<p>I was a little surprised myself.  Apparently \"need not include new results\" at least sometimes means \"<em>may</em> not include new results\", at least not ones that are \"too substantial\".</p>",
        "id": 433607752,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713301828
    },
    {
        "content": "<p>Of course the funny thing is that I'm also an editor of TAC myself.  But no one's ever submitted anything to me for Expositions.</p>",
        "id": 433607984,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713301928
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433568506\">said</a>:</p>\n<blockquote>\n<p>Some coauthors and I submitted a paper to TAC Expositions recently, but the referees said they thought it made novel research contributions, so the editors moved it into TAC proper.  </p>\n</blockquote>\n<p>Heh, that's the reverse of the usual attitude among some established category theorists.</p>",
        "id": 433623273,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1713310004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433607752\">said</a>:</p>\n<blockquote>\n<p>I was a little surprised myself.  Apparently \"need not include new results\" at least sometimes means \"<em>may</em> not include new results\", at least not ones that are \"too substantial\".</p>\n</blockquote>\n<p>Or even may <em>not</em> include ;-)</p>",
        "id": 433623620,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1713310246
    },
    {
        "content": "<p>if there is one thing we need in category theory is expository notes...</p>",
        "id": 433690036,
        "sender_full_name": "fosco",
        "timestamp": 1713338562
    },
    {
        "content": "<p>You made me wonder now [genuine question]: what's better according to said metrics? TAC or, say, \"Expositiones Mathematicae\"?</p>",
        "id": 433690321,
        "sender_full_name": "fosco",
        "timestamp": 1713338705
    },
    {
        "content": "<p>I can't check rn but last time I got interested in these matters I realized that TAC is too free and cool for the beans</p>",
        "id": 433699982,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1713342106
    },
    {
        "content": "<p>I guess you have to charge 3k$ to be considered impactful (it surely is, on bank accounts)</p>",
        "id": 433700077,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1713342130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275932\">@Matteo Capucci (he/him)</span> </p>\n<p>It is paradoxical that the most expensive venues/institutions are considered by many to be the most reputable.  Naively, I would think that a lower fee would increase the number of applicants, and thus competition.  But I suppose when an institution or venue becomes more popular, they tend to capitalize on the popularity, which makes them exclusively accessible to people from wealthy countries/institutions.</p>",
        "id": 433714261,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1713346834
    },
    {
        "content": "<p><span aria-label=\"man shrugging\" class=\"emoji emoji-1f937-200d-2642\" role=\"img\" title=\"man shrugging\">:man_shrugging:</span></p>",
        "id": 433720491,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1713348789
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433699982\">said</a>:</p>\n<blockquote>\n<p>I can't check rn but last time I got interested in these matters I realized that TAC is too free and cool for the beans</p>\n</blockquote>\n<p>Maybe a naive question, but could the lack of DOIs potentially cause TAC to be less well indexed and therefore more poorly reflected in metrics?</p>",
        "id": 433721342,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1713349152
    },
    {
        "content": "<p>Kaching. I tried talking with a senior editor (remain unnamed) ten years ago about DOIs for TAC. No-go. But Compositionality has them, so why not raise some funds, get DOIs for backlog as well as getting good metadata (which I think you need for DOI purposes) possibly via a crowd-sourced activity/pay some students to do some data scraping/entry and then validate?</p>",
        "id": 433733787,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1713353785
    },
    {
        "content": "<p>This previous conversation discusses exactly that: <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs\">https://categorytheory.zulipchat.com/#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs</a></p>",
        "id": 433734493,
        "sender_full_name": "Joshua Wrigley",
        "timestamp": 1713354025
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"623323\">Niles Johnson</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433534024\">said</a>:</p>\n<blockquote>\n<p>Another factor that I think is related: our <em>advice about writing</em> also sets an intimidating standard.  For example,  <a href=\"https://golem.ph.utexas.edu/category/2024/03/why_mathematics_is_boring_1.html\">your recent admonitions</a> about math writing.  I've been puzzling over this for a while, because your advice is good, but also impossible for a young person to follow.  </p>\n</blockquote>\n<p>I don't think age is the determining factor here.    I was trying to give some tips to prevent math writing from being boring, and while these tips take some time to internalize, I've seen interesting papers by young people and boring papers by old people (and vice versa).</p>\n<blockquote>\n<p>For example, my 2-categories book with Donald would never have been written if we tried to write it as a grand narrative.</p>\n</blockquote>\n<p>\"Grand\" makes it sound very hard; I never said anything about \"grand\".  You could write it as dozens of petty narratives.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> </p>\n<blockquote>\n<p>So, there must be some different kind of advice for reference writing.  Maybe <em>Let it be boring!</em>??  When one wants to reference a result or construction, the most bone-dry textbook is much easier to navigate.  I don't think your advice there was intended to apply to a reference like ours (was it?!).</p>\n</blockquote>\n<p>I was talking about writing a math paper: that's why I started with \"But I can’t count the number of times I’ve launched into reading a math paper, dewy-eyed and eager to learn, only to have my enthusiasm slowly but remorselessly crushed by pages and pages of bad writing.\"    </p>\n<p>If you're writing a reference work that people only dip into when they want to know a specific thing, it can be bone-dry yet still perfectly functional.   It's not like people complain about the phone book being dull.   I still think even a long math book can benefit from a subtle dash of narrative structure, so people would be more eager to plow through large chunks of it.   But whatever... if you don't want to do that, don't do it.   One of the best things about advice is that we're all free to ignore it!   </p>\n<p>Go ahead, everyone, and submit expositions to <em>TAC</em>.</p>",
        "id": 433769779,
        "sender_full_name": "John Baez",
        "timestamp": 1713362570
    },
    {
        "content": "<p>But wait:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20Expositions/near/433568506\">said</a>:</p>\n<blockquote>\n<p>Some coauthors and I submitted a paper to <em>TAC Expositions</em> recently, but the referees said they thought it made novel research contributions, so the editors moved it into <em>TAC</em> proper.  </p>\n</blockquote>\n<p>Wow, it seems weird to kick the paper out because it wasn't <em>purely</em> exposition of well-trodden material.  At least they moved it into <em>TAC</em> proper.</p>\n<blockquote>\n<p>I don't know if anyone else has had such an experience, but I think sometimes it can be difficult to write a <em>purely</em> expository paper, for me personally at least...</p>\n</blockquote>\n<p>Yeah, to me a good expository paper often takes known material and reworks it in a novel way that helps the world understand it better.   I have an old half-finished paper <a href=\"https://ncatlab.org/johnbaez/show/Dirichlet+species+and+the+Hasse-Weil+zeta+function\">Dirichlet species and the Hasse-Weil zeta function</a> that I've been wanting to finish up and submit to <em>TAC Expositions</em>.  The idea is that it might explain known stuff about zeta functions in a way category theorists can enjoy better.  But now I'm wondering if it will be booted out because the material isn't sufficiently unoriginal!</p>",
        "id": 433774531,
        "sender_full_name": "John Baez",
        "timestamp": 1713363090
    },
    {
        "content": "<p>Well, I don't think our experience should discourage anyone from submitting to TAC Expositions.  Getting shifted over to TAC proper is a perfectly fine outcome.</p>",
        "id": 433833156,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713372670
    },
    {
        "content": "<p>As I see it, the reason for having an \"expositions\" journal is that expository papers are sometimes hard to publish in ordinary journals.  I don't see any reason to prefer publishing an expository paper in an \"expositions\" journal if it can be accepted to an ordinary journal.</p>",
        "id": 433833480,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713372771
    },
    {
        "content": "<p>I just mentioned our experience because we were discussing why there aren't many papers in TAC Expositions yet, and if our paper hadn't been shifted over then there would be one more (soon).  (-:</p>",
        "id": 433833640,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713372829
    },
    {
        "content": "<p>In fact, if the <em>existence</em> of an \"expositions\" journal makes people more willing to <em>write</em> expository papers since it makes them feel more publishable, that seems like a win to me even if those papers eventually get published in other journals.</p>",
        "id": 433834188,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1713373011
    }
]