[
    {
        "content": "<p>Does anyone know how to quickly find the DOI of a TAC paper? It's not on the abstract page</p>",
        "id": 401716033,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1699866008
    },
    {
        "content": "<p>TAC papers don't currently have DOIs. I believe <span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span> was looking into DOI assignment for TAC papers?</p>",
        "id": 401716486,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1699866126
    },
    {
        "content": "<p>Yes, Chris was talking to the head editor of TAC, Geoff Crutwell, about that.  I believe it turned out that getting DOIs for existing papers would require a nontrivial amount of work - doing something to each one of those papers.  But <span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span> knows the details!</p>",
        "id": 401723791,
        "sender_full_name": "John Baez",
        "timestamp": 1699868596
    },
    {
        "content": "<p>Maybe it's a bit easier and still useful to get DOIs for all <em>new</em> TAC papers?</p>",
        "id": 401724095,
        "sender_full_name": "John Baez",
        "timestamp": 1699868654
    },
    {
        "content": "<p>Just getting new a doi for new papers would be a start. The backlog can be slowly worked on over years, if need be.</p>",
        "id": 401727570,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1699869513
    },
    {
        "content": "<p>They also cost money, no? Each one is very cheap but they probably add up to quite a bit</p>",
        "id": 401751228,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1699877906
    },
    {
        "content": "<p>I'll throw the alerts back at <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> and say he was willing to find funding (it's actually way less expensive than you think, and I'm sure John has grants for such things)</p>",
        "id": 401785429,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1699888718
    },
    {
        "content": "<p>It's been a while since we talked about this (steering a ship the size of TAC is pretty slow) but I'm still happy to do the work</p>",
        "id": 401785575,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1699888757
    },
    {
        "content": "<p>Plus I'm <em>extremely</em> confident that if there's some tedious task we have to do for each paper in the backlog that there will be other people in the zulip willing to help out with 5 or 10 at a time (actually, can you react to this if you would be open to helping with this project?)</p>",
        "id": 401785821,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1699888814
    },
    {
        "content": "<p>It's been a while since I looked into it, but the most tedious aspect (which can't be automated with code scraping the TAC website) is adding DOI cross references for the bibliographies of each TAC paper. </p>\n<p>I also, importantly, <em>don't know if we actually need to do that</em>. We definitely need to do it going forward, but the website is kind of confusing regarding the backlog. Once TAC gives me a tentative go ahead I'll contact the DOI people and double check exactly what the requirements are</p>",
        "id": 401786483,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1699889009
    },
    {
        "content": "<blockquote>\n<p>We definitely need to do it going forward</p>\n</blockquote>\n<p>What precisely is the requirement? For instance, arXiv assigns DOIs for each preprint, but does not require preprints to include DOIs in their bibliographies.</p>",
        "id": 401794771,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1699890965
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs/near/401785429\">said</a>:</p>\n<blockquote>\n<p>I'll throw the alerts back at <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> and say he was willing to find funding (it's actually way less expensive than you think, and I'm sure John has grants for such things)</p>\n</blockquote>\n<p>No, I don't have any grants for anything!   I've generally avoided the whole grant system, though this will have to change with the new Fields Institute project.   I was just willing to spend my own money on this - given the figures I heard, which by now I completely forget.  How much do DOIs cost, again?</p>",
        "id": 401796306,
        "sender_full_name": "John Baez",
        "timestamp": 1699891321
    },
    {
        "content": "<p>I'll be honest, I don't remember either, haha. I'm about to leave the house, but I'll either find our old discussion or redo the estimate later today</p>",
        "id": 401799354,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1699891930
    },
    {
        "content": "<p>I think for a single DOI it's around $1, but I imagine if you do it in bulk there are substantial savings.</p>",
        "id": 401824333,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1699900676
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs/near/401786483\">said</a>:</p>\n<blockquote>\n<p>It's been a while since I looked into it, but the most tedious aspect (which can't be automated with code scraping the TAC website) is adding DOI cross references for the bibliographies of each TAC paper. </p>\n<p>I also, importantly, <em>don't know if we actually need to do that</em>. We definitely need to do it going forward, but the website is kind of confusing regarding the backlog. </p>\n</blockquote>\n<p>There's no way articles all need to have DOIs added to the actual pdfs/etc, since this didn't happen for eg Springer's enormous back catalogue of scanned papers.</p>",
        "id": 401848672,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1699911163
    },
    {
        "content": "<p>I think talking to the Compositionality people would be a good idea, as they have DOIs</p>",
        "id": 401848774,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1699911225
    },
    {
        "content": "<p>I'm one of the <em>Compositionality</em> people, but the right people to talk to are <span class=\"user-mention\" data-user-id=\"307077\">@Nina Otter</span>  (formerly on the journal, who would know how to start getting DOIs) and <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> (who would at least know who makes this happen now).  </p>\n<p>The big difference is that <em>Compositionality</em> got DOIs for its papers from the very start.   Getting DOIs for old papers is a bit more mysterious, at least to me, and the <em>Compositionality</em> people wouldn't know about that.</p>",
        "id": 401858762,
        "sender_full_name": "John Baez",
        "timestamp": 1699916032
    },
    {
        "content": "<p>I just mean getting DOIs for papers going forward, not for the historical backlog, which I am theorising is a completely different matter.</p>",
        "id": 401910160,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1699940609
    },
    {
        "content": "<p>Okay, we agree.  Anyway, those are two relevant people at <em>Compositionality</em>.</p>",
        "id": 401920538,
        "sender_full_name": "John Baez",
        "timestamp": 1699946074
    },
    {
        "content": "<p>Hello <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>,  <span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span>, <span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> .  The DOIs for <em>Compositionality</em> are handled by a wordpress plugin so TAC will need to use a different system. I will point you to the <a href=\"https://www.crossref.org/documentation/member-setup/\">CrossRef documentation</a> which will hopefully have answers to your questions. In particular, here is the <a href=\"https://www.crossref.org/fees/\">fees page</a>. (as you can see it is $275 a year + $1 per article).</p>",
        "id": 401955352,
        "sender_full_name": "Jade Master",
        "timestamp": 1699957854
    },
    {
        "content": "<p>I should also mention that we are planning a move to <a href=\"https://www.episciences.org/\">Episciences</a> soon. Episciences will handle the DOI registration for us (including the fees!) so if TAC is willing to give up their old website and modernize a little then Episciences could be a very good option for them as well.</p>",
        "id": 401956085,
        "sender_full_name": "Jade Master",
        "timestamp": 1699958070
    },
    {
        "content": "<blockquote>\n<p>if TAC is willing to give up their old website and modernize a little</p>\n</blockquote>\n<p>Episciences is a platform for overlay journals, which have advantages and disadvantages compared to traditional journals, so I don't think it's reasonable to describe such a change as \"modernising\" (especially \"a little\").</p>",
        "id": 401959229,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1699958950
    },
    {
        "content": "<p>True that it's not an overlay but I'd be willing to bet that most of the articles on TAC are already also on arxiv.</p>",
        "id": 401960137,
        "sender_full_name": "Jade Master",
        "timestamp": 1699959257
    },
    {
        "content": "<p>I'm not involved with TAC at all, just trying to give helpful suggestions. I'm not saying that they should switch to Episciences...just something to consider. We have found that it will reduce the work needed to run <em>Compositionality</em> by a lot.</p>",
        "id": 401960663,
        "sender_full_name": "Jade Master",
        "timestamp": 1699959446
    },
    {
        "content": "<p>Actually, Scholastica is also  a good OA  platform, if TAC would go for a new infrastructure.</p>",
        "id": 401963185,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1699960245
    },
    {
        "content": "<p>Scholastica is a good option, but would come with another set of fees unfortunately.</p>",
        "id": 401973050,
        "sender_full_name": "Jade Master",
        "timestamp": 1699963830
    },
    {
        "content": "<p>Is TAC down?</p>",
        "id": 406710453,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1702023660
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs/near/406710453\">said</a>:</p>\n<blockquote>\n<p>Is TAC down?</p>\n</blockquote>\n<p>It is working fine for me on the usual link: <a href=\"http://www.tac.mta.ca/tac/\">http://www.tac.mta.ca/tac/</a></p>",
        "id": 406711049,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1702023945
    },
    {
        "content": "<p>I can access it at the moment, but in the past month it's been down for me more often than it's been up.</p>",
        "id": 406718005,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1702026864
    },
    {
        "content": "<p>Alright, I can access it again now, thanks for checking :)</p>",
        "id": 406720065,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1702027695
    },
    {
        "content": "<p>If someone sees that <em>TAC</em> is down, they can email the editor, Geoffrey Cruttwell, at </p>\n<p><a href=\"mailto:gcruttwell@mta.ca\">gcruttwell@mta.ca</a></p>\n<p>To avoid flooding him with emails, you could mention here that you've done it.</p>",
        "id": 406720468,
        "sender_full_name": "John Baez",
        "timestamp": 1702027856
    },
    {
        "content": "<p>We should not think of the \"old\" category theorists who run <em>TAC</em>,  the annual CT conference, the nLab etc. as inaccessible gods.</p>",
        "id": 406720536,
        "sender_full_name": "John Baez",
        "timestamp": 1702027886
    },
    {
        "content": "<p>For the times it's down you can also always find the papers on the Internet Archive.</p>",
        "id": 406735998,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1702033442
    },
    {
        "content": "<p>Are all TAC papers placed there?</p>",
        "id": 406815506,
        "sender_full_name": "John Baez",
        "timestamp": 1702059781
    },
    {
        "content": "<p>Every one I've checked at least, so it seems the site is crawled reasonably regularly.</p>",
        "id": 406823085,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1702062845
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span>: do you know what the current status of the TAC DOI situation is?</p>",
        "id": 441750015,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1717172881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span> has been talking to Geoff Crutwell about this, and they're making progress, but I'll let Chris detail it.</p>",
        "id": 441767289,
        "sender_full_name": "John Baez",
        "timestamp": 1717177419
    },
    {
        "content": "<p>Sorry I've been out for a few days! I've been talking to Geoff Crutwell about this, and I have the goahead to start doing some real work to make it happen. In the next few weeks I'll be setting up a crossref account for TAC (and sister journals) and figuring out how to automatically create DOIs for both the TAC backlog and all new publications going forwards. I don't know exactly how long it will take, but it should hopefully be fully set up within a month or so!</p>",
        "id": 442108399,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1717364359
    },
    {
        "content": "<p>This week I finished a first draft on a big paper I've been writing surveying Johnstone's topological topos (both proving some folklore facts that I'm excited to have in the literature, and proving some new facts that I think people will find really interesting!) That's been the top priority lately, but now that I have a draft of that I'll work on the DOI stuff more seriously to give myself a break from it</p>",
        "id": 442108617,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1717364475
    },
    {
        "content": "<p>I can't say how happy I am this is finally happening.</p>",
        "id": 442153792,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1717393606
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span>  </p>\n<blockquote>\n<p>I can't say how happy I am this is finally happening.</p>\n</blockquote>\n<p>Me too!</p>",
        "id": 442154173,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1717393812
    },
    {
        "content": "<p>Hi, is there any news on this front? <span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (they/them)</span></p>",
        "id": 494960209,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1737430189
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span> ! Great question, thanks for reaching out.</p>\n<p>I wish I had better news, but I had to stop working on this because my department is forcing all the 5th years to graduate this year (no 6th years are being funded next year at all), so I had to drop everything last october to start working on my thesis and applying to postdocs and stuff :/. Thankfully, I'm done with the postdoc applications now, which feels incredible, but I still need to write my thesis (and, being completely honest, finish solving my problem).</p>\n<p>I'm still interested in finishing the DOI stuff, though, and I can give some updates from when I had to take a step back:</p>\n<ul>\n<li>we have a crossref membership now, which lets us make DOIs</li>\n<li>we have a program that scrapes latex files for their authors/title/abstract/bibliography and gets all the information needed to make a new DOI</li>\n</ul>\n<p>So the only thing that's left to do is get this code to <em>use</em> this information to make an XML file, and to upload that file to crossref to actually make the DOI (which I think is just an html POST). This shouldn't be hard at all, I just need to find a weekend to do it.</p>\n<p>Once that's done, we can run the code on the TAC server and automatically generate DOIs for all our backlog! I don't want to make promises on the timeline, since I don't know exactly when I'll have time to finish, but I hope it'll be soon, because I really want this to happen</p>",
        "id": 495364804,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1737576361
    },
    {
        "content": "<p>Thanks for the update, Chris! I figured it might be something like this, and it sounds like you have more than sufficient reason to have let the project drop.</p>",
        "id": 495366281,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1737576960
    },
    {
        "content": "<p>Would you be willing to share your scraping program and access to the crossref membership to, say, me, in case someone else can get the xml generated sooner than you find a chance?</p>",
        "id": 495366383,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1737576993
    },
    {
        "content": "<p>Those shares could be split into a public repo and a more controlled login access, of course.</p>",
        "id": 495366418,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1737577011
    },
    {
        "content": "<p>Is there going to be some kind of verification process for the scraped data? I know manual verification of metadata isn't everyone's cup of tea (and there's a lot to do! Maybe it's infeasible), but I for one quite enjoy such tasks as a way of distracting myself. Get enough grad students and they can pick a few papers each and verify the bibliography scraped correctly in each one, and the process can be done without too much stress...</p>",
        "id": 501430466,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1740361907
    },
    {
        "content": "<p>Then of course doing some kind of datasciencey analysis of the results would be very cool, like a citation graph for (this selection of) CT...</p>",
        "id": 501430530,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1740361944
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/TAC.20DOIs/near/495366383\">said</a>:</p>\n<blockquote>\n<p>Would you be willing to share your scraping program and access to the crossref membership to, say, me, in case someone else can get the xml generated sooner than you find a chance?</p>\n</blockquote>\n<p>Oh, sorry I missed this! I think right now I'm feeling a certain blend of guilt and pride that makes me want to get at least something working myself before I share it, but eventually my plan is to post it somewhere (semi-?)publically and I'm sure better programmers than me will be able to improve upon it.</p>",
        "id": 501441294,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1740369815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/TAC.20DOIs/near/501430466\">said</a>:</p>\n<blockquote>\n<p>Is there going to be some kind of verification process for the scraped data? I know manual verification of metadata isn't everyone's cup of tea (and there's a lot to do! Maybe it's infeasible), but I for one quite enjoy such tasks as a way of distracting myself. Get enough grad students and they can pick a few papers each and verify the bibliography scraped correctly in each one, and the process can be done without too much stress...</p>\n</blockquote>\n<p>I wasn't planning for there to be anything this formal. I was going to randomly choose ~20 papers from across the TAC catalogue and check those by hand -- if they work I'm happy to count it as good. In my tests, though, (with an admittedly small fraction of the TAC papers), it basically works completely correctly for most of the bibliography. The biggest annoyance is if you cite a book, often the book and its chapters have separate DOIs, but defaulting to \"always choose the whole book\" seems reasonable to me and lets the fuzzy match keep working</p>",
        "id": 501441571,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1740369984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span> <a href=\"#narrow/stream/229111-community.3A-general/topic/TAC.20DOIs/near/501441294\">said</a>:</p>\n<blockquote>\n<p>Oh, sorry I missed this! I think right now I'm feeling a certain blend of guilt and pride that makes me want to get at least something working myself before I share it, but eventually my plan is to post it somewhere (semi-?)publically and I'm sure better programmers than me will be able to improve upon it.</p>\n</blockquote>\n<p>OK. Well, I’d think about setting yourself a deadline by which you’ll share whatever you’ve got. Lots of people have an interest in this project and would love to help or at least see it finished; don’t let it get too tied up in your own psychodrama.</p>",
        "id": 501625041,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740423470
    },
    {
        "content": "<p>I'm a bit put off by the word psychodrama, haha. But I do take your point, and the project is more important than my feelings about it (I was thinking more about this after sending my message last night, that the instinct to do it myself is a pretty immature one). If I don't get it finished up this week (I have a lot of travel this week, and am planning to spend most of it hacking away at this) I'll post what I have provided it's ok with Geoff Crutwell (I'm sure it will be)</p>",
        "id": 501636153,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1740427102
    },
    {
        "content": "<p>Sorry, that word probably comes across as something like \"you're being psycho and dramatic!\" But I just meant it in the sense that we're all always dealing with an internal story, e.g. the guilt and pride you're grappling with.</p>",
        "id": 501636580,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740427237
    },
    {
        "content": "<p>Out of curiosity, who would be interested in helping double check the relevant metadata?</p>\n<p>The code is very close to working, and my original plan was to \"spot check\" it randomly, but if there's enough interest we can possibly do more. There's about 1000 papers that we have to go through, and for each one we'll want to double check</p>\n<ul>\n<li>correct title</li>\n<li>correct authors</li>\n<li>correct abstract</li>\n<li>correct bibliography</li>\n</ul>\n<p>Checking title/authors should go pretty quickly, so I think it's doable to actually verify all of those (those are also the most important parts). The abstract is unlikely to be broken since it's easy to parse out something living inside \\begin{abstract} and \\end{abstract}... The bibliography is going to be annoying, and unless there's a HUGE outpouring of support I suggest we spot check those.</p>\n<p>Can you hit this with a <span aria-label=\"raising hand\" class=\"emoji emoji-1f64b\" role=\"img\" title=\"raising hand\">:raising_hand:</span> if you're willing to help out?</p>\n<p>This week is finals week and next week is spring break, and I'm basically going to do nothing except DOI stuff until teaching starts back up, so this will hopefully be finished soon! (Sorry to keep saying that, but I keep believing it, haha)</p>",
        "id": 506577418,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1742330831
    },
    {
        "content": "<p>What does the checking entail: comparing the pdf/abstract page to data in something like a spreadsheet?</p>\n<p>And what does checking the bibliography mean precisely? That the cited paper's data (title, authors, journal, volume, issue, year, pages ... doi?) is correct, compared to the cited journal's information on the paper?</p>",
        "id": 506587935,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1742334860
    },
    {
        "content": "<p>Yeah exactly, I would make a pdf or something that's one page per article (and probably one pdf per volume). Each page would say the title, authors, abstract, and for each citation either \"Not Found\" or a DOI/title/authors triple... </p>\n<p>Then we would want to check everything agrees with the actual paper's title/authors/abstract/bibliography</p>",
        "id": 506604777,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1742343034
    },
    {
        "content": "<p>I would shy away from making a pdf like that, and have the text that's being checked in as raw a format as possible. People might want to write their own scripts to scrape the TAC website and see if they get the same answer :-)</p>",
        "id": 506624834,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1742354315
    },
    {
        "content": "<p>Nothing wrong with a CSV ...</p>",
        "id": 506624864,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1742354337
    },
    {
        "content": "<p>I mean, whether I put it in a CSV or a PDF, it'll be the same auto-generated information, haha. Like I would literally take the information I use to make the XML file that gets sent to crossref and just... put it in a PDF for readability. But yeah a CSV would be just as easy to do!</p>",
        "id": 506794201,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1742406859
    },
    {
        "content": "<p>It's just nice if somebody might want to use a program to support some of the reading rather than pure Mk I eyeballs.</p>",
        "id": 506799224,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1742408436
    },
    {
        "content": "<p>Ok, so it took longer than the weekend. BUT. I think everything is working now!</p>",
        "id": 521487958,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737396
    },
    {
        "content": "<p>Here's a few volumes (two newer ones and one older one, volumes 39, 40, and 15) which I've compiled into the XML I'll submit to crossref to actually make the DOIs, as well as human readable .txt files of all the parsing that got done and a big CSV of the major details that's also contained in the individual XML files</p>",
        "id": 521488054,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737450
    },
    {
        "content": "<p>If people are really interested in helping out with this, I'd love if you could tell me whether this looks good to you, compared to the actual metadata which should be attached to these volumes</p>",
        "id": 521488081,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737488
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/XI63bOq3H5dDxmLmV1rkwsIl/15.txt\">15.txt</a><br>\n<a href=\"/user_uploads/21317/VIVk59iyEposJOxiX2zRHlIN/15.xml\">15.xml</a><br>\n<a href=\"/user_uploads/21317/R1rYfwhK_By0sItcEznWFkwx/39.txt\">39.txt</a><br>\n<a href=\"/user_uploads/21317/5Jh8j6aq0Aq7UFfCHjW4aA4d/39.xml\">39.xml</a><br>\n<a href=\"/user_uploads/21317/GwkNJglmBYEl8RF1IqYQBrm5/40.txt\">40.txt</a><br>\n<a href=\"/user_uploads/21317/eY49DGbdtQe0jtGElKuwG3_D/40.xml\">40.xml</a><br>\n<a href=\"/user_uploads/21317/sZlAIuOR_bN8DpixbAe1BOmH/master-DOI-list.csv\">master-DOI-list.csv</a></p>",
        "id": 521488110,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737515
    },
    {
        "content": "<p>(also, I'm now realizing I forgot to turn the DOI printing back on in the human readable file... Sorry about that. You can still find that information in the CSV or XML files, though!)</p>",
        "id": 521488227,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737600
    },
    {
        "content": "<p>oh, and the .csv file is tab separated rather than comma separated because it's really common to have commas in titles/abstracts</p>",
        "id": 521488375,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737772
    },
    {
        "content": "<p>Oh, and also obviously these won't be the final DOIs. So don't go citing them yet, haha</p>",
        "id": 521488503,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1748737916
    },
    {
        "content": "<p>( <span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span>  and <span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> in particular, did either of you want to help with doublechecking the metadata, at least for these volumes? It's ok if not (I'm pretty sure it's mostly right) or if \"yes, but it'll take a while\" (I definitely took a while), but I'd like to know if it's at least something you're planning to do so I can either wait or go ahead and post everything to crossref to actually make the DOIs)</p>",
        "id": 522630894,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1749140913
    },
    {
        "content": "<p>I will look at it, but rather busy right now (last night was writing a article about a tv show for a website, time sensitive release; got to do mandatory online advisor training to keep being my grad student's advisor;  paid job big deadline etc etc)</p>",
        "id": 522670850,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1749158267
    },
    {
        "content": "<p>Thanks very much for this, Chris! Am I understanding right that the suggestion is to look at the .txt files using eyeballs and compare to the TAC display of some corresponding articles to be sure the various metadata was copied correctly? You presumably scraped this stuff with a script though, no? I'd sooner check the script and test it than just scan my eyes over the output.</p>",
        "id": 522841747,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1749240869
    },
    {
        "content": "<p>The ideal situation, though I can understand this might not be fully achievable, would be to have a git repo containing everything that would be needed to reproduce what you did in principle, as well as your proposed outputs.</p>",
        "id": 522841876,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1749240936
    },
    {
        "content": "<p>The main thing that I want to make sure is correct are the author names and the bibliographies. </p>\n<p>The author names should be pretty easy to double check automatically -- there's easily parse-able &lt;metadata&gt; tags on each of the TAC paper pages, one of which gives the authors. So it should be quite easy to compare the authors of each paper in the csv output of my script to the authors of the correpsonding paper already on the TAC website. I was actually planning to do this myself.</p>\n<p>The bibliography is the thing that took the most time on my end, and is the thing that we don't currently have metadata about to check against. I don't have any great ideas for double checking it, though, so I would be open to hearing any ideas you all have!</p>",
        "id": 522865927,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1749262400
    },
    {
        "content": "<p>I'm perfectly happy to share my code, I'll put it on github as soon as I clean up some comments. I told Geoff (Cruttwell) that I wouldn't freely share the tex files which I'm parsing, but if you give it any tex file that uses the <code>tac.cls</code> file, it should work on that.</p>",
        "id": 522866136,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1749262698
    },
    {
        "content": "<p>I was randomly poking around 15.txt and saw<br>\n'Reflective Kleislisubcategories of the category of  Eilenberg-Moore algebras for factorization monads'</p>\n<p>which has a missing space in the title, and also all its citations have \\newblock a million times, whereas other don't. I have no clue if the consistency of the format for citations matters here.</p>",
        "id": 522869623,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1749267930
    },
    {
        "content": "<p>Thanks! I'll take a look at that one and see what's causing that problem</p>",
        "id": 522872395,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1749271695
    },
    {
        "content": "<p>Thanks so much for doing this work <span class=\"user-mention\" data-user-id=\"278546\">@Chris Grossack (she/they)</span> !</p>",
        "id": 523587283,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1749655820
    },
    {
        "content": "<p>I just had a conversation about this with some friends at CT2025, and I wanted to check back in to see if anyone else has had time to look at these? I think I'll probably wait until the end of July for feedback and then I'll make it official. It's possible we'll have some small metadata errors, but if that happens people can let me know and I'll fix them as they turn up ^_^</p>",
        "id": 528736513,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1752525571
    },
    {
        "content": "<p>DOIs are live! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span><span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>\n<p>You can see the articles in crossref here: <br>\n<a href=\"https://search.crossref.org/search/works?q=theory+and+applications+of+categories&amp;from_ui=yes\">https://search.crossref.org/search/works?q=theory+and+applications+of+categories&amp;from_ui=yes</a></p>\n<p>Geoff and I are working on updating the website to include the DOIs on all the abstract pages (so that they're easier to find), but at this point everything is at least in-theory cite-able ^_^</p>",
        "id": 537574809,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1756948529
    },
    {
        "content": "<p>Obviously it wasn't possible to look at all the metadata myself, so the plan is to community outsource the verification. Once we get the new abstract landing pages posted, it will be really obvious what metadata is broken (since the code remade the abstract files using the metadata associated to the DOI). I've made a document for anyone who wants to help double check everything. It should be mostly right, and I'm the one who has to actually go in and fix things, so it should be pretty quick on the part of any volunteers! You can find the document here if you're interested in a preview:</p>\n<p><a href=\"https://docs.google.com/document/d/1I4HT2c3IgWDiCpg8bbDckqqmcbuhROezXPCU4_f_BPA/edit?usp=sharing\">https://docs.google.com/document/d/1I4HT2c3IgWDiCpg8bbDckqqmcbuhROezXPCU4_f_BPA/edit?usp=sharing</a></p>\n<p>but again <strong>this isn't relevant until we get the website updated</strong>. I'll make another announcement when that happens</p>",
        "id": 537575017,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1756948731
    },
    {
        "content": "<p>Thanks so much!</p>",
        "id": 537618101,
        "sender_full_name": "John Baez",
        "timestamp": 1756974844
    },
    {
        "content": "<p><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span> great job, thank you so much!</p>",
        "id": 537799307,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1757052434
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (she/they)</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/TAC.20DOIs/near/537574809\">said</a>:</p>\n<blockquote>\n<p>You can see the articles in crossref here: <br>\n<a href=\"https://search.crossref.org/search/works?q=theory+and+applications+of+categories&amp;from_ui=yes\">https://search.crossref.org/search/works?q=theory+and+applications+of+categories&amp;from_ui=yes</a></p>\n</blockquote>\n<p>I used this search to find a DOI for Marco Grandis's \"Finite sets and symmetric simplicial sets\": <a href=\"https://doi.org/10.70930/tac/8s7w6fcb\">https://doi.org/10.70930/tac/8s7w6fcb</a>. However, the DOI points to <a href=\"http://www.tac.mta.ca/tac/volumes/08/8/08-08abs.html\">http://www.tac.mta.ca/tac/volumes/08/8/08-08abs.html</a>, which does not currently exist; the paper page is actually at <a href=\"http://www.tac.mta.ca/tac/volumes/8/n8/8-08abs.html\">http://www.tac.mta.ca/tac/volumes/8/n8/8-08abs.html</a>.</p>\n<p>I'm not in the loop on this process so I apologize if this is expected behavior at this point :) Thanks a lot for working on this!</p>",
        "id": 544702537,
        "sender_full_name": "Evan Cavallo",
        "timestamp": 1760434900
    },
    {
        "content": "<p>Of course! Volumes 1-10 have a different folder structure, as you've noticed. Sometime soon we're going to make them match the rest of the volumes (with symlinks for backwards compatibility), but I had to switch to working on my NSF postdoc application.</p>",
        "id": 544768019,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1760452816
    },
    {
        "content": "<p>This grant application is due literally tomorrow, though, so pretty soon I'll be able to devote a weekend to making volumes 1-10 fit the current format, and make a few updates to metadata that people have pointed out to me</p>",
        "id": 544768531,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1760452935
    },
    {
        "content": "<p>Okay, thanks for the explanation!</p>",
        "id": 544786303,
        "sender_full_name": "Evan Cavallo",
        "timestamp": 1760457186
    }
]