[
    {
        "content": "<p>Maybe we have finally tracked it down...</p>\n<p><a href=\"https://arxiv.org/abs/2007.14505\">https://arxiv.org/abs/2007.14505</a></p>\n<blockquote>\n<p>Finally, we prove a version of the homotopy hypothesis for the infinity-groupoids in the weak model, and exhibit a specific mistake in a proof by Kapranov and Voevodsky that had previously been refuted indirectly. </p>\n</blockquote>\n<p>Though I seem to think there was another paper not too long ago that also claimed to have found the specific mistake.</p>",
        "id": 205455181,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1596099137
    },
    {
        "content": "<p>Hi, a while ago we had a discussion about this here, <a href=\"#narrow/stream/229136-theory.3A-category.20theory/topic/Homotopy.20hypothesis/near/192906371\">in this thread</a> :)<br>\nI've known what the error was for a while, but that discussion made me realise that there could be some interest in having it published somewhere. So I wrote it down in this paper.</p>",
        "id": 205457753,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1596101114
    },
    {
        "content": "<p>Anyway, I'll take the chance to say that I'd be happy to get comments or feedback on the paper!</p>",
        "id": 205457896,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1596101213
    },
    {
        "content": "<p>This started as a revision of an older draft but then there was a lot of new content, a lot of old content that didn't fit anymore, and I made it a new one.</p>\n<p>The main purpose is to give a framework for “higher-dimensional rewriting”, by which I mean broadly all sorts of diagrammatic manipulations (such as “cutting and pasting” diagrams) in all dimensions, which is nearly as expressive as polygraphs/strict higher categories but avoids the pitfalls of strictness (unsoundness for homotopical algebra). <br>\nSo I hope it can be useful to applied CT when it is forced to go higher than dimensions 2 or 3, with their safety net of coherence and strictification theorems.</p>",
        "id": 205458516,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1596101687
    },
    {
        "content": "<p>It's a long paper, so when I have time I'd like to write a brief “user's manual” on how to formalise diagrams in this framework. Maybe in time for the next ACT conference...</p>",
        "id": 205458983,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1596102085
    }
]