[
    {
        "content": "<p>I'm writing a regular column for the <em>Notices of the American Mathematical Society</em>, and here is a draft of my second column:</p>\n<ul>\n<li><a href=\"http://math.ucr.edu/home/baez/brownian.pdf\">The Brownian map</a>.</li>\n</ul>\n<p>It's about a really cool \"random surface\", sort of the 2d analogue of Brownian motion.   I'd really appreciate it if anyone could read this and comment about things that are hard to understand.    I guess it's supposed to assume a grad-level course or two on topology and real analysis (mainly measure theory and Hilbert spaces).</p>",
        "id": 213723325,
        "sender_full_name": "John Baez",
        "timestamp": 1603051886
    },
    {
        "content": "<p>It's just two pages long.</p>",
        "id": 213723336,
        "sender_full_name": "John Baez",
        "timestamp": 1603051906
    },
    {
        "content": "<p>The paragraph starting </p>\n<blockquote>\n<p>But this result is just a small part of something much bigger:  is deliberately a bit vaguer and requires knowing what a Riemann surface is - it's just supposed to give a taste of how this subject is connected to some other ideas.</p>\n</blockquote>",
        "id": 213723420,
        "sender_full_name": "John Baez",
        "timestamp": 1603051994
    },
    {
        "content": "<p>I like it! I must admit, I had to google what exactly the \"conformal structure\" of a Riemann surface was, but maybe this is something that other people have generally heard of.</p>",
        "id": 213723523,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1603052137
    },
    {
        "content": "<p>I'll think about it.   </p>\n<p>Btw, conformal field theory, which is the basis of string theory, is about quantum field theories on Riemann surfaces that are invariant under automorphisms of those Riemann surfaces (aka \"conformal transformations\").</p>",
        "id": 213723986,
        "sender_full_name": "John Baez",
        "timestamp": 1603052749
    },
    {
        "content": "<p>Maybe saying <em>that</em> would be good.</p>",
        "id": 213724084,
        "sender_full_name": "John Baez",
        "timestamp": 1603052839
    },
    {
        "content": "<p>Maybe just a line about how conformal transformations preserve angles, but not necessarily scale? So a sphere of radius r and a sphere of radius R are not isometric, but they are conformally equivalent? Or the good old Mercator projection being a conformal transformation from a twice-punctured sphere to a cylinder? And then the conformal structure is an equivalence class of metrics under these transformations?</p>",
        "id": 213730558,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1603061968
    },
    {
        "content": "<p>Or perhaps a more concrete example? The cylinder has two simply-described conformal structures: one coming from the product of the circle and the real line, the other coming from the Mercator projection. They are the same real surface, but different Riemann surfaces-with-conformal-structure.</p>",
        "id": 213730659,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1603062074
    },
    {
        "content": "<p>These columns have to be pretty short, basically two pages.  So, the most I could do is add a sentence or two reminding people what a conformal structure on a Riemann surface is.</p>",
        "id": 213739759,
        "sender_full_name": "John Baez",
        "timestamp": 1603077418
    }
]