[
    {
        "content": "<p>I've wanted to know for some time now: how much of volume 3 of The Elephant is done? In 2013 I heard that it was about 40% written (someone sat next to Peter Johnstone at the CT2013 dinner and pumped him for info while he was... talkative). The Synthetic Differential Geometry section was at least drafted, as PTJ had taught a class on it at Cambridge. The notes were not shared in any way that I know of, unfortunately. I suspect the work of PTJ's student Zhen Lin Low on simplicial objects was meant to feed into the homotopy theory section. I'd love to ask the man himself, but I doubt I'd get an answer. Is there anyone with connections to Cambridge who has info? Or even just more recent rumours?</p>",
        "id": 192209801,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585542038
    },
    {
        "content": "<p>I have no information; I should have asked him at CT2019.</p>",
        "id": 192209880,
        "sender_full_name": "John Baez",
        "timestamp": 1585542145
    },
    {
        "content": "<p>My worry is that he is trying to be completely comprehensive, and the growth of our knowledge of the homotopy theory of simplicial sheaves in the past decade and a half has been immense. I'm not sure he can keep up with current research in that area. Just getting all the 1-topos theory down will be a big service.</p>",
        "id": 192209963,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585542261
    },
    {
        "content": "<p>Or he's hoping to do a second edition of volumes 1 and 2, updating those as well :-o</p>",
        "id": 192209973,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585542278
    },
    {
        "content": "<p>The first two volumes took ~15 years from rough outline as a table of contents to publication. It's been 18 years that he's been working on the third. So maybe it will be two volumes, one each for sections E and F? That would be cool, but in that case it would be good to get at least one of them out before too long!</p>",
        "id": 192210074,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585542428
    },
    {
        "content": "<p>As an absolute noob on the area i have nothing to say other than what a great name for the streeam.</p>",
        "id": 192211257,
        "sender_full_name": "nadia esquivel márquez",
        "timestamp": 1585544254
    },
    {
        "content": "<p>I somehow really doubt Johnstone is trying to write about anything besides 1-topos theory.</p>",
        "id": 192213135,
        "sender_full_name": "John Baez",
        "timestamp": 1585546638
    },
    {
        "content": "<p>Sure, but he does have sections in the proposed contents on model structures (plural!) on simplicial sets, and on sheaves, and also a chapter on cohomology. This seems like at least the Joyal model structure could get a look in, since that was in the air even when the original book outline was written.</p>",
        "id": 192215874,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585550167
    },
    {
        "content": "<p>In the intro PTJ does mention that he was working on material from Part F even before the first two volumes were published, which is a good sign.</p>",
        "id": 192215892,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585550203
    },
    {
        "content": "<p>Oh, well. Hopefully someone that he trusts can bug him for info and let us know if there is an ETA, or at least give a progress report.</p>",
        "id": 192215912,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585550235
    },
    {
        "content": "<p>You could ask his PhD students - I hung out with them at the Postgraduate Conference in Category Theory and its Applications in Leicester last year and I think they had seen some excerpts of some sort (not sure if it was meant to be part of volume 3 though)</p>",
        "id": 192218131,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1585552326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> ooh, good idea. Do you know who they are? PTJ's webpage is AWOL, and the Cambridge maths department website is woeful. I can't even find a list of current PhD students, let alone those attached to a specific supervisor.</p>",
        "id": 192227605,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585558601
    },
    {
        "content": "<p>The ones I met are Peter Faul and Jose Vitor Paiva Miranda De Siqueira, if I am not wrong</p>",
        "id": 192227826,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1585558739
    },
    {
        "content": "<p>PJ send me his drafts on synthetic differential geometry and synthetic domain theory. These seem ~ 60% percent done. I don't know about the homotopy part.</p>",
        "id": 192229135,
        "sender_full_name": "Alexander Gietelink Oldenziel",
        "timestamp": 1585559595
    },
    {
        "content": "<p>synthetic domain theory <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 192231573,
        "sender_full_name": "sarahzrf",
        "timestamp": 1585560979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> excellent, thanks.</p>\n<p><span class=\"user-mention\" data-user-id=\"278660\">@Alexander Gietelink Oldenziel</span> thanks. I'm surprised it's so low, given what I had heard. But that was complete rumour.</p>",
        "id": 192234475,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1585562484
    }
]