[
    {
        "content": "<p>My name is Ben Sprott and I am the inventor and developer at <a href=\"http://www.thecanonworks.com\">TheCanonworks</a>.</p>\n<p>TheCanonworks is a social media website that aims at helping people to form small research communities focusing on discrete subjects that interest them, organizing their reasoning about the world, and allowing for collaborative exploration of topics.  The site provides for the highest possible quality of interaction, while remaining quite loose in its structure and ease of use.  We believe that it will appeal to everyone, from accomplished Academics, to average people.</p>\n<p>The site functions by organizing interactions according to how Academics interact through familiar Journaling Systems.  Furthermore, we believe that, by structuring interactions this way, average users will have an unparalleled experience of interaction with information, ideas and other people.  In short, interactions are structured through a voting process that ensures that people respond to each other strictly in the ways that Academics respond while citing each other in their publications.</p>\n<p>I am inviting Academics to start to use the site, learn how it works, and begin training subsequent echelons of users and voters.  With a large number of voters, TheCanonworks will form an engine that will help people to have the highest quality of curated interactions.  This curation, we believe, will be a solution to the problems of division, misinformation, disinformation, foreign influence, and the assault on consensus which we are seeing around the world.  By becoming members of TheCanonworks, posting, replying and especially by voting, your efforts will directly aid in the bolstering of Democracy and Reason in your country and elsewhere.</p>\n<p>Thanks for reading and please visit us at <a href=\"http://thecanonworks.com\">TheCanonworks</a>.</p>",
        "id": 230813392,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1616042832
    },
    {
        "content": "<p>The one real way the experience the site properly is to create an account and try all the buttons.</p>",
        "id": 230861571,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1616073742
    },
    {
        "content": "<p>I will be giving a demo for TheCanonworks next week.</p>\n<p>Here is a zoom link:</p>\n<p>Ben Sprott is inviting you to a scheduled Zoom meeting.</p>\n<p>Topic: TheCanonworks Demo<br>\nTime: Mar 24, 2021 11:00 AM Eastern Time (US and Canada)</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://us02web.zoom.us/j/85242572431?pwd=RkZKRHhHdjREdEtCYkRXdmlXZ0NnQT09\">https://us02web.zoom.us/j/85242572431?pwd=RkZKRHhHdjREdEtCYkRXdmlXZ0NnQT09</a></p>\n<p>Meeting ID: 852 4257 2431<br>\nPasscode: 891078<br>\nOne tap mobile<br>\n+19294362866,,85242572431#,,,,*891078# US (New York)<br>\n+12532158782,,85242572431#,,,,*891078# US (Tacoma)</p>\n<p>Dial by your location<br>\n        +1 929 436 2866 US (New York)<br>\n        +1 253 215 8782 US (Tacoma)<br>\n        +1 301 715 8592 US (Washington DC)<br>\n        +1 312 626 6799 US (Chicago)<br>\n        +1 346 248 7799 US (Houston)<br>\n        +1 669 900 6833 US (San Jose)<br>\nMeeting ID: 852 4257 2431<br>\nPasscode: 891078<br>\nFind your local number: <a href=\"https://us02web.zoom.us/u/kqdmjKbhB\">https://us02web.zoom.us/u/kqdmjKbhB</a></p>",
        "id": 230873204,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1616077998
    }
]