[
    {
        "content": "<blockquote>\n<p>Dear Friends of Topos,</p>\n<p>As 2020 comes to a close, we at Topos thank you for your support and partnership.</p>\n<p>It's been a challenging year for all our communities, and one full of reminders of the ways our interconnected world is changing, from the disruption of the pandemic, to the increasing spotlight on social media, to the now everyday ways we connect with each other remotely. </p>\n<p>In response, the role of science and technology in navigating the complexity of our world has only become clearer. We need better computational tools for rapidly modelling pandemics. We need new methods for true interdisciplinary collaboration that can balance the multifaceted health and economic challenges of COVID-19. And as communications and AI technology becomes ever more deeply interwoven with our daily lives, we need confidence that this infrastructure can be trusted to enable human flourishing.</p>\n<p>And so we begin 2021 imbued with an extra sense of purpose, as we shape technology for public benefit through a foundational understanding of connection and integration.</p>\n<p>In the new year we're delighted to bring on our first scientific researchers: Valeria de Paiva, Evan Patterson, Tim Hosgood, Toby St Clere Smithe, and Johannes Kleiner. While we will all begin by working remotely, we look forward to soon working together and hosting seminars at our Berkeley, California Headquarters and our satellite campus in Oxford, UK.</p>\n<p>In addition to the humbling generosity of you all, we'll be supported in over USD1.3M in research grants, to study Functorial Dynamics and Interaction from the US Air Force Office of Scientific Research; Foundations for AI Safety from the Survival and Flourishing Fund; Categorical Theories of Consciousness from the Foundational Questions Institute; and a contract to deliver open-source software for Model-Based Scientific Computing from Georgia Tech Research Institute. </p>\n<p>We're grateful for the roles you all have played in supporting Topos, from your generosity with your time, expertise, and resources, to your enthusiasm and encouragement to pursue our vision of a better future.</p>\n<p>Be well, stay safe, and see you all in the new year!</p>\n<p>Brendan Fong and David Spivak</p>\n<p>Founders, Topos Institute</p>\n<p><a href=\"https://topos.institute\">https://topos.institute</a></p>\n</blockquote>",
        "id": 221417400,
        "sender_full_name": "John Baez",
        "timestamp": 1609621638
    },
    {
        "content": "<p>related to this, David Spivak is pencilled in as the first speaker for the new Topos Colloquium, which should hopefully be starting on the 4th of February! he'll be speaking about the main vision and goals behind the Topos Institute, as well as the role of applied category theory more generally as a tool for positive (in many senses of the word) <br>\ndevelopment <a href=\"https://topos.site/seminars/\">https://topos.site/seminars/</a></p>",
        "id": 221426174,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1609635561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span>: is there a public calendar that could be added to the <a href=\"https://teamup.com/ksfss6k4j1bxc8vztb\">CT seminars</a> calendar?</p>",
        "id": 221426433,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1609635997
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/221426433\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span>: is there a public calendar that could be added to the <a href=\"https://teamup.com/ksfss6k4j1bxc8vztb\">CT seminars</a> calendar?</p>\n</blockquote>\n<p>not yet, but this is the sort of thing that i'm in charge of sorting out! is it enough to just create e.g. a google calendar?</p>",
        "id": 221426575,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1609636215
    },
    {
        "content": "<p>Yes, if you create a Google Calendar, then you can add it as one of the sources for the Teamup calendar.</p>",
        "id": 221426768,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1609636604
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 221430647,
        "sender_full_name": "John Baez",
        "timestamp": 1609643597
    },
    {
        "content": "<p>who do i need to contact for this? the publicly available calendar can be found at <a href=\"https://calendar.google.com/calendar/u/1?cid=Y18zZWFpazZ1ZzR0MjVzNTFjbzJ0ODhpMnB1OEBncm91cC5jYWxlbmRhci5nb29nbGUuY29t\">https://calendar.google.com/calendar/u/1?cid=Y18zZWFpazZ1ZzR0MjVzNTFjbzJ0ODhpMnB1OEBncm91cC5jYWxlbmRhci5nb29nbGUuY29t</a></p>",
        "id": 221453710,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1609684889
    },
    {
        "content": "<p>Great Tim, I'll add it to the calendar.</p>",
        "id": 221457521,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1609689877
    },
    {
        "content": "<p>(if someone needs the ICS feed, here it is <a href=\"https://calendar.google.com/calendar/ical/c_3eaik6ug4t25s51co2t88i2pu8%40group.calendar.google.com/public/basic.ics\">https://calendar.google.com/calendar/ical/c_3eaik6ug4t25s51co2t88i2pu8%40group.calendar.google.com/public/basic.ics</a>)</p>",
        "id": 221457688,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1609690097
    },
    {
        "content": "<p>Some good news!</p>\n<p>First, one of the Topos Institute's biggest donors has given them a bunch more money.</p>\n<p>Second, they've voted to add Wesley Phoa to their board of directors.   Phoa did his Ph.D. with Martin Hyland in 1991, on <em>Domain Theory in Realizability Toposes</em>.   Now he does different things:</p>\n<blockquote>\n<p>Wesley K.-S. Phoa is a fixed-income portfolio manager at Capital Group. As a fixed-income investment analyst at Capital, he covers U.S. government-sponsored entities. He is also an economist, and follows U.S. monetary policy, macro-prudential regulation and fixed-income quantitative research. He has 21 years of investment experience and has been with Capital Group for 16 years. Prior to joining Capital, he was director of research with Capital Management Sciences and a quantitative analyst with Deutsche Bank in Australia. He holds a PhD in pure mathematics from Trinity College at the University of Cambridge and a bachelor’s degree with honors from the Australian National University. He is an elected member of the Conference of Business Economists and the International Conference of Commercial Bank Economists. Wesley is based in Los Angeles.</p>\n</blockquote>\n<p>But he's very interested in applied category theory.   I'm going to talk to him next week on future directions that the Topos Institute should take.</p>",
        "id": 263678860,
        "sender_full_name": "John Baez",
        "timestamp": 1638586427
    },
    {
        "content": "<p>(and if you're interested in some of the thoughts and plans of other members of Topos, you can check out <a href=\"https://topos.site/blog/2021/12/topos-in-2021-a-retrospective/\">https://topos.site/blog/2021/12/topos-in-2021-a-retrospective/</a> !)</p>",
        "id": 263710818,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638628020
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/263678860\">said</a>:</p>\n<blockquote>\n<p>Some good news!</p>\n<p>First, one of the Topos Institute's biggest donors has given them a bunch more money.</p>\n<p>Second, they've voted to add Wesley Phoa to their board of directors.   Phoa did his Ph.D. with Martin Hyland in 1991, on <em>Domain Theory in Realizability Toposes</em>.   Now he does different things:</p>\n<blockquote>\n<p>Wesley K.-S. Phoa is a fixed-income portfolio manager at Capital Group. As a fixed-income investment analyst at Capital, he covers U.S. government-sponsored entities. He is also an economist, and follows U.S. monetary policy, macro-prudential regulation and fixed-income quantitative research. He has 21 years of investment experience and has been with Capital Group for 16 years. Prior to joining Capital, he was director of research with Capital Management Sciences and a quantitative analyst with Deutsche Bank in Australia. He holds a PhD in pure mathematics from Trinity College at the University of Cambridge and a bachelor’s degree with honors from the Australian National University. He is an elected member of the Conference of Business Economists and the International Conference of Commercial Bank Economists. Wesley is based in Los Angeles.</p>\n</blockquote>\n<p>But he's very interested in applied category theory.   I'm going to talk to him next week on future directions that the Topos Institute should take.</p>\n</blockquote>\n<p>Wow! I have recently been studying Wesley Phoa's thesis...</p>",
        "id": 263712435,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1638629780
    },
    {
        "content": "<p>Is there a possibility that Topos gets into econ stuff?</p>",
        "id": 263763443,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1638703265
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/263678860\">said</a>:</p>\n<blockquote>\n<p>Second, they've voted to add Wesley Phoa to their board of directors.   Phoa did his Ph.D. with Martin Hyland in 1991, on <em>Domain Theory in Realizability Toposes</em>.   Now he does different things:</p>\n</blockquote>\n<p>Interesting. I worked with Wesley at Capital Group <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span> </p>\n<p>Say \"Hi\" for me <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 263793706,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1638744615
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/263763443\">said</a>:</p>\n<blockquote>\n<p>Is there a possibility that Topos gets into econ stuff?</p>\n</blockquote>\n<p>Not in the near term: nobody there is working on that!  They are pushing three main projects: categories for scientific computing (with my favorite application being epidemiology), polynomial functors, and natural language processing for computer-assisted math research.</p>",
        "id": 263806456,
        "sender_full_name": "John Baez",
        "timestamp": 1638763094
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"367398\">Eric Forgy</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/263793706\">said</a>:</p>\n<blockquote>\n<p>Say \"Hi\" for me <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>\n</blockquote>\n<p>Will do!</p>",
        "id": 263806476,
        "sender_full_name": "John Baez",
        "timestamp": 1638763155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Topos.20Institute.20news/near/263806456\">said</a>:</p>\n<blockquote>\n<p>Not in the near term: nobody there is working on that!  They are pushing three main projects: categories for scientific computing (with my favorite application being epidemiology), polynomial functors, and natural language processing for computer-assisted math research.</p>\n</blockquote>\n<p>Ah, but what if I told you that polynomial functors <em>is</em> econ stuff? <span aria-label=\"smiling devil\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling devil\">:smiling_devil:</span></p>",
        "id": 263838198,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1638790915
    },
    {
        "content": "<p>That's category theory, where everything is everything :P</p>",
        "id": 263842003,
        "sender_full_name": "Jade Master",
        "timestamp": 1638793460
    },
    {
        "content": "<p>Also the applied decorated cospans in Julia stuff is just waiting to be applied to operations research</p>",
        "id": 263846243,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1638795765
    },
    {
        "content": "<p>Well, then the Topos Institute <em>is</em> doing econ stuff.</p>",
        "id": 263848024,
        "sender_full_name": "John Baez",
        "timestamp": 1638796749
    },
    {
        "content": "<p>If David Spivak thinks he's working on econ, then the Topos Institute is working on econ.</p>",
        "id": 263848169,
        "sender_full_name": "John Baez",
        "timestamp": 1638796826
    },
    {
        "content": "<p>The applied decorated cospans in Julia stuff is being aimed at <a href=\"https://topos.institute/model-based-computing\">model-based computing</a>.   That <em>could</em> include econ, but in fact we have a team of about 7 people meeting every other week talking about applications to epidemiology, and I am pushing this as the \"killer app\" that will prove the Topos Institute can create software that does things non-category-theorists will find exciting.   I'm also meeting with <a href=\"https://www.cs.usask.ca/faculty/osgood/\">Nate Osgood</a> and his grad student Xiaoyan Li and Evan Patterson on this project.</p>",
        "id": 263848875,
        "sender_full_name": "John Baez",
        "timestamp": 1638797145
    },
    {
        "content": "<p>The Topos Institute has a new director of research!   Brendan Fong writes:</p>\n<blockquote>\n<p>I'm delighted to announce that Shaowei Lin will be joining Topos as Director of Research on May 11th.</p>\n<p>We began exploring a Director of Research role last August, in order to provide new scientific leadership, administration, and coordination for our growing team. Early this year we confirmed funding for the role and posted our Call for Applications, which contains further details about the position.</p>\n<p>Shaowei is the ideal person to fill this role. Shaowei's experience spans mathematical research (including as Assistant Professor in Engineering Systems and Design at Singapore University of Technology and Design), launching and leading scientific start-ups (Head of AI at Awecom), and research administration (Deputy Head (Research) of the Sense-making Group at the Institute of Infocomm Research, Singapore). In addition, through his career he has co-led over USD10M of research grant funding. He thus brings a wealth of expertise across the exact mix of duties underpinning our Director of Research role. Shaowei completed his PhD at UC Berkeley under the supervision of Bernd Sturmfels, and holds a BS in Mathematics from Stanford.</p>\n<p>Shaowei has long been a supporter and advocate for Topos, reaching out in early 2021 when we were just beginning operations. He spoke about program synthesis in the Topos Colloquium in April 2021, and has visited Topos Berkeley for a number of events, including Dana Scott's 90th birthday celebration, and our recent Advisory Council Retreat. As many of you know, we've been in talks with Shaowei for a few months now. This week, Shaowei's visa to work in this role was approved, and so we are very pleased to now be able to confirm that Shaowei will be joining us in two weeks, starting Thursday May 11th.</p>\n<p>At the same time, David Spivak will be transitioning to a new, dual role as Senior Scientist and Institute Fellow. This role reflects a greater focus on leading his connected intelligence research agenda at Topos, centered around his new $1.8M AFOSR proposal Structure and Dynamics of Working Language. As Institute Fellow, we're thrilled that David will continue his essential work as a leading advocate for Topos -- collaborating with his network to expand our support base across government, industry, and philanthropy -- and will continue to serve as part of our Leadership team. We're very grateful for David's pivotally important service as Chief Scientist, and know that both he and Topos will continue to thrive as his role evolves to bring more focus to his world-leading research.</p>\n</blockquote>",
        "id": 354737701,
        "sender_full_name": "John Baez",
        "timestamp": 1682880896
    }
]