[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229111-general/topic/Introduce.20yourself!/near/373851363\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276695\">Posina Venkata Rayudu</span> what is \"Unity-respecting Change\"?</p>\n</blockquote>\n<p>Thank you Morgan! Unity-respecting change is structure-respecting morphism.  As you know, all mathematical transformations, beginning with functions between between sets, are structure-preserving.  Of course, in the case of sets, there is almost-zero cohesion, i.e., discrete, which is preserved as a function maps a domain element to a codomain element.  The seemingly tall claim {\"all mathematical\") is justified by the omnipresent 'do not tear' (please see Lawvere &amp; Schanuel, Conceptual Mathematics, p.210).  The Yoneda lemma showing that structure-respecting morphisms are natural (ibid, pp. 149-150, 378) is reason enough to baptize category theory as the theory of naturality.  It is this naturality that makes the effectiveness of mathematics in natural sciences reasonable (cf. <a href=\"https://www.youtube.com/watch?v=r0kLC-pridI\">we are given changes/contrasts, which we objectify, which, in turn, moves as one thing</a>).  All of this is but a prologue: more than the mathematics, it is the everyday life that screams NATURAL: as I walk to Malabar Cafe for coffee, the motion (or, more broadly, the changes) that takes me to the cafe preserves the unity that is poison.  So, is the case with the growth and development of plants and animals.  Obviously, there's an unavoidable question: what if a change chops me into pieces; no worries: i/we go from one category to another (and there is no escaping the unity-respecting change, albeit the specific unity (cf. discrete, codiscrete, etc.) may be different, which, nevertheless, is respected.  Admittedly, after all said nothing new has been said, or so it seems to me (except for my juvenile twinkle at taking a shot at Newton ;)  Please let me know if I answered your question or went off on a tangent (as is my wont ;)  Equally importantly, please correct me of any mistakes in my understanding.  Thank you!</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"r0kLC-pridI\" href=\"https://www.youtube.com/watch?v=r0kLC-pridI\"><img src=\"https://uploads.zulipusercontent.net/0b0eabdb108d2d2a669306478bd50ab96a11b258/68747470733a2f2f692e7974696d672e636f6d2f76692f72306b4c432d70726964492f64656661756c742e6a7067\"></a></div>",
        "id": 374140473,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1689052569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276695\">@Posina Venkata Rayudu</span> thank you for this fundamental topic!  I am interested to think more about structure preserving transformations.  One source of ideas is architect Christopher Alexander, his four volume \"The Nature of Order\", and his 15 properties of life (especially: strong centers, clear boundaries, levels of scale), which he relates to wholeness preserving transformations. Have you thought about his ideas?</p>",
        "id": 376807856,
        "sender_full_name": "Andrius Kulikauskas",
        "timestamp": 1689808203
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"589612\">Andrius Kulikauskas</span> <a href=\"#narrow/stream/229111-general/topic/Unity-respecting.20Change/near/376807856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276695\">Posina Venkata Rayudu</span> thank you for this fundamental topic!  I am interested to think more about structure preserving transformations.  One source of ideas is architect Christopher Alexander, his four volume \"The Nature of Order\", and his 15 properties of life (especially: strong centers, clear boundaries, levels of scale), which he relates to wholeness preserving transformations. Have you thought about his ideas?</p>\n</blockquote>\n<p>Thank you <span class=\"user-mention\" data-user-id=\"589612\">@Andrius Kulikauskas</span> for your encouring note.  I must admit that I am (embarrasingly) unaware of Christopher Alexander and his \"The Nature of Order\", leave alone his 15 properties of life.  But, I got interested in architecture, upon reading my guru Professor F. William Lawvere briefly mention it in <a href=\"http://www.tac.mta.ca/tac/reprints/articles/27/tr27.pdf\">http://www.tac.mta.ca/tac/reprints/articles/27/tr27.pdf</a> (in this context it may be noted that mathematical objects are not structures, but can be represented/modeled as structures/diagrams in a structureless background, also according to Professor F. William Lawvere).  As much as I consciously and effortfuly try to avoid studying anything other than Professor F. William Lawvere, your \"wholeness preserving transformations\" is definitely on the top of my list-to-understand, especially given that one may define SUM (e.g., 1 + 1 = 2) as a whole that is completely determined by its parts (which is the closest I got to a verbal rendition of the universal mapping property definition of SUM; i forgot if the phrasing was intended to remind one of the Gestalt maxim: a whole is different from the sum of its parts ;)  Be that as it may, would you be kind enough to suggest a source (book/papers) to begin my study of the work of Christopher Alexander (pardon me, for I'm not a big fan of googling ;)  Thanking you, yours truly, posina</p>",
        "id": 386189115,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1692510995
    },
    {
        "content": "<p>Hi Posina, his book that I like the best is \"The Timeless Way of Being\".  It's available at the Internet Archive's online library: <a href=\"https://archive.org/details/timelesswayofbui0000alex_u9i8\">https://archive.org/details/timelesswayofbui0000alex_u9i8</a>   In that book he talks about building in terms of patterns and pattern languages.  A pattern relates structure and activity:  recurring activity evokes structure and structure channels activity.  In his later four-volume work, \"The Nature of Order\", he specifically talks about wholeness preserving transformations.  Book I and the first part of Volume II are the most useful.  This is where he describes his 15 principles of life. Here is the summary for Book II, which mentions \"structure-preserving transformations\".  <a href=\"http://www.natureoforder.com/summarybk2.htm\">http://www.natureoforder.com/summarybk2.htm</a> Book IV is available online <a href=\"https://archive.org/details/natureoforderess0000alex/\">https://archive.org/details/natureoforderess0000alex/</a></p>",
        "id": 386227185,
        "sender_full_name": "Andrius Kulikauskas",
        "timestamp": 1692540785
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"589612\">Andrius Kulikauskas</span> <a href=\"#narrow/stream/229111-general/topic/Unity-respecting.20Change/near/386227185\">said</a>:</p>\n<blockquote>\n<p>Hi Posina, his book that I like the best is \"The Timeless Way of Being\".  It's available at the Internet Archive's online library: <a href=\"https://archive.org/details/timelesswayofbui0000alex_u9i8\">https://archive.org/details/timelesswayofbui0000alex_u9i8</a>   In that book he talks about building in terms of patterns and pattern languages.  A pattern relates structure and activity:  recurring activity evokes structure and structure channels activity.  In his later four-volume work, \"The Nature of Order\", he specifically talks about wholeness preserving transformations.  Book I and the first part of Volume II are the most useful.  This is where he describes his 15 principles of life. Here is the summary for Book II, which mentions \"structure-preserving transformations\".  <a href=\"http://www.natureoforder.com/summarybk2.htm\">http://www.natureoforder.com/summarybk2.htm</a> Book IV is available online <a href=\"https://archive.org/details/natureoforderess0000alex/\">https://archive.org/details/natureoforderess0000alex/</a></p>\n</blockquote>\n<p>Thank you very much Sir for the pointers; I'll go through them and write to you again soon!</p>",
        "id": 386588611,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1692704487
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"589612\">Andrius Kulikauskas</span> <a href=\"#narrow/stream/229111-general/topic/Unity-respecting.20Change/near/386227185\">said</a>:</p>\n<blockquote>\n<p>Hi Posina, his book that I like the best is \"The Timeless Way of Being\".  It's available at the Internet Archive's online library: <a href=\"https://archive.org/details/timelesswayofbui0000alex_u9i8\">https://archive.org/details/timelesswayofbui0000alex_u9i8</a>   </p>\n</blockquote>\n<p>I seem to have found a strange loop here on Zulip, paralleling some of my obscure interest in alternative complex system philosophies...</p>\n<p>I'm just chiming in to second this book, assuming most would never have heard of it. I would say it is in a short list of books I've read which are truly unique. Some are unique in the way they are written (think Godel, Escher, Bach (GEB)). Some are unique in that they force a reevaluation of assumptions you would never have otherwise believed were assumptions (one that springs to mind is Julian Jaynes' \"Origin of Consciousness...\" Caveat: not endorsing the theory's psychological validity, just that it is truly \"out there\"). </p>\n<p>Timeless Way of <em>Building</em> (typo in OP) is a bit of both: it is written as a piece of art, part prose, part poetry in a unique way. Highly philosophical, it outlines a theory of coevolutionary design of an environment, always in terms of \"building\" but clearly abstracting to much bigger ideas, probably in a satisfactory way to folks who are drawn to formal \"abstract nonsense\". I could see it being a bit \"new-agey\" for some tastes, but I'm sure GEB is a bit \"Church-Turing\" for some tastes. Still both are cool in their own way.</p>",
        "id": 386663956,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1692726053
    },
    {
        "content": "<p>Dear All, I'd like to humbly request you all to refrain from using \"abstract nonsense\".  In the absence of abstraction, we would be suspended in blooming, buzzing confusion i.e., particulars (with no exit ;)  The words we use to present concepts (abstracted from a given family of particulars) we use to think change the way we see.  For example, \"I called the appearance of snow 'micaceous'; and the moment I did so, the other connotations of the word 'micaceous' dragged the snow farther away from ordinary snow and seemed even to aggravate the peculiar look\" (James, W. (1890) Principles of Psychology, p. 512).  Thanking you, yours truly, posina<br>\nP.S. <span class=\"user-mention\" data-user-id=\"589612\">@Andrius Kulikauskas</span> Thanks so much for your helpful pointers; please allow me to write to you again soon.  Pardon me for going off on the above tangent, which seemed to be armed with the immediacy of headline news (at least to me ;)</p>",
        "id": 386669397,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1692728070
    },
    {
        "content": "<p>Yes, abstraction is of course essential to concept formation and thought, and I understand your point on connotations. However, \"abstract nonsense\" is a term of endearment (at least to me).</p>",
        "id": 386879950,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1692800004
    },
    {
        "content": "<p>Ah, Christopher Alexander I got to know his work accidentally, but it was clear to me he is very mathematically-inclined when I read his essay \"The city is not a tree\", hope I will have time to checkout the book as well.. <a href=\"http://en.bp.ntu.edu.tw/wp-content/uploads/2011/12/06-Alexander-A-city-is-not-a-tree.pdf\">http://en.bp.ntu.edu.tw/wp-content/uploads/2011/12/06-Alexander-A-city-is-not-a-tree.pdf</a></p>",
        "id": 388829078,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1693749611
    }
]