[
    {
        "content": "<p>(Sorry if this should go into \"learning: questions\" rather than \"community: general\", I was not sure where to post.)</p>\n<p>I've been following the interesting discussions in \"community: general\" about foundations that began on the \"Category Theory is Being Co-Opted\" thread. In that context, I wanted to ask if anyone could explain Lawvere's stance or opinions about foundations of mathematics—hopefully he was clear enough on this topic that others can restate his position. Reading pointers to his own words are also welcome.</p>\n<p>To add a bit more to the question, two distinctions from those threads seem relevant (I think both were raised by <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>).</p>\n<ol>\n<li>The distinction between \"foundations\" and what could be called \"cofoundations\" to describe the role of category theory as an organizer of mathematics \"from above\" instead of \"from below\" as foundations do.</li>\n<li>The distinction between foundations as (A) something on which mathematics \"rests\", be it because they justify mathematics, they give it its actual meaning, they come as close as possible to guaranteeing some sort of consistency, etc.; and (B) as mathematical theories that are \"mathematics-complete\" in the sense that all (?) or \"most\" (??) of mathematics can be encoded in some way inside them, with no claim to them being necessary for the integrity of the mathematical enterprise (I must admit I do not understand what \"all\" and \"most\" mean in this context). Let's call this foundations-A and foundations-B. </li>\n</ol>\n<p>I've seen somewhere a passage by Lawvere showing that he really disliked the preoccupation of early 20th Century logicians like Russell and Hilbert with proving the consistency of mathematics. I also read, perhaps in that same text (sorry, I'm being lazy to check my sources) that he thought \"foundations of mathematics\" should mean something closer to what \"foundations of mechanics\" means as in the title of a Physics textbook: an organized corpus of essential ideas and methods that a mathematical practitioner should know. Based on this incredibly sloppy prior knowledge it seems to me that Lawvere denied the need for foundations-A, and that he thought the word \"foundations\" should be used for what was called above \"cofoundations\".</p>\n<p>A starting point for an answer to my broad question would be whether this understanding is more or less correct. If it is, then I would really like to understand more the arguments behind this denial of foundations-A.</p>",
        "id": 544365295,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760236972
    },
    {
        "content": "<p>I don't know enough to summarize Lawvere's stance on foundations - and I'm always suspicious when people summarize the views of smarter people, since typically a lot of nuance gets lost.  But I know enough to search for Lawvere's remarks on foundations and quote some.   From his paper <a href=\"https://ncatlab.org/nlab/show/Adjointness+in+Foundations\">Adjointness in foundations</a>:</p>\n<blockquote>\n<p>That pursuit of exact knowledge which we call mathematics seems to involve in an essential way two dual aspects, which we may call the Formal and the Conceptual. For example, we manipulate algebraically a polynomial equation and visualize geometrically the corresponding curve. Or we concentrate in one moment on the deduction of theorems from the axioms of group theory, and in the next consider the classes of actual groups to which the theorems refer. Thus the Conceptual is in a certain sense the subject matter of the Formal.</p>\n<p>Foundations will mean here the study of what is universal in mathematics. Thus<br>\nFoundations in this sense cannot be identified with any “starting-point” or “justification” for mathematics, though partial results in these directions may be among its fruits. But among the other fruits of Foundations so defined would presumably be guide-lines for passing from one branch of mathematics to another and for gauging to some extent which directions of research are likely to be relevant.</p>\n<p>Being itself part of Mathematics, Foundations also partakes of the Formal-Conceptual duality. In its formal aspect, Foundations has often concentrated on the formal side of mathematics, giving rise to Logic. More recently, the search for universals has also taken a conceptual turn in the form of Category Theory, which began by viewing as a new mathematical object the totality of all morphisms of the mathematical objects of a given species A, and then recognizing that these new mathematical objects all belong to a common non-trivial species C which is independent of A. Naturally, the formal tendency in Foundations can also deal with the conceptual aspect of mathematics, as when the semantics of a formalized theory T is viewed itself as another formalized theory T ′, or in a somewhat different way, as in attempts to formalize the study of the category of categories. On the other hand, Foundations may conceptualize the formal aspect of mathematics, leading to Boolean algebras, cylindric and polyadic algebras, and to certain of the structures discussed below.<br>\n</p>\n</blockquote>",
        "id": 544386065,
        "sender_full_name": "John Baez",
        "timestamp": 1760262060
    },
    {
        "content": "<blockquote>\n<p>But among the other fruits of Foundations so defined would presumably be guide-lines for passing from one branch of mathematics to another and for gauging to some extent which directions of research are likely to be relevant.</p>\n</blockquote>\n<p>This parts resonates with what Penelope Maddy called <strong>Essential Guidance</strong> in her <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/About.20the.20foundations.20of.20mathematics/near/543070768\">paper</a>. This is one aspect of what could be considered a \"foundational work\". We discussed them briefly in this <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/About.20the.20foundations.20of.20mathematics/near/543070768\">thread</a>.</p>",
        "id": 544401061,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1760276006
    },
    {
        "content": "<p>Thank you for the pointer, John. <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  The transcript seems to support the idea that he was especially interested in \"cofoundations\" (\"...guide-lines for passing from one branch of mathematics to another and for gauging to some extent which directions of research are likely to be relevant\") but not that he denied any importance at all to \"foundations-A\". I will look for the passage I referred to where he seemed to be more dismissive about it, if I recall correctly.</p>",
        "id": 544768548,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760452940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/544386065\">said</a>:</p>\n<blockquote>\n<p>I'm always suspicious when people summarize the views of smarter people, since typically a lot of nuance gets lost.</p>\n</blockquote>\n<p>Fair, but isn't it part of the advancement of any collective intellectual endeavor to try to distill the essence of what other, smarter people said?</p>",
        "id": 544769214,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760453085
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"619003\">@Peva Blanchard</span> ! I somehow missed that whole thread and it's immensely helpful to me. It answers some other questions that I would have liked to ask.</p>",
        "id": 544769835,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760453233
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278867\">Gabriel Goren Roig</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/544769214\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/544386065\">said</a>:</p>\n<blockquote>\n<p>I'm always suspicious when people summarize the views of smarter people, since typically a lot of nuance gets lost.</p>\n</blockquote>\n<p>Fair, but isn't it part of the advancement of any collective intellectual endeavor to try to distill the essence of what other, smarter people said?</p>\n</blockquote>\n<p>In math someone can correctly state a theorem that they could never have proved themselves, and that's very useful.   But whenever I compare what a philosopher wrote to the summaries of their ideas, I'm amazed at how much the summaries have lost.   It's like looking at the Mona Lisa through the bottom of a coca-cola bottle, blurry and distorted.   Luckily, Lawvere's writings on foundations are so few and so short that we scarcely need to summarize them.  We can just find them, and quote them here, and talk about them.</p>",
        "id": 544780100,
        "sender_full_name": "John Baez",
        "timestamp": 1760455630
    },
    {
        "content": "<p>I guess that raises the question of how are philosophers to proceed, methodologically, if the work of each person is not really \"compressible\". But as you say that's probably not a problem in this case, and I appreciate the point that, as mathematicians, we should not expect other fields enjoy the same degree of \"compressibility\" that mathematical statements do.</p>",
        "id": 544784962,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760456845
    },
    {
        "content": "<p>From my experience sharing an office with a philosopher, I can say that one way they proceeds by reading a lot more than we do (or at least than I do)</p>",
        "id": 544885328,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1760509426
    },
    {
        "content": "<p>Yes.   Or you could say, learning Plato's philosophy is a bit more like learning \"number theory\" than learning a theorem in number theory.   It's learning the world-view of an extremely smart guy from a culture that is very foreign to you - many things that are familiar to him aren't familiar to you, and vice versa - and trying to understand the thoughts he had over the course of his life.</p>",
        "id": 544910060,
        "sender_full_name": "John Baez",
        "timestamp": 1760518167
    },
    {
        "content": "<p>Ok, I've been able to track down some sources for the dismissal of the idea of foundations as justification.</p>\n<p>I want to focus on a certain fragment from Clementino and Picado's 2008 <a href=\"https://lawverearchives.com/wp-content/uploads/2024/12/Interview-by-Clementino-and-Picado.pdf\">\"An Interview with F. William Lawvere\"</a> (I read this a long time ago and haven't re-read yet entirely, so it might be the case that other parts of the interview are relevant to this topic as well):</p>\n<blockquote>\n<p><em>As Mac Lane wrote in his Autobiography, “The most radical aspect is Lawvere’s notion of using axioms for the category of sets as a foundation of mathematics. This attractive and apposite idea has, as of yet, found little reflection in the community of specialists in mathematical logic, who generally tend to assume that everything started and still starts with sets”. Do you have any explanation for that attitude ?</em></p>\n<p>The past 100 years’ tradition of “foundations as justification” has not helped mathematics very much. In my own education I was fortunate to have two teachers who used the term “foundations” in a common-sense way (rather than in the speculative way of the Bolzano-Frege-Peano-Russell tradition). This way is exemplified by their work in Foundations of Algebraic Topology, published in 1952 by Eilenberg (with Steenrod), and the Mechanical Foundations of Elasticity and Fluid Mechanics, published in the same year by Truesdell. Whenever I used the word “foundation” in my writings over the past forty years, I have explicitly rejected that reactionary use of the term and instead used the definition implicit in the work of Truesdell and Eilenberg. The orientation of these works seemed to be “concentrate the essence of practice and in turn use the result to guide practice”. Namely, an important component of mathematical practice is the careful study<br>\nof historical and contemporary analysis, geometry, etc. to extract the essential recurring concepts and constructions; making those concepts and constructions (such as homomorphism, functional, adjoint functor, etc.) explicit provides powerful guidance for further unified development of all mathematical subjects, old and new.</p>\n<p><em>Could you expand a little bit on that ?</em></p>\n<p>What is the primary tool for such summing up of the essence of ongoing mathematics? Algebra! Nodal points in the progress of this kind of research occur when, as in the case with the finite number of axioms for the metacategory of categories, all that we know so far can be expressed in a single sort of algebra. I am proud to have participated with Eilenberg, Mac Lane, Freyd, and many others, in bringing about<br>\nthe contemporary awareness of Algebra as Category Theory. Had it not been for the century of excessive attention given to alleged possibility that mathematics is inconsistent, with the accompanying degradation of the F-word, we would still be using it in the sense known to the general public: the search for what is “basic”. We, who supposedly know the explicit algebra of homomorphisms, functionals,<br>\netc., are long remiss in our duty to find ways to teach those concepts also in high school calculus.</p>\n<p>Having recognized already in the 1960s that there is no such thing as a heaven-given platonic “justification” for mathematics, I tried to give the word “Foundations” more progressive meanings in the spirit of Eilenberg and Truesdell. That is, I have tried to apply the living axiomatic method to making explicit the essential features of a science as it is developing in order to help provide a guide to the use, learning, and more conscious development of the science. A “pure” foundation which forgets this purpose and pursues a speculative “foundation” for its own sake is clearly a NON-foundation.</p>\n<p>Foundations are derived from applications by unification and concentration, in other words, by the axiomatic method. Applications are guided by foundations which have been learned through education.</p>\n</blockquote>\n<p>The \"common-sense\" way to interpret the term \"foundations\", based on \"distilling the essence of practice\", seems identifiable with the notion of \"cofoundations\" I mentioned above, and also seems to correspond reasonably well to \"Essential Guidance\" as you said, <span class=\"user-mention\" data-user-id=\"619003\">@Peva Blanchard</span>, although I haven't read Penelope Maddy's paper (yet).</p>",
        "id": 545788128,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760829537
    },
    {
        "content": "<p>There are many statements here that seem very strong to me:</p>\n<ul>\n<li>\"The past 100 years’ tradition of 'foundations as justification' has not helped mathematics very much.\"</li>\n<li>The usage of the word \"foundation\" in the sense of justification is <em>reactionary</em>.</li>\n<li>The attention given to the possibility that mathematics is consistent has been \"excessive\" for the past century.</li>\n<li>The possibility that mathematics is inconsistent is \"alleged\". He seems to question directly whether that possibility is really a legitimate concern.</li>\n<li>He (and others) \"recognized already in the 1960s that there is no such thing as a heaven-given platonic 'justification' for mathematics\".</li>\n<li>\"A 'pure' foundation which forgets this purpose [of providing a guide to the use, learning, and more conscious development of the science] and pursues a speculative “foundation” for its own sake is clearly a NON-foundation.\"</li>\n<li>He also refers to \"the speculative way of the Bolzano-Frege-Peano-Russell tradition\". I would like to understand better what he means by \"speculative\".</li>\n</ul>\n<p>It seems to me that Lawvere talks about this issue of whether mathematics needs justification in a way that is coupled with the topic of ETCS and how we can define sets by axiomatizing function composition and so on instead of the \"rigid epsilon-chains of von Neumann et al\" and the \"epsilon ideology\" (he uses that expression twice in another of the sources I tracked down: an email to the categories list dated \"Sun, 17 Mar 1996\" which can be found <a href=\"https://lawverearchives.com/wp-content/uploads/2025/02/Bills_messages_to_the_categories_list.pdf\">here</a>.</p>",
        "id": 545788286,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760829778
    },
    {
        "content": "<p>By the way, some phrases from the interview appear also in the article <a href=\"https://lawverearchives.com/wp-content/uploads/2024/12/2003-FoundationApplicationAxioEd.pdf\">Foundations and Applications: Axiomatization and Education</a>. I'm a bit confused about this because the article is supposedly from 2003, 5 years before the interview. I wonder whether the interview was conducted in written form, so that Lawvere could re-utilize textual fragments from previous work as part of his answers.</p>",
        "id": 545788339,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760829831
    },
    {
        "content": "<p>I have so many questions! I guess the most important for me right now is why he thought the concern about inconsistency was not merely given excessive attention, but was altogether an illegitimate concern.</p>",
        "id": 545788549,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1760830079
    },
    {
        "content": "<p>That's a nice quote to be aware of, thanks for sharing it.</p>",
        "id": 545806739,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1760854390
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278867\">Gabriel Goren Roig</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/545788286\">said</a>:</p>\n<blockquote>\n<ul>\n<li>He also refers to \"the speculative way of the Bolzano-Frege-Peano-Russell tradition\". I would like to understand better what he means by \"speculative\".</li>\n</ul>\n</blockquote>\n<p>He's contrasting <em>speculation</em> with an approach to a topic that takes as central the empirical practice relating to that topic. So in <a href=\"https://lawverearchives.com/wp-content/uploads/2024/12/2003-FoundationApplicationAxioEd.pdf\">Foundations and applications</a>:</p>\n<blockquote>\n<p>Since the most fundamental social purpose of philosophy is to guide education and since mathematics is one of the pillars of education, accordingly philosophers often speculate about mathematics. But a less speculative philosophy based on the actual practice of mathematical theorizing should ultimately become one of the important guides to mathematics education.</p>\n</blockquote>\n<p>This in turn relates to the distinction Marx is making between his own mature work and that of Hegel. For Marx, Hegel prioritises abstract philosophical theorising of the conceptual over the study of the concrete, material conditions of society, such as economic structures or class struggles. </p>\n<p>I remember as a young student turning with great anticipation to <em>Das Kapital</em> and there deflatingly confronting interminable detail on the British Factory Laws of the nineteenth century.</p>",
        "id": 545976805,
        "sender_full_name": "David Corfield",
        "timestamp": 1760966482
    },
    {
        "content": "<p>Thanks David, <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> I found your comment illuminating and have been thinking about it. It suddenly makes a lot of sense to me that the Marxist rejection of speculative philosophy can serve as grounds for Lawvere's dismissal of the concerns about inconsistency.</p>\n<p>However, I still don't see the point completely. I would like to also understand what he means when he says that it was \"recognized already in the 1960s that there is no such thing as a heaven-given platonic 'justification' for mathematics\". I'm not sure what it means to have a \"justification\" for mathematics aside from the issue of potential inconsistency. I was assuming they were the same thing, but perhaps they aren't, in this context.</p>",
        "id": 546566432,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1761175800
    },
    {
        "content": "<p>In the 1960s you had two things happen: Lawvere invented ETCS, a set theory that suffices for 99.99% of non-set-theory mathematics (which is probably what he had in mind), so that ZFC is not the only option, and the invention of forcing by Cohen, which showed set theorists that essentially the ZFC axioms of set theory severely underdetermine how sets behave. The ZFC axioms have hundreds of different models that fail to agree on many things, some of which are not explicitly about set theory (eg: does the Calkin algebra <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi><mo stretchy=\"false\">(</mo><mi mathvariant=\"script\">H</mi><mo stretchy=\"false\">)</mo><mi mathvariant=\"normal\">/</mi><mi mathvariant=\"script\">K</mi></mrow><annotation encoding=\"application/x-tex\">B(\\mathcal{H})/\\mathcal{K}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05017em;\">B</span><span class=\"mopen\">(</span><span class=\"mord mathcal\" style=\"margin-right:0.00965em;\">H</span><span class=\"mclose\">)</span><span class=\"mord\">/</span><span class=\"mord mathcal\" style=\"margin-right:0.01445em;\">K</span></span></span></span> have outer automorphisms? What's the solution to the Whitehead problem on abelian groups?). That this is the case removes the claim that somehow ZFC is The One Real foundation for mathematics, since it can't answer rather concrete questions</p>\n<p>But that is my reading of what he said, I can't say for sure he intended the second option, but the first I'm fairly confident that he was thinking of.</p>",
        "id": 546569879,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761178084
    },
    {
        "content": "<blockquote>\n<p>I guess the most important for me right now is why he thought the concern about inconsistency was not merely given excessive attention, but was altogether an illegitimate concern.</p>\n</blockquote>\n<p>I don't think that by \"alleged\", Lawvere meant to call the study of inconsistency as such into question. Rather, it is important that he says \"alleged inconsistency <em>of mathematics</em>\". I do think it consistent to cast doubt on such a thing, because inconsistency is a property of formal systems, and it does not appear that the <em>global</em> practice of mathematics is taking place in a formal system. It falls under the rubric of \"speculation\" to claim that it is (usually cashed out in the language of \"<em>in principle</em> (we could translate everything into ZFC)\"... could we really?) Let me quote from another source,</p>\n<blockquote>\n<p>Though it is clear that the concepts that are concentrated from applications may sometimes need testing to evaluate their consistency, and it is also clear that much work is involved in presenting concepts in such a way that they can be understood by all the students who consciously participate in learning, such presentations need not be burdened with the historical constructions that have been used to establish consistency. For example, a perfectly rigorous treatment of infinite-dimensional differential geometry (that is, of the mathematics underlying the everyday physics of continuous bodies and waves), does not have to be preceded by a long detour into topological vector spaces or countable additivity, nor does it require an elaborate arbitrary build-up of atlases of charts, based in turn on rituals devised by Bolzano and Cauchy, based in turn on a cumulative hierarchy of sets. All those steps might be useful in developing some particular aspect of the subject, but they should not be a barrier that prevents people from learning to work rigorously. </p>\n</blockquote>\n<p>(<a href=\"https://lawverearchives.com/wp-content/uploads/2024/12/2001-explicit-foundational-concepts-in-the-teaching-of-mathematics.pdf\">Explicit foundational concepts in the teaching of mathematics</a>)</p>\n<p>So here is an admission that consistency does matter, and that such work is useful in some regard. But there is concern with excessive fuss over consistency as a \"barrier to learning\". It seems that Lawvere thought that foundations should be a synthetic activity which, having reflected on practice, finds clearer and more communicable concepts, be they localized to one area (e.g. SDG), or something wider (e.g. ETCS). The d-word has not yet been mentioned in this thread, but it is clear that Lawvere considered foundations to be an aspect of a dialectic (which is more or less to say mutual constitution) with the demands of education. </p>\n<p>Another point to mention in this connexion is the importance of <em>contradiction</em> to dialectical \"movement\". This is discussed in the 2003 article mentioned previously,</p>\n<blockquote>\n<p>But are not abstract sets themselves problematic? Does not perhaps the very idea of them involve a contradiction? In considering that question one should not confuse contradiction and inconsistency. A. Tarski deﬁned in the 1930s an “inconsistent” formal system to be one in which everything is provable (clearly such a system is useless); by contrast, whether A and not-A can co-exist depends on the precise rules of inference and meanings that the system attributes to negation. One of the principles of dialectics is that speciﬁc contradictions are the key to all development. For example, complex analysis had needed to become explicit on a notion which is fundamental to general topology: in the category of closed subspaces of a space, (A and not-A) = the boundary of A, as is made precise in the formal system of co-Heyting algebra. (To move from a room A into not-A one must pass through the threshold, at least if motion is parameterized by a time interval which is a connected space.)</p>\n</blockquote>\n<p>It seems that Lawvere also felt that concern with inconsistency stepped too much on the toes of contradiction, which he wanted to defend in the precise sense above (sketched in adjoint terms in many articles).</p>",
        "id": 546622511,
        "sender_full_name": "Matt Earnshaw",
        "timestamp": 1761209173
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277812\">Matt Earnshaw</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/546622511\">said</a>:</p>\n<blockquote>\n<p>sketched in adjoint terms in many articles</p>\n</blockquote>\n<p>Such as the kind of material discussed onwards from <a href=\"https://ncatlab.org/nlab/show/Aufhebung#lawveres_path_to_aufhebung\">Lawvere’s path to *Aufhebung*</a>.</p>",
        "id": 546634875,
        "sender_full_name": "David Corfield",
        "timestamp": 1761212601
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277812\">Matt Earnshaw</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/546622511\">said</a>:</p>\n<blockquote>\n<p>I don't think that by \"alleged\", Lawvere meant to call the study of inconsistency as such into question. Rather, it is important that he says \"alleged inconsistency <em>of mathematics</em>\". I do think it consistent to cast doubt on such a thing, because inconsistency is a property of formal systems, and it does not appear that the <em>global</em> practice of mathematics is taking place in a formal system. It falls under the rubric of \"speculation\" to claim that it is (usually cashed out in the language of \"<em>in principle</em> (we could translate everything into ZFC)\"... could we really?)</p>\n</blockquote>\n<p>Thank you! I think this is one of the crucial points that I felt I was missing. The claim that mathematics \"actually happens inside a formal system\" does sound speculative in the sense of being removed from the actual practice of mathematicians. The fact that the idea \"what if mathematics turns out to be inconsistent one day\" seems to be some kind of science fiction plot adds to the accusation of it being \"speculative\"; see for instance Ted Chiang's short story \"Division by Zero\".</p>\n<p>The suggestion that excessive concern with inconsistency could be philosophically linked to a rejection of contradictions, or of their \"constructive\" role as part of dialectical processes, is also really interesting and reminds me of a thought that I once had on this topic of the fear of inconsistency. Suppose some piece of mathematics is unexpectedly discovered to be \"inconsistent\". I guess more realistically it would go like this: some definition was thought to have at least one example, but it turns out to have none. Conceivably, this could cause a relatively big line of work to collapse in some sense. However, in all likelihood this would not invalidate the line of work itself but rather shed light on it and lead to improvements that \"repair\" the flaw while still capturing the relevant intuitions.</p>\n<p>Of course such \"collapse\" could be terrifying (especially for actual people's careers) but it would not necessarily have the metaphysical implications that it has in e.g. Chiang's short story. Of course, in the story it actually happens that arithmetic is \"proved inconsistent\" which does sound really dramatic, but even in that case, wouldn't the discovery be an exciting step forward in our understanding of mathematics?</p>\n<p>I'm curious what you all think about this and what you feel about inconsistency as a sci-fi plot. It does seem to me that Lawvere would have had (or maybe even had) some strong thoughts about that short story.</p>",
        "id": 547165064,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1761518492
    },
    {
        "content": "<p>That puts me in mind of the discussions between Wittgenstein and Turing on inconsistency, the former being much more sanguine about its consequences. You can read some of their exchange in slides from <a href=\"https://www.britishwittgensteinsociety.org/wp-content/uploads/documents/lectures/Turing-and-Wittgenstein-on-Logic-and-Mathematics.pdf\">this talk</a> by Ray Monk (especially from slide 12).</p>",
        "id": 547238118,
        "sender_full_name": "David Corfield",
        "timestamp": 1761560280
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"619003\">Peva Blanchard</span> <a href=\"#narrow/channel/229111-community.3A-general/topic/What.20was.20Lawvere's.20stance.20on.20foundations.3F/near/544401061\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>But among the other fruits of Foundations so defined would presumably be guide-lines for passing from one branch of mathematics to another and for gauging to some extent which directions of research are likely to be relevant.</p>\n</blockquote>\n<p>This parts resonates with what Penelope Maddy called <strong>Essential Guidance</strong> in her <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/About.20the.20foundations.20of.20mathematics/near/543070768\">paper</a>. This is one aspect of what could be considered a \"foundational work\". We discussed them briefly in this <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/About.20the.20foundations.20of.20mathematics/near/543070768\">thread</a>.</p>\n</blockquote>\n<p>Just wanted to say I thoroughly enjoyed Maddy's paper! Delightful read.</p>",
        "id": 553795784,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1762332758
    }
]