[
    {
        "content": "<p>Where is a good place to ask non-trivial questions about basic category theory? I had been asking them under 'basic', but I'm aware that that might be sub-optimal. Is there some kind of consensus of what I should be asking such questions?  [I have quite a few more, that I'll be asking over the coming weeks.]</p>\n<p>Most of my questions come from examining basic CT definitions from a constructive, type-theoretic point of view, although I think the answers ought to apply much more widely than that.</p>",
        "id": 199760783,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1591283279
    },
    {
        "content": "<p>The #learning: basic questions stream has been renamed to <a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> — it's meant to be an appropriate venue for any sort of general question.</p>",
        "id": 199761414,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1591283522
    },
    {
        "content": "<p>I second what <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> says. In principle, we moderators can move a topic to another stream if it genuinely feels out of place. Ask away! Everyone here is friendly enough that they'll answer your questions if they can <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 199762651,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591283958
    },
    {
        "content": "<p>#learning seems to be a mismatch with my intent. I often understand the area of CT that I'm asking a question about, the question often is one of 'foundations', in that some definitions seem to embed some classical principles (sneakily).</p>",
        "id": 199762821,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1591284024
    },
    {
        "content": "<p>Up to now, my questions have indeed gotten interesting answers, so I do feel welcome to ask more. Beginners might feel quite put-off by these questions though, which is why I'm somewhat reluctant to put them under a #learning tag.</p>",
        "id": 199763018,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1591284113
    },
    {
        "content": "<p>then wouldn't these question fit better to the <a class=\"stream\" data-stream-id=\"229136\" href=\"/#narrow/stream/229136-theory.3A-category-theory\">#theory: category theory</a>  stream ?</p>",
        "id": 199767043,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1591285676
    },
    {
        "content": "<p>Yes, I think that stream is the official one for \"research-level questions\".</p>",
        "id": 199773787,
        "sender_full_name": "John Baez",
        "timestamp": 1591288336
    }
]