[
    {
        "content": "<p>Any category treatments of Gregory Chaitin, Stephen Wolfram or Stephen Simpson work? Each strives to handle the whole of mathematics.</p>",
        "id": 192924080,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1586029848
    },
    {
        "content": "<p>I don't know if there's some categorical work about cellular automata, but last time I talked with Wolfram he seemed quite interested in the latest developments in category theory, especially wrt categorical quantum mechanics and graphical formalisms</p>",
        "id": 192926612,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586033668
    },
    {
        "content": "<p>So I don't know if there's work about what he did, but it's reasonable to expect Mathematica will start implementing stuff from CT at some point. He also told me they were thinking about developing a typesystem for the Wolfram language, but it seems quite a heavy task to me.</p>",
        "id": 192926636,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586033745
    },
    {
        "content": "<p>Wolfram was interested in Petri nets when I last talked to him.... I told him a bunch of stuff.</p>",
        "id": 192926750,
        "sender_full_name": "John Baez",
        "timestamp": 1586033884
    },
    {
        "content": "<p>When did this happen? I met him in 2018. I was presenting some stuff about Petri nets and he just opened the conversation with a \"We never implemented Petri nets in Mathematica because we thought they were useless. Change my mind!\"</p>",
        "id": 192926783,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586033974
    },
    {
        "content": "<p>Then we spoke a bit more in the next weeks and I pointed him out to what <span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span> was doing in Ox and what you were doing at UCR. I don't know if the events are causally related!</p>",
        "id": 192926845,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586034029
    },
    {
        "content": "<p>Umm, he stopped by Riverside on March 17th 2019.   It doesn't seem that long ago!</p>",
        "id": 192926889,
        "sender_full_name": "John Baez",
        "timestamp": 1586034103
    },
    {
        "content": "<p>Then they could be related things. For me the events went like this: I met him at SXSW in Austin in 2018. We spoke a bit about Petri net stuff. It was fun because I just thought he was someone working in the Wolfram corporation, only after like 20 minutes I asked him \"so you work for Mathematica?\" and he told me \"Yes I made it\" and I was like WTF. Anyway we basically talked about Statebox and what I did in Oxford for my PhD. Then a few weeks later he contacted me because he wanted to know more about doing quantum stuff with pictures. So we spoke on the phone about that, and more about Statebox. I sent him the Statebox monograph and some other papers about various things, which he later told me he was reading. We kept messaging sporadically on and off, and this went on tilla few months ago I believe. He even sent me some documents Adam Petri sent to him ages ago about ideas for implementing his nets in Mathematica, which I imagine didn't go forward</p>",
        "id": 192927123,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586034438
    },
    {
        "content": "<p>Wolfram is back working on major issues in physics.</p>",
        "id": 192927125,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1586034463
    },
    {
        "content": "<p>It's nice that he keeps doing research and being interested in latest developments in Maths and CS anyway. He striked me as a very open minded and curious person, it may even be that he could join this group if we ask him <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 192927175,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586034532
    },
    {
        "content": "<p>I'm sending him a message now.</p>",
        "id": 192927183,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1586034567
    },
    {
        "content": "<p>Cool!</p>",
        "id": 192927187,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586034594
    },
    {
        "content": "<p>Only major issues in physics?   No minor ones?   <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span> </p>\n<p>Yes, Fab - Wolfram referred to you, not by name, saying some guy had gotten him interested in developing a Mathematica implementation of Petri nets.</p>",
        "id": 192927272,
        "sender_full_name": "John Baez",
        "timestamp": 1586034696
    },
    {
        "content": "<p>Whoohoo! It's nice to know I contributed infinitesimally into the making of something nice if this happens</p>",
        "id": 192927329,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586034781
    }
]