[
    {
        "content": "<p>This is a topic for discussing the page on <a href=\"https://wiki.functorialwiki.org/act/show/Conferences+and+seminars\">Conferences and seminars</a> - as well as all of the contents pages that it links through to.</p>",
        "id": 201439456,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592600409
    },
    {
        "content": "<p>There is a lot to be done here.   I would like to see this develop into a complete reference for ACT conference and seminar information.   For each conference/seminar, we let's make a nicely organized page that contains (1) general information about the conference/seminar, and (2) an itemization of the talks.   </p>\n<p>As an ideal goal, for each talk we could have:</p>\n<ul>\n<li>Title</li>\n<li>Bio for the presenter</li>\n<li>Abstract</li>\n<li>Link to slides</li>\n<li>Link to paper</li>\n<li>Link to videos</li>\n<li>Bibliography</li>\n<li>Link to wiki page for commentary</li>\n</ul>\n<p>Think of how useful this could be to the community, if all this were accessible via a quick link from the ACT wiki.</p>",
        "id": 201440144,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592600834
    },
    {
        "content": "<p>Of course, we can proceed incrementally, and get as far as we get.   Incremental progress works very well here!</p>",
        "id": 201440234,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592600884
    },
    {
        "content": "<p>The first thing I would recommend is simply completing the inventory of conferences and seminars, which on the index page.   First step is to add stub links to the page.   That we just be a markdown line like [[ACT 2020]].   Then create stub pages for each conference/seminar.   Then for each conference/seminar create a page which just lists the titles of the talks.</p>",
        "id": 201440744,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601195
    },
    {
        "content": "<p>Some of this data can be seen right from Zulip itself.    There should be pages corresponding to the following streams:</p>\n<ul>\n<li>ACT@UCR seminar</li>\n<li>MIT Categories seminar</li>\n<li>ACT@UMD seminar</li>\n<li>ACT 2020</li>\n</ul>",
        "id": 201440929,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601326
    },
    {
        "content": "<p>For things not posted to Zulip, there's also ACT 2018, ... and what else?</p>",
        "id": 201441044,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601395
    },
    {
        "content": "<p>We should all understand that, no matter who types in the initial information, this is shared community data, and it can be reformatted for improved consistency and readability by anybody.  So in <em>this sense</em> it needs to be 'egoless' work.   But everyones' contributions will be appreciated!! (And recorded in the history of the diff log.)</p>",
        "id": 201441190,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601507
    },
    {
        "content": "<p>For example, I used some rather ad hoc formatting for the conference and seminar that I started with.   I'd be glad to see improvements made their.   And if I didn't like the changes somebody made, I could raise it on Zulip and we'd work out an understanding.</p>",
        "id": 201441413,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601682
    },
    {
        "content": "<p>If someone had an idea for a big change formatting change to a bunch of stuff, that's already been done, then rather then invest a lot of time in it, and then get people's feedback, a better alternative could be to create a small demo of the new idea, and float it by on Zulip first.</p>",
        "id": 201441625,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592601830
    },
    {
        "content": "<p>This kind of work calls for abilities in organizing and presenting information effectively - and a good deal of legwork as well.   I see an analogy with knitting - it requires thought for the overall design and structure, aesthetics, plus efforts that don't require a lot of thought, and are relaxing in that way, plus they can be labors of love that benefit others.</p>",
        "id": 201441976,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592602062
    },
    {
        "content": "<p>I plan to keep chipping away at this, but it's going to go slowly.   <span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> if you - or anyone else - wants to chip in, for however much time is comfortably available - that would be great.   To the extent that we can crowd-source this,  the faster can we get to a nice resource for the community.</p>",
        "id": 201442148,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592602193
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span> sure, I can crank up my involvement.</p>",
        "id": 201690003,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1592891635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> I didn't yet get to writing the Instiki tutorial.   A good deal of it is pretty clear, but there is some \"kicking around\" of the tires which is helped by some extra explanation - especially to do with creating new pages.   So if you have any questions in the mean time, just post a question.   I suggest going to the Notebook web, and experimenting with creating and editing pages.   Start with the Sandbox in the Notebook web.   To create a new page, you can <em>try</em> by searching for it.   If it's not found in the wiki, there is an option at the beginning of the search results to create the pages.   So try searching for TestPage and then creating it.   To get ideas about the formatting language, look around at pages and Edit their source, copy snippets to a Sandbox page, then cancel out of the source page.   The Azimuth wiki has lots of pages with formatting which you can get ideas from.   Thanks</p>",
        "id": 201690492,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592892451
    }
]