[
    {
        "content": "<p>This is a topic for discussing the <a href=\"https://wiki.functorialwiki.org/act/show/Glossary\">Glossary</a>.</p>",
        "id": 201309862,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592506072
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/243548-practice.3A-ACT.20wiki/topic/This.20vs.20nLab/near/201290098\">said</a>:</p>\n<blockquote>\n<p>To write about the basic concepts of category theory, maybe the main concepts from the first few chapters of Mac Lane plus the main concepts of monoidal categories, from a pedagogical (and maybe applied) perspective</p>\n</blockquote>\n<p>I guess I had in mind pedagogically leaning wiki articles rather than tutorials. And only a short sketch of each at first, realistically I don't have time for long form writing</p>",
        "id": 201372561,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592561879
    },
    {
        "content": "<p>Good!   I'm interested in helping out with that as well.   That kind of article will work well in tandem with tutorials.   (Just deleted the page Tutorials; not needed at the moment.)</p>",
        "id": 201421142,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592588813
    },
    {
        "content": "<p>Let's come up with a good category name for this type of article.</p>",
        "id": 201422303,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592589479
    },
    {
        "content": "<p>I suggest category:gloss</p>\n<p>noun: gloss  <br>\nA translation or explanation of a word or phrase</p>",
        "id": 201422667,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592589654
    },
    {
        "content": "<p>Being that this category represents a kind of dictionary, my recommendation would be to use the nLab naming conventions.</p>",
        "id": 201423215,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592589919
    },
    {
        "content": "<p>One can also add further categorization for the subject area, e.g.,</p>\n<p>category:algebra,logic</p>",
        "id": 201424524,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592590697
    },
    {
        "content": "<p>The collection of all glosses naturally makes up the glossary.</p>",
        "id": 201431881,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592595388
    },
    {
        "content": "<p>Another option is category:glossary.   Using the singular gloss feels more logically consistent, perhaps for the same reason that the nLab guidelines say to use the singular for entries in the mathematical dictionary.   The category can be likened to a predicate.   We would not say \"This article is a tutorials.\"   Yet this is not a watertight argument, as we would also not say \"This article is an algebra.\"</p>",
        "id": 201432851,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592596030
    },
    {
        "content": "<p>Just created the page <a href=\"https://wiki.functorialwiki.org/act/show/Glossary\">Glossary</a>, and linked it from the navigation menu.    This is an index page with \"workflow,\" which shows the following possible states for an article:  suggested, draft and (reasonably) completed.   It is good to prepare a reader's expectations before they start reading.   Articles which are very incomplete are fine - works in progress - but can be disappointing if people click on them expecting to find information.</p>",
        "id": 201433804,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592596615
    },
    {
        "content": "<p>RFC</p>",
        "id": 201434109,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592596805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span> my only comment is that the wiki is well thought out and I can't think of an improvement at the moment. I'm looking at what I can do to contribute to the wiki given I don't have a background in CT.</p>",
        "id": 201434719,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1592597225
    },
    {
        "content": "<p>Thanks!  One option is that there's substantive work to be done for the community in organizing the page on conferences and seminars, which I am chipping away at slowly.   Since it's tangential to this topic, I'll start a new one for that.</p>",
        "id": 201439092,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592600185
    }
]