[
    {
        "content": "<p>Proposal to reuse exactly the same article naming conventions as the nLab without modification: <a href=\"https://ncatlab.org/nlab/show/HowTo#naming\">https://ncatlab.org/nlab/show/HowTo#naming</a></p>",
        "id": 200904363,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592234704
    },
    {
        "content": "<p>In particular \"page articles should be singular nouns\"</p>",
        "id": 200904605,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592234768
    },
    {
        "content": "<p>We don't yet have a quorum here to set binding style guidelines.   But we can  try to come up with recommendations.   But if we can't agree on something, let's temporarily leave room for people to write in the style they feel comfortable with.    Once we have some content and more contributors,  we can have a wider discussion and clean up any inconsistencies.</p>",
        "id": 201305897,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592504028
    },
    {
        "content": "<p>The nLab naming conventions look well thought out.   I propose to provisionally accept these naming conventions for categories that are \"reference dictionaries,\" including the the category \"definition.\"</p>",
        "id": 201306213,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592504181
    },
    {
        "content": "<p>For other categories - including the new category \"tutorial\" -  I propose to follow standard rules for capitalization of  article titles -- capitalize just the first word, except for words that always get capitalized.   It reads well:   \"My journey across the sea\"; \"My journey to Ithaca\".</p>",
        "id": 201306903,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592504551
    },
    {
        "content": "<p>Just edited my proposal above, to use simpler language.</p>",
        "id": 201356797,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592548339
    },
    {
        "content": "<p>Another suggestion.   For any article, one could make a \"personal version\" by qualifying it with your name, e.g., \"monad (Tanzer)\".    That means that (unless you say  otherwise) you are asking to be the sole editor.   OTOH articles not qualified this way are shared content, which everyone is free to work on.</p>",
        "id": 201456029,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592616936
    },
    {
        "content": "<p>I would use this to make draft articles for the glossary, and get feedback before \"publishing\" them.   Not that I'm recommending that everybody do this.     I would choose to do this is because I am not very experienced with CT and it would increase my comfort level.    For someone who is \"in the business\"  it probably makes sense to just go for it.</p>",
        "id": 201456298,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592617428
    }
]