[
    {
        "content": "<p>The most important question to me is how this wiki is distinct from the nLab. It would be bad to (try to) split the community, and it would also be bad to duplicate a lot of effort. My proposal would be that anything that <em>can</em> go on the nLab <em>should</em> still go on the nLab. The problem with that is that the nLab is (at least in theory, and despite appearances) totally open to very applied stuff, so it's still not clear to me what should go where</p>",
        "id": 200813703,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592136326
    },
    {
        "content": "<p>I think it's valuable to get a fresh start without the nLab's \"cultural\" context, especially for more pedagogical articles</p>",
        "id": 200813752,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592136382
    },
    {
        "content": "<p>There are lots of instances where the nLab has a perfectly good (if you accept the nPOV) article on a subject, but there's room for a totally different article on the same subject with different emphasis</p>",
        "id": 200813773,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592136447
    },
    {
        "content": "<p>Naturally starting something like this from scratch failure is still the most likely outcome, so it's probably better to <em>write first and think later</em></p>",
        "id": 200813892,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592136607
    },
    {
        "content": "<p>I agree, but the nLab also doesn't <em>require</em> articles to stick to the nPOV (not in the same way that Wikipedia requires the NPOV)</p>",
        "id": 200890104,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592228531
    },
    {
        "content": "<p>There's still tons of 1-category theory on the nLab</p>",
        "id": 200890133,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592228550
    },
    {
        "content": "<p>Yes, I agree</p>",
        "id": 200903162,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592234260
    },
    {
        "content": "<p>The whole issue is quite delicate though. (In the past I have handled it in a decidedly non delicate way)</p>",
        "id": 200903208,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592234281
    },
    {
        "content": "<p>This wiki differs in that it is created for a specific social context, for ACT.   Think of a regional newspaper.   It may well evolve into something that looks little like an online encyclopedia.   Already we are seeing reading lists and ACT conferences being posted.   One could imagine news articles or calendars.   It's now a community resource, and I think the best thing is to see how it grows, rather than trying to anticipate it.</p>",
        "id": 201074753,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592341938
    },
    {
        "content": "<p>It also differs in structure, in that I am making the most of the multi-web capabilities of Instiki; that in addition to the \"professional\" web called ACT, there are other webs which can play supportive auxiliary roles - the notebook and appendix webs - and address a nonprofessional section of the public that could still be interested in ACT and its extensions - that's the \"blog\" web.</p>",
        "id": 201075768,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592342505
    },
    {
        "content": "<p>Each web, being a subcontext, can potentially have its own content and formatting guidelines.     What's good for a dictionary-style web  of definitions may not fit for a writer's network web of draft blog articles.</p>",
        "id": 201105016,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592374693
    },
    {
        "content": "<p>The only hard, general requirements are that content adhere to collegial norms -- the obvious things like not writing offensively, etc. ---  and that it not be antagonistic to science, whether explicitly or implicitly.   It can be assumed that we are all here for the advancement not the destruction of true understanding.</p>",
        "id": 201105225,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592375037
    },
    {
        "content": "<p>Each web will naturally have its own category schema.   The schema is not formally defined in the system, but it is part of the content structure.   Some webs may benefit from a codified schema, and some may benefit from a free-form structure.</p>",
        "id": 201105847,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592375749
    },
    {
        "content": "<p>A category is in some ways like an embedded sub-web.   It is plausible that in some webs there may be per-category content and formatting guidelines.</p>",
        "id": 201106085,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592376035
    },
    {
        "content": "<p>This could be applied in a web like ACT, which may contain both definitions and \"cultural\" pages like reading lists and course directories.   Definitions could go under category \"definition.\"   They could benefit from dictionary-style naming conventions (like singular nouns beginning with lower case), whereas a cultural pages like \"Courses\" needs to be plural, and looks a lot more standard beginning with a capital.</p>",
        "id": 201106652,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592376755
    },
    {
        "content": "<p>For the webs Notebook, Appendix and Blog there won't be any content requirements besides collegial norms and remaining in the context of math and science - though there is a gentle reminder that ACT is the \"north star\" for the wiki as a whole.</p>",
        "id": 201236281,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592465822
    },
    {
        "content": "<p>Better to see what grows here, organically and then reclassify it later if need be, e.g., move something that seems out of scope to the Notebook.</p>",
        "id": 201237427,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592466731
    },
    {
        "content": "<p>Which leads to the reminder that if you want to say something about the wiki to the general community, use stream #practice: applied ct, topic ACT wiki.</p>",
        "id": 201238091,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592467242
    },
    {
        "content": "<p>I optimistically hope to at least sketch around one wiki article per day. Naturally I won't  hit that, but you get the idea</p>",
        "id": 201244029,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592471385
    },
    {
        "content": "<p>Another thing I can do is to share on twitter, for example every time a new (non-\"administrative\") article is added. Not sure whether it's a good idea before we hit some minimum amount of content, but it would cause the word to spread sooner or later</p>",
        "id": 201244144,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592471451
    },
    {
        "content": "<p>Just out of curiosity (not an interest to control), do you have a sense of the thrust and direction for your writings / sketchings?</p>",
        "id": 201273515,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592489691
    },
    {
        "content": "<p>My present intention is to write primer-style articles for practitioners in fields where category theory may be applied.     For a paradigmatic example, natural transformations and monads deserve to be presented to aspiring functional programmers.    This will fall naturally into  a theory section of the wiki.    But it's clear how different the article on monads here could be than the nLab version, which strives for maximal generality, abstraction and mathematical completeness.   Here the goal is to present enough theory - in a pedagogical style, with good examples, and possibly review sections - to give a theoretical orientation that will help people to \"get the job done.\"</p>",
        "id": 201288988,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592496201
    },
    {
        "content": "<p>I think I basically had something similar in mind</p>",
        "id": 201290017,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592496668
    },
    {
        "content": "<p>To write about the basic concepts of category theory, maybe the main concepts from the first few chapters of Mac Lane plus the main concepts of monoidal categories, from a pedagogical (and maybe applied) perspective</p>",
        "id": 201290098,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592496711
    },
    {
        "content": "<p>Let's go for it!</p>",
        "id": 201290525,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592496858
    }
]