[
    {
        "content": "<p>Dear all, </p>\n<p>I have spent some time on 2-groups since I was a grad student, and there is an aspect of the notion of 2-group that, when I realized it for the first time, seemed amazing to me.  I have learned this reading the paper by <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Lauda \"Higher-Dimensional Algebra V: 2-Groups\" ([BL04]). The fact is well known: a 2-group has all of its 1-cells invertible (w.r.t. composition). This is fact is usually given as the definition, as for instance in Sinh's 1975 thesis (or should we say Hoang's thesis?), which is often considered as a primary reference for the notion of  2-groups (or gr-catégories, as they were named there). In fact this is a theorem, one proof is hidden in the proof of Proposition 20 of  [BL04]. The idea is that you cannot have a category which is a weak internal group object in CAT without it being a groupoid: if objects are weakly invertible w.r.t. tensor and you want this \"inversion\" be internal in CAT (i.e. you want a covariant functor), then this forces arrows being invertible w.r.t. composition. So my first question is: when was this fact discovered? Is [BL04] a primary source for this? I have read 1983 Laplaza's paper \"Coherence for categories with group structure: An alternative approach\", where he studies a notion of categories with group structure (gs-categories), but I haven't read Ulrich's paper where the notion was introduced. However, these gs-categories do not require inversion to be internal, so that in fact it gives a contravariant functor, and invertibility of 1-cells is not implied. Here comes my second question: was Laplaza (and other working on monoidal categories at that time) aware of the notion of gr-catégorie of the Grothendieck school? </p>\n<p>To conclude, I have to admit that invertibility \"for free\" of 1-cells still seems amazing to me. </p>\n<p>It's like... You want to make a monoidal category into a categorified group? Well, you cannot make invertible only the objects - weakly invertible I mean - but also the one-dimensional structure of the arrows must be involved, and they must be strictly invertible. In other words, vertical categorification of groups factors through horizontal categorification of groups ;)</p>\n<p>Ciao!</p>\n<p>Beppe.</p>",
        "id": 295423921,
        "sender_full_name": "Beppe Metere",
        "timestamp": 1661520847
    },
    {
        "content": "<p>I don't know if [BL04] is the primary written source for the fact you mentioned: I probably learned this fact from conversations withJames Dolan, but he didn't claim to be the first to discover it.</p>",
        "id": 295755751,
        "sender_full_name": "John Baez",
        "timestamp": 1661719242
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> . In fact I remember I read a discussion on a forum or something  on the Internet... It was some time ago, indeed, and in that thread James Dolan was explaining this stuff to someone, but I cannot find the source now...</p>",
        "id": 295792304,
        "sender_full_name": "Beppe Metere",
        "timestamp": 1661757147
    }
]