[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/Ideas.20for.20new.20topics/near/198402255\">said</a>:</p>\n<blockquote>\n<p>I'll start. I'd like to see retrospectives on the history of ideas in someone's career, looking at what led them to their early work, through to what changes in directions they've taken as their career progressed. Since there are some senior people here, it might be nice to start with them first: it could be a kind of Ask Me Anything (AMA) session, and serve as a slice of living history for everyone.</p>\n</blockquote>\n<p>I didn't want to have a career. It was the punk times, I was living in the most beautiful squat on earth, with a whole floor for just two of us, and was supporting like 15 people by programming software for opening and closing rows of windows on the first truly gigantig greenhouses somewhere between Utrecht and Rotterdam. But I heard of Goedel's incompleteness theorem, and wanted to understand that and went to study. After 2 years I figured out what it was, and dropped out. But after another 2 years I figured out that they would pay me a little more if I had a diploma, so I went back to study. They wanted me to do 28 exams to graduate. To cut the story short, I complained a lot, and to get rid of me they let me take all exams whenever I wanted. Then Duistermaat offered me to not do any more exams if I would become a grad student. He offered me 1503 guilden per month, and I was earning 7500 from programming. But I was flattered that he wanted me to be a grad student, so I said \"They can never pay me as little as I can work. I'll do this and then I'll go back to programming.\" But after I graduated and went back to the same people who had been paying me 7500 for freelancing, and would have paid me 9000 if i accepted a permanent job, they didn't want to talk to me. I was willing to swear that I would never mention that I had a PhD, but they didn't want to talk to me. So that was the end of my career. I tried to escape from academia 1998 until 2007 again.</p>",
        "id": 198419336,
        "sender_full_name": "dusko",
        "timestamp": 1590137766
    },
    {
        "content": "<p>Dusko, you told me a few stories, but I didnt hear this one before ... thanks ... I always think it would be nice to know more stories like this ...</p>",
        "id": 198515963,
        "sender_full_name": "Alexander Kurz",
        "timestamp": 1590205038
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198419336\">said</a>:</p>\n<blockquote>\n<p>Then Duistermaat offered me to not do any more exams if I would become a grad student. </p>\n</blockquote>\n<p>You mentioned Duistermaat, but your promoters were van Dalen and Moerdijk, and your thesis was on <em><a href=\"http://www.isg.rhul.ac.uk/dusko/papers/1990-proefschrift-dusko.pdf\">Predicates and Fibrations</a></em>. What led you to them and the ideas in your thesis?</p>",
        "id": 198527357,
        "sender_full_name": "(=_=)",
        "timestamp": 1590226591
    },
    {
        "content": "<p>What led you to work on security protocols? It looks like this was during your escape from academia, so perhaps you can also talk about how you engineered that escape.</p>",
        "id": 198540475,
        "sender_full_name": "(=_=)",
        "timestamp": 1590248192
    },
    {
        "content": "<p>I am very interested in that. That is what I meant to write my PhD on, where I want to help develop a mathematics of Tim Berners-Lee <a href=\"https://solidproject.org/\">Solid project</a> for the next Web.</p>",
        "id": 198541015,
        "sender_full_name": "Henry Story",
        "timestamp": 1590249135
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"294557\">@dusko</span>: Is this the Duistermaat of the <a href=\"https://en.wikipedia.org/wiki/Duistermaat%E2%80%93Heckman_formula\">Duistermaat-Heckman formula</a>?</p>\n<p>I think we'd all like to hear more about your escape from academia.  Like caged pigeons we like watching the birds outdoors</p>",
        "id": 198545415,
        "sender_full_name": "John Baez",
        "timestamp": 1590256708
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198527357\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198419336\">said</a>:</p>\n<blockquote>\n<p>Then Duistermaat offered me to not do any more exams if I would become a grad student. </p>\n</blockquote>\n<p>You mentioned Duistermaat, but your promoters were van Dalen and Moerdijk, and your thesis was on <em><a href=\"http://www.isg.rhul.ac.uk/dusko/papers/1990-proefschrift-dusko.pdf\">Predicates and Fibrations</a></em>. What led you to them and the ideas in your thesis?</p>\n</blockquote>\n<p>well i first started in the alg geometry seminar, but p-adic l-functions sounded like some religion to me. and there was a guy next door who counted the number of points on eliptic curves (nowadays everyone knows the theorem by his name), and i was unable to focus on something that could obviously never ever have any connection with real world. logic and type theory seemed like reality embodied. ((10 years later, i pulled my notebooks to understand how could it be that eliptic curves made DHIES like 1000 times faster and many thousands time more secure with shorter keys.)) van dalen and ieke moerdijk were very very nice, but ieke was around only when i had finished writing, and van dalen was mostly at the philosophy department. i spent some time in cambridge, but also didn't quite know how to talk to people. my main claim to fame is that i repeatedly helped stephen hawking into the graduate center for lunch.</p>",
        "id": 198571575,
        "sender_full_name": "dusko",
        "timestamp": 1590306409
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198545415\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span>: Is this the Duistermaat of the <a href=\"https://en.wikipedia.org/wiki/Duistermaat%E2%80%93Heckman_formula\">Duistermaat-Heckman formula</a>?</p>\n<p>I think we'd all like to hear more about your escape from academia.  Like caged pigeons we like watching the birds outdoors</p>\n</blockquote>\n<p>yes, gert heckman was also just down the corridor. i attended some quite spectacular seminars there. duistermaat's story about entropy is still one of vibrating parts of my mind. i think i understood what he was trying to say, but didn't find the model to make it communicable. maybe it smiles some day on me.</p>\n<p>but truth be told, i was completely impossible. i came from the junky scene in sarajevo bosnia to the dutch scene, and there they i got to review submissions to APAL claiming that they proved shimura-tanayama conjecture by model theoretic methods. in 1989. escaping from academia, i learned all about politics. i can tell you exactly what trump means when he says something.</p>",
        "id": 198572149,
        "sender_full_name": "dusko",
        "timestamp": 1590307422
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198545415\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span>: Is this the Duistermaat of the <a href=\"https://en.wikipedia.org/wiki/Duistermaat%E2%80%93Heckman_formula\">Duistermaat-Heckman formula</a>?</p>\n<p>I think we'd all like to hear more about your escape from academia.  Like caged pigeons we like watching the birds outdoors</p>\n</blockquote>\n<p>i am also dying to tell it. attack ships on fire off the shoulder of orion. but it's kind of too much for a margin, albeit of facebook. we should organize a conference in hawaii, and i'll tell you over dinner.</p>",
        "id": 198572394,
        "sender_full_name": "dusko",
        "timestamp": 1590307811
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/History.20of.20Ideas.20AMA.3A.20Dusko.20Pavlovic/near/198572149\">said</a>:</p>\n<blockquote>\n<p>there they i got to review submissions to APAL claiming that they proved shimura-tanayama conjecture by model theoretic methods. in 1989. </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span>: Looks like it's not the first time somebody tried to prove something in number theory using model theory.</p>",
        "id": 198574258,
        "sender_full_name": "(=_=)",
        "timestamp": 1590311280
    }
]