[
    {
        "content": "<p>Due to my moderate autism I was considered developmentally disabled and flunked second grade. The next year I discovered discrete calculus. I also remember having the idea that Newton's revolution was only the first of two needed parts and that a revolution of the soft sciences was needed. I wanted to understand the entirety of science and in fourth grade concluded I needed to master college level math. In seventh grade I taught myself algebra and basic calculus. Freshman year in high school in 1971 I discovered Euler's identity and pondered fractional dimensions, algorithmic information theory (got it totally wrong) and iterated exponentiation aka tetration. <br>\nAt sixteen I connected with folks practicing yoga meditation and recalled Henri Poincaré's comment on mathematicians not being aware of the source of their mathematical intuition. Also mastery of my mind seemed a good approach to doing significant mathematics. I then skipped from sophomore year in high school to sophomore year in college. Then problems with depression and poverty.<br>\nI entered the Air Force in the late seventies and ended up at AFTAC monitoring the nuclear test ban treaty. AFTAC worked with DARPA and no expense was spared. AFTAC was a world class scientific establishment and I flourished there. I worked as a systems engineer/electrical engineer/mathematician/seismologist/computer programmer. <br>\nLots of signal processing and early AI - adaptive filtering, beam steering, cepstrums, convolution filters. My AI textbook from 1979 is completely useless.</p>",
        "id": 198428603,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590145113
    },
    {
        "content": "<blockquote>\n<p>Have you ever known anyone with autism to be anything if not absolutely incorruptible?</p>\n</blockquote>",
        "id": 198429205,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590145578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> I didn't catch the jump from Air Force to Yoga :D What's your input on the effect that meditation has on doing mathematics? <br>\nI always wonder where we are in our head, when we e.g. imagine a vector spaces. It doesn't seem in the past, the present or the future.</p>",
        "id": 198430028,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1590146211
    },
    {
        "content": "<p>Sorry I was in yoga at 16 and in the USAF at 21. I had several guys meditating at night in basic training. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span><br>\nI believe autistic people and some good mathematicians repurpose their visual cortex. I've trained myself not to need pen and paper but to just see what I'm working on in my mind. While the effect feels mystical, I believe it is neurological.<br>\nI suspect meditating keeps me mentally young. I'm retired and still aggressive in my research after 55 years.<br>\nFun fact - I've spent about ten years as a yogic monk teaching meditation and doing social service.</p>",
        "id": 198430995,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590146984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/Living.20histories/near/198422499\">said</a>:</p>\n<blockquote>\n<p>I think there may be a lot of fear that you may take the manager's job who is trying to employ you. It is tricky situation: you can't really say that you just want the job because you want to earn some money, as they want people to be super-enthusiastic about the job. You can't tell the manager that you don't want his job because there are more interesting things to do, because then that would show you are not super enthusiastic, and 2) that you think the manager has a boring job. <br>\nBut this is getting a bit off topic :-)</p>\n</blockquote>\n<p>you know what they told me (tho this was like 25 years ago). they said: \"I know you are a good programmer, but the fact that you have preferred the comfort of academia over the challenges of practice disqualifies you.\" I am not sure that I am quite quoting it, but it was something like that. Tho truth be told, that was a deep thinking and in fact honest dutch calvinist enterpreneur. most of the time they don't know what they are doing. many people eg in palo alto really function very well, but they don't really know what they are doing.</p>",
        "id": 198522595,
        "sender_full_name": "dusko",
        "timestamp": 1590217806
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/Living.20histories/near/198423529\">said</a>:</p>\n<blockquote>\n<p>Anyway, that's just some recent experience trying to get work in the UK to supplement my thesis income. I think the US especially California or Massachusets are different. People there actually know what computing is about. In London they know about finance. Paris fashion and politics. And Bavaria where I am now cars and beer.</p>\n</blockquote>\n<p>no one knows what computing is about. the engineers who remembered how some parts of the chip architecture were designed retired 20 years ago. they were available by phone for up to 15 years. and as for software, until recently it could be argued that some person at google, still understanding the architecture, has an operational knowledge of the functioning of the system. with neural networks, there is even no more <em>theoretical</em> claim that we know how any of the systems actually work.</p>",
        "id": 198522723,
        "sender_full_name": "dusko",
        "timestamp": 1590218099
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276867\">Daniel Geisler</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/Living.20histories/near/198430995\">said</a>:</p>\n<blockquote>\n<p>Sorry I was in yoga at 16 and in the USAF at 21. I had several guys meditating at night in basic training. :)<br>\nI believe autistic people and some good mathematicians repurpose their visual cortex. I've trained myself not to need pen and paper but to just see what I'm working on in my mind. While the effect feels mystical, I believe it is neurological.<br>\nI suspect meditating keeps me mentally young. I'm retired and still aggressive in my research after 55 years.<br>\nFun fact - I've spent about ten years as a yogic monk teaching meditation and doing social service.</p>\n</blockquote>\n<p>wow, you really covered all bases. i would be interested to read a book about all that. it would be challenging to make One Thing of it all. kolmogorov complexity and tetration and meditation and social service. very impressed.</p>",
        "id": 198522989,
        "sender_full_name": "dusko",
        "timestamp": 1590218537
    },
    {
        "content": "<p>There is a dark side to my life - chronic homelessness. I've only recently obtained a home after being homeless for a year and a half. Because I have hyper acute senses I can't stay with other people, so I stay in the woods. Fortunately I'm burly enough no one messes with me. One of my best jobs was working one on one with violent developmentally disabled people. Then in 2002 I worked with a non-vocal autistic man and taught him to speak and express his desires.</p>",
        "id": 198523663,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590219865
    },
    {
        "content": "<p>Statistics: <br>\nI'm 63 - the average autistic life span is 60 years.<br>\n90% unemployment</p>",
        "id": 198523732,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590219998
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276867\">Daniel Geisler</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/Living.20histories/near/198523732\">said</a>:</p>\n<blockquote>\n<p>Statistics: <br>\nI'm 63 - the average autistic life span is 60 years.<br>\n90% unemployment</p>\n</blockquote>\n<p>What do autistic people die of there?</p>",
        "id": 198531639,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1590234380
    },
    {
        "content": "<blockquote>\n<p>Nikolaj Kuntner<br>\nDaniel Geisler said:<br>\nStatistics:<br>\nI'm 63 - the average autistic life span is 60 years.<br>\nWhat do autistic people die of there?</p>\n</blockquote>\n<p>I assume poverty and poor health care</p>",
        "id": 198531893,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590234906
    },
    {
        "content": "<p>Even the darkness contains light:<br>\nTechnically I considered myself unhomed with the Earth, or better yet Gaia, and we look out for each other. I consider Gaia to be my Mother. Often my senses are super humanly acute and I enjoyed living in the woods. I remember laying in a light rain with my shirt off and it was exquisite.</p>",
        "id": 198532211,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590235451
    },
    {
        "content": "<p>Suicide is also another huge problem for autistics, because we’re so different and we don’t fit in (and sometimes don’t know why) and don’t get the support we need to cope with depression and anxiety. And filicide, unfortunately, is also a thing. Chronic health issues, poverty like Daniel mentioned, discrimination ... it’s a big long list I’m afraid :(</p>",
        "id": 198555132,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1590273285
    },
    {
        "content": "<p>Although the mathematician in me has to wonder: what is the life expectancy for those who make it to their 20s? (Just like infant mortality can skew perceptions of average life expectancy in times and places where that is a problem.)</p>",
        "id": 198555183,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1590273376
    },
    {
        "content": "<p>Just so folks know there is a method to my madness, I self-identify about being autistic and dealing with being bipolar to connect with people and support them. One of these days someone will come along who is like me and they will know they weren't alone. Ten years ago someone bragged that there was an autistic mathematician at Berkeley, like we have a single autistic person in our profession! <br>\nAs a yogi of fifty years, I paid a price against darkness. We fight our inner battles so we can then serve humanity in fighting our collective battles. So I have shown up to work with the Azimuth Project at least part time. That is the positive and beautiful thing autistics can bring to society as we manifest sentinel intelligence.</p>",
        "id": 198556931,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590276927
    },
    {
        "content": "<p>Folks, feel free to PM me if you ever need someone to talk to. While I can only serve as a friend, I worked crisis intervention for half a dozen years.</p>",
        "id": 198557139,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590277278
    },
    {
        "content": "<p>Many autistics I have known have developed a high degree of self-awareness, probably out of necessity. The term \"old soul\" may be a cliche, but I think there is frequently some justice in applying the term to such people. (Somewhere in the thread I saw the word \"incorruptible\", and while that's awfully strong, they are frequently \"honest to a fault\", I find.)</p>",
        "id": 198558493,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1590279610
    },
    {
        "content": "<p>Well, time to turn the floor over to the many more worthy people we have not heard from. <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 198560987,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590285064
    },
    {
        "content": "<p>Speaking as a young autistic mathematician, it was nice to hear your story, Daniel.<br>\nI would like to mention though that using functioning labels like \"high functioning\" can be harmful to people like us, though? How autistic people function in our neurotypical-oriented society is rarely as simple as a well/badly dichotomy (due to depending on the type and context of a task, the amount of support received, and the amount of spoons available), and can contribute to negative treatment of autistic people - \"high functioning\" people may receive less support than they should, and \"low functioning\" people may receive fewer opportunities, despite their capabilities.<br>\n(Not saying that this was intended; just hoping to help people use the language in a more aware way.)</p>",
        "id": 198598604,
        "sender_full_name": "Jem",
        "timestamp": 1590351990
    },
    {
        "content": "<p>I edited my comment, Jem. Thanks for explaining this.</p>",
        "id": 198600205,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1590354366
    },
    {
        "content": "<p>I came across Autism as a concept in courses on the Philosophy of Mind in the early 1990s at Birbeck College London. Looking around on the internet just now I found <a href=\"https://books.google.co.uk/books?hl=en&amp;lr=&amp;id=4isTDgAAQBAJ&amp;oi=fnd&amp;pg=PA163&amp;dq=autims+philosophy+of+mind&amp;ots=D-bhqOg_A6&amp;sig=aHq4i5_aXPaA0rs8me0rvDDsJn8#v=onepage&amp;q=autims%20philosophy%20of%20mind&amp;f=false\">an article in this 1994 book</a> that looks like it is close to what we covered then. <br>\nIt struck me over time that some fields don't leave space for minds, at least as they are usually taught. So for example in Physics, mathematics or engineering one does not usually come across them. One learns about a lot of concepts (atoms, electrons, mass, geometric figures, ...) in huge details, but minds don't come up as concepts. One may get some first opening on the notion of a point of view from geometry, since one can see how a scene can be seen differently at different points of views (but the scene is still the same for all). But one does not usually work there with concepts that explain how people can understand others to have different beliefs, thinking the world to be different from the way others think it is. Notions of desires or aims don't come up.<br>\nThey don't come up in computer science either usually. As a result we have people who are well trained in computer science, who, due to lack of concepts in that field relating to this, don't know how to model these very important phenomena.  One  can think of Object Oriented programming, for example, as a bit like carpentry: One builds a chair, a table, objective things, and one has to look at that it functions correctly. In other parts one is more of a plumber, building tubes for information flow. So one works with information often without looking at its interpretation. <br>\nThis is where I found modal logic to be very helpful. It gives one a way to move from an objective logic/mathematics, to one that expand that by  considering all possibilities to model beliefs held by different agents so that one can build (mathematical/logical) tools that take those views into account. On the semantic web, which turns the World Wide Web into a database, this is paramount, since we can't assume one unified consistent database: everyone can publish anything. <br>\nI have actually floundered with quite a few programmers on just this issue trying to build the tools for the semantic web, as they would want to simplify things by putting everything in one database, without distinguishing who said what.<br>\nSo if the definition of autism that I came across is correct, then it could be that a lot of people are by training pushed in that direction, as they have no way with their tools to conceive of how to model minds. If they happen to be very conscientious, trying to think through the logical conclusions of their tools (perhaps starting with a strong belief in the objectivity of physics, or in  computer science they could be taken by the idea of a reduction of truth to information) then they could well end up trapped.</p>",
        "id": 198600859,
        "sender_full_name": "Henry Story",
        "timestamp": 1590355378
    },
    {
        "content": "<p>The people who do HCI do think about 'theory of mind' more than the rest of people in CS. It is also fairly present in Game Studies, as that is very inter-disciplinary.  There are others as well: for example the \"Psychology of Programming\" folks.</p>\n<p>I've actually got 2 Ph.D. students working on game-related things where these things come up: one is doing an \"Emotion Engine\" for NPCs (based on theories of emotion from psychology, not the weird stuff that CS people cobbled together because they could 'compute'); the other is looking at the 'mechanical human' (i.e. motor skills and lower level cognition) as part of the game&lt;-&gt;human loop. The 'competency profile' of a human player has a lot to do with how they experience [and succeed / fail at] a game.</p>\n<p>Lastly, Chris Martens (<a href=\"https://sites.google.com/ncsu.edu/cmartens\">https://sites.google.com/ncsu.edu/cmartens</a>) has done some amazing work linking ideas from modal logic to various aspects of game design, especially narrative.  Of course, a very high-level concept like 'narrative' is a very human idea, so finding formal structures to explain it can be quite challenging.</p>",
        "id": 198601908,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1590357060
    },
    {
        "content": "<p>Oh very interesting, from Chris Martens site on the  Principles of Expressive Machines (POEM) Lab</p>\n<blockquote>\n<p>Like poems (the namesake of my lab), my projects generally explore the relationship between syntax and semantics, between formal structure and expressive affordances. Examples include modeling narrative structure with linear logic; using dynamic epistemic logic to give a theory of mind to agents that can play communicative, social games; using constraint solving and static analysis to generate games that communicate specific ideas through interactive processes; examining interfaces to virtual worlds through the lens of programming languages; </p>\n</blockquote>\n<p>I have been hovering around linear logic, games, dynamic epistemic logic, and model logic (Virtual worlds are one way of thinking of those).</p>",
        "id": 198602166,
        "sender_full_name": "Henry Story",
        "timestamp": 1590357472
    },
    {
        "content": "<p>And indeed my thought is that the whole Human Computer Interface will need to be rethought for the Semantic Web, to allow people to see perspectives on their data from different points of views.</p>",
        "id": 198602299,
        "sender_full_name": "Henry Story",
        "timestamp": 1590357643
    },
    {
        "content": "<p>I had this story to illustrate this idea of dealing with data on the web and its impact on user interfaces <a href=\"https://co-operating.systems/2019/04/01/PhD_second_year_report.pdf\">my second year report</a> which is quite funny (though perhaps I was told not quite right for a thesis).<br>\n<a href=\"/user_uploads/21317/6GSEWdu5NfUvIVfKcSwQy2mi/Screen-Shot-2020-05-25-at-00.06.24.png\">Screen-Shot-2020-05-25-at-00.06.24.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/6GSEWdu5NfUvIVfKcSwQy2mi/Screen-Shot-2020-05-25-at-00.06.24.png\" title=\"Screen-Shot-2020-05-25-at-00.06.24.png\"><img src=\"/user_uploads/21317/6GSEWdu5NfUvIVfKcSwQy2mi/Screen-Shot-2020-05-25-at-00.06.24.png\"></a></div>",
        "id": 198602566,
        "sender_full_name": "Henry Story",
        "timestamp": 1590358123
    },
    {
        "content": "<p>Sorry I didn’t read the whole link yet, but most people I know believe that the theory of mind deficit research is out of date and missed the point. Here’s two modern viewpoints on it:</p>\n<p><a href=\"https://embraceasd.com/weak-theory-of-mind/\">https://embraceasd.com/weak-theory-of-mind/</a></p>\n<p><a href=\"https://neuroclastic.com/2018/09/11/aspergers-and-empathy/\">https://neuroclastic.com/2018/09/11/aspergers-and-empathy/</a></p>",
        "id": 198633349,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1590381889
    },
    {
        "content": "<p>I'm sorry lovely people, but I need to ask folks to keep conversations on this thread relevant to this website.<br>\nI have a new website where people can ask the sort of questions that don't fit in here.<br>\n<a href=\"http://oracleofchaos.com/\">Oracle of Chaos</a></p>",
        "id": 198654814,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590402910
    },
    {
        "content": "<p>Daniel, can you say a little more about the meditative traditions and practices you have been immersed in? Are some of these practices things you would generally actively encourage people with an ASD to explore?</p>",
        "id": 198711735,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1590454104
    },
    {
        "content": "<p>I consider people's spiritual needs quite distinctive. Fortunately there are a wide variety of mental disciplines a people can take up. If someone asks me for a book on spirituality I begin to enumerate the different approaches and major books. <br>\nPhysiologically there are two types of mediation - mindfulness and mastery. I connected up with tantra yoga where the focus was self mastery and transforming the world though social service. But as amazing as yoga was, they where so demanding that I suffered from depression from not being able to perfectly follow elaborate spiritual practices. So I'm cautious about recommending a path. <br>\nOn the other hand I'm a \"hard core\" person, so advanced yoga mediation became my focus. Later I would do \"heroic\" doses of acid and shrooms, but my experience in meditative states was far more powerful and profound. <br>\nI took to Bodhisattva oath at sixteen and that shapes much of who I am. To be continued on my new website...</p>",
        "id": 198715714,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590460755
    },
    {
        "content": "<p>We can take it up over there, if that's where you're more comfortable. But you must have had a guide/master/guru (however you wish to refer to said person), no? Maybe more than one. I'm curious about the circumstances.</p>",
        "id": 198717554,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1590463732
    },
    {
        "content": "<p>I am also curious about the circumstances. Also I believe that in Zulip more than one people can privately chat (if they want), so that could also be an alternative.</p>",
        "id": 198720784,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1590469183
    },
    {
        "content": "<p>At my sixteenth birthday I came across a circle of meditating people doing Ananda Marga meditation whose guru was <a href=\"https://en.wikipedia.org/wiki/Prabhat_Ranjan_Sarkar\">Prabhat Ranjan Sarkar</a>. To be honest I thought myself a good mathematician, but I wanted more mathematical power, much more power. I considered yogi's capable of doing things most people would consider magical. I thought if I could gain the control of my mind I could be a much better mathematician. I feel a deep connection with Yoga, Christianity, Buddhism, Tantra, Zen and so on. I particularly relate to the Dalai Lama's take on science as taking precedence over scripture. </p>\n<p>I never had just a single mystical connection or just one teacher. I had my mathematical Muse since early childhood. For me looking at the times tables was to look upon the naked face of God. Then at seventeen I had a long series of visions of seeing the Divine as a scientist. During the visions I understood all science, but afterwards, not so much.</p>",
        "id": 198721483,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590470293
    },
    {
        "content": "<p>transcendental experiences are good for something, but not so good for concrete and rigorous understanding. experiences of unity as a flow within the world, manic episodes of free association, obsessive thoughts of multiversal metaphysics and anthropic decisionmaking, the purity and refinement of experiencing a very small formal system... they all motivate me, and i feel like they have recoverable content, but the state i am in to experience such things incapacitates me to any sort of recovery, and the feelings of insight are illusory if i am not able to recover the content of an experience.</p>\n<p>not that i would say i'm not constantly incapacitated by adhd and general confusion about how to demonstrate to myself that i understand anything in a reliable way, but. generally the more confidence i have the less i can actually trust anything i'm thinking, the less coherently i'm able to communicate with even my near-future self, the less i'm able to concentrate on doing anything that builds on past effort or suggests future direction.</p>\n<p>and that is why i primarily trawl for pdfs by people who have publishable thoughts.</p>",
        "id": 198740627,
        "sender_full_name": "Pastel Raschke",
        "timestamp": 1590486919
    },
    {
        "content": "<p>I believe that mathematics and spirituality are closely aligned, but not the same. A person can experience constructive or destructive interference from them. My transcendental experiences gave me the will and the drive to make it through the dark times. One hundred times I have been unable to get out of bed from depression. I've learned to take a \"mathematical vacation\" where I am responsible for nothing beyond my mathematical joy. My mathematical intensity serves as a flywheel powering my life until I'm functional again. I was born with the tools I needed even if it took a while to understand how to use them.<br>\nI hope folks still read ET Bells <strong>Men of Mathematics</strong>. Now I guess it seems silly, but I also feel there is some fundamental truth in the positivity of the book. What I've learned over the decades is you can be good at math, you can be good at life - do not forget to be good at life. Still there is something special when a persons spiritual forces and their mathematical strength create constructive interference. <br>\nDisclaimer: as opposed to the others in the AMA, my work does not earn me a spot in this list. I'm painfully aware of this. Well, back to playing blues guitar.</p>",
        "id": 198747580,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1590491874
    }
]