[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> and <span class=\"user-mention\" data-user-id=\"276770\">@Steve Awodey</span>, I'm curious about your experience in writing (or rather leading the writing of) a massive open-source math textbook <a href=\"https://github.com/HoTT/book\">https://github.com/HoTT/book</a>.</p>\n<p>Did you or some of the other authors write anything about this? And anyway, would you be willing to answer some general big-picture questions here?</p>",
        "id": 208326391,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598610633
    },
    {
        "content": "<p>There were some blog posts when the book first came out: <a href=\"https://homotopytypetheory.org/2013/06/20/the-hott-book/\">https://homotopytypetheory.org/2013/06/20/the-hott-book/</a>, <a href=\"https://golem.ph.utexas.edu/category/2013/06/the_hott_book.html\">https://golem.ph.utexas.edu/category/2013/06/the_hott_book.html</a>, <a href=\"http://math.andrej.com/2013/06/20/the-hott-book/\">http://math.andrej.com/2013/06/20/the-hott-book/</a>.  And here are some slides from a talk I gave once that might be relevant: <a href=\"http://home.sandiego.edu/~shulman/papers/nlabhott.pdf\">http://home.sandiego.edu/~shulman/papers/nlabhott.pdf</a>.  I'd be happy to answer questions too.</p>",
        "id": 208339018,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598619766
    },
    {
        "content": "<p>Great. I'll have a read through those, and see what's left to say. :)</p>",
        "id": 208341643,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598621048
    },
    {
        "content": "<p>Is this a secret hint that there could be an open source CQM book in the future?</p>",
        "id": 208344725,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1598622543
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> I guess the thing that interested me the most, which you already touched on in your blog and talk, was how you and the other core writers kept the whole thing from falling into chaos. You mentioned in your slides a \"unity of vision\" of the core contributors, which really helped. Is that something you more or less had from the start, or was it (perhaps painstakingly) established during writing?</p>",
        "id": 208348784,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598624552
    },
    {
        "content": "<p>Andrej Bauer wrote a nice article for the Institute Letter, which is here:<br>\n<a href=\"https://www.ias.edu/ideas/2013/bauer-hott-book\">https://www.ias.edu/ideas/2013/bauer-hott-book</a><br>\ndon't miss the neat video linked there depicting the authorship of the book. <br>\nAndrej was also interviewed about it for an article in  Wired magazine  - maybe someone has the link.</p>",
        "id": 208352810,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1598626483
    },
    {
        "content": "<p>One thing that should be remembered is that we were basically living together on a space ship for nearly a year, meeting daily for seminars, working groups, tea, meals, walks, etc.  GitHub allowed us to do the actual writing and that was necessarily online, but there was a lot face to face interaction and discussion that wasn't online - even sometimes sitting around a big table with laptops open and writing text together while discussing it.  I think it would be very different trying to do everything online.</p>",
        "id": 208355617,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1598627680
    },
    {
        "content": "<p>Maybe this one? <a href=\"https://www.wired.com/2013/06/cades-witty-headline-here/\">https://www.wired.com/2013/06/cades-witty-headline-here/</a></p>",
        "id": 208355995,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598627873
    },
    {
        "content": "<p>yup</p>",
        "id": 208356217,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1598627963
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276770\">Steve Awodey</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/HOTT.20Book/near/208355617\">said</a>:</p>\n<blockquote>\n<p>One thing that should be remembered is that we were basically living together on a space ship for nearly a year, meeting daily for seminars, working groups, tea, meals, walks, etc. </p>\n</blockquote>\n<p>Sounds like fun. :) Also very intense.</p>",
        "id": 208356718,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598628210
    },
    {
        "content": "<p>Steve is right that being all together at IAS for a year was very helpful.  Also, the long list of participants in the preface may be a bit misleading as the number of people actively writing large amounts of text for the book was significantly smaller (roughly enough to fit around a large table, as Steve says).  However, I don't think it would be impossible to manage online, even with a larger number of contributors, as long as there were one or a few \"dictators\" who had a coherent vision and were enabled to freely edit everything.  Wikipedia manages to have a surprisingly consistent style despite having orders of magnitude more editors.</p>",
        "id": 208356905,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598628297
    },
    {
        "content": "<p>I suppose that zoom meetings could also replace some of the face-to-face interaction.</p>",
        "id": 208369994,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1598634497
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276770\">Steve Awodey</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/HOTT.20Book/near/208369994\">said</a>:</p>\n<blockquote>\n<p>I suppose that zoom meetings could also replace some of the face-to-face interaction.</p>\n</blockquote>\n<p>Yeah. Though probably pretty hard to recreate that \"hackathon\" atmosphere of a lot of people around a table tex'ing/coq'ing away.</p>",
        "id": 208374003,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598636599
    },
    {
        "content": "<p>How did you decide who to call an author (vs someone who did a couple of pull req's)? Was there some particular threshold, or just kindof common sense?</p>",
        "id": 208374164,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598636684
    },
    {
        "content": "<p>Technically no person is explicitly designated as an \"author\" of the HoTT Book.  The people listed in the preface are all the participants of the special year, all of whom we regard as having contributed something to the book, whether by writing some of the text or by development of the ideas expressed therein.  So we didn't have to set any threshold or make any judgment calls.</p>",
        "id": 208375194,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598637267
    },
    {
        "content": "<p>Post-publication, various fixes have been contributed on github by others who were not at the special year, but we tried to be clear in advance that although we invite such contributions (subject to our policies about what sorts of changes will be made to the first edition), they will not be given any sort of coauthor credit.</p>",
        "id": 208375426,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598637395
    },
    {
        "content": "<p>except the fame that comes with an accepted pull request!</p>",
        "id": 208378836,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1598639279
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/HOTT.20Book/near/208375194\">said</a>:</p>\n<blockquote>\n<p>Technically no person is explicitly designated as an \"author\" of the HoTT Book.</p>\n</blockquote>\n<p>That's pretty radical, maybe more so that than doing the whole thing \"open source\" in the first place. But it also makes sense. No need to make awkward decisions about who's in the \"in crowd\" and who's not.</p>",
        "id": 208386451,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598643425
    },
    {
        "content": "<p>What sorts of procedures / roles / documents / etc did you set up to help keep things uniform and going in the right direction? Was there anything you didn't do from the start that you wish you had?</p>",
        "id": 208387509,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598644054
    },
    {
        "content": "<p>Unfortunately my memory is kind of spotty.  If I'd known at the time people would be so interested in the process of writing the book, I would have paid better attention and maybe taken notes!</p>",
        "id": 208397073,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598650192
    },
    {
        "content": "<p>One thing I do remember that I think was helpful was to enforce the use of semantic LaTeX macros.  That allowed us to sidestep many arguments about notation by saying \"just use the macro; later on we can change the macro definition.\"  I believe we had a \"technical dictator\" whose job was to uniformize everyone's LaTeX code to use the semantic macros.</p>",
        "id": 208397344,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598650360
    },
    {
        "content": "<p>I believe we did assign specific chapters to specific people at the beginning, although the particular assignments didn't always persist.  I have a vague memory of there being someone designated as a dictator of another sort too, but I can't remember what it was.</p>",
        "id": 208397458,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598650445
    },
    {
        "content": "<p>Oh, I see from <a href=\"https://ncatlab.org/ufias2012/published/The+book\">https://ncatlab.org/ufias2012/published/The+book</a> (archived from the wiki we used during the special year) that it was a \"logical dictator\".  But I don't remember what that meant.</p>",
        "id": 208397705,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1598650652
    },
    {
        "content": "<p>would be interesting to know what the \"logical dictator\" did. maybe making sure you used the same exact version/formulation of axioms and rules throughout?</p>",
        "id": 208480939,
        "sender_full_name": "Aleks Kissinger",
        "timestamp": 1598787273
    },
    {
        "content": "<p>Crazy to think the book was released over 7 years ago.</p>",
        "id": 208491697,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1598803849
    }
]