[
    {
        "content": "<p>I have been wondering for while about the relation of Category Theory to French Structuralism as it became the philosophical movement in the 50s and 60s, leading at its apotheosis to the French football coach claiming he was sure to win because they were applying structural methods.<br>\n It is odd that structuralism appeared just at the point when Category Theory, which it seems can also be thought of as the mathematics of structures, came to be.</p>",
        "id": 198530441,
        "sender_full_name": "Henry Story",
        "timestamp": 1590232104
    },
    {
        "content": "<p>I think that sort of structuralism really came from Bourbaki, or at least that's what the author of a book I read (<em>The artist and the mathematician</em>) claimed. However, Grothendieck left Bourbaki and set out with his focus on categories in his own group.</p>",
        "id": 198649837,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1590398752
    },
    {
        "content": "<p>Yeah, he's been emailing me about that stuff.</p>",
        "id": 198794456,
        "sender_full_name": "John Baez",
        "timestamp": 1590513957
    },
    {
        "content": "<p>He's really nice.  I tend to feel stupid because he knows so much more about some kinds of math, maybe homotopy theory and number theory in particular.  But then there are sometimes things I consider elementary that he doesn't know, or mistakes he makes that I can catch.   I guess this just means there's too much math for anyone to have a chance to know most of it.</p>",
        "id": 198838943,
        "sender_full_name": "John Baez",
        "timestamp": 1590539828
    },
    {
        "content": "<p>I'm probably going to DC this fall, and I'd hoped to visit him at the University of Maryland, but he's retired now and lives in Charlottesville or somewhere.   But he said he'd like to meet sometime.</p>",
        "id": 198839002,
        "sender_full_name": "John Baez",
        "timestamp": 1590539890
    },
    {
        "content": "<p>I'm not sure we're able to communicate very well about math....</p>",
        "id": 198839029,
        "sender_full_name": "John Baez",
        "timestamp": 1590539943
    },
    {
        "content": "<p>It would be nice if we develop one topic dedicated to origin of names of mathematical structures in category theory.</p>",
        "id": 226776032,
        "sender_full_name": "Uroš Nedić",
        "timestamp": 1613635282
    }
]