[
    {
        "content": "<p>Hi all, clearing out my mum's attic I found a box of old lecture notes on category theory from the 70's. She was a grad student then. Does anyone have recommendations on finding out whether they would be interesting/useful to others? I will of course look everything up online but also have a lot of other stuff to go through so any shortcuts welcomed!</p>",
        "id": 356359188,
        "sender_full_name": "Martha Lewis",
        "timestamp": 1683400219
    },
    {
        "content": "<p>Who gave the lectures?</p>",
        "id": 356366788,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1683404837
    },
    {
        "content": "<p>Hi, looking closer quite a lot of it may well be available online, e.g. quite a few bound lecture notes from Aarhus, and preprints. Stuff that is maybe less readily available: teaching notes from a category theory seminar at University of Sussex by Christopher Mulvey, 1970,71,73, abstracts of lectures given at that seminar in 1976, some class notes on sheaves and logic by Dana Scott, early drafts of a couple of papers.</p>",
        "id": 356374069,
        "sender_full_name": "Martha Lewis",
        "timestamp": 1683409835
    },
    {
        "content": "<p>Scan as many as you can!</p>",
        "id": 356479793,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1683463028
    },
    {
        "content": "<p>This would be of great interest to me.</p>",
        "id": 356480363,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1683463222
    },
    {
        "content": "<p>Same! I would love to learn Scott's perspective on sheaves!!</p>",
        "id": 356486591,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1683465238
    },
    {
        "content": "<p>Glad it’s of interest - I’ll give a full list later on and let me know what people have interest in. Will also check on who I should check with before scanning and sharing, the authors/family I guess.</p>",
        "id": 356511189,
        "sender_full_name": "Martha Lewis",
        "timestamp": 1683473720
    }
]