[
    {
        "content": "<p>Following the Unicode mailing list, I recently read <a href=\"https://corp.unicode.org/pipermail/unicode/2021-September/009552.html\">this message</a>:</p>\n<blockquote>\n<p>It seems that the symbol U+22B6 has been used first by Joachim Kock from UAB Barcelona Maths Department. He is also using on a website, last modified in 2006, four years before the already mentioned paper “Polynomial functors and opetopes” had been published.[1]</p>\n</blockquote>\n<blockquote>\n<p>The symbol has been “borrowed” from other authors, e. g. [2], [3]</p>\n</blockquote>\n<blockquote>\n<p>Maybe Mr. Kock can provide more information about the origin of that<br>\ncharacter and also answer the other questions.</p>\n</blockquote>\n<p>The \"U+22B6\" being referred to is the symbol '⊶'.</p>\n<p><span class=\"user-mention\" data-user-id=\"276625\">@Joachim Kock</span>, not sure if this query has already been passed on to you via other channels?</p>",
        "id": 252173399,
        "sender_full_name": "Alexis Hazell",
        "timestamp": 1630933810
    },
    {
        "content": "<p>I think he doesn't read this very much...</p>",
        "id": 252202943,
        "sender_full_name": "John Baez",
        "timestamp": 1630948790
    },
    {
        "content": "<p>Thanks for the ping!</p>\n<p>This is funny. I didn't even know ⊶ was a unicode symbol.</p>\n<p>I started using it with André Joyal, Michael Batanin, and Jean-François Mascari in 2004 for what we called the zoom relation.  (That was long before  Zoom the app.) A zoom complex is a sequence of trees with circles, with a bijection between between circles in one tree and nodes of the next tree (and a bijection between nodes in one tree and leaves in the next). These bijections is the zoom relation. The symbol ⊶ is thus 'onomatopoetic'. Zoom complexes are a combinatorial model for the opetopes, and the zoom relation is implicit already in the work of Baez and Dolan.</p>\n<p>To print the symbol in the paper, we had to use a little postscript figure in a \\savebox. Nowadays it can be obtained with tikz arrow heads</p>\n<p>-Circle and -{Circle[open]}.</p>",
        "id": 252304504,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1631021216
    }
]