[
    {
        "content": "<p>Prompted by Saunders Mac Lane's comment about &ldquo;purloining words from the philosophers&rdquo; &mdash; I know many people take that as tongue-in-cheek but I take him at his words, purloined or otherwise &mdash; I began a sketch several years ago inquiring into the continuities of the category concept through history.&nbsp;  Clearly, there are wide divergences in the names and numbers of categories coming from different categorizers, so we don't expect to find much continuity there, but in the common function of category markers.</p>\n<p>Here's a couple of links to what I've cobbled together so far &mdash;</p>\n<p>&#128606; <a href=\"https://oeis.org/wiki/Precursors_Of_Category_Theory\">Precursors Of Category Theory</a><br>\n&#128606; <a href=\"https://inquiryintoinquiry.com/2020/09/20/survey-of-precursors-of-category-theory-2/\">Survey of Precursors Of Category Theory</a></p>\n<p>Regards,<br>\nJon</p>",
        "id": 240838466,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1622470520
    },
    {
        "content": "<p>I would say also definitely Alfred North Whitehead. His ‘definition’ of the notion of a point in space is eerily close to locale theory.</p>",
        "id": 240844192,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622473722
    },
    {
        "content": "<p>He defines a point in a space as a kind of imaginary limit of extended regions</p>",
        "id": 240844218,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622473741
    },
    {
        "content": "<p>With the dynamically extended regions/events playing the dominant role and the points (of space or time) emerging as constant idealisations</p>",
        "id": 240844423,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622473838
    },
    {
        "content": "<p>Also Bergson’s ‘synthetic’ approach to experience with the idea that we understand dynamic experiences by ‘probing them’</p>",
        "id": 240844637,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622473947
    },
    {
        "content": "<p>So the thing is in itself totally synthetic and whole with our understanding of it coming from the ways we see it in different contexts.</p>",
        "id": 240844736,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622474033
    },
    {
        "content": "<p>I used to take another crack (or whack?) at Kant every decade or so ... but it doesn't look like I'll be getting back that way again so I'll leave that to someone else to fill in ...</p>",
        "id": 240845072,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1622474210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306979\">@Jon Awbrey</span> IIRC the introduction of Moerdijk and Reyes's <a href=\"https://ncatlab.org/nlab/show/Models+for+Smooth+Infinitesimal+Analysis\">Models for smooth infinitesimal analysis</a> mentions Sophus Lie, in a way that might make him count as a precursor. Up to you!</p>",
        "id": 240863916,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1622488519
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"383799\">@Tom Hirschowitz</span>  Absolutely!  Lie gave me all the best clues to the maze of <a href=\"https://inquiryintoinquiry.com/2021/05/15/survey-of-differential-logic-3/\">Differential Logic</a>.</p>",
        "id": 240866459,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1622490847
    },
    {
        "content": "<p>It is all in Dedekind... (well, not really, but his paper with the definition of the natural numbers is very structural, and Lawvere is very justified in attaching Dedekind's name the the concept of NNO.)</p>",
        "id": 240900515,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1622529891
    },
    {
        "content": "<p>Dedekind and Cantor (along with Eilenberg and Mac Lane) are on the cover of Lawvere and Rosebrugh’s Sets for Mathematics</p>",
        "id": 240902588,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622531576
    },
    {
        "content": "<p>The Erlangen Program is a pretty good candidate. Quoting <a href=\"https://en.wikipedia.org/wiki/Erlangen_program#Abstract_returns_from_the_Erlangen_program\">wikipedia</a>:</p>\n<blockquote>\n<p>In the seminal paper which introduced categories, Saunders Mac Lane and Samuel Eilenberg stated: \"This may be regarded as a continuation of the Klein Erlanger Program, in the sense that a geometrical space with its group of transformations is generalized to a category with its algebra of mappings\"</p>\n</blockquote>",
        "id": 240928664,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1622547721
    }
]