[
    {
        "content": "<p>Speaking of zero, there is a zero, which, without much exaggeration, is indispensable for the advancement of mathematics.  Simply put, the zero that Indians scramble to take credit for is one of quantity/number/size/property; in fact the one and only (isomorphism-invariant) property of Cantor's lauter Einsen (all ones), with number 0 being the value of the property of empty set.  Cantor's abstraction of points from a given cohesive and/or variable category results not in totally devoid of structure, but almost devoid of structure, with traces of ambient category from which sets of points are abstracted.  As we all know, abstract sets serve as an ideal background to represent all kinds of mathematical objects as structures (diagrams).  Cantor's lauter Einsen are like a blank page on which we can print pretty much any text/pic of any color.  However, it doesn't take long to realize that a blank white page still has some structure, which gets in the way of printing (representing), say, a white moon, so to speak.  Hence the struggle towards absolute zero: zero quality embodying zero cohesion and zero variation, which would serve as a universal background to model any mathematical object.  Approaching this problem incrementally, we ask: how can we get \"more\" discrete than a set of points.  One immediate thought is that since two points can be on a single piece, we abstract pieces instead of points.  Needless to note, this is merely to share my new-found fascination with quality zero, which, not surprisingly, I learned from Professor F. William Lawvere's <a href=\"https://github.com/mattearnshaw/lawvere/blob/master/pdfs/2003-foundations-and-applications-axiomatization-and-education.pdf\">Axiomatization and Education</a> paper.  A related question is about the relation between categories of variation (e.g., dynamical systems) and of cohesion (e.g., reflexive graphs), which, if I'm not mistaken, Grothendieck referred to as Chocolate exercise.  Please allow me to write again in a less rambling tone about the fundamental relation between unity and change, along with their nullification, so to speak, needed to objectify quality zero, which, in turn, is indispensable in accounting for the naturality (as in not-a-miracle) or Becoming consistent with Being that pervades both moving and think matter.  Your time permitting, please critique (unvarnished ;)  Here's a good visual illustration of the <a href=\"https://www.youtube.com/watch?v=r0kLC-pridI\">unity-respecting change</a>, but for which we would be suspended in that Jamesian blooming buzzing confusion ;)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"r0kLC-pridI\" href=\"https://www.youtube.com/watch?v=r0kLC-pridI\"><img src=\"https://uploads.zulipusercontent.net/0b0eabdb108d2d2a669306478bd50ab96a11b258/68747470733a2f2f692e7974696d672e636f6d2f76692f72306b4c432d70726964492f64656661756c742e6a7067\"></a></div><p>p.s. I just thought of crediting Gene Stoner @ Salk Institute for the point-light walker video :)</p>",
        "id": 373826300,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1688963160
    },
    {
        "content": "<p><a href=\"#narrow/stream/232163-learning.3A-history-of-ideas/topic/Quality.20Zero/near/373826300\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"232163\" href=\"/#narrow/stream/232163-learning.3A-history-of-ideas/topic/Zero.20.28origins.29\">#learning: history of ideas &gt; Zero (origins)</a> by <span class=\"user-mention silent\" data-user-id=\"276695\">Posina Venkata Rayudu</span>.</p>",
        "id": 373826849,
        "sender_full_name": "Notification Bot",
        "timestamp": 1688963492
    }
]