[
    {
        "content": "<p>Dear all,</p>\n<p>I hope and pray you and your families are all well.</p>\n<p>If I may, I'd like to request you to consider the following petition initiative of my good friend Peter, who is committed to getting to the<br>\norigins of zero.</p>\n<p>Full disclosure: I'm giving a lecture on the mathematics of attaining the ideal of: totally devoid of structure (zero cohesion and/or zero variation).  This is part of our joint research with Professor Sisir Roy to mathematically reconstruct the cognitive construction of zero by the human mind (individually and collectively, as part of various collectives).</p>\n<p>Thanking you,<br>\nposina<br>\n===============Zero Project Online Petition==================</p>\n<p>We would kindly request you to sign and share widely among your respective networks our online Petition</p>\n<p><a href=\"https://www.petitions.net/radiocarbon-dating_of_the_bakhshali_manuscript\">https://www.petitions.net/radiocarbon-dating_of_the_bakhshali_manuscript</a></p>\n<p>to encourage the Bodleian Libraries, London, to take concrete steps to have follow-up Radiocarbon-dating of the famous Bakhshali Manuscript conducted in the interest of scientific advancement in the field.</p>\n<p>The Zero Project [Zero Project] has been in contact with the Bodleian Libraries, London, since the time prior to their announcement of the Radiocarbon-dating of the Bakhshali Manuscript (BM) conducted in 2017. As the results of the radiocarbon-dating of the Bakshshali Manuscript at that time were inconclusive, many scholars across the world have encouraged the Bodleian to please consider conducting follow-up tests.</p>\n<p>As you may be aware, the issue of the Bakhshali Manuscript has also been raised by most of the 40 participants in the Zero Project’s Monograph on Zero book project and online International Conference/Workshop on Zero (10/’21 – 4/’22).</p>\n<p>Peter Gobets</p>\n<p>Secretary / Research Coordinator<br>\nTrustee Zero Project<br>\nThe Hague, The Netherlands<br>\nW: <a href=\"http://www.TheZeroProject.nl\">www.TheZeroProject.nl</a><br>\nE: <a href=\"mailto:pgobets@zerorigindia.org\">pgobets@zerorigindia.org</a><br>\nT: +31-6-39 88 05 03 // +31-70-3501930</p>",
        "id": 273391326,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1645951415
    },
    {
        "content": "<p>A message was moved from this topic to <a class=\"stream-topic\" data-stream-id=\"232163\" href=\"/#narrow/stream/232163-learning.3A-history-of-ideas/topic/Quality.20Zero\">#learning: history of ideas &gt; Quality Zero</a> by <span class=\"user-mention silent\" data-user-id=\"276695\">Posina Venkata Rayudu</span>.</p>",
        "id": 373826850,
        "sender_full_name": "Notification Bot",
        "timestamp": 1688963492
    }
]