[
    {
        "content": "<p>I would be overjoyed if any of the extremely intelligent people in this community would have any insight to share on this question. Thank you.</p>\n<p><a href=\"https://philosophy.stackexchange.com/questions/117707/an-intensional-system-of-meaning-for-predicates-and-related-thoughts\">https://philosophy.stackexchange.com/questions/117707/an-intensional-system-of-meaning-for-predicates-and-related-thoughts</a></p>",
        "id": 474676000,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1727987120
    },
    {
        "content": "<p>Many questions, and I don't understand all of them. The last part reminds me of this distinction I made, might resonate with you:</p>\n<blockquote>\n<p>To elucidate this, let’s examine the predicates from classical Aristotelian syllogisms:</p>\n<ul>\n<li>Plurality - <code>One A is B</code> / <code>Some A-s are B</code> (limited scope)</li>\n<li>Totality - <code>All A-s are B</code> (universal scope)</li>\n</ul>\n<p>This distinction becomes clearer: statements with limited scope can only be justified through <em>observation.</em> – if I observe any number of objects categorized as <code>A</code> (e.g., “apples”) and find they possess property <code>B</code> (e.g., “tasty”), I can conclude, based on those observations alone, that <code>Some A-s are B</code> or <code>One A is B</code>.</p>\n<p>Statements with universal scope, on the other hand, are axiomatic by nature. Although <code>All A-s are B</code> and <code>Some A-s are B</code> differ significantly, the basis/reason for someone to concluding that <code>All A-s are B</code> are no different from the basis for saying <code>Some A-s are B</code> — if I enjoy apples and have never had a bad one, I might say, “All apples are tasty,” whereas someone with the same experience but in a more skeptical mood might say, “All apples that I have eaten are tasty.” Our experiences are identical; my choice to assume universality is the only difference.</p>\n<p>Thus, even both of them reference the same two variables (<code>A</code> and <code>B</code>), statements of the form <code>Some A-s are B</code> and <code>All A-s are B</code> are very different categorically. We might say that the latter type references a “secret third thing”—the <em>universe.</em> In other words, we could rephrase <code>All A-s are B</code> as <code>All A-s in this universe are B.</code></p>\n<p>This reveals a paradox: while the concept of the universe underlies empirical statements, it is not itself empirical, as we cannot make empirical observations about the universe (unless we are Laplace’s demon, but more on that later). And one way to navigate this paradox (actually, the only way I can think off) is to assume that universal statements are not entirely empirical—they <em>create reality as much as they describe it.</em> By saying all A-s are B-s, we are defining what A is, rather than simply describing the world.</p>\n</blockquote>\n<p><a href=\"https://abuseofnotation.github.io/time/06/\">https://abuseofnotation.github.io/time/06/</a></p>",
        "id": 489701300,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1734509553
    },
    {
        "content": "<p>Check also Witgenstein's idea of <a href=\"https://en.wikipedia.org/wiki/Family_resemblance\">family resemblance</a>. This view is often contrasted with <a href=\"https://en.wikipedia.org/wiki/Platonism\">Platonism</a>, the idea that things are defined somewhere (e.g. by God) and it's our task only to  decipher which is which.</p>",
        "id": 489703374,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1734510412
    }
]