[
    {
        "content": "<p><em>A riot is the language of the unheard.</em></p>\n<ul>\n<li>Martin Luther King Jr.</li>\n</ul>",
        "id": 199389331,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591028335
    },
    {
        "content": "<p>I think it's very problematic, and potentially misleading, to take this quote out of context.  <a href=\"https://www.crmvet.org/docs/otheram.htm\">Here</a> is the context:</p>\n<p>\" Let me say as I've always said, and I will always continue to say, that riots are socially destructive and self-defeating. I'm still convinced that nonviolence is the most potent weapon available to oppressed people in their struggle for freedom and justice. I feel that violence will only create more social problems than they will solve. That in a real sense it is impracticable for the Negro to even think of mounting a violent revolution in the United States. So I will continue to condemn riots, and continue to say to my brothers and sisters that this is not the way. And continue to affirm that there is another way.</p>\n<p>But at the same time, it is as necessary for me to be as vigorous in condemning the conditions which cause persons to feel that they must engage in riotous activities as it is for me to condemn riots. I think America must see that riots do not develop out of thin air. Certain conditions continue to exist in our society which must be condemned as vigorously as we condemn riots. But in the final analysis, a riot is the language of the unheard.\"</p>",
        "id": 199594083,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1591174262
    },
    {
        "content": "<p>I think that the implicit context of the quote, as imposed by current events and the state of affairs in our society, is precisely the actual context of the quote. But if you feel the message is better served this way, I have no objections.</p>",
        "id": 199813630,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591307805
    },
    {
        "content": "<p>The problem is that taken out of context, the quote is sometimes used to condone or excuse rioting.  I'm not saying you were doing that, but I have seen it done in the past week.</p>",
        "id": 199914096,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1591380666
    },
    {
        "content": "<p>(What on earth is the emoji \"fist\" supposed to mean?)</p>",
        "id": 199914124,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1591380682
    },
    {
        "content": "<p>(I intended it as a fist raised in solidarity, I can only presume others also did)</p>",
        "id": 199916423,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591381582
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229134-philosophy/topic/A.20relevant.20quote/near/199914096\">said</a>:</p>\n<blockquote>\n<p>The problem is that taken out of context, the quote is sometimes used to condone or excuse rioting.  I'm not saying you were doing that, but I have seen it done in the past week.</p>\n</blockquote>\n<p>I would argue that is a case of (opportunistically) misapplying the quote rather than misinterpreting it due to a lack of context.</p>",
        "id": 199916762,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591381723
    },
    {
        "content": "<p>Yes, AFAIK the fist should stand for solidarity.</p>",
        "id": 199916877,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591381773
    },
    {
        "content": "<p>This is completely off-topic but this reminds me of a quote by Rumsfeld on Looting during the US occupation of Iraq:<br>\n\"Stuff happens … and it's untidy, and freedom's untidy, and free people are free to make mistakes and commit crimes and do bad things.\"</p>\n<p>I wonder if he would apply the same line of reasoning to looting in the United States...</p>",
        "id": 199926363,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1591386955
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229134-philosophy/topic/A.20relevant.20quote/near/199916423\">said</a>:</p>\n<blockquote>\n<p>(I intended it as a fist raised in solidarity, I can only presume others also did)</p>\n</blockquote>\n<p>Lol, please do not use this gestur ever in Italy! xD</p>",
        "id": 199927030,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591387275
    },
    {
        "content": "<p>Hah, that's a good one <span class=\"user-mention\" data-user-id=\"277391\">@Cole Comfort</span>. On one hand you have playing down the massive destabilization caused by an unjustifiable war (excusing looting), on the other hand you have skewing attention away from the real problem (by heavily emphasizing on looting).</p>",
        "id": 199933660,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591390869
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275900\">Stelios Tsampas</span> <a href=\"#narrow/stream/229134-philosophy/topic/A.20relevant.20quote/near/199933660\">said</a>:</p>\n<blockquote>\n<p>Hah, that's a good one <span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span>. On one hand you have playing down the massive destabilization caused by an unjustifiable war (excusing looting), on the other hand you have skewing attention away from the real problem (by heavily emphasizing on looting).</p>\n</blockquote>\n<p>Perhaps you weren't picking up on my sarcasm...</p>",
        "id": 199933720,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1591390906
    },
    {
        "content": "<p>If you knew me, then you would know that Rumsfeld isn't a personal hero of mine.  Or maybe I am misinterpreting you and you are criticising Rumsfeld, in which case, I agree with you.</p>",
        "id": 199933813,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1591390942
    },
    {
        "content": "<p>I'm not a moderator, I don't even play one on the Internet. <br>\nI'm a bit critical of an education that lacks a nuanced understanding of Martin Luther King Jr.'s position. This is not the issue for intellectual jousting, it is for finding as much common ground with as many as possible. My position is I'm non-violent, but that doesn't imply Jain non-violence. I've broken up hundreds of fights with either zero or the minimal about of physical force needed. <br>\nFYI - my spiritual name is Prashanta which mean \"dynamic peace\".  My last job in a school had a 250 lb student repeatedly hitting a blind 70 lb student with running charges. I wasn't allowed to touch the violent student under ANY circumstance, but no one could stop me from being a body shield.  <br>\nI just watched a video here about racial equality and \"white privilege\".  Working out your stance on non-violence from the comfort of your computer keyboard is a white privilege. The real world tends to get grungy real quick.</p>",
        "id": 199941429,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1591396540
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> <a href=\"#narrow/stream/229134-philosophy/topic/A.20relevant.20quote/near/199933813\">said</a>:</p>\n<blockquote>\n<p>If you knew me, then you would know that Rumsfeld isn't a personal hero of mine.  Or maybe I am misinterpreting you and you are criticising Rumsfeld, in which case, I agree with you.</p>\n</blockquote>\n<p>Yeah, that's exactly what I'm doing ;). The sarcasm was pretty clear.</p>",
        "id": 199943904,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591398749
    }
]