[
    {
        "content": "<p>I am interested in applications of category theory to humanities scholarship. In particular, I am interested in using categorical ideas to model informal modes of reasoning and argumentation. For example, argument by analogy or inference to the best explanation. I also think category theory could be used to model hermeneutic relationship between texts.  For example, modelling how a text can be about another text or about a text that is about a text and so on. </p>\n<p>I have found a few articles on modelling analogies with functors and/or natural transformations. </p>\n<p><a href=\"https://arxiv.org/abs/1801.10542\">https://arxiv.org/abs/1801.10542</a><br>\n<a href=\"https://psyarxiv.com/zp3jq/download\">https://psyarxiv.com/zp3jq/download</a><br>\n<a href=\"https://psyarxiv.com/zp3jq/download\">https://psyarxiv.com/zp3jq/download</a></p>\n<p>I would be grateful for any pointers towards other discussion of these topics.</p>",
        "id": 203001279,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594047961
    },
    {
        "content": "<p>Thanks for the reference. I read through the thread, and it makes me think that Walton's work could be a vein to mine for informal reasoning stuff to try to to model with CT.  Unfortunately, I was not able to find Morgan's comment about using CT for this.</p>",
        "id": 203115851,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594134929
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"312048\">@Avi Craimer</span> This has been on my agenda for a while. I'm also very interested in applications of CT to the humanities.</p>\n<p>I'm currently busy working on a defeasible reasoning adjacent subproject in this area, which is to understand and develop categorical approaches to statistical models (see <a class=\"stream\" data-stream-id=\"245528\" href=\"/#narrow/stream/245528-learning.3A-statistics-reading-group\">#learning: statistics reading group</a>) with an eye to non-numerical structures such as logic and textual data.</p>\n<p>However, if you have any thoughts or ideas related to argumentation schemes, defeasible reasoning, etc. please don't hesitate to reach out! I'd be happy to discuss and exchange resources.</p>",
        "id": 203137733,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594144907
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span>  Good to connect. </p>\n<p>It strikes me that there is a lot of focus on automation (such as NLP), but I'm more interested in creating better tools for human thinkers. Kind of like the Adobe Photoshop of reasoning. I feel that we should have tools for informal thought that are an improvement over a chalkboard. So far, this has been elusive. The idea is not to add another layer of meta-data as annotations on natural language thoughts, but instead to use a CT powered tool as a direct medium for expressing ideas and arguments.</p>",
        "id": 203198975,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594153844
    },
    {
        "content": "<p>perhaps this is an already answered question since i haven't followed the discussion closely, but have you seen ologs? <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0024274\">https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0024274</a> or does that fall into the meta-data bucket you want to avoid</p>",
        "id": 203199190,
        "sender_full_name": "Aleksandar Makelov",
        "timestamp": 1594153966
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"312048\">@Avi Craimer</span> I completely agree. Topics in automation have a lot to offer to the humanities and the qualitative sciences, but there's also a lot to be desired.</p>\n<p>I have a few of my own ideas about that but I'd like to  hear more about your take on things.</p>\n<p>By the way, the adobe photoshop metaphor is exactly how I think of it too!</p>\n<p>I'd like to have a suite of tools that either protect me from making mistakes or automate segments of the process so that I can use my brain for the more interesting parts.</p>",
        "id": 203204128,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594156594
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"309897\">@Aleksandar Makelov</span>, I've heard of Ologs. One tning I discovered is that they are good for highly structured situations, but it's hard to build them into more elaborate structures that could be made into thinking tools for \"ill-defined\" problems and systems. That was also the consensus among the students whose projects are on the early intro ACT course on Open MIT. It is a good place to start though. Maybe thinking deeper about what goes wrong with ologs could be one avenue for progress?</p>",
        "id": 203204446,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594156804
    },
    {
        "content": "<p>oh interesting, I haven't seen those projects. yeah I see how ill-defined systems would pose a problem to such an approach</p>",
        "id": 203211185,
        "sender_full_name": "Aleksandar Makelov",
        "timestamp": 1594160885
    },
    {
        "content": "<p>Lol yeah, there was a psych student whose capstone project was basically a presentation that said \"These are cool and exciting, but literally nothing I tried could be made into a real Olog so here are some interesting diagrams that aren't categories.\"</p>",
        "id": 203211389,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594161069
    },
    {
        "content": "<p>I have run into a similar problem with oLogs. I was super excited when I first came across them, but then using them proved difficult. It is possible that something like oLogs could work as a kind of low-level language, with some good user-interface and abstraction layer over top of them to allow the expression of complex things. Just to take a simple example. With ologs if you want to talk about a subset you need to start constructing pullbacks from sub-object classifiers. This should not be something the user has to deal with. They should just be able to specify that it's a subset. Figuring out what interface  abstractions are useful for actual reasoning in informal domains is the big challenge.</p>",
        "id": 203278768,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594220821
    },
    {
        "content": "<p>Hi Avi,</p>\n<p>My research is on omnidisciplinary thinking and focuses specifically on art and psychology.</p>",
        "id": 203305750,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594233618
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319212\">Xavier</span> <a href=\"#narrow/stream/229134-philosophy/topic/ACT.20for.20the.20humanities/near/203305750\">said</a>:</p>\n<blockquote>\n<p>My research is on omnidisciplinary thinking and focuses specifically on art and psychology.</p>\n</blockquote>\n<p>Hi Xavier. I'd love to hear more about your research. Do you have any links?</p>",
        "id": 203313358,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594237542
    },
    {
        "content": "<p>Not at the moment, but would welcome a chat.</p>",
        "id": 203397128,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594307006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/229134-philosophy/topic/ACT.20for.20the.20humanities/near/203204446\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"309897\">Aleksandar Makelov</span>, I've heard of Ologs. One tning I discovered is that they are good for highly structured situations, but it's hard to build them into more elaborate structures that could be made into thinking tools for \"ill-defined\" problems and systems. That was also the consensus among the students whose projects are on the early intro ACT course on Open MIT. It is a good place to start though. Maybe thinking deeper about what goes wrong with ologs could be one avenue for progress?</p>\n</blockquote>\n<p>I remember David  <a href=\"https://johncarlosbaez.wordpress.com/2015/04/02/a-networked-world-part-3/\">posted</a>  a while back about how  ologs weren’t doing justice to the idea of modularity and he was looking into operads.</p>",
        "id": 203457570,
        "sender_full_name": "Eran Meir",
        "timestamp": 1594340162
    },
    {
        "content": "<p>Yes operads do seem like a more promising approach.</p>",
        "id": 203458846,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1594341766
    },
    {
        "content": "<p>In David's article he says:</p>\n<blockquote>\n<p>I often think of the operad O as a picture language, and the O-algebra F its intended semantics.</p>\n</blockquote>\n<p>I wonder if David here is conscious here of Wittgenstein's <em>Tractatus Logico-Philosophicus</em> where he offers what is know as the \"picture theory of meaning\". Quite possibly these are not connected, but I thought it was an interesting linguistic resonance.</p>",
        "id": 203510940,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1594390314
    },
    {
        "content": "<p>This is deeply conjectural and I cannot and will not defend it, but I think <a href=\"https://arxiv.org/abs/1811.00420\">https://arxiv.org/abs/1811.00420</a> could be a thing that one could aim at Deleuzian assemblage theory and get some formality out.</p>",
        "id": 204874971,
        "sender_full_name": "dan pittman",
        "timestamp": 1595559716
    },
    {
        "content": "<p>I came across a tweet referring to the collection of essays on Paul Cillers work on \"Critical Complexity\". The introductory essay is <a href=\"https://twitter.com/mireillemoret/status/1290548858825531392\">available online</a>. Cillers work seems more to go from  biology to French Philosophy (Derrida) where. I don't know much more, but it would be interesting if it has a strong basis in mathematics or such could be provided. <br>\nWorking with logic one gets a quick exposure to how complex systems can quickly become. The fact that logic so quickly leads to undecidable problems would be an interesting way to perhaps allow one to reconcile the Humanities to logic.</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/mireillemoret/status/1290548858825531392\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/584997350927683584/tjxQFHPd_normal.jpg\"></a><p>An introduction to the content: <a href=\"https://t.co/GxiSBrUwyt\">https://www.researchgate.net/publication/291337798_Critical_Complexity_Collected_Essays</a>, highly relevant for ML when working with behavioural data and for e.g. all of social science 1/2 <a href=\"https://t.co/zYuNQukuOj\">https://twitter.com/abebab/status/1267937792090411011</a></p><span>- Mireille Hildebrandt (@mireillemoret)</span></div></div>",
        "id": 205885623,
        "sender_full_name": "Henry Story",
        "timestamp": 1596531812
    },
    {
        "content": "<p>I found Peli Grietzer's <a href=\"https://www.glass-bead.org/article/a-theory-of-vibe/?lang=enview\">*Theory of Vibe*</a> super interesting, and I did a bit of writing about it here: <a href=\"https://dpitt.me/newsletter/2020-07/#vibin\">https://dpitt.me/newsletter/2020-07/#vibin</a>, where I think about it categorically—albeit very informally (I literally say \"this is getting very hand-wavy\" at some point).</p>",
        "id": 206161257,
        "sender_full_name": "dan pittman",
        "timestamp": 1596729617
    }
]