[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507055684\">said</a>:</p>\n<blockquote>\n<p>The big problem with string theory and quantum gravity more generally is that without any experimental or observational evidence from the real world either way whether strings exist or not or whether gravity is quantum or not, all the work that is currently going into those theories aren't really science, but rather some kind of heavily mathematical metaphysics.</p>\n</blockquote>\n<p>The fact that matter is quantum <em>is</em> excellent evidence that gravity is quantum since nobody has ever come up with a reasonable way <em>any</em> non-quantum thing can have a two-way interaction with a quantum field.  There is admittedly basically no <em>direct</em> evidence of gravity acting quantumly, but there are a lot of things we accept without direct evidence.</p>",
        "id": 507068826,
        "sender_full_name": "James Deikun",
        "timestamp": 1742502582
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507068826\">said</a>:</p>\n<blockquote>\n<p>The fact that matter is quantum <em>is</em> excellent evidence that gravity is quantum since nobody has ever come up with a reasonable way <em>any</em> non-quantum thing can have a two-way interaction with a quantum field.</p>\n</blockquote>\n<p>The absence of evidence or a mechanism for one thing is not evidence for its opposite. The right thing to do in science is to stay agnostic and suspend judgment on the issue until experiment resolves it one way or another. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507068826\">said</a>:</p>\n<blockquote>\n<p>There is admittedly basically no <em>direct</em> evidence of gravity acting quantumly, but there are a lot of things we accept without direct evidence.</p>\n</blockquote>\n<p>Yes, and without direct evidence these are just <em>philosophical beliefs</em> on the quantum nature of gravity that just happen to be shared by many physicists.</p>",
        "id": 507069883,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742502965
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507069883\">said</a>:</p>\n<blockquote>\n<p>The absence of evidence or a mechanism for one thing is not evidence for its opposite. The right thing to do in science is to stay agnostic and suspend judgment on the issue until experiment resolves it one way or another.</p>\n</blockquote>\n<p>Say you bought a new microwave and you're planning to microwave a plate of food.  I somehow get it into my head that the microwave will cause a nuclear explosion if you microwave broccoli.  I tell you this.  There is no evidence or mechanism by which microwaving broccoli would cause a nuclear explosion.  However, you've never microwaved broccoli in this particular microwave oven before.  You, what, are going to thank me for my warning and microwave your plate of food in the middle of the desert while hiding in a bunker, since a never-before-seen fifth force could cause a nuclear explosion and there's no way to know until you do the experiment?</p>",
        "id": 507073118,
        "sender_full_name": "James Deikun",
        "timestamp": 1742504145
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/near/507073118\">said</a>:</p>\n<blockquote>\n<p>Say you bought a new microwave and you're planning to microwave a plate of food.  I somehow get it into my head that the microwave will cause a nuclear explosion if you microwave broccoli.  I tell you this.  There is no evidence or mechanism by which microwaving broccoli would cause a nuclear explosion.  However, you've never microwaved broccoli in this particular microwave oven before.  You, what, are going to thank me for my warning and microwave your plate of food in the middle of the desert while hiding in a bunker, since a never-before-seen fifth force could cause a nuclear explosion and there's no way to know until you do the experiment?</p>\n</blockquote>\n<p>This example doesn't really work, because I don't have to worry about causing a nuclear explosion when I think about whether gravity is quantum. I can safely suspend judgment and simply not think about the issue of quantum gravity at all until some future point in time and still be fine, whereas I do have to make a judgment about whether it's safe to microwave broccoli for consumption for pure survival reasons.</p>\n<p>(I mean, maybe believing that gravity is not quantum results in a nuclear explosion. But then you have much bigger philosophical issues than quantum gravity, since mere thoughts causing nuclear explosions raises huge problems for materialism.)</p>",
        "id": 507074525,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742504605
    },
    {
        "content": "<p>In the big picture, it really doesn't matter what we believe about whether gravity is quantum or not since we don't have evidence pointing one way or another. Only thing we might eventually get is the satisfaction of being right or the regret of being wrong if in the future the evidence does end up pointing one way or another, and the evidence might never arrive.</p>",
        "id": 507075381,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742504865
    },
    {
        "content": "<p>But when you make the decision about microwaving broccoli, is it a decision based in science or in \"some kind of metaphysics\"?</p>",
        "id": 507082545,
        "sender_full_name": "James Deikun",
        "timestamp": 1742507755
    },
    {
        "content": "<p>If somebody tells me that microwaving broccoli causes a nuclear explosion I would ask him for experimental evidence that microwaving broccoli causes nuclear explosions. The same goes for if a different person claims that microwaving broccoli does not causes a nuclear explosion. If neither side cannot provide experimental evidence of their claim, then any decision made based on either claim will not be made in science.</p>",
        "id": 507092483,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742513019
    },
    {
        "content": "<p>8 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"241990\" href=\"/#narrow/channel/241990-community.3A-discussion/topic/Urs.20Schreiber.20Podcast/with/506951116\">#community: discussion &gt; Urs Schreiber Podcast</a> by <span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span>.</p>",
        "id": 507093113,
        "sender_full_name": "Notification Bot",
        "timestamp": 1742513390
    },
    {
        "content": "<p>But the only <em>direct</em> experimental evidence that microwaving broccoli will not cause a nuclear explosion <em>this time</em> is a fait accompli; otherwise you are relying on the absence of a mechanism for this time to act differently than all the past times broccoli has been microwaved.</p>",
        "id": 507103538,
        "sender_full_name": "James Deikun",
        "timestamp": 1742519313
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Based.20in.20science.20vs.20metaphysics/near/507103538\">said</a>:</p>\n<blockquote>\n<p>But the only <em>direct</em> experimental evidence that microwaving broccoli will not cause a nuclear explosion <em>this time</em> is a fait accompli; otherwise you are relying on the absence of a mechanism for this time to act differently than all the past times broccoli has been microwaved.</p>\n</blockquote>\n<p>Ah, and here we are finally reaching some hotly contested territory in the philosophy of science. How do we know that the laws of physics don't change over time? We don't actually know that. We have to constantly perform experiments to make sure that the universal gravitational constant G or the fine structure constant are actually constant, that special relativity still holds, etc. </p>\n<p>The idea that the laws of physics are universal across all of space and time is just an assumption, one that many physicists hold but which it is impossible to scientifically prove. You would have to test the theories at all parts of the universe at all times before you can come to such a conclusion scientifically.</p>",
        "id": 507105188,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742520353
    },
    {
        "content": "<p>And anyways, it is perfectly possible to test that theory: you can just microwave the broccoli in the microwave oven. Whether it is ethical to do so and risk potentially destroy the surroundings with a nuclear explosion is another question. </p>\n<p>With quantum gravity, you can't even test the issue. The technology simply isn't there yet in 2025. Therein lies another gap between the example you gave here compared to quantum gravity and other speculative theoretical physics theories.</p>",
        "id": 507106929,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742521250
    },
    {
        "content": "<p>There are many questions which we can answer scientifically at the moment but refuse to do so because of ethical issues involved. There are other questions which we cannot answer scientifically at the moment because we do not have the capabilities to conduct experiments.</p>",
        "id": 507107744,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742521677
    }
]