[
    {
        "content": "<p>I've been consistently impressed by the philosophy of category theorists, including Mac Lane, Lawvere, and now recently Grothendieck (in particular this essay \"The New Universal Church\"). This general impression of philosophical competence amongst category theorists got me brave enough to ask this question.</p>\n<p>When I think about music, \"beauty\" is supported by \"reason\". When I think about science \"reason/empiricism\" is supported by \"beauty\". Both these aspects are very important to me, in both activities. </p>\n<p>When I prioritize \"beauty\", There's a risk my understanding regresses into making \"mystical\" mistakes. A representative example includes believeing any conclusions I make, are simply reinterpretations of ancient thinker's ideas (prisca sapientia). Training in the \"classics\" often has this value as a subtext, or even a supertext.</p>\n<p>Scientific thought <em>out grew</em> this by solving ancient scientific problems. So one solution to avoiding mystical thinking, is to throw out beauty first thinking entirely, by sticking to the subject that got itself sorted.</p>\n<p>Personally, I can't throw out beauty first thinking. When folks claim songs are \"merely\" fun to listen to, or are an evolutionary accident, I defend them as ways to understand life.</p>\n<p>But I don't want to indulge in the deepest mistakes of mystical thinking either.</p>\n<p>I'm not a philosopher, but my superficial impression is Nietzsche, Wittgenstein, and even Grothendieck, essentially summarized my struggle as a difficulty with \"scientism\". But, it seems they mainly stated the problem.</p>\n<p>Are folks aware of notable thinkers, books, or courses that discuss how to \"think with less scientism, but still carefully\"?</p>",
        "id": 532947191,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754410063
    },
    {
        "content": "<p>I've never read this essay \"A New Universal Church\".   Can you point me to it?</p>\n<p>I think the best scientists have never been \"scientistic\" in the sense of falling into the trap of \"scientism\" - by which I guess you mean the trap of thinking that all important questions can be settled by the methods that science has managed to formalize so far. </p>\n<p>A lot of the best ones carefully extended science into questions that seemed beyond the reach of science.   \"Carefully\" in the sense that they managed to tackle new topics, not biting off too much more than they could chew.  (The later Newton, and the later Grothendieck, seem to have bitten off more than they could chew.)</p>\n<p>Also, a lot of the best scientists have been keenly aware of the importance of beauty.   </p>\n<p>So, I think one good way to learn to \"think with less scientism, but still carefully\" is to study people like Kepler, Newton, Maxwell, Darwin, Einstein, etc.   They didn't spend most of their time <em>talking about</em> how to think better - although they did some of that too.  They were mainly busy trying to actually <em>do it</em>.   So I try to learn from what they actually did.</p>\n<p>Short of actually reading their papers, it seems one reasonably good way to do this is read detailed biographies that talk about these people's work.</p>",
        "id": 532954995,
        "sender_full_name": "John Baez",
        "timestamp": 1754413035
    },
    {
        "content": "<p>I found out about \"A New Universal Church\" from Wikipedia's article on Scientism, which linked this: <a href=\"https://publish.uwo.ca/~jbell/univ.pdf\">https://publish.uwo.ca/~jbell/univ.pdf</a> </p>\n<p>What little clarity I got on my question was after a small bit of science History. I'm not a historian so I'm always a bit nervous trying to figure it out on my own, but I'll keep going in the absence of more accessible options.</p>",
        "id": 532957057,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754413926
    },
    {
        "content": "<p>I find the detailed study of the lives and work of specific exemplary individuals more inspiring than studying science history \"in general\", though that's good too.  For example after I understood quantum mechanics and general relativity I reread Abraham Pais' biography of Einstein, which goes into great detail of how Einstein figured things out, and I was struck by how Einstein's many shocking discoveries weren't the result of magic or divine inspiration, but very persistently assembling the key bits of evidence, thinking about them very carefully, being willing to drop assumptions everyone else took for granted, being utterly convinced that nature is beautiful, and being completely unwilling to accept as fundamental a theory that's not beautiful.</p>",
        "id": 532958518,
        "sender_full_name": "John Baez",
        "timestamp": 1754414526
    },
    {
        "content": "<p>I mention this because you talk about \"beauty first thinking\".  Einstein wrote:</p>\n<blockquote>\n<p>The ideals that have lighted my way, and time after time have given me new courage to face life cheerfully, have been Kindness, Beauty, and Truth. Without the sense of kinship with men of like mind, without the  occupation with the objective world, the eternally unattainable in the  field of art and scientific endeavors, life would have seemed empty to  me. The trite objects of human efforts -- possessions, outward success,  luxury -- have always seemed to me contemptible.</p>\n</blockquote>",
        "id": 532958822,
        "sender_full_name": "John Baez",
        "timestamp": 1754414660
    },
    {
        "content": "<p>Thank you for the recommendation, I'll check it out, and that is encouraging.</p>",
        "id": 532959106,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754414777
    },
    {
        "content": "<p>Unfortunately if you don't know quantum mechanics and general relativity quite well, Pais' biography of Einstein will just seem bewildering and a bit dull.  That was my first experience of reading it.  So I wasn't actually recommending it.</p>",
        "id": 532959352,
        "sender_full_name": "John Baez",
        "timestamp": 1754414876
    },
    {
        "content": "<p>It's difficult reading, because you watch Einstein slowly fighting his way through some difficult puzzles, without the benefit of the beautiful theory that came later.</p>",
        "id": 532959578,
        "sender_full_name": "John Baez",
        "timestamp": 1754414965
    },
    {
        "content": "<p>Coming from you that somehow makes it sound both more compelling and intimidating.</p>",
        "id": 532959888,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754415076
    },
    {
        "content": "<p>It's good motivation to understand general relativity and quantum mechanics more deeply.</p>",
        "id": 532960091,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754415161
    },
    {
        "content": "<p>There could be biographies of scientists that explain their working methods without sinking into a morass of detail, but Pais was Einstein's assistant at the Institute for Advanced Studies, and he wanted to completely document all the details of what Einstein did, which was an excellent thing for him to do.</p>",
        "id": 532963343,
        "sender_full_name": "John Baez",
        "timestamp": 1754416317
    },
    {
        "content": "<p>It sounds like a nice book to have, even if it's hard to understand</p>",
        "id": 532963542,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754416394
    },
    {
        "content": "<p>When I was young I venerated Einstein but I never thought much about how he figured things out - it just seemed magic.   So, it was great to learn that no, the ideas didn't just come to him by magic, he was just tons better than most of us at following the clues.  This made me respect him even more!</p>",
        "id": 532963851,
        "sender_full_name": "John Baez",
        "timestamp": 1754416520
    },
    {
        "content": "<p>Not to be mysterious, the book is called <em>Subtle is the Lord</em>. </p>\n<p>And digressing still further, two other things I learned from it are:</p>\n<ol>\n<li>How important statistical mechanics was in Einstein's early work, and how he reinvented a lot of statistical mechanics on his own before reading Boltzmann.</li>\n<li>How much interesting work he did after inventing general relativity - the period when most people tend to think he'd lost his magic touch.</li>\n</ol>",
        "id": 532967292,
        "sender_full_name": "John Baez",
        "timestamp": 1754417841
    },
    {
        "content": "<p>I thought about what you wrote here. Thank you for sharing your thoughts. Your commentary was very helpful.</p>",
        "id": 533110293,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754488906
    },
    {
        "content": "<p>Thanks!    Grothendieck's essay <a href=\"https://publish.uwo.ca/~jbell/univ.pdf\">A new universal church</a> was interesting.</p>\n<p>I'm still hoping other people will give other answers to your question.</p>",
        "id": 533113539,
        "sender_full_name": "John Baez",
        "timestamp": 1754489806
    },
    {
        "content": "<p>I don’t really understand what “thinking with scientism” would mean. It seems to me that scientism is at best a way to <em>avoid</em> thinking. Are you really drawing a connection between scientism and a bias towards beauty?</p>",
        "id": 533146199,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754499515
    },
    {
        "content": "<p>Yeah, I think I don’t have quite enough to hang onto here as you’ve phrased it. You’ve named some very different philosophers and summarized certain of their arguments in a single word that I’m not sure any of them actually used. Maybe you could point to some more particular “statements of the question” if this question still feels live to you?</p>",
        "id": 533146566,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754499665
    },
    {
        "content": "<p>I guess here's what I think a concrete example of this looks like.</p>\n<p>I got very interested in \"Digital audio workstations\" when I was younger. In particular I enjoyed being able to synthesize sounds, and imagining the possibilities it added to my music.</p>\n<p>But when I talked to people about the sort of features they thought were really cool in these tools, it was stuff like \"undo\", \"copy and paste\", \"rhythm machines\", \"pitch correct\", etc.</p>\n<p>This raised alarm bells in my head, but I couldn't articulate why until many years later. I figured maybe I was being a Luddite.</p>\n<p>When machine learning based statistical models of songs came out, In a way I actually felt less alarmed than other people, because \"the danger\" it portended seemed to already be here from my point of view.</p>\n<p>Folks were already trying to avoid making a song themselves. They were assuming the parts of music making they didn't like could simply be replaced by a sufficiently sophisticated technology.</p>\n<p>To me this is a special case of \"thinking with scientism\". Technology is <em>replacing</em> musical thinking rather than <em>supporting</em> musical thinking.</p>\n<p>Machine learning song systems, that make a song given a sentence - to me, look like the obvious advancement of this attitude.</p>\n<p>In my mind, making music as a way of understanding the world, is being assaulted by this attitude.</p>\n<p>So, assuming I believe this, what do I do?</p>\n<p>The \"obvious but wrong\" choice is to give up technology entirely and live on a farm. That is, adopt an extremely regressive life style and world view. That's the analog here for \"mystical thinking\". </p>\n<p>I don't want to assume there's something intrinsically magic about music the AI isn't doing, but I also don't want to give up perspectives musical thinking provides. For whatever reason, it seems too easy to be black and white about this.</p>\n<p>The essay Grothendieck wrote, in my opinion, anticipates this. For example the music writing technology becomes an implicit record of the technology maker's assumptions about what music is. Which is fine, but if we culturally decide it's where most of our music should come from, perhaps by using only a handful of AI models in most social services - then it creates an \"elite in charge\" of music, that don't necessarily know much about music. That's how I see this connected to scientism as he defines it.</p>\n<p>But I'm not trying to solve that big problem, I'm just trying to look for advice on navigating this tension. Baez's answer to study Einstein's life, and that it's okay to keep beauty at the center, is a really nice answer to this question.</p>\n<p>But I still think other folks could have nice things to add.</p>",
        "id": 533149961,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754500981
    },
    {
        "content": "<p>In particular though, I'm assuming folks responded to, or expanded on Grothendieck's thoughts in that essay for example.</p>\n<p>I was hopeful someone might be aware of responses, or a larger academic context I could explore, to help me articulate and develop my thoughts on this more. I like how category theorists think about these issues, I wouldn't have brought this up if I didn't see Grothendieck's essay.</p>",
        "id": 533151465,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754501603
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533146199\">said</a>:</p>\n<blockquote>\n<p>Are you really drawing a connection between scientism and a bias towards beauty?</p>\n</blockquote>\n<p>I thought <span class=\"user-mention\" data-user-id=\"277352\">@Alex Kreitzberg</span> was claiming the opposite: that scientism leads to prizing 'rationality', narrowly defined, at the expense of valuing beauty:</p>\n<blockquote>\n<p>one solution to avoiding mystical thinking, is to throw out beauty first thinking entirely, by sticking to the subject that got itself sorted.</p>\n</blockquote>\n<blockquote>\n<p>Personally, I can't throw out beauty first thinking.</p>\n</blockquote>",
        "id": 533168240,
        "sender_full_name": "John Baez",
        "timestamp": 1754508985
    },
    {
        "content": "<p>Right, thanks. That’s much clearer. One major thing that helps a lot with avoiding the downsides of overly mystic approaches to scientific work is having a community. The broader the group, and more deserving of your respect, that agrees with you that something you’re thinking about is beautiful, the less likely you are to be on a wild goose chase that’ll only ever seem of value inside your own idiosyncratic mind. I think this principle applies in the arts and spirituality as much as the sciences, that this “be in community” principle is the biggest thing a lot of “cranks” are missing, and that it’s a fundamentally different attitude than a scientism which says you have to follow a particular ossified methodology or something like that.</p>",
        "id": 533172503,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754510980
    },
    {
        "content": "<p>Regarding community, Grothendieck talked a bit about \"being alone\", I'm assuming he's overstating how difficult it was to communicate with others right? Weren't there a lot of mathematicians who really liked Grothendieck's work while he was working?</p>",
        "id": 533348335,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754593252
    },
    {
        "content": "<p>Yes, he had a strong community in the '50s and '60s, although he decided after the fact that even some of the closest members like Deligne hadn't \"really\" been with him in that, for instance, Deligne was willing to finish off the Weil conjectures in a way that seemed unaesthetic (probably not a strong enough word) to Grothendieck.</p>",
        "id": 533363999,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754600926
    },
    {
        "content": "<p>I think that even while Grothendieck worked intensively with a group of great mathematicians, lecturing to them almost every weekday, he felt they didn't \"really get it\" - that is, get his working methods and philosophy<a href=\"/user_uploads/21317/awuhOiDMkGB6OoodSCdiVd7Z/635ac6ae-5aec-457c-9746-95e23d96f88f_2000x1146.jpg\">.</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/awuhOiDMkGB6OoodSCdiVd7Z/635ac6ae-5aec-457c-9746-95e23d96f88f_2000x1146.jpg\" title=\".\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"1456x834\" src=\"/user_uploads/thumbnail/21317/awuhOiDMkGB6OoodSCdiVd7Z/635ac6ae-5aec-457c-9746-95e23d96f88f_2000x1146.jpg/840x560.webp\"></a></div>",
        "id": 533418148,
        "sender_full_name": "John Baez",
        "timestamp": 1754640945
    },
    {
        "content": "<p>His book <em><a href=\"/user_uploads/21317/pk_YjnglbTjOxi8HXm-XmZgZ/recoltes_et_semailles.pdf\">Reapings and Sowings</a></em> tries among other things to explain his approach to doing mathematics and how it was different from others.  Anyone who really wants to understand Grothendieck has to read this.</p>",
        "id": 533419451,
        "sender_full_name": "John Baez",
        "timestamp": 1754641437
    },
    {
        "content": "<p>For example:</p>\n<blockquote>\n<p>As I've often said, most mathematicians take refuge within a specific conceptual framework, in a \"Universe\" which seemingly has been fixed for all time - basically the one they encountered \"ready-made\" at the time when they did their studies. They may be compared to the heirs of a beautiful and capacious mansion in which all the installations and interior decorating have already been done, with its living-rooms , its kitchens, its studios, its cookery and cutlery, with everything in short, one needs to make or cook whatever one wishes. How this mansion has been constructed, laboriously over generations, and how and why this or that tool has been invented (as opposed to others which were not), why the rooms are disposed in just this fashion and not another - these are the kinds of questions which the heirs don't dream of asking . It's their \"Universe\", it's been given once and for all! It impresses one by virtue of its greatness, (even though one rarely makes the tour of all the rooms) yet at the same time by its familiarity, and, above all, with its immutability.</p>\n<p>When they concern themselves with it at all, it is only to maintain or perhaps embellish their inheritance: strengthen the rickety legs of a piece of furniture, fix up the appearance of a facade, replace the parts of some instrument, even, for the more enterprising, construct, in one of its workshops, a brand new piece of furniture. Putting their heart into it, they may fabricate a beautiful object, which will serve to embellish the house still further.</p>\n<p>Much more infrequently, one of them will dream of effecting some modification of some of the tools themselves, even, according to the demand, to the extent of making a new one. Once this is done, it is not unusual for them make all sorts of apologies, like a pious genuflection to traditional family values, which they appear to have affronted by some far-fetched innovation.</p>\n<p>The windows and blinds are all closed in most of the rooms of this mansion, no doubt from fear of being engulfed by winds blowing from no-one knows where. And, when the beautiful new furnishings, one after another with no regard for their provenance, begin to encumber and crowd out the space of their rooms even to the extent of pouring into the corridors, not one of these heirs wish to consider the possibility that their cozy, comforting universe may be cracking at the seams. Rather than facing the matter squarely, each in his own way tries to find some way of accommodating himself, one squeezing himself in between a Louis XV chest of drawers and a rattan rocking chair, another between a moldy grotesque statue and an Egyptian sarcophagus, yet another who, driven to desperation climbs, as best he can, a huge heterogeneous collapsing pile of chairs and benches!</p>\n</blockquote>",
        "id": 533420937,
        "sender_full_name": "John Baez",
        "timestamp": 1754641984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/532947191\">said</a>:</p>\n<blockquote>\n<p>When I think about music, \"beauty\" is supported by \"reason\". When I think about science \"reason/empiricism\" is supported by \"beauty\". Both these aspects are very important to me, in both activities.</p>\n<p>When I prioritize \"beauty\", There's a risk my understanding regresses into making \"mystical\" mistakes. A representative example includes believing any conclusions I make, are simply reinterpretations of ancient thinker's ideas (prisca sapientia). Training in the \"classics\" often has this value as a subtext, or even a supertext.</p>\n</blockquote>\n<p>Beauty is very subjective, especially when it comes to science and scientific theories. For example, many string theorists think that string theory is very beautiful. Many other physicists think that string theory is a very ugly complex mess. And string theory currently has zero empirical support so the philosophical debate over string theory's value tends to end up in aesthetics (beauty, simplicity, etc).</p>",
        "id": 533517184,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754681953
    },
    {
        "content": "<p>Right, but you can't throw it away when writing a song because that's generally the point of the song. Moreover, I don't believe songs are only pretty, I think they help us actually understand the <del>world</del> life.</p>\n<p>If you extend your philosophy of science <em>to</em> music, than the natural conclusion is that music <em>is merely</em> aesthetic, because \"that's all beauty is\".</p>\n<p>I think that's very bad, and maybe that's worth talking about. </p>\n<p>I just know it can be easy to talk around in circles about this which is why I hoped Grothendieck had more engagement with his essay (I'll admit I'm a little disappointed there wasn't much engagement with the essay )</p>",
        "id": 533518421,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754682687
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533518421\">said</a>:</p>\n<blockquote>\n<p>If you extend your philosophy of science <em>to</em> music, than the natural conclusion is that music <em>is merely</em> aesthetic, because \"that's all beauty is\".</p>\n</blockquote>\n<p>I don't know if you're using \"you\" as a synonym as \"one / a person\" or if you're specifically addressing me here.</p>",
        "id": 533519025,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754682977
    },
    {
        "content": "<p>I should've wrote \"If one extends your...\", I didn't mean to imply what you believe your philosophy means in music.</p>\n<p><em>I</em> believe discrediting beauty as a general heuristic implies discrediting it in the arts, which I think is bad.</p>\n<p>Obviously beauty isn't a perfect heuristic, especially as a postfacto justification for a failed idea.</p>",
        "id": 533519653,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754683330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533518421\">said</a>:</p>\n<blockquote>\n<p>I just know it can be easy to talk around in circles about this which is why I hoped Grothendieck had more engagement with his essay (I'll admit I'm a little disappointed there wasn't much engagement with the essay).</p>\n</blockquote>\n<p>Engagement by whom - us here?</p>\n<p>You might like to read this:</p>\n<ul>\n<li><a href=\"https://webusers.imj-prg.fr/~leila.schneps/grothendieckcircle/Spirituality/Spirituality6.pdf\">Survivre et Vivre, 1970 - 1972</a>.</li>\n</ul>\n<p>It's from a <a href=\"https://webusers.imj-prg.fr/~leila.schneps/grothendieckcircle/Spirituality/\">collection of chapters</a> on Grothendieck's spirituality.  I don't know who wrote them, but they're on Leila Schneps' website.  (She was one of the last people to see Grothendieck alive, and she plays a big role in the Grothendieck Circle.)</p>",
        "id": 533519764,
        "sender_full_name": "John Baez",
        "timestamp": 1754683394
    },
    {
        "content": "<p>Oh thank you! Carlson implied they didn't think there were many responses to Grothendieck's essay, that looks like a great resource to dig into to find more context.</p>",
        "id": 533520058,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754683568
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533519653\">said</a>:</p>\n<blockquote>\n<p>I should've wrote \"If one extends your...\", I didn't mean to imply what you believe your philosophy means in music.<br>\n<em>I</em> believe discrediting beauty as a general heuristic implies discrediting it in the arts, which I think is bad.</p>\n</blockquote>\n<p>Even in music, you will have some people believing that a song or instrumental piece is beautiful and other people believing that it is terrible. </p>\n<p>Also, subjectivity of beauty doesn't mean that beauty is discredited, it just means that people have different opinions on what is beautiful and what isn't. And that can lead to endless vicious philosophical arguments, as we have seen in philosophy in the past, and in music and in science.</p>",
        "id": 533520066,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754683573
    },
    {
        "content": "<p>So while it is good to aim for beauty, just remember that your belief of what is beauty might not be the same as anybody else's.</p>",
        "id": 533520208,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754683670
    },
    {
        "content": "<p>Oh sure, I hope I didn't give the impression I thought beauty was \"objective.\" I just think it's useful (and had it binned in my head as distinct from scientific thinking, which Baez pushed against)</p>",
        "id": 533520355,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754683760
    },
    {
        "content": "<p>As for managing scientism, my current problem isn't really rationalism vs beauty, but rather how much evidence / anomalies / contradictions is enough evidence to give up on a theory or the current paradigm and start looking for an alternative.</p>",
        "id": 533520477,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754683828
    },
    {
        "content": "<p>For example, with all the new data coming out of the James Webb Space Telescope and other astronomy observatories and telescopes leading to new anomalies and tensions that refuse to go away, when does belief in the validity of say Lambda CDM stop being science and start becoming \"scientism\"? </p>\n<p>If you want a 20th century analogue, when did belief in Newtonian physics stop being science and start being \"scientism\" and if you wanted to move on to actual science, it was time to move on to believe in relativity?</p>",
        "id": 533520963,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684078
    },
    {
        "content": "<p>I suspect you and Alex have quite different ideas of what counts as \"scientism\".</p>",
        "id": 533521118,
        "sender_full_name": "John Baez",
        "timestamp": 1754684156
    },
    {
        "content": "<p>Perhaps.</p>",
        "id": 533521210,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684197
    },
    {
        "content": "<p>You seem to be talking about clinging to bad theories.  Wikipedia says \"<strong>scientism</strong> is the belief that science and the scientific method are the best or only way to render truth about the world and reality\", and that's what I thought Alex was worrying about.</p>",
        "id": 533521236,
        "sender_full_name": "John Baez",
        "timestamp": 1754684213
    },
    {
        "content": "<p>Yeah that's the definition I was using, Maybe I should pull in a quote from the essay</p>\n<p>The Wikipedia summarizes Grothendieck's framing in his essay, very well I think:</p>\n<blockquote>\n<p>Grothendeick predicted that \"in coming years, the chief political dividing line will fall less and less among the traditional division between 'right' and 'left', but increasingly between the adherents of scientism, who advocate 'technological progress at any price', and their opponents, i.e., roughly speaking, those who regard the enhancement of life, in all its richness and variety, as being the supreme value\".</p>\n</blockquote>",
        "id": 533521631,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754684452
    },
    {
        "content": "<p>The Wikipedia article and <a href=\"https://www.merriam-webster.com/dictionary/scientism\">the Merriam-Webster dictionary</a> both say that \"scientism\" can also be used in the sense of \"an exaggerated trust in the efficacy of the methods of natural science applied to all areas of investigation (as in philosophy, the social sciences, and the humanities)\".</p>",
        "id": 533521833,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684562
    },
    {
        "content": "<p>I've been using it in the sense of \"an exaggerated trust in the current dominant scientific theories of our society\".</p>",
        "id": 533521914,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684598
    },
    {
        "content": "<p>You know I read multiple articles and all of them carefully defined \"Scientism\" in the same way, so I assumed it was safe to use, maybe that was the opposite take I should've had <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 533522038,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754684661
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533521631\">said</a>:</p>\n<blockquote>\n<p>the adherents of scientism, who advocate 'technological progress at any price',</p>\n</blockquote>\n<p>You see, now that to me is another definition of scientism that is different from the two given on the scientism Wikipedia article.</p>",
        "id": 533522101,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533521631\">said</a>:</p>\n<blockquote>\n<p>Grothendieck predicted that \"in coming years, the chief political dividing line will fall less and less among the traditional division between 'right' and 'left', but increasingly between the adherents of scientism, who advocate 'technological progress at any price', and their opponents, i.e., roughly speaking, those who regard the enhancement of life, in all its richness and variety, as being the supreme value\".</p>\n</blockquote>\n<p>This reminds me of Marc Andreesen's <a href=\"https://a16z.com/the-techno-optimist-manifesto/\">Techno-Optimist Manifesto</a>, of which I quote just a portion:</p>\n<blockquote>\n<h2>Truth</h2>\n<p>Our civilization was built on technology.</p>\n<p>Our civilization <em>is</em> built on technology.</p>\n<p>Technology is the glory of human ambition and achievement, the spearhead of progress, and the realization of our potential.</p>\n<p>For hundreds of years, we properly glorified this – until recently.</p>\n<p>I am here to bring the good news.</p>\n<p>We can advance to a far superior way of living, and of being.</p>\n<p>We have the tools, the systems, the ideas.</p>\n<p>We have the will.</p>\n<p>It is time, once again, to raise the technology flag.</p>\n<p>It is time to be Techno-Optimists.</p>\n<h2>Technology</h2>\n<p>Techno-Optimists believe that societies, like sharks, grow or die.</p>\n<p>We believe growth is progress – leading to vitality, expansion of life, increasing knowledge, higher well being.</p>\n<p>We agree with Paul Collier when he says, “Economic growth is not a cure-all, but lack of growth is a kill-all.”</p>\n<p>We believe everything good is downstream of growth.</p>\n<p>We believe not growing is stagnation, which leads to zero-sum thinking, internal fighting, degradation, collapse, and ultimately death.</p>\n</blockquote>",
        "id": 533522205,
        "sender_full_name": "John Baez",
        "timestamp": 1754684757
    },
    {
        "content": "<p>Belief that \"science and the scientific method are the best or only way to render truth about the world and reality\" really has nothing to do with whether society should progress technologically at any price. One can believe in the former and still think that the latter is a terrible idea.</p>",
        "id": 533522370,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754684849
    },
    {
        "content": "<p>What Baez quotes is imo what Grothendieck predicted. I think that's why Wikipedia quotes Grothendieck the way they did.</p>\n<p>Grothendeick also defines \"scientism\" in the usual way, and then proceeds to defend the connection:</p>\n<p>From his essay \"A new universal church\"</p>\n<blockquote>\n<p>The Credo of Scientism</p>\n<p>Myth 1: Only scientific knowledge is true or real knowledge; that is, only knowledge<br>\nwhich can be expressed quantitatively, or formalized, or repeated at will under <br>\nlaboratory conditions, can be the content of true knowledge. “True” or “real” knowledge, <br>\nsometimes called “objective” knowledge, may be defined as universal knowledge, which <br>\nholds at all times, places, and for all people, independently of societies and particular <br>\nforms of culture.<br>\n...</p>\n</blockquote>",
        "id": 533522519,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754684942
    },
    {
        "content": "<p>It feels rude to tell people to just read the essay so I tried to ask my question in a self contained way. But I think that made it more confusing</p>",
        "id": 533522756,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754685069
    },
    {
        "content": "<p>Anyways I also don't think you have to believe Grothendieck saw a real connection here, but I do, and felt Grothendieck didn't really provide solutions. I was hopeful somebody else maybe did, so tried to ask a question.</p>",
        "id": 533522984,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754685204
    },
    {
        "content": "<p>I'm wondering, when was Grothendieck's \"A new universal church\" first published? I'm wondering where his works lined up, relative to the publications of the likes of Kuhn, Lakatos, Feyerabend, Polanyl?</p>",
        "id": 533523065,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754685257
    },
    {
        "content": "<p>Seems that \"A new universal church\" was in Survivre et vivre issue 9, which was published in August–September 1971 according to Wikipedia.</p>",
        "id": 533523305,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754685407
    },
    {
        "content": "<p>Kuhn's <em>The Structure of Scientific Revolutions</em> appeared in 1962, Polanyl's <em>Science, Faith and Society</em> appeared in 1946 and <em>Personal Knowledge</em> appeared in 1958, Feyerabend's <em>Against Method</em> appeared in 1975 and <em>Science in a Free Society</em> appeared in 1978, and Lakatos's <em>The Methodology of Scientific Research Programmes</em> also appeared in 1978, all addressing various issues in science and \"scientism\" in the scientific community.</p>",
        "id": 533524366,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754685719
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533522370\">said</a>:</p>\n<blockquote>\n<p>Belief that \"science and the scientific method are the best or only way to render truth about the world and reality\" really has nothing to do with whether society should progress technologically at any price. One can believe in the former and still think that the latter is a terrible idea.</p>\n</blockquote>\n<p>I agree.   And maybe conversely!</p>\n<p>It would be nice if there were some pro-science, anti-technology organizations, just to broaden out the realm of views that people discuss.  (I'm not saying I agree; it's just that some but not all positions get a lot of publicity.)</p>",
        "id": 533524726,
        "sender_full_name": "John Baez",
        "timestamp": 1754685809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533524726\">said</a>:</p>\n<blockquote>\n<p>I agree.   And maybe conversely!</p>\n</blockquote>\n<p>A lot of people believe in religion or the occult and simultaneously in technological progress at all cost.</p>",
        "id": 533525242,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754685951
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533524726\">said</a>:</p>\n<blockquote>\n<p>It would be nice if there were some pro-science, anti-technology organizations, just to broaden out the realm of views that people discuss.  (I'm not saying I agree; it's just that some but not all positions get a lot of publicity.)</p>\n</blockquote>\n<p>Not even anti-technology, perhaps just anti-our current technologies. There are probably lots of other technologies out there that haven't been explored yet by humanity, because we have been shoehorned down this dependency on electricity and fossil fuels.</p>",
        "id": 533525931,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754686151
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533522984\">said</a>:</p>\n<blockquote>\n<p>Anyways I also don't think you have to believe Grothendieck saw a real connection here, but I do, and felt Grothendieck didn't really provide solutions. I was hopeful somebody else maybe did, so tried to ask a question.</p>\n</blockquote>\n<p>Just try to keep an open mind on everything, and be open to the possibility that anything you currently believe might end up being wrong.</p>",
        "id": 533527788,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754686682
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533521236\">said</a>:</p>\n<blockquote>\n<p>\"<strong>scientism</strong> is the belief that science and the scientific method are the best or only way to render truth about the world and reality\"</p>\n</blockquote>\n<p>Now, a critique of scientism in this sense. </p>\n<p>How does one justify scientism? One would have to use the scientific method to show that the scientific method is the best or only way to render truth about the world and reality at every single location in the universe at all times. Absent time travel, this is physically impossible for any human being and any human civilization, so one doesn't know for sure and the belief is unjustified.</p>",
        "id": 533528908,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754687010
    },
    {
        "content": "<p>Another text that may be worth reading, this article on the social aspects of scientific knowledge:</p>\n<p><a href=\"https://plato.stanford.edu/entries/scientific-knowledge-social/\">https://plato.stanford.edu/entries/scientific-knowledge-social/</a></p>",
        "id": 533529645,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754687337
    },
    {
        "content": "<p>One thing that I have had to deal with in the past 15 years is the realization that science is an ongoing process that occurs in the context of various scientific communities, rather than just the contents of the scientific theories themselves.</p>",
        "id": 533529811,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754687493
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533525931\">said</a>:</p>\n<blockquote>\n<p>There are probably lots of other technologies out there that haven't been explored yet by humanity, because we have been shoehorned down this dependency on electricity and fossil fuels.</p>\n</blockquote>\n<p>Indeed, I think that if our civilization manages to keep advancing we eventually look back on our current technologies as incredibly crude, clumsy and wasteful.  For a bit of evidence, notice that you can plant a small apple seed in some soil, give it water and sunlight, and eventually get apples.   But if we tried to make apples using chemical engineering the process would probably use a lot of energy and create a lot of waste material.   Or notice that the human brain operates at a power of less than 90 watts.   Biology has had time to find 'technologies' that humans don't really understand yet.  I think someday we could understand them and do wonderful things.   </p>\n<p>(Right now we are so messed up that if we partially figure them out we may do terrible things.)</p>",
        "id": 533533228,
        "sender_full_name": "John Baez",
        "timestamp": 1754690084
    },
    {
        "content": "<p>Since the original question was about book recommendations: Girard in his book \"The blind spot\", states his opinion that the clash between Hilbert and Brouwer was also a clash between scientism and mysticism (and then he frames linear logic as resolving some of the tension). It's an unusual book, meant as a rather introductory logic text book, but is packed with opinionated, polemic, and aggressive passages on the course of logic and the role of its big figures. On me this style had the effect of taking nothing at face value, but it gave a lot of food for thought - I had great fun reading it so far!</p>",
        "id": 533679813,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1754863971
    },
    {
        "content": "<p>I recently came across the book \"Beauty and the Beast: The Aesthetic Moment in Science\" (1999) by Ernst Peter Fischer. Haven't read much of it but seems nice!</p>",
        "id": 533680427,
        "sender_full_name": "Simon Burton",
        "timestamp": 1754864822
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 533684023,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754869418
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"277352\">@Alex Kreitzberg</span> on that essay recommendation by Grothendieck. The issue he is describing is, through a long and winding path, one of the main reasons I have begun trying to learn more about category theory and have ended up here. (But this is long and winding so, perhaps better left out.)</p>\n<p>It seems that this issue is one that has been simmering for a long time.</p>\n<p>I wonder what people here make of the book \"The Ultimate Foundation of Economic Science\" by Ludwig von Mises. (There is a free download here <a href=\"https://mises.org/library/book/ultimate-foundation-economic-science\">https://mises.org/library/book/ultimate-foundation-economic-science</a>) This is probably going to seem like a book from way out in left field (economics) but he is grappling with topics like epistemology, a prioricity, free will, scientific induction, etc. coming from the field of economics and pushing back against the logical positivists of the Vienna Circle.</p>\n<p>I think this scientism philosophy stems from the logical positivists (and was put to rest some time ago in the philosophical circles).</p>\n<p>But what really grabbed my attention from this book is the idea that we might be able to know something about the world without having to appeal to external observation. In the realm of man, we are privy to internal observation, and importantly, we know why we do things. To interpret the behavior of others, we do not appeal to repeated experiments but assume that other people are like us (they have a mind and will etc.).</p>\n<p>Has anyone else read this? Thoughts?</p>",
        "id": 533879726,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1754952592
    },
    {
        "content": "<p>I haven't read the book.  </p>\n<p>Does von Mises talk about how we can misinterpret the actions of others by assuming they're more like us than they are?   I think we do <em>need</em> to assume others are somewhat like us to develop the higher forms of understanding, like empathy and sympathy.  This is even true if the other is, say, a dog.  But we can also go astray by neglecting differences, so it's an interesting dynamic.</p>",
        "id": 533921561,
        "sender_full_name": "John Baez",
        "timestamp": 1754983203
    },
    {
        "content": "<p>He does not belabor the point. </p>\n<p>He assumes that we are not privy to the inner workings of other people's minds. But we are at a loss to interpret the movement of people's bodies and the noises they make without presuming that they are acting. That is, that they have ends they are aiming at, they are using means to attain those ends. The reason they aim at those ends is that they perceive that the change in the state of the world is preferable than the alternative. </p>\n<p>It is in this limited and fairly abstract sense that we \"know\" what people are doing when they act. The main point is that we cannot interpret human action from the physicist's perspective.</p>\n<p>This also extends to science itself. We interpret theories about the world in the context of them being created by acting rational beings. We understand theories not on the basis of laws of brain chemistry but on the basis of laws of logic.</p>",
        "id": 533995558,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755009326
    },
    {
        "content": "<p>An example of that I like are folks agreeing to meet up to catch a flight.</p>\n<p>The flight could be months after the plan to meet up, but if someone was missing when it was time to meet, that would be cause for concern.</p>\n<p>Whereas for many physical problems, much simpler than people, trying to predict three months out is impossible. So it isn't silly our reasoning isn't based on physics when trying to meet up for a flight.</p>\n<p>By the way I looked up \"logical positivists\", and some folks on Reddit suggested the essay \"Two Dogmas of Empiricism\" by Quine as a critical account. It seems relevant so I wanted to mention the name, but I'm getting the sense I need to be better at philosophy to talk about this topic.</p>",
        "id": 534008055,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1755013317
    },
    {
        "content": "<p>Quine influenced me a lot as a kid since I was into logical positivism then (Ayer, Russell, early Wittgenstein and such), and he came from that tradition but sort of outgrew it in a thoughtful way (as did the later Wittgenstein).   I imagine that essay of his is good, but I don't think I've read it.</p>",
        "id": 534009765,
        "sender_full_name": "John Baez",
        "timestamp": 1755013862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"932124\">Ondrej Dyck</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533879726\">said</a>:</p>\n<blockquote>\n<p>But what really grabbed my attention from this book is the idea that we might be able to know something about the world without having to appeal to external observation. In the realm of man, we are privy to internal observation, and importantly, we know why we do things. To interpret the behavior of others, we do not appeal to repeated experiments but assume that other people are like us (they have a mind and will etc.).</p>\n<p>Has anyone else read this? Thoughts?</p>\n</blockquote>\n<p>I have not, but this seems to be the old question of <em>a priori</em> versus <em>a posteriori</em> knowledge which was a central concern of Western philosophy at least by Kant, and in a sense back to Descartes. The <em>cogito ergo sum</em> has as premise the assertion \"I think\" because, for Descartes, this was the most solid knowledge available, even supposing a demon were poisoning all his percepts. Just wanted to point that out in case it came across as a novel concern in Mises.</p>",
        "id": 534043954,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1755027426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span> yes, exactly right. He [Mises] is arguing along the lines of Kant and Descartes. And before Mises there was a debate between the German Historical School and the Austrian School of Economics, known as the Methodenstreit, that centered around what might be now known as the theory vs data debate.</p>\n<p>The historical school took up the data side and the Austrian economists (not to be confused with logical positivists of the Vienna circle) took up the theory side. These positions are analogous to a priori vs a posteriori.</p>\n<p>My understanding is that Hume demonstrates the problem of induction (which is also a problem for abduction (causality)). This shocks Kant because, given that Newton's law of gravitation appears to be absolutely true, there must be a way to arrive at absolutely certain inductive conclusions. Kant gives as a powerful example Euclidean geometry. In a jaw dropping sequence of events (IMO) non-Euclidean geometry is invented and then proposed by Einstein that this is, in fact, how the world is. It actually doesn't matter if Einstein is right at this point in the argument. What is critical is that we can't know before hand, we must appeal to the data (data and history have the upper hand).</p>\n<p>The logical positivists are, as I understand it, completely sold on the data side. </p>\n<p>It is during this time that Karl Popper and Ludwig von Mises are writing. Both are highly critical of the positivists (Quine as well, but I am less familiar with his writing. There is a quote from Popper somewhere where he mentions the drawing of 'heavy fire from Quine's guns' <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span>).</p>\n<p>But Popper and Mises are actually also in sharp disagreement over what constitutes 'science'. I think this was because the positivists were highly critical of anything that was not 'science' (and were fairly influential) so that anything that was labeled as 'unscientific' could instantly be dismissed as nonsense (this continues today).</p>\n<p>For Popper math is not science because it cannot be falsified by experiment. Mises objects that human action cannot be falsified by experiment, in the sense that <span class=\"user-mention\" data-user-id=\"277352\">@Alex Kreitzberg</span> mentions above for explaining how people can meet up for a flight in three months. The notion that man acts is not falsifiable, for to <em>interpret</em> any objection, we would have to presuppose that the objector was acting in order to understand him.</p>\n<p>Nevertheless, Popper does seem to conclude that theory comes first, in opposition to the logical positivists and the whole of the antagonism between the two seems to be mostly semantics. Popper simply means 'natural empirical science' by 'science' and excludes what we might call 'rational science' (lines of thought open to rational refutation and argument but which are not open to empirical refutation, like math).</p>",
        "id": 534290301,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755112921
    }
]