[
    {
        "content": "<p>The word \"category\" has unfortunately been quite commonly adopted in academic jargon, sometimes in ways that are hard to relate to the sense of the word in which we use it here. However, the expression 'category error', referring to a misapplication of a word or a misunderstanding of the concept to which a word/phrase refers, could actually bridge the gap. For example, if I have two categories have the same objects but different morphisms, I might accidentally take a product or other construction in the wrong category, and this is a very concrete example of a category error (in both senses of that phrase!)<br>\nAbstracting this, in situation when we can think of a property or concept as a construction (an object, morphism, limit...) in or on a particular category, a category error consists precisely of a mistake about which category is being referred to, and so drawing an erroneous conclusion or performing an erroneous calculation. I don't know the extent to which this can give new insights, but I found it satisfying to realise.</p>",
        "id": 213131631,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1602582133
    },
    {
        "content": "<p>I think I more or less see your point but I also feel like I'm missing a big chunk of it. Can you give me a bit more context to better understand it?</p>",
        "id": 213148364,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1602593273
    },
    {
        "content": "<p>I should come up with some actual category theory examples; it's hard to find ones where the arrows aren't trivial. Suppose I consider the collection of roads in a city as a category (there might be one-way systems, so not necessarily a groupoid), the <em>city-map category</em>. If a tourist asks me for directions to a particular landmark, my response will correspond to a morphism from my current position to their proposed destination.<br>\nHowever, there are a bunch of category errors that could occur in this situation, especially if the tourist is a non-native speaker of English or a child. They could ask me directions to something intangible (eg \"love\"), to an ambiguous location (eg \"the museum\"), to a place such as \"the university\" which doesn't really denote a specific building/position (eg if someone in the centre of Cambridge asked \"which way to the university?\", the answer would be \"it's all around you\"). In each case, they still expect the answer to have the same form, of a morphism in the city-map category, and this is the category error.</p>",
        "id": 213154653,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1602596222
    },
    {
        "content": "<p>Ok, so roughly the idea would be that there are two categories at play: </p>\n<ol>\n<li>A \"real world category\" modelling whatever you want to model</li>\n<li>A \"fake world category\" which looks very similar to the first apparently, but it's not, and it's wrongly modelling whatever you want to model</li>\n</ol>\n<ul>\n<li>You think you are querying 1, but you are actually querying 2.</li>\n</ul>",
        "id": 213157465,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1602597406
    },
    {
        "content": "<p>Finding a category error in a philosophical argument is quite a serious charge. It would be indeed interesting if this could shown to be related to the notions of category from CT.</p>",
        "id": 213158351,
        "sender_full_name": "Henry Story",
        "timestamp": 1602597740
    },
    {
        "content": "<p>I think it's difficult to model categorically this phenomenon... The point being exactly that \"I'm in structure A, I think I'm in structure B, structure A and B are not compatible\"</p>",
        "id": 213171565,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1602602440
    },
    {
        "content": "<p>Still, basically all categorical concepts (functors, ...) are create with the precisely opposite intent of preserving structure</p>",
        "id": 213171611,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1602602467
    },
    {
        "content": "<p>It helps when there is a concrete relationship between the categories to refer to. So we might have a category of concrete objects (with a definite location, say) which embeds into a larger category of objects, including abstract ones. Then a category error arises from the inability to extend a gadget defined on the first category (the \"location\" property) along the inclusion into the second category.</p>",
        "id": 213172915,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1602602968
    },
    {
        "content": "<p>It happens very often when category A has the same objects of category B. So you get really confused. Anyone who has worked in categories of complete lattices can confirm that!</p>",
        "id": 213181515,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1602606277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229134-philosophy/topic/category.20error/near/213181515\">said</a>:</p>\n<blockquote>\n<p>It happens very often when category A has the same objects of category B. So you get really confused. Anyone who has worked in categories of complete lattices can confirm that!</p>\n</blockquote>\n<p>That's why some people like to use different names for the objects of different categories even though they are \"the same\".  E.g. frames and locales.</p>",
        "id": 213349711,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1602709081
    },
    {
        "content": "<p>Robert Brandom just published a very interesting paper <a href=\"https://www.academia.edu/44387246/Brandom_The_Pragmatist_Roots_and_Some_Expressivist_Extensions_of_The_Dialogical_Roots_of_Deduction?email_work_card=title\">The Pragmatist Roots and Some Expressivist Extensions of The Dialogical Roots of Deduction</a>, which seems to get very close to the points made by James Trafford on the relation between <a href=\"https://twitter.com/bblfish/status/1251803266238885889\">Topoi and complemenl-Topoi</a> that I came across half a year ago, even if he does not use the CT vocabulary. Brandom develops a linear logic that builds on his pragmatist philosophy there in support of a dialogical view of reason. (Note that Brandom was a student of David Lewis, though he does not mention him that often, even if one can see many themes from Lewis reversed in a pragmatic direction). I know that <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> values Brandom's insight, and given the discussion on linear logic it should be of interest to <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> .</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/bblfish/status/1251803266238885889\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1004326761608417281/HjxjS9BX_normal.jpg\"></a><p>This dual interpretation of any Topos as ① logic of construction ② a logic of refutation can be grasped intuitively by thinking of reasoning dialogically. \nWhere ① builds an argument  ② tries to disprove it. \n②-types are really annoying, but necessary\n<a href=\"https://t.co/22czVC8wRt\">https://twitter.com/bblfish/status/1248684859658317826</a></p><span>- The 🐟‍‍ BabelFish (@bblfish)</span></div></div>",
        "id": 215781343,
        "sender_full_name": "Henry Story",
        "timestamp": 1604614504
    },
    {
        "content": "<p>I should have mentioned also that Robert Brandom was one of the reviewers with <span class=\"user-mention\" data-user-id=\"276770\">@Steve Awodey</span>  and Nuel Belnap of Kishida's 2011 thesis <a href=\"http://d-scholarship.pitt.edu/10224/\">Generalized Topological Semantics for First-Order Modal Logic</a>. So he must have some knowledge of Category Theory :-)</p>",
        "id": 215839904,
        "sender_full_name": "Henry Story",
        "timestamp": 1604666299
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/category.20error/near/215781343\">said</a>:</p>\n<blockquote>\n<p>Robert Brandom just published a very interesting paper <a href=\"https://www.academia.edu/44387246/Brandom_The_Pragmatist_Roots_and_Some_Expressivist_Extensions_of_The_Dialogical_Roots_of_Deduction?email_work_card=title\">The Pragmatist Roots and Some Expressivist Extensions of The Dialogical Roots of Deduction</a>, which seems to get very close to the points made by James Trafford on the relation between <a href=\"https://twitter.com/bblfish/status/1251803266238885889\">Topoi and complemenl-Topoi</a> that I came across half a year ago, even if he does not use the CT vocabulary. Brandom develops a linear logic that builds on his pragmatist philosophy there in support of a dialogical view of reason. (Note that Brandom was a student of David Lewis, though he does not mention him that often, even if one can see many themes from Lewis reversed in a pragmatic direction). I know that <span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> values Brandom's insight, and given the discussion on linear logic it should be of interest to <span class=\"user-mention silent\" data-user-id=\"276656\">Valeria de Paiva</span> .</p>\n</blockquote>\n<p>I am hoping to catch up (or try to) on this sometime soon. I heard that there was a talk by Caterina and one by Robert Brandom, do you happen to have the links?</p>",
        "id": 215857007,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1604674766
    },
    {
        "content": "<p>Catarina on Twitter informed me it was not recorded. (other than as the written document). That, I guess, constitutes a refutation object.</p>",
        "id": 215869996,
        "sender_full_name": "Henry Story",
        "timestamp": 1604680265
    }
]