[
    {
        "content": "<p>I am not a Category Theorist, nor a mathematician, but a philosopher interested in Category Theory. I have written a paper relating the Yoneda Lemma to the structure of Existence and Being within the Western worldview. Audacious I know. Anyway I thought someone here might be interested in the <em>attempt</em> to apply a central concept in Category Theory to Western philosophy in a significant way. Whether successful or not <em>it is an attempt</em> to place Category Theory at the center of things, as organizing the worldview, even if that is hard to believe. See <a href=\"https://www.academia.edu/115745588/Existence_Mathematics_Being\">https://www.academia.edu/115745588/Existence_Mathematics_Being</a> Let me know what I got wrong. As a speculative philosopher leaping to conclusions I am happy to find I am wrong and get corrected especially about the niceties of Category Theory which I am still trying to learn.</p>",
        "id": 429310531,
        "sender_full_name": "Kent Palmer",
        "timestamp": 1711353644
    },
    {
        "content": "<p>We have had some dubious attempts posted here in this direction before now. Your humility in presenting this is frankly refreshing (and reflective of the attitude I see in my philosopher colleagues), so I look forward to reading what you have to say in the near future.</p>",
        "id": 429333257,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711360108
    },
    {
        "content": "<p>If you could share your paper in such a way I don't have to register to a service to read it I would be more inclined to do so :)</p>",
        "id": 429375084,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711368902
    },
    {
        "content": "<p>In the meantime, in this post I present some common pitfalls in engaging with Yoneda philosophically: <a href=\"https://matteocapucci.wordpress.com/2023/07/15/no-the-yoneda-lemma-doesnt-solve-the-problem-of-qualia/\">https://matteocapucci.wordpress.com/2023/07/15/no-the-yoneda-lemma-doesnt-solve-the-problem-of-qualia/</a></p>",
        "id": 429375359,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1711368949
    },
    {
        "content": "<p>This is definitely a topic I would like to learn more about, I’ll try to read your post and respond when I can.</p>",
        "id": 430579685,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1711970939
    }
]