[
    {
        "content": "<p>Yep that's certainly a condescending way to talk about others' approaches to mathematics!</p>",
        "id": 533463674,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1754659428
    },
    {
        "content": "<p>Yes!   <em>Reapings and Sowings</em> is arrogant and self-centered, and it begins to show signs of the madness that seems to have later overtaken him.   Nonetheless this passage helps me understand how Grothendieck had the energy to repeatedly tear up the foundations of algebraic geometry and start again.</p>",
        "id": 533466378,
        "sender_full_name": "John Baez",
        "timestamp": 1754660334
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/532957057\">said</a>:</p>\n<blockquote>\n<p>I found out about \"A New Universal Church\" from Wikipedia's article on Scientism, which linked this: <a href=\"https://publish.uwo.ca/~jbell/univ.pdf\">https://publish.uwo.ca/~jbell/univ.pdf</a> </p>\n<p>What little clarity I got on my question was after a small bit of science History. I'm not a historian so I'm always a bit nervous trying to figure it out on my own, but I'll keep going in the absence of more accessible options.</p>\n</blockquote>\n<p>That was interesting, and I must say I was unaware this side of Grothendieck's. What became of such works with a mystical tone? Have they been picked up by any particular individual or movement at any point, or are they mostly unknown (or actively ignored)?</p>",
        "id": 533486144,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1754667604
    },
    {
        "content": "<p>Grothendieck helped start <a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre\">Survivre et Vivre</a>:</p>\n<blockquote>\n<p><strong>Survivre</strong> (Survive), later renamed <strong>Survivre et Vivre</strong> (Survive and Live), was a political group founded on 27 July 1970 in <a href=\"https://en.wikipedia.org/wiki/Montreal\">Montreal</a>, with the goals of promoting <a href=\"https://en.wikipedia.org/wiki/Pacificism\">pacificism</a>, <a href=\"https://en.wikipedia.org/wiki/Ecological_movement\">ecology</a>, and a new kind of science. It was headed by the French mathematician <a href=\"https://en.wikipedia.org/wiki/Alexander_Grothendieck\">Alexander Grothendieck</a> and later included several other well-known mathematicians such as <a href=\"https://en.wikipedia.org/wiki/Claude_Chevalley\">Claude Chevalley</a> and <a href=\"https://en.wikipedia.org/wiki/Pierre_Samuel\">Pierre Samuel</a>, as well as about 50 or 60 other members, both in North America and France.<a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-:0-1\">[1]</a> From August 1970 to June 1975, they published the journal <em>Survivre... et vivre</em>.<a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-:1-3\">[3]</a></p>\n</blockquote>\n<blockquote>\n<p>Grothendieck left in 1972 or 1973 and the visionary group dissolved in the middle of the 1970s, its members dispersing, or joining more politically engaged groups, or magazines like La Gueule Ouverte.</p>\n</blockquote>\n<p>Currently there are organizations with similar aims, but I'm not aware of any who say they're following <em>Grothendieck's</em> ideas - except for <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>, who tried to plan out a kind of mathematical monastery:</p>\n<ul>\n<li>Joshua Meyers, <a href=\"https://johncarlosbaez.wordpress.com/2023/02/10/34097/\">Let me think</a>, February 10, 2023.</li>\n</ul>\n<p>Hmm, now I see that Josh was funded by something called the <a href=\"https://survivalandflourishing.fund/\">Survival and Flourishing Fund</a>.    Was this inspired by Survivre et Vivre?</p>",
        "id": 533487247,
        "sender_full_name": "John Baez",
        "timestamp": 1754668064
    },
    {
        "content": "<p>SFF is the foundation of Jann Tallinn, who made a lot of money on Skype. I'm not aware that he has any connection to Grothendieck. He's influenced by the rationalist/AI safety movement, which certainly contains some people who know Grothendieck's math, but their politics are not so close together other than evincing a dedication to avoiding everyone dying.</p>",
        "id": 533487707,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754668265
    },
    {
        "content": "<p>Oh, Josh said he was funded by Jaan Tallinn and the Survival and Flourishing Fund - I didn't guess they were essentially the same.</p>\n<p>I'm glad they agree that \"everyone dying would be bad\".  <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 533487935,
        "sender_full_name": "John Baez",
        "timestamp": 1754668353
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533487247\">said</a>:</p>\n<blockquote>\n<p>Grothendieck helped start <a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre\">Survivre et Vivre</a>:</p>\n<blockquote>\n<p><strong>Survivre</strong> (Survive), later renamed <strong>Survivre et Vivre</strong> (Survive and Live), was a political group founded on 27 July 1970 in <a href=\"https://en.wikipedia.org/wiki/Montreal\">Montreal</a>, with the goals of promoting <a href=\"https://en.wikipedia.org/wiki/Pacificism\">pacificism</a>, <a href=\"https://en.wikipedia.org/wiki/Ecological_movement\">ecology</a>, and a new kind of science. It was headed by the French mathematician <a href=\"https://en.wikipedia.org/wiki/Alexander_Grothendieck\">Alexander Grothendieck</a> and later included several other well-known mathematicians such as <a href=\"https://en.wikipedia.org/wiki/Claude_Chevalley\">Claude Chevalley</a> and <a href=\"https://en.wikipedia.org/wiki/Pierre_Samuel\">Pierre Samuel</a>, as well as about 50 or 60 other members, both in North America and France.<a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-:0-1\">[1]</a> From August 1970 to June 1975, they published the journal <em>Survivre... et vivre</em>.<a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Survivre_et_vivre#cite_note-:1-3\">[3]</a></p>\n</blockquote>\n<blockquote>\n<p>Grothendieck left in 1972 or 1973 and the visionary group dissolved in the middle of the 1970s, its members dispersing, or joining more politically engaged groups, or magazines like La Gueule Ouverte.</p>\n</blockquote>\n<p>Currently there are organizations with similar aims, but I'm not aware of any who say they're following <em>Grothendieck's</em> ideas - except for <span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span>, who tried to plan out a kind of mathematical monastery:</p>\n<ul>\n<li>Joshua Meyers, <a href=\"https://johncarlosbaez.wordpress.com/2023/02/10/34097/\">Let me think</a>, February 10, 2023.</li>\n</ul>\n<p>Hmm, now I see that Josh was funded by something called the <a href=\"https://survivalandflourishing.fund/\">Survival and Flourishing Fund</a>.    Was this inspired by Survivre et Vivre?</p>\n</blockquote>\n<p>Did the workshop take place? I was not able to find any proceedings from it or anything of the like</p>",
        "id": 533492044,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1754669820
    },
    {
        "content": "<p>Yes, it took place.   They did not publish a proceedings.  <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span>  You can ask <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> how it went: I know, roughly, but I figure I should let him say as much or as little as he wants.   </p>\n<p>(Btw, it's somewhat better to quote just the portion of a comment that you really need, so people don't need to scroll down through a lot of stuff to see what you have to say.)</p>",
        "id": 533494357,
        "sender_full_name": "John Baez",
        "timestamp": 1754670858
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/533494357\">said</a>:</p>\n<blockquote>\n<p>(Btw, it's somewhat better to quote just the portion of a comment that you really need, so people don't need to scroll down through a lot of stuff to see what you have to say.)</p>\n</blockquote>\n<p>I see, I wasn't aware you could highlight portions to quote, thanks</p>",
        "id": 533498041,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1754672396
    },
    {
        "content": "<p>I guess another way to reframe my question, is I think you can see in that essay evidence of him wanting to give up on society and live on a farm.</p>\n<p>And folks worried about this might've tried to talk him down by responding to that essay, by earnestly addressing his points and concerns carefully. I'm interested in those responses.</p>\n<p>I think Grothendieck touched on a problem, but didn't have a solution (from what I saw in that essay anyways).</p>",
        "id": 533499590,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754673064
    },
    {
        "content": "<p>The well-known correspondence of Grothendieck in his later decades were with people like Quillen who were just talking about math. Grothendieck did indeed give up on society for the whole last half-century of his life and I don't think there was anyone who could have plausibly talked him out of it, nor am I aware of anyone who published anything aimed at doing so.</p>",
        "id": 533500217,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754673376
    },
    {
        "content": "<p>Well if such arguments existed they might be helpful for me. It's possible somebody could have given sharp advice that Grothendieck ignored.</p>\n<p>(The answers given in this thread have been very helpful though, to be clear!)</p>",
        "id": 533500939,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754673697
    },
    {
        "content": "<p>I think the question of \"should one give up on the fallen world\" is bigger and older than Grothendieck. I don't particularly see his decision to do so as that particular to him over any number of other such hermits over the millennia.</p>",
        "id": 533501243,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754673826
    },
    {
        "content": "<p>My grandfather did something similar, so maybe I'm getting hung up on why someone might choose to do that.</p>\n<p>I believe I resonated with the specific points though <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 533503186,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754674659
    },
    {
        "content": "<p>I don't think it's so bad for people to go live on a farm, and it's easy for me to imagine wanting to do it.  (I don't at all want to do it: it's just easy to <em>imagine</em>.)    </p>\n<p>Unfortunately Grothendieck tried to live on only dandelion soup until his neighbors helped cook him some other food.   So he was not cut out to be a farmer.  </p>\n<p>Also he retreated into solitude and, arguably, went nuts.   I think very few people can withstand long periods of solitude well.</p>",
        "id": 533503701,
        "sender_full_name": "John Baez",
        "timestamp": 1754674905
    },
    {
        "content": "<p>Yeah, I was responding more to the “give up on society” part, which is related to the difficulty of solitude.</p>",
        "id": 533507547,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754676651
    },
    {
        "content": "<p>Hey, I think Alex changed the part where he said his grandfather went to live on a farm.  (That's why I wrote what I did.)</p>",
        "id": 533512476,
        "sender_full_name": "John Baez",
        "timestamp": 1754679324
    },
    {
        "content": "<p>I didn't actually say that, but incidentally he did decide to live on a farm.</p>\n<p>He made it work, but I'm not convinced it was a natural fit. I resolved to never \"give up\" by living on a farm in any case.</p>",
        "id": 533512686,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754679441
    },
    {
        "content": "<p>Oh, okay.</p>\n<p>There are plenty of people sick of features of our modern existence, or afraid of collapse, who turn to farming.   I don't think it's \"giving up\" - in fact it's hard as hell!    If I ever decide to \"give up\" I'll live off my savings and order take-out.</p>\n<p>But I think farming works best with a community.    And if you're going to be really honest about self-sufficiency, you need someone in the community who makes the tools, etc.</p>",
        "id": 533512844,
        "sender_full_name": "John Baez",
        "timestamp": 1754679518
    },
    {
        "content": "<p>Oh the \"give up\" is a personal comment, with respect to myself, given what I know about what I find interesting and what I'm good at.</p>\n<p>That is I agree with your point that Grothendieck should never have been a farmer, that life choice was an artifact of something bad.</p>\n<p>Maybe it's as general as \"he had poor mental health which drove him into isolation\", but I genuinely worry there's a deep risk in carelessly judging modern technical solutions as bad or dangerous, even if a specific argument of that sort was true.</p>",
        "id": 533513778,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754680001
    },
    {
        "content": "<p>Maybe I should frame that more concretely</p>",
        "id": 533514188,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754680216
    },
    {
        "content": "<p>In my own life, I think I have rightly noticed an over application of some technology in certain contexts, but when I try to resolve that contradiction or solve that problem, it's way too easy to imagine certain conservative or regressive solutions.</p>",
        "id": 533514334,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754680310
    },
    {
        "content": "<p>So instead of using line stabilizers I draw by hand on paper to get better, which makes me want to learn euclidean geometry. </p>\n<p>Multiple times I had moments and thoughts that were too close to \"Western math has lost its way\", and only after a lot of thought and work, do I get my brain \"modern\" again, often by rewalking through the historical journey.</p>",
        "id": 533514765,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754680561
    },
    {
        "content": "<p>(And there were communities that would be happy for me to stay in those locations fwiw, I feel like choosing your friends is more important for defining your beliefs than thinking sometimes)</p>",
        "id": 533514926,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754680662
    },
    {
        "content": "<p>Grothendieck didn't have the knowledge or community support to help him succeed in becoming a farmer, nor really the motivation to build the knowledge base or community. I'm sure if he wanted to and put in the effort, Grothendieck could have successfully spent the rest of his life being a dandelion farmer.</p>",
        "id": 533514946,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754680675
    },
    {
        "content": "<p>30 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"229134\" href=\"/#narrow/channel/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/with/533172503\">#theory: philosophy &gt; Book/course recommendations for managing \"Scientism\"?</a> by <span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span>.</p>",
        "id": 533515287,
        "sender_full_name": "Notification Bot",
        "timestamp": 1754680882
    },
    {
        "content": "<p>Which would have been a short life if he only ate dandelion soup.  <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span> </p>\n<p>(Btw I'm not sure Alex, who started this thread, considers the current discussion to be a digression from his original intent.   He may or may not care that Madeleine severed this portion from the initial portion.  I don't personally care.)</p>",
        "id": 533515579,
        "sender_full_name": "John Baez",
        "timestamp": 1754681045
    },
    {
        "content": "<p>Given Madeleine's comment I want to underscore I don't think there's anything wrong with farming.</p>\n<p>I very much think if <em>I</em> say \"I want to be a farmer\" in 30 years, knowing what I know about myself, then I can confidently say \"something went wrong.\" And I see analogies in my life with Grothendieck's specific argument (I don't believe I'm as unstable as him). </p>\n<p>My grandfather actually had to figure out a lot of farming on his own because the \"real\" farmers didn't know what to make of him <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>. I'm actually very proud of him, I just think that life was more stressful than it needed to be, and don't want to repeat it.</p>",
        "id": 533516727,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754681697
    },
    {
        "content": "<p>I want to say, if an old idea was actually good, then generally we don't stop using it, so if you ask \"is this old idea good?\" If you're not very careful you're buying into a lot of confusion.</p>\n<p>Which in the farming case, if done carelessly, amounts to needing to rediscover how to farm. That's bad!</p>",
        "id": 533517457,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754682102
    },
    {
        "content": "<p>One thing about farming is that today's methods of farming heavily relies on our industrial society for inputs, such as fertilizers, pesticides, GMOs, tractors, et cetera. I don't know if Grothendieck was willing to deal with all that in farming with the views he had towards the end of the life.</p>",
        "id": 533518198,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754682534
    },
    {
        "content": "<p>I don't really recall any evidence that Grothendieck ever farmed.  His Wikipedia biography says </p>\n<blockquote>\n<p>In 1991, Grothendieck moved to a new address that he did not share with his previous contacts in the mathematical community <a href=\"https://en.wikipedia.org/wiki/Alexander_Grothendieck#cite_note-FOOTNOTEScharlau2008-1\">[1]</a>. Very few people visited him afterward <a href=\"https://en.wikipedia.org/wiki/Alexander_Grothendieck#cite_note-Rivka#-73\">[71]</a>.  Local villagers helped sustain him with a more varied diet after he tried to live on a staple of <a href=\"https://en.wikipedia.org/wiki/Taraxacum\">dandelion</a> soup <a href=\"https://en.wikipedia.org/wiki/Alexander_Grothendieck#cite_note-74\">[72]</a>.\"</p>\n</blockquote>\n<p>Maybe he learned to farm after a while - I don't know!</p>",
        "id": 533518474,
        "sender_full_name": "John Baez",
        "timestamp": 1754682717
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/533516727\">said</a>:</p>\n<blockquote>\n<p>I very much think if <em>I</em> say \"I want to be a farmer\" in 30 years, knowing what I know about myself, then I can confidently say \"something went wrong.\" And I see analogies in my life with Grothendieck's specific argument (I don't believe I'm as unstable as him).</p>\n</blockquote>\n<p>It's not just knowing about yourself, but also knowing about society and the local community around you. If the society changes enough around you, perhaps being a farmer might look more pleasing.</p>",
        "id": 533518531,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754682751
    },
    {
        "content": "<p>Maybe, if I ever feel that way I hope it comes from a place of honest curiosity rather than desperation.</p>",
        "id": 533518776,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754682887
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/533517457\">said</a>:</p>\n<blockquote>\n<p>I want to say, if an old idea was actually good, then generally we don't stop using it…</p>\n</blockquote>\n<p>I don’t think this is true very broadly at all. It’s probably at least modestly correlated to the truth that better old ideas are less likely to die out than worse ones. But all kinds of new fashions break down Chesterton’s fences all the time, and it can take a long time or forever to notice the problem.</p>",
        "id": 533527120,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1754686501
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/533501243\">said</a>:</p>\n<blockquote>\n<p>I think the question of \"should one give up on the fallen world\" is bigger and older than Grothendieck. I don't particularly see his decision to do so as that particular to him over any number of other such hermits over the millennia.</p>\n</blockquote>\n<p>Ultimately, Grothendieck did act on his beliefs to abandon our industrial society and go off to live his own life elsewhere. </p>\n<p>I see a lot of others in our society say that e.g. humans should be reducing their carbon footprint, but they never end up taking steps in their own lives to do so.</p>",
        "id": 533530816,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1754688237
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/533527120\">said</a>:</p>\n<blockquote>\n<p>... all kinds of new fashions break down Chesterton’s fences all the time, and it can take a long time or forever to notice the problem.</p>\n</blockquote>\n<p>The point your saying makes sense to me, so if it's important to us to rebuild a Chesterson's fence how should we go about it?</p>\n<p><em>This ended up with me thinking through my thoughts on this and ending somewhere that I think is consistent with your advice to engage with the community, so you don't need to read it if you aren't interested</em></p>\n<p>When I try this, I almost always take a historical perspective.</p>\n<p>Here's a specific example I've thought a bit about lately</p>\n<p>I think modern French curves are paths of certain linkages, because that's what their inventor Ludwig Burmester (1840 - 1927) studied.</p>\n<p>I'm suspicious these guides buried Durer's insight that it was helpful to classify general curves, by thinking of them as stitched up with segments of spirals. His book on drawing starts with a ton of spiral constructions (here's a beautiful example: <a href=\"https://archive.org/details/vnderweysungderm00drer/page/n12/mode/1up\">https://archive.org/details/vnderweysungderm00drer/page/n12/mode/1up</a>). I don't know how I would prove Durer had this motivation.</p>\n<p>But the french curves at least had the advantage that you didn't have to know how to draw first to use them.</p>\n<p>But now, a modern spline library Spiro, classifies a very interesting set of curves by thinking of them as segments of <em>clothoids</em>. And it relates this practice to the much older technique of using duck splines to place a strip of wood.</p>\n<p>I love this thesis (<a href=\"https://levien.com/phd/phd.html\">https://levien.com/phd/phd.html</a>) I'm suspicious it saved and reintroduced an old idea with a modern twist, that ultimately consolidated different curve making approaches, that ends up being practical in a modern setting in ways that couldn't be practical in the old world.</p>\n<p>I want much more of this, so I think about what went well with this. My argument that the chesterson fence was repaired has so many gaps, because I don't know how to rebuild the old mindsets that motivated the old solutions. I think a chesterson fence was fixed here, but I'm not sure how to tell XD. </p>\n<p>Historically folks would actually solve problems and pretend they were historical. In this framing it almost sounds like they thought they discovered a chesterson's fence, but really they actually moved their subject forward. How do I know I'm not similarly confused?</p>\n<p>I guess the suggested solution here was simply to engage with the thesis's solution earnestly if I think it's cool. As well as with historians who are interested in similar subjects.</p>\n<p>i.e. engage with the community.</p>",
        "id": 533531711,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754688875
    },
    {
        "content": "<p>Alright, I think I'm satisfied, thank you for taking the time to engage with my questions</p>",
        "id": 533533302,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1754690162
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/533518474\">said</a>:</p>\n<blockquote>\n<p>I don't really recall any evidence that Grothendieck ever farmed.  </p>\n</blockquote>\n<p>I got curious about this, and other things, and started reading this book, which is free online:</p>\n<ul>\n<li>Winfried Scharlau, <em><a href=\"https://webusers.imj-prg.fr/~leila.schneps/grothendieckcircle/Spirituality.html\">Who Is Alexandre Grothendieck? Anarchy, Mathematics, Spirituality, Solitude: Volume 3: Spirituality (1970-1991)</a></em>.</li>\n</ul>\n<p>Chapter 20 quotes Grothendieck as writing this at the end of 1985:</p>\n<blockquote>\n<p>As for me, I live a tranquil little life in the country, very retired, and cultivate a garden in the company of a little black cat. I see very few people, and I especially enjoy busying myself with my activities in solitude.</p>\n</blockquote>\n<p>So, he cultivated a garden at least.     From January 1985:</p>\n<blockquote>\n<p>For the last week there has been a very unusual cold wave - temperatures of -15 and lower, and when the wind blows off the Mont Ventoux (the name says it all! ) it gets even colder. It seems that this cold wave is raging more or less everywhere in the world (according to someone who has listened to the news), and that in the Midi this has not happened since the famous winter and spring of 1956. During my childhood in Germany I experienced cold snaps like this, but then there was also snow, which protected the earth and added a note of softness to the air and objects. In this frigid cold with no snow, the surface of the earth is frozen like a block of ice. The garden was ruined within a few days - I don't know if anything that I sowed and planted will remain when the spring arrives.</p>\n</blockquote>",
        "id": 533564593,
        "sender_full_name": "John Baez",
        "timestamp": 1754728643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <span class=\"user-mention\" data-user-id=\"565212\">@Alonso Perez-Lona</span>  I haven't released anything publicly about how the workshop went, but if anybody is considering doing anything similar, I would be happy to talk to them about it on a call so they can learn from my successes and failures.</p>\n<p>I still consider myself to be picking up the work left behind by Grothendieck, see my website and the ensuing discussion/conflagration <a class=\"message-link\" href=\"/#narrow/channel/229111-community.3A-general/topic/.E2.9C.94.20Freelance.20ACT/near/454384881\">#community: general &gt; ✔ Freelance ACT @ 💬</a>.</p>\n<p>Though I am not entirely clear what this thread is about, as it seems to be broken off from a large thread that would give context, it does seem that leaving the mainstream culture because it's destroying life on Earth is a big theme.  I think this is a great thing to do, and if you aspire to actually <em>make things better</em> rather than merely discontinuing your participation in <em>making things worse</em> (which btw is still praiseworthy), you'll want to do it with other people in a <strong>community which is centered around ascertaining how to go about making things better</strong>.</p>\n<p>\"Let Me Think\" was my attempt to try out creating such a community myself.  Now I have joined such a community that others have created, called the <a href=\"https://www.monasticacademy.org/\">Monastic Academy for the Preservation of Life on Earth</a>.  I intend to go on living in such communities.</p>",
        "id": 534282950,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1755109945
    },
    {
        "content": "<p>The original thread was here:</p>\n<p><a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/532947191\">https://categorytheory.zulipchat.com/#narrow/stream/229134-theory.3A-philosophy/topic/Book.2Fcourse.20recommendations.20for.20managing.20.22Scientism.22.3F/near/532947191</a></p>\n<p>Maintaining a relationship with the mathematics community was suggested as a way to keep ones math ideas from getting too weird. I wanted to explore Grothendieck's relationship with the math community as a point of reference for understanding and contextualizing that advice. That discussion was split off into this thread.</p>",
        "id": 534284101,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1755110440
    },
    {
        "content": "<p>Nice to hear from you again, <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>.</p>",
        "id": 534313863,
        "sender_full_name": "John Baez",
        "timestamp": 1755124199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277352\">@Alex Kreitzberg</span> -  For most people, it is very dangerous to spend a long time working on mathematics without seeking confirmation of their ideas from the general community of mathematicians.</p>\n<p>However, I know don't anyone who argues (now) that Grothendieck's math ideas became too weird when he stopped communicating with experts on math.   His work on <em>dessins d'enfants</em> and his huge books <em>Pursuing Stacks</em>, <em>The Long March to Galois Theory</em>, and <em>Derivators</em> have become very important.   It's his other ideas that people say are too weird.  For example, his friend the great mathematician Pierre Cartier <a href=\"http://xahlee.info/math/i/Alexander_Grothendieck_cartier.pdf\">wrote</a>, while Grothendieck was still alive:</p>\n<blockquote>\n<p>The most worrisome symptom is his obsession with the Devil. According to his most recent visitors, he, who never theologized his religion, has plunged into the writing of a sermon on the Devil’s action in our world (he always was obsessional about writing!) His “catastrophism” is by no means new, and his concerns about the terrors of global nuclear war and pollution came at the right time in the 1970’s. More recently, there was the incident mentioned earlier where, like Paco Rabanne, he received a revelation of the date of the end of the world, and he made it quite clear that it was going to be the end of “everything”, not just our little Earth. Out of charity, he communicated this date to 200 or 300 people drawn from his list of scientific correspondents, and exhorted them to repentance before the final explosion, for afterwards, there would remain but a few chosen. That letter, which received no response, was followed by a gloomy retraction after the fatidic date.</p>\n</blockquote>",
        "id": 534314195,
        "sender_full_name": "John Baez",
        "timestamp": 1755124393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Grothendieck.20and.20community/near/534282950\">said</a>:</p>\n<blockquote>\n<p>I still consider myself to be picking up the work left behind by Grothendieck, see my website and the ensuing discussion/conflagration <a href=\"#narrow/channel/229111-community.3A-general/topic/.E2.9C.94.20Freelance.20ACT/near/454384881\">#community: general &gt; ✔ Freelance ACT @ 💬</a>.</p>\n</blockquote>\n<p>Wow that was quite the read!</p>",
        "id": 534508616,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755185841
    }
]