[
    {
        "content": "<p>The people on this Zulip make for a very interesting population. I'm wondering whether we could benefit from this population and platform to get some interesting information about some human science kind of questions. Maybe we could we go as far as publishing some human science paper(s) out of insights got through Zulip someday, who knows. (In this case, it could be fun to make a paper with a very large list of authors, basically all the people who want to participate. I don't think it is the usual way of doing human science research to mix the people who ask the questions and the one who answer but maybe it is possible to do something like this. But I think some people on YouTube published some papers with the whole list of participants gathered from the net as coauthors. I'm not sure.). As far as I understand human science studies (at least psychology and sociology I guess) consist in asking questions to people and then analyze what they said, but I clearly don't have a precise knowledge of methodologies in these fields. I just want to experiment a bit and discuss informally in this topic. What could you say about some questions below? What would be other interesting (or more interesting) questions to ask?</p>\n<p>Don't hesitate to  say if a single question seems much more interesting than the other ones. <strong>Also there are questions for all types of people.</strong> Some should be easier to answer for people who are not in academia or who are in academia (in this case, who are undergrad/grad student, postdoc, professors etc...). For some questions it would be interesting to have diverging opinions from different kind of people. You don't have to mention what is your background and what you're doing in life but you can say it you feel it will be a useful piece of information.</p>\n<p>Some questions I have in mind:</p>\n<ul>\n<li>Is to possible to get a good understanding of category theory with the help of people from Zulip rather than trough a traditional academic curriculum?</li>\n<li>Can we start learning category theory before learning any university level math?</li>\n<li>Did this Zulip helped some people in a way which would have been difficult to achieve through other media? </li>\n<li>Is it fair to say that category theory have been badly seen my most math scholars during decades? (For this question, it would be fair to have opinions from all kind of math people but it is still interesting to see what category theory people have to say.)</li>\n<li>Do people in math often have a  strong opinion about what kind of topic is interesting or not? And is it more pronounced than in other disciplines? Can we say that younger people are more open minded? </li>\n<li>Is the process of selecting people in academia really fair, in particular selections for positions which will provide money? (e.g. master/phd/postdoc/assistant professor etc...) What I mean more precisely is this: Do some people feel that they haven't been selected at some point and that it was unfair? Also: are people who work hard too much favoured compared to more lazy people even if these latter people could achieve more interesting result on the long term?</li>\n<li>Do people would like to see more extensive research level discussions which can lead to real new work? In particular I'm thinking about the discussions about 2-rigs stuff which have been happening here. Is it inspiring to see such discussions? Do people don't talk about their research ideas extensively because they fear that their ideas will be stole? Wouldn't be more efficient to talk about them anyway without any fear to advance their research projects?</li>\n<li>Do some people felt offended some time on this Zulip? For instance if they ask question and nobody replies?</li>\n</ul>\n<p>I'm curious to see what people are going to say! (Hopefully, I will not talk alone ahah.) I had some trouble thinking about how to write this message correctly but let's go as it is now! (I'll try not to edit it 10 times ahah).</p>",
        "id": 482882515,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731866158
    },
    {
        "content": "<blockquote>\n<p>Can we start learning category theory before learning any university level math?</p>\n</blockquote>\n<p>I believe there are a few people who played around in Haskell in their free time while they were still in secondary school and started learning category theory because category theory appears in some of the discussions in the Haskell community.</p>",
        "id": 482887349,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731869921
    },
    {
        "content": "<p>All your questions are very interesting to me, <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span>.  I feel that if you start a thread by asking <em>the first</em> of these questions, people might have a good discussion about it.  Then you could start another thread asking <em>the second</em> of these questions, and so on.  It's hard to discuss 8 questions at once.</p>\n<p>Since Madeleine has began discussing question 2, maybe we should talk about that one first.</p>\n<p>It's possible that some people who'd be interested in these questions won't see them because have the stream <a class=\"stream\" data-stream-id=\"229134\" href=\"/#narrow/channel/229134-theory.3A-philosophy\">#theory: philosophy</a> muted. I think some people aren't interested in \"philosophy\" but would be interested in your questions.</p>",
        "id": 482887467,
        "sender_full_name": "John Baez",
        "timestamp": 1731870003
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482887467\">said</a>:</p>\n<blockquote>\n<p>All your questions are very interesting to me, <span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span>.  I feel that if you start a thread by asking <em>the first</em> of these questions, people might have a good discussion about it.  Then you could start another thread asking <em>the second</em> of these questions, and so on.  It's hard to discuss 8 questions at once.</p>\n<p>Since Madeleine has began discussing question 2, maybe we should talk about that one first.</p>\n</blockquote>\n<p>You may be right. I thought to that after posting the message also. But I didn't know precisely what I wanted to ask first.</p>",
        "id": 482887653,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731870149
    },
    {
        "content": "<p>If a category theorist doesn't know what to say, they say the set of all possible things to say.</p>",
        "id": 482887699,
        "sender_full_name": "John Baez",
        "timestamp": 1731870192
    },
    {
        "content": "<p>Ok, so let's discuss \"Can we start learning category theory before learning any university level math?\" (thanks <span class=\"user-mention\" data-user-id=\"671813\">@Madeleine Birchfield</span> for your message)</p>",
        "id": 482887816,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731870298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482887467\">said</a>:</p>\n<blockquote>\n<p>All your questions are very interesting to me, <span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span>.  I feel that if you start a thread by asking <em>the first</em> of these questions, people might have a good discussion about it.  Then you could start another thread asking <em>the second</em> of these questions, and so on.  It's hard to discuss 8 questions at once.</p>\n<p>Since Madeleine has began discussing question 2, maybe we should talk about that one first.</p>\n<p>It's possible that some people who'd be interested in these questions won't see them because have the stream <a class=\"stream\" data-stream-id=\"229134\" href=\"/#narrow/channel/229134-theory.3A-philosophy\">#theory: philosophy</a> muted. I think some people aren't interested in \"philosophy\" but would be interested in your questions.</p>\n</blockquote>\n<p>Maybe we should move the thread to meta: meta, or meta: off-topic. Or community: general?</p>",
        "id": 482887945,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731870383
    },
    {
        "content": "<p>I think this zulip is amazing, and that it is useful to a variety of people in a variety of ways. I can talk a bit about how my experience has been:</p>\n<ul>\n<li>For a long time (since elementary school), I've wanted to learn more math than my teachers were telling me about. So I tried to learn more math on my own, which was difficult. I've learned a lot of math from this zulip, and I've also learned how to learn math more effectively from this zulip!</li>\n<li>If my health was good, I would strongly consider taking at least some math classes or possibly try to work towards an MSc in math. Since it is not good, it is incredible that I can have high-quality math discussions here, on a flexible schedule that can accommodate my health.</li>\n</ul>\n<p>As to your more specific questions:</p>\n<ul>\n<li>I suspect it is possible to get a good understanding of category theory with the help of this zulip, rather than through a traditional academic curriculum. However, at least for me, I think it would take a very long time, and I feel nowhere near having a \"good understanding\" yet.</li>\n<li>Yes, I think one can start learning category theory before \"university level math\". I started learning some at a time while the only university level math I had taken was calculus, and I didn't feel that my experience with calculus was that helpful. In my opinion, some ideas from category theory are simpler than ideas that we learn in middle school.</li>\n<li>This zulip has helped me a lot in a way that would have been difficult to achieve otherwise. It's been a wonderful way to learn and explore that is compatible with my poor health.</li>\n<li>I do think it would be really cool if I could get involved in research-level work through this zulip. I do think it is inspiring and educational to see research level discussions, even if I can't understand them hardly at all.</li>\n<li>I have a lot of half-baked questions  and ideas that I haven't asked about here. But that's not because I fear getting a poor response, but rather because I'm not convinced it would be efficient use of my limited energy.</li>\n</ul>",
        "id": 482887960,
        "sender_full_name": "David Egolf",
        "timestamp": 1731870396
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482887349\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Can we start learning category theory before learning any university level math?</p>\n</blockquote>\n<p>I believe there are a few people who played around in Haskell in their free time while they were still in secondary school and started learning category theory because category theory appears in some of the discussions in the Haskell community.</p>\n</blockquote>\n<p>More generally, if category theory ends up being used in some real world application / domain, then people working in that domain will end up learning some category theory, even if they otherwise have no experience in other university mathematics.</p>",
        "id": 482888114,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731870532
    },
    {
        "content": "<p>I also would count people who took the physics / engineering / sciences track of probability and statistics + calculus + applied linear algebra (i.e. matrix algorithms) as not having taken \"university mathematics\" since the contents in those classes are significantly different from those one would find in a typical university mathematics track - they consist of mostly a collection of algorithms to solve various equations, rather than theorems about mathematical objects and proofs of such mathematical theorems.</p>",
        "id": 482888389,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731870787
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482888389\">said</a>:</p>\n<blockquote>\n<p>I also would count people who took the physics / engineering / sciences track of probability and statistics + calculus + applied linear algebra (i.e. matrix algorithms) as not having taken \"university mathematics\" since the contents in those classes are significantly different from those one would find in a typical university mathematics track - they consist of mostly a collection of algorithms to solve various equations, rather than theorems about mathematical objects and proofs of such mathematical theorems.</p>\n</blockquote>\n<p>I don't think I ever took a class that aimed to teach me how to prove things... although I took as an elective (I did engineering) an introductory number theory class, which assigned some homework problems involving some proofs. Somewhat unhelpfully, that homework was never graded so I never got back much feedabck from that class as to whether I knew how to write proofs <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> . Getting feedback on proofs (or proof attempts) here on this zulip has been hugely helpful.</p>",
        "id": 482888776,
        "sender_full_name": "David Egolf",
        "timestamp": 1731871110
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482887960\">said</a>:</p>\n<blockquote>\n<ul>\n<li>I suspect it is possible to get a good understanding of category theory with the help of this zulip, rather than through a traditional academic curriculum. However, at least for me, I think it would take a very long time, and I feel nowhere near having a \"good understanding\" yet.</li>\n</ul>\n</blockquote>\n<p>I'm not sure that's a limitation of this Zulip.   One's speed of progress learning category theory may be roughly proportional to how many hours per week one spends talking to experts about it, reading about it, and solving problems.   Due to your health issues you are limited in how many hours a week you can spend.  But you seem to make very quick progress when you're actually working on category theory.    </p>\n<p>One of the great features of a traditional math undergrad or grad program is simply that it can give people a good reason to spend most of their time talking about and working on math.  I'm not sure how many hours, actually - it obviously varies.  But people who are serious can spend most of their time focusing on it.</p>",
        "id": 482888795,
        "sender_full_name": "John Baez",
        "timestamp": 1731871143
    },
    {
        "content": "<p>From what has been said up to now, it seems to me that it is clear that Zulip help people to learn category theory  or to do research in math. The interesting points are probably how Zulip is different from everything else and what new it provides. That's what I would like to write about if I was a sociology student trying to find something to write about! In particular, we should think about how Zulip is different from math overflow, math stack exchange, quora, reddit etc...</p>",
        "id": 482889014,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871329
    },
    {
        "content": "<p>Observation: I think this is the only platform where there are very long discussions + LaTeX?</p>",
        "id": 482889082,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871412
    },
    {
        "content": "<p>I don't actually really.use the category theory Zulip for asking questions about category theory. I mostly have treated the Zulip as a general forum for university mathematics that I can ask questions about topology or analysis or algebra or logic or whatever. </p>\n<p>So I guess I would fall into the \"Zulip for research in maths\" category.</p>",
        "id": 482889087,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731871419
    },
    {
        "content": "<p>Ok, that's very interesting. It means that this is maybe not so much the category theory name of this Zulip which makes it special but maybe rather the category theory or whatever people on it</p>",
        "id": 482889174,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871475
    },
    {
        "content": "<p>Maybe, everything  started from <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> blogging dozen of years ago ahah</p>",
        "id": 482889289,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871585
    },
    {
        "content": "<p>If I understand, from the beginning you wanted to talk to everybody about math (I'm thinking to the \"evaluate your math research project stuff\")</p>",
        "id": 482889309,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871621
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482889174\">said</a>:</p>\n<blockquote>\n<p>Ok, that's very interesting. It means that this is maybe not so much the category theory name of this Zulip which makes it special but maybe rather the category theory or whatever people on it</p>\n</blockquote>\n<p>There are a lot of people on here who have gone through the gauntlet of undergraduate and graduate university mathematics in order to get to category theory, and thus have a wide breadth of knowledge of many other subfields of mathematics.</p>",
        "id": 482889363,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731871681
    },
    {
        "content": "<p>Very good point.</p>",
        "id": 482889429,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871718
    },
    {
        "content": "<p>So category theory and this Zulip are about everything (in math) and for everybody from anywhere ahah</p>",
        "id": 482889596,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871869
    },
    {
        "content": "<p>(Reminds me of a recent movie I liked <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> )</p>",
        "id": 482889631,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731871912
    },
    {
        "content": "<p>I would love if we succeeded to write collectively an academic paper proving that such a Zulip is good for education and research. That it helps a lot of people in different ways. I hope that it would help math and other disciplines to get better and better on the internet by maybe making some people change their opinion (in particular scholars) about this kind of media. That would be great if in 50 years some people will have learned everything on the internet and amazing research will have been done on the internet, with all the discussions taking place publicly from the beginning.</p>\n<p>Imagined such a paper existed. What would be a good title?</p>",
        "id": 482890340,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731872573
    },
    {
        "content": "<p>(I'm thinking about trying to get in touch with sociology (or whatever discipline it should be) grad students or prof for instance in my university and ask them if they could help. In particular with how a paper in their field must be written, how research must be done officially etc...)</p>",
        "id": 482890370,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731872622
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482882515\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Do some people felt offended some time on this Zulip? For instance if they ask question and nobody replies?</li>\n</ul>\n</blockquote>\n<p>Some discussions have devolved into politics on this server from time to time and those end up inevitably causing some people to feel offended.</p>",
        "id": 482890724,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731872925
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482882515\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Can we start learning category theory before learning any university level math?</li>\n</ul>\n</blockquote>\n<p>Lawvere and Schanuel's \"Conceptual Mathematics: A First Introduction to Categories\" was explicitly written for a high-school audience -- or earlier even! The tradeoff is that it is forced mainly to work with very \"Setlike\" things as examples of categories, or just in <code>Set</code> itself, since students would not yet be familiar with more exotic structures.</p>",
        "id": 482890778,
        "sender_full_name": "Gershom",
        "timestamp": 1731872981
    },
    {
        "content": "<p>But we could also start with a programming point of view today maybe. Therefore people with some acquaintance of sets and functions <strong>or</strong> programming can get into category theory.</p>",
        "id": 482891092,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731873235
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482890778\">said</a>:</p>\n<blockquote>\n<p>Lawvere and Schanuel's \"Conceptual Mathematics: A First Introduction to Categories\" was explicitly written for a high-school audience -- or earlier even! The tradeoff is that it is forced mainly to work with very \"Setlike\" things as examples of categories, or just in <code>Set</code> itself, since students would not yet be familiar with more exotic structures.</p>\n</blockquote>\n<p>That's kind of how I personally got started with category theory, it was literally just learning category theory so I know what properties the category of sets has, and how different kinds of categories correspond to the categories of sets in various foundations. Though I did that through the nLab, rather than through any textbooks.</p>",
        "id": 482891171,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731873262
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482891092\">said</a>:</p>\n<blockquote>\n<p>But we could also start with a programming point of view today maybe. Therefore people with some acquaintance of sets and functions <strong>or</strong> programming can get into category theory.</p>\n</blockquote>\n<p>I forgot to say that you could also start with quantum physics. At least this is almost what Bob Coecke tried (even if he doesn't mention category theory a lot in his books).</p>",
        "id": 482891361,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731873418
    },
    {
        "content": "<p>Category theory sounds like somewhat unique as a field of mathematics! Since it is useful for very advanced question but it also accessible from a variety of backgrounds which can be quite minimal.</p>",
        "id": 482891526,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731873556
    },
    {
        "content": "<p>I think it would be amazing if many more academic disciplines had a zulip like this one. (I know I've wished that a medical imaging zulip existed! If it does exist, I don't know about it). So I'm all for advertising the positives of creating a community like this one.</p>",
        "id": 482891527,
        "sender_full_name": "David Egolf",
        "timestamp": 1731873557
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482891361\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482891092\">said</a>:</p>\n<blockquote>\n<p>But we could also start with a programming point of view today maybe. Therefore people with some acquaintance of sets and functions <strong>or</strong> programming can get into category theory.</p>\n</blockquote>\n<p>I forgot to say that you could also start with quantum physics. At least this is almost what Bob Coecke tried (even if he doesn't mention category theory a lot in his books).</p>\n</blockquote>\n<p>Not even quantum physics. Lawvere helped developed category theory in order to formulate classical continuum mechanics in some rigourous foundations, see i.e.</p>\n<ul>\n<li>\n<p><a href=\"https://ncatlab.org/nlab/files/Lawvere-ToposesOfLawsOfMotion.pdf\">Toposes of Laws of Motion</a></p>\n</li>\n<li>\n<p><a href=\"https://dmitripavlov.org/scans/kock.pdf\">Categorical Dynamics</a></p>\n</li>\n</ul>",
        "id": 482891554,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731873588
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482891527\">said</a>:</p>\n<blockquote>\n<p>I think it would be amazing if many more academic disciplines had a zulip like this one. (I know I've wished that a medical imaging zulip existed! If it does exist, I don't know about it). So I'm all for advertising the positives of creating a community like this one.</p>\n</blockquote>\n<p>Back 20 years ago, people would have set up dedicated online forums for whatever topic or hobby or academic discipline or whatever. However, starting around 2009 or something like that, everybody decided to abandon forums for social media platforms like Facebook and Twitter, and our society hasn't really recovered from that yet.</p>",
        "id": 482891723,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731873701
    },
    {
        "content": "<p>I have some exam to prepare and some assignments to work on ahah (the \"annoying\" stuff you must do at the beginning of a phd <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> ). So I will not talk here for a few hours I think!</p>",
        "id": 482891800,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731873748
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"705200\">@Federica Pasqualone</span> I think you might be interested in this discussion as well.</p>",
        "id": 482892040,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731873945
    },
    {
        "content": "<ul>\n<li>Is to possible to get a good understanding of category theory with the help of people from Zulip rather than through a traditional academic curriculum?</li>\n</ul>\n<p>In my opinion, it is.</p>\n<p>Maybe due to life experiences, maybe something innate to my psychology, I have often had an “anti-academic” bent. I think sometimes young people are rushed into college with a lot of pressure on them from society, and it can lead to some depression. It can be healthy and beneficial to not go into academia until you have a clear personal reason for why. I often did not like “signing up for classes” arbitrarily. I would rather try to pursue a goal, even if that’s just “earning income”, and through that process, possibly discover why getting guidance or certification from an academic institution actually lends itself towards that goal. </p>\n<p>Being in this group for 18 months has really impacted my mind. I feel like my mind has rewired itself. I sat in on some machine learning lectures at a local university, and I suddenly felt “mathematically literate”. It is so easy to follow a math lecture if you feel intuitively comfortable with concepts like functions, sets, limits, the real numbers, etc. </p>\n<p>Being in this group made me want to take a set theory class at a university because now that topic has so many connections to things I’ve been learning about that I imagine I would cling to every sentence. But if someone just sits you down and starts telling you about set theory without all that motivation, I can imagine it would feel aimless.</p>\n<ul>\n<li>Can we start learning category theory before learning any university level math?</li>\n</ul>\n<p>I personally think so. I think Lawvere’s books did a good job introducing this topic to people with very few prerequisites. I’ve always been a believer in Feynman’s claim that “if you can’t explain it to a five year old, you don’t understand it well enough.” Terence Tao also recommends “asking dumb questions”, which I really agree with. I think it would benefit category theory itself if people worked on presenting it in a simple enough way for anyone to start learning it. One time, I actually tried to explain the axioms of a category to my mom at a restaurant.</p>\n<ul>\n<li>Did this Zulip help some people in a way which would have been difficult to achieve through other media? </li>\n</ul>\n<p>I am recurrently blocked from asking questions on Math Stack Exchange. They don’t like my questions. There isn’t any other good forum where you can talk to people who actually know what they’re talking about than this Zulip. Math is already an esoteric enough of a subject, but even within math, category theory is its own niche. I can’t imagine how a person like me would be able to connect to an entire community of experts without the internet and a group like this. It’s interesting that experts in general seem to like that there are people who are interested in what they do, and are actually happy to share their knowledge. They love this subject enough to have devoted their life to it; naturally they can empathize with other people who have the same yearning. </p>\n<ul>\n<li>Is it fair to say that category theory have been badly seen by most math scholars during decades? (For this question, it would be fair to have opinions from all kind of math people but it is still interesting to see what category theory people have to say.)</li>\n</ul>\n<p>I don’t know, but it’s been really interesting getting exposure to math through this group, because category theory, as a nexus of quite a few different mathematical disciplines, may also have its own particular “mathematical culture”. For example, it feels like there is zero compromise on rigor, amongst category theorists. In my machine learning class, it was interesting to see how the theory as presented kind of skirts around or avoids certain questions, like generalizing to infinite sets. Category theorists would never “not care” about questions of definition, proof or justification. I also talked to a professor of math working on some AI stuff, and he similarly did not seem that interested in category theory, like it’s pointlessly abstract. </p>\n<p>I don’t think people are hostile to category theory, but I almost feel like if you are mainly inside the category theory community, you may not be aware how different other mathematical communities are in terms of how they approach mathematics.</p>\n<ul>\n<li>Do people in math often have a strong opinion about what kind of topic is interesting or not?</li>\n</ul>\n<p>I feel that way. In the beginning of my foray into these topics, if any mathematician told me my question didn’t make sense, or even “wasn’t about math”, I didn’t have a firm enough footing in my understanding to be able to disagree. Luckily, I have gotten a lot more exposure to logic, the foundations of math, and the philosophy of math, where now I feel like I can spot more easily where what someone is telling you is their personal viewpoint, not a ubiquitous/standard viewpoint in all of math. </p>\n<p>It’s interesting how math and philosophy seem utterly inextricable in my mind, yet many mathematicians don’t want to go into those philosophical details. This is a topic I can imagine writing a lot more about. But from my point of view, really important contributions to math were informed by philosophical analysis. For example, Per Martin-Löf developed intuitionistic type theory, I believe, through some heavy reflections on Kantian notions of “judgment”.</p>\n<ul>\n<li>Is it more pronounced than in other disciplines?</li>\n</ul>\n<p>I don’t know, I hadn’t thought about that.</p>\n<ul>\n<li>Can we say that younger people are more open minded? </li>\n</ul>\n<p>Yes, but I find this to be true universally, across all fields of knowledge. </p>\n<p>AI has been a good example. A lot of older people are heavily critical of it. I have often felt that their objections are accurate but besides the point, because they misunderstand how younger people actually use AI. That’s also a topic which could use some elaborating. </p>\n<ul>\n<li>Is the process of selecting people in academia really fair, in particular selections for positions which will provide money? (e.g. master/phd/postdoc/assistant professor etc...) What I mean more precisely is this: Do some people feel that they haven't been selected at some point and that it was unfair?</li>\n</ul>\n<p>I don’t know. From my perspective, it seems like there are loads of opportunities to do PhDs and postdocs in this field. I would do one if I had the qualifications. Compared to other academic fields, I feel like this one is thriving in terms of funding opportunities. </p>\n<ul>\n<li>Are people who work hard too much favoured compared to more lazy people even if these latter people could achieve more interesting result on the long term?</li>\n</ul>\n<p>I have no idea, but personally, I think if you’re getting paid money, it’s basically a job, so I don’t think I would give money to someone who seemed “lazy”, but it really depends what you mean by “lazy”. If someone is motivated to learn and theorize and teach and share and collaborate, I would definitely give them money. If someone doesn’t seem that interested, I wouldn’t.</p>\n<ul>\n<li>Would people like to see more extensive research level discussions which can lead to real new work? In particular I'm thinking about the discussions about 2-rigs stuff which have been happening here. Is it inspiring to see such discussions? Do people not talk about their research ideas extensively because they fear that their ideas will be stole? Wouldn't it be more efficient to talk about them anyway without any fear to advance their research projects?</li>\n</ul>\n<p>I don’t know. I for the most part feel like there isn’t a lot of egotism in this community, which is refreshing. I feel like people are very collaborative and open, in spirit; and very, very humble. I think overall it’s a very healthy community, socially.</p>\n<ul>\n<li>Do some people felt offended some time on this Zulip? For instance if they ask question and nobody replies?</li>\n</ul>\n<p>Absolutely, but that’s just because of a fragile ego. Getting an affirming comment is like a wave of relief, not getting a response makes me worry. I think it’s a sign that one cares a lot about something that their emotional reactions get amplified in both a positive and negative direction.</p>",
        "id": 482892560,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1731874334
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482892040\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"705200\">Federica Pasqualone</span> I think you might be interested in this discussion as well.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"671813\">@Madeleine Birchfield</span>  Here I am ... what happened? :) Hallo Leuteeee !</p>",
        "id": 482893156,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731874822
    },
    {
        "content": "<p>Lemme read carefully ...</p>",
        "id": 482893205,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731874884
    },
    {
        "content": "<p>Ok, <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span>  posed a number of very interesting questions, and I agree with <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <br>\nthat they deserve one thread per each.<br>\nWell, as far as category theory is concerned I think it is not part of a standard \"mathematical curriculum\" - meaning you can survive without it- as topos theory is not. The question is that this technology is like the Internet compared to the telegraph .. you see what I mean?</p>",
        "id": 482894075,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731875610
    },
    {
        "content": "<p>I've been a middle school math teacher for about seven years now (though I quit this year), and I've thought very occasionally about \"what would category theory for middle school students\" look like.</p>\n<p>First, it is absolutely possible to teach proofs, I've seen very good curriculums teaching combinatorial style problem solving and geometry to very young students. That's one reason why our math Olympiad culture is so strong, because this is possible.</p>\n<p>A very helpful heuristic towards this end, is making sure the assigned proofs can be explained by the student when having a conversation with the teacher. These should be real proofs! If you require they be able to write the proof down, far fewer kids can do it (the calculations and constructions can be written or drawn, but you need to be reasonable about what you're asking for)</p>\n<p>This generally forces the math to be pretty concrete, less detailed, and mentally intuitive. If this is done well, as the students mature, they naturally add the details and abstractions to their basic skills set, with their now exercised ability to give careful proofs.</p>\n<p>Category theory seems, to me, to be at a large disadvantage with respect to the above heuristic. If somebody thinks that's not true, I'd be curious to know why. You'd want to have categorical questions as mentally exciting as introductory \"Knights and Knaves\" puzzles.</p>\n<p>That said, even if Category Theory broadly is hard I'd be very surprised if there were no opportunities to introduce categorical thinking in primary school.</p>\n<p>The formula <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>d</mi><mo>=</mo><mi>r</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">d = rt</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">d</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6151em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span><span class=\"mord mathnormal\">t</span></span></span></span>, is repeated over and over again at every level. Although a full calculus curriculum isn't being taught in middle school, students are still getting used to calculus.</p>\n<p>I'll occasionally see a professor lean hard on a diagrammatic argument to prove a point, making sure to stick to the ideas of the basic material. Because diagrams, string diagrams, and other topological constructions are so important, they seem like a very important visual resource to exploit when trying to get kids excited.</p>\n<p>If you could organize material around diagrams like this, and somehow convey that using them is doing \"real math\", while making sure not to drop the key categorical lessons - I think that could help a student learn more sophisticated categorical thinking later on. But remember, whatever you come up with here is competing for time with basic geometry and basic algebra. I sometimes think discrete math is only occasionally covered because Olympiads include it in their competitions.</p>\n<p>Ultimately you'll have to convince parents this is a good idea, and teachers that this is worth learning to teach, so they can teach it well.</p>",
        "id": 482894185,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731875695
    },
    {
        "content": "<p>and well,  I am in favour of deductive reasoning .. but to teach category theory without the possibility to attach the concepts to some elementary example? I don't know. I guess in elementary school each one gets familiar with sets and functions, at least I did. So if a baby has the image of a collection of flowers and can reason about cardinalities and counting stars .. I think they can also grasp category theory! :)</p>",
        "id": 482894494,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731875957
    },
    {
        "content": "<p>Yeah, my feeling is the body of the curriculum maybe shouldn't be changed, but because category theory is so abstract there should be opportunities to think about the usual material in a way informed by category theory.</p>\n<p>If you can do that, you probably then only have to get the teachers on board, but that's still a challenge on its own.</p>",
        "id": 482894778,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731876168
    },
    {
        "content": "<p>On the other hand it is like giving them a Porsche to drive without driving license and experience on the road, extremely dangerous ...</p>",
        "id": 482894810,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731876199
    },
    {
        "content": "<p>I'm sort of assuming colleges will start teaching category theory to more undergrads, many of which will become teachers. And then you'll see teachers experiment with introducing category theory into classrooms. </p>\n<p>This process might take longer than some people would like, but I think it'll happen organically (provided our education systems are supported)</p>",
        "id": 482895027,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731876374
    },
    {
        "content": "<p>In the context of school mathematics before university, introducing categorical thinking would probably just end up being either teaching basic set theory using some naive ETCS approach, or categorical thinking in combinatorics (aka finite set theory), or both. </p>\n<p>It's hard to see a categorical approach to the basic real analysis / school algebra taught at that level of schooling which doesn't inevitably go far beyond the requirements of the curricula.</p>",
        "id": 482895314,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731876647
    },
    {
        "content": "<p>There is also a big difference between individual students being interested in learning category theory and studying it on their own time, vs category theory being taught as part of the curriculum.</p>\n<p>The latter is a big no to me; there are far more important subjects in mathematics for the vast majority of students to learn than category theory.</p>\n<p>But the former is easily achievable by interested students in secondary school.</p>",
        "id": 482895371,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731876717
    },
    {
        "content": "<p>On the general topic of reflecting on my experience on the zulip, there are two more positives that come to mind:</p>\n<ol>\n<li>since posts are archived and searchable, I can easily browse my old conversations; this has saved me more than once from re-posting the same question</li>\n<li>since posts are archived and searchable, I like to hope that other people might come along and learn something from them in the future; this feels like it encourages me to have high-quality conversations</li>\n</ol>",
        "id": 482895420,
        "sender_full_name": "David Egolf",
        "timestamp": 1731876740
    },
    {
        "content": "<p>But the point is to what extend can they be teaching category theory? What a category is, maybe some intuition about inductive and projective systems, i.e. geometrical ideas of approximations, graphs ... but this is not what category theory is for ..</p>",
        "id": 482895480,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731876817
    },
    {
        "content": "<p>I mean, it is not a comprehensive introduction to Linux, it is like you see just the graphical interface and you know how to play around with it .. but no bash at all. It's underpowered ...</p>",
        "id": 482895533,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731876847
    },
    {
        "content": "<p>I'm curious as to what the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>d</mi><mo>=</mo><mi>r</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">d = rt</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">d</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6151em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span><span class=\"mord mathnormal\">t</span></span></span></span> of category theory is XD. You can torture a student for years with questions involving just <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>d</mi><mo>=</mo><mi>r</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">d = rt</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">d</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6151em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span><span class=\"mord mathnormal\">t</span></span></span></span>. It'd be useful to know the equivalent for category theory, regardless of whether one actually commits to teaching it in primary school.</p>",
        "id": 482896134,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731877387
    },
    {
        "content": "<p>distance = rate <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>×</mo></mrow><annotation encoding=\"application/x-tex\">\\times</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord\">×</span></span></span></span> time is very useful; I doubt there's anything as simple <em>and simultaneously as useful</em> in category theory.  </p>\n<p>Digressing quite a lot, I can't resist mentioning that I recently wrote <a href=\"https://johncarlosbaez.wordpress.com/2024/11/07/the-mean-speed-theorem/\">an article</a> where I explained:</p>\n<p>Aristotle knew distance = rate <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>×</mo></mrow><annotation encoding=\"application/x-tex\">\\times</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord\">×</span></span></span></span> time, and used this to define \"rate\", or \"velocity\", which is really the <em>average</em> velocity over the time interval in question, but only around the early 1300s did a group of philosophers called the Oxford Calculators invent a concept of <em>instantaneous</em> velocity.  They figured out how far an object moves if its velocity changes at a constant rate, and they called this the Mean Speed Theorem.    This was considerably before calculus, and I believe it laid some of the groundwork for calculus.</p>",
        "id": 482896555,
        "sender_full_name": "John Baez",
        "timestamp": 1731877769
    },
    {
        "content": "<p>Trying to save the conversation, I could say that <em>group theory</em> played a similar role as a warmup for category theory.   Group theory has been incredibly powerful in Galois theory since the late 1800s, and since the 1930s in quantum chemistry and many branches of physics.   Undergrad math majors take group theory.  Sadly, its applications to chemistry and physics aren't usually discussed.    But I think those applications convinced a lot of scientists that group theory is really important.</p>\n<p>So perhaps if applied category theory does something that most scientists consider important, it will help category theory get into the undergraduate math curriculum, as a course kids can take.  It will probably take much longer for it to become more than just one course, affecting the whole curriculum in the way some young dreamers hope it will.</p>",
        "id": 482897039,
        "sender_full_name": "John Baez",
        "timestamp": 1731878174
    },
    {
        "content": "<p>That's a good point, maybe one can have as prerequisites group theory and linear algebra and build category theory I on top of them?</p>",
        "id": 482897368,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731878497
    },
    {
        "content": "<p>Most people will prefer a course that <em>does something</em> with category theory to a course where the instructor merely says \"here is category theory: everything you learn after this will be clearer now - at least if it's explained using category theory\".    </p>\n<p>With group theory and linear algebra you can start doing something with category theory - though you have to decide what.   Its uses become extremely evident by the time you hit algebraic topology, since that begins roughly as the study of functors from Top to Grp.</p>\n<p>In a completely separate direction, I can imagine a course on category theory for computer science students.</p>",
        "id": 482897626,
        "sender_full_name": "John Baez",
        "timestamp": 1731878716
    },
    {
        "content": "<p>Mmh and I guess another factor to ponder is in which country this is to be implemented ...</p>",
        "id": 482897753,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731878822
    },
    {
        "content": "<p>I have, rarely, seen group theoretical ideas in (advanced) middle school settings. So if Baez thinks that's the natural prep subject, then yeah, there is some movement. And the amount of representation in school right now is probably fair.</p>",
        "id": 482897778,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731878838
    },
    {
        "content": "<p>It's hard to ask somebody to learn something they aren't obviously going to need (to reiterate Madeleine's point)</p>",
        "id": 482897862,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731878894
    },
    {
        "content": "<p>I feel like the need depends on the audience. John is right in saying if they know they are going to use it to facilitate solutions in (let's say) physics .. I would rather learn it. In circle, you have to get them to see it is indeed the  5G tech they need.</p>",
        "id": 482898070,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879078
    },
    {
        "content": "<p>Otherwise they can jump in and say, why don't we learn renormalization theory then?</p>",
        "id": 482898103,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879115
    },
    {
        "content": "<p>I taught at a math circle as well! It was very rewarding.</p>",
        "id": 482898222,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731879200
    },
    {
        "content": "<p>Idk I am trying to figure out a subject specific implementation to start with ... this is how you do it for distributions <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 482898338,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879283
    },
    {
        "content": "<p>This is why I think ultimately category theory wouldn't be taught as simply a random course on category theory or even applied category theory. You would have separate courses in each department, such as \"category theory for computer science\", \"category theory for economics\", \"category theory for systems science\", \"category theory for mechanical engineering\", etc, where each class would have specific examples of how category theory applies to their domain.</p>",
        "id": 482898343,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731879288
    },
    {
        "content": "<p>For mathematics, this would mean how category theory applies to other branches of mathematics, i.e. group theory or algebraic topology or combinatorics or differential geometry, etc...</p>",
        "id": 482898474,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731879386
    },
    {
        "content": "<p>Yep, it is like when you have to choose between CentOS and Ubuntu LTS</p>",
        "id": 482898532,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879458
    },
    {
        "content": "<p>Maybe CT should come in distributions as well, with books already packed ahead ..</p>",
        "id": 482898587,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879496
    },
    {
        "content": "<p>It's a nice Sunday discussion btw <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 482898641,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879559
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"671813\">@Madeleine Birchfield</span> for us I think it is different, because the higher you get <em>almost surely</em> you will find category theory in the literature you are gonna read.</p>",
        "id": 482898892,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731879761
    },
    {
        "content": "<p>I sometimes think it would be interesting if math was taught more of as an art, even in middleschool or highschool. In that context, category theory is great because it describes some of the \"moves\" that you can do - strategies for creating new structures and characterizing them. One could build a class around describing and illustrating just a few of these \"moves\" in fairly concrete situations like sets or preorders. But such a class would probably need to be some kind of elective, as I think many art classes are (?).</p>",
        "id": 482899145,
        "sender_full_name": "David Egolf",
        "timestamp": 1731879979
    },
    {
        "content": "<p>My mom recently retired, but previous to that she taught highschool math. It was her impression that in recent years there has been a push away from explaining procedures and towards trying to create more open-ended situations where students can explore. However, a challenge with that idea is that the mathematical structures involved are still fairly complex! So if a student has trouble with \"algebra\" it's difficult to imagine how they can have this \"joy of discovery\" in this setting.</p>\n<p>So I sometimes wonder if the philosophy is good (of trying to aim for situations where students can explore and create), but  perhaps it just needs to applied to a simpler mathematical setting. (Monoids, groups, rings, preorders, lattices etc. are typically not introduced in highschool, but I think an argument can be made that they are simpler in certain ways than the structures that <em>are</em> introduced.)</p>",
        "id": 482899307,
        "sender_full_name": "David Egolf",
        "timestamp": 1731880112
    },
    {
        "content": "<p>It would be nice to explore how children react to categories instead of sets. If we get to the point we teach these foundations ... wow! All magic can happen then <span aria-label=\"magic\" class=\"emoji emoji-1fa84\" role=\"img\" title=\"magic\">:magic:</span></p>",
        "id": 482899440,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731880241
    },
    {
        "content": "<p>(now do not start experimenting this with your own babies in case)</p>",
        "id": 482899511,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731880303
    },
    {
        "content": "<p>Thoughts?</p>",
        "id": 482899604,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731880381
    },
    {
        "content": "<p>I think that some of the philosophy of category theory is quite intuitive. (I'm thinking here of the idea that what really matters is the morphisms in a category).</p>\n<p>It is very natural to focus on comparisons: this toy car is faster than that one. And I seem to recall that \"numbers\" were introduced in my grade 1 class <em>after</em> we learned how to say if there are more or fewer stars or circles (basically by explicitly constructing an injective map from one set to the other). (Although my memory is hazy... that was a long time ago <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>  !)</p>",
        "id": 482899632,
        "sender_full_name": "David Egolf",
        "timestamp": 1731880414
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482899307\">said</a>:</p>\n<blockquote>\n<p>My mom recently retired, but previous to that she taught highschool math. It was her impression that in recent years there has been a push away from explaining procedures and towards trying to create more open-ended situations where students can explore. However, a challenge with that idea is that the mathematical structures involved are still fairly complex! So if a student has trouble with \"algebra\" it's difficult to imagine how they can have this \"joy of discovery\" in this setting.</p>\n</blockquote>\n<p>Presumably this is in the American education system?</p>",
        "id": 482899639,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731880426
    },
    {
        "content": "<p>I live in Canada. My mom worked as math teacher in BC. <span class=\"user-mention\" data-user-id=\"671813\">@Madeleine Birchfield</span></p>",
        "id": 482899711,
        "sender_full_name": "David Egolf",
        "timestamp": 1731880469
    },
    {
        "content": "<p>Ah, close enough.</p>",
        "id": 482899724,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731880485
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482899145\">said</a>:</p>\n<blockquote>\n<p>I sometimes think it would be interesting if math was taught more of as an art, even in middleschool or highschool. </p>\n</blockquote>\n<p>Alas, in the US that would guarantee that the budget for math education in high school plummets to the budget for art education in high school: rather close to zero!  </p>\n<p>Once high schools in the US taught art and music, but as the billionaire class continues to squeeze the working class, nothing that doesn't help students \"get a good job\" is considered worth spending money on.   And the same is even true in college: the humanities departments in most colleges are losing funding.   So mathematicians know that calling math an \"art\" would be akin to suicide.  We will never do that.   We instead run around talking all the time about how important it is in technology - meaning, people like Bezos and Musk and Zuckerberg would not be so rich if they couldn't hire people who know math.</p>",
        "id": 482899937,
        "sender_full_name": "John Baez",
        "timestamp": 1731880692
    },
    {
        "content": "<p>Maybe we could have a bonus \"art math\" elective in addition to the \"you need this for college/your job\" math classes.</p>",
        "id": 482899970,
        "sender_full_name": "David Egolf",
        "timestamp": 1731880741
    },
    {
        "content": "<p>Although on that topic, it is weird to me that calculus is so strongly emphasized in university. As far as I can tell the number of jobs where knowing calculus is directly useful is rather low. I support learning calculus, but more in the way that I support learning a variety of things to expand one's worldview and mindset - which starts to sound a bit like what art can be good for.</p>\n<p>For example, I'm tutoring a student who wants to be a vet. It is my understanding that she will still need to complete at least one calculus course!</p>",
        "id": 482900044,
        "sender_full_name": "David Egolf",
        "timestamp": 1731880803
    },
    {
        "content": "<p>Eugenia Cheng teaches category theory to artists at the Art Institute of Chicago and they seem to love it!  But there of course, the stigma of art has already been factored in: all her students already <em>know</em> they are not going down the correct track to become productive drones.</p>",
        "id": 482900111,
        "sender_full_name": "John Baez",
        "timestamp": 1731880837
    },
    {
        "content": "<p>See her four courses listed <a href=\"https://www.saic.edu/profiles/faculty/eugenia-cheng\">here</a>.</p>",
        "id": 482900174,
        "sender_full_name": "John Baez",
        "timestamp": 1731880897
    },
    {
        "content": "<p>I think part of the justification (as far as I've heard, indirectly) for pushing more for discovery/exploration in math education in BC was this: Employers need employees who can think creatively, and who can solve problems. So, \"being able to think abstractly\" is being presented as a relevant job skill that should be cultivated to foster a healthy economy.</p>",
        "id": 482900648,
        "sender_full_name": "David Egolf",
        "timestamp": 1731881311
    },
    {
        "content": "<p>I was thinking it was more because of  a transferable skill of the kind \"now I know how to solve a problem given a prompt\"</p>",
        "id": 482900795,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731881440
    },
    {
        "content": "<p>Otherwise why so many calculus classes and limits? <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 482900827,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731881486
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"705200\">Federica Pasqualone</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482899440\">said</a>:</p>\n<blockquote>\n<p>It would be nice to explore how children react to categories instead of sets. If we get to the point we teach these foundations ... wow! All magic can happen then <span aria-label=\"magic\" class=\"emoji emoji-1fa84\" role=\"img\" title=\"magic\">:magic:</span></p>\n</blockquote>\n<p>I think I remember how I've been taught multiplication in primary school: to multiply 5 by 3</p>\n<ul>\n<li>arrange a collection of marbles as a rectangular grid of length 5 and width 3</li>\n<li>and count the marbles.</li>\n</ul>\n<p>I might project back the intuitions I have today, but this kind of reasoning seems very natural in a categorical setting: this is literally the cartesian product of finite sets.</p>",
        "id": 482900893,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1731881525
    },
    {
        "content": "<p>(If anyone wants to read more about the rationale and goals involved with the current BC math curriculum, you might find this interesting: <a href=\"https://curriculum.gov.bc.ca/curriculum/mathematics\">BC math curriculum</a>.)</p>",
        "id": 482901085,
        "sender_full_name": "David Egolf",
        "timestamp": 1731881740
    },
    {
        "content": "<p>well, sounds like a good start <span class=\"user-mention\" data-user-id=\"619003\">@Peva Blanchard</span>  ... are you also renaming when teaching? Guys this is the product (don't call it multiplication! hahha) I see a bunch of issues at the horizon ...</p>",
        "id": 482901148,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731881774
    },
    {
        "content": "<p>I agree it is useful though .. then it takes a second to the product of two top spaces !</p>",
        "id": 482901208,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731881853
    },
    {
        "content": "<p>Blanchard's example is also something I have ambiently in mind. But that seems to me to be, categorical intuition that is evidently already taught, and therefore the curriculum doesn't need to change.</p>\n<p>Unless there's something extra you can say about that example that prepares the students to interpret that example in a categorical way someday.</p>",
        "id": 482901220,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731881869
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482901085\">said</a>:</p>\n<blockquote>\n<p>(If anyone wants to read more about the rationale and goals involved with the current BC math curriculum, you might find this interesting: <a href=\"https://curriculum.gov.bc.ca/curriculum/mathematics\">BC math curriculum</a>.)</p>\n</blockquote>\n<p>That curriculum uses \"foundations of mathematics\" differently than how mathematicians use. No mention of logic or set theory, etc</p>",
        "id": 482901223,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731881878
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482901223\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482901085\">said</a>:</p>\n<blockquote>\n<p>(If anyone wants to read more about the rationale and goals involved with the current BC math curriculum, you might find this interesting: <a href=\"https://curriculum.gov.bc.ca/curriculum/mathematics\">BC math curriculum</a>.)</p>\n</blockquote>\n<p>That curriculum uses \"foundations of mathematics\" differently than how mathematicians use. No mention of logic or set theory, etc</p>\n</blockquote>\n<p>Maybe they mean \"foundations for learning mathematics\". Or possibly \"foundations for mathematical thinking in everyday living\".</p>",
        "id": 482901444,
        "sender_full_name": "David Egolf",
        "timestamp": 1731882089
    },
    {
        "content": "<p>One big thing that category theory brings to the table in terms of 'mathematical thinking in everyday living' is the notion of compositionality. The idea that you can combine two relationships or structures or processes to get a new one is fundamental to everyday life, so perhaps thinking about it explicitly could be worthwhile for many people.</p>",
        "id": 482901661,
        "sender_full_name": "David Egolf",
        "timestamp": 1731882306
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482901661\">said</a>:</p>\n<blockquote>\n<p>One big thing that category theory brings to the table in terms of 'mathematical thinking in everyday living' is the notion of compositionality. The idea that you can combine two relationships or structures or processes to get a new one is fundamental to everyday life, so perhaps thinking about it explicitly could be worthwhile for many people.</p>\n</blockquote>\n<p>I don't think mathematically formalising that concept via category theory would really be that useful to most people. Informally explaining the notion of compositionality as a philosophical concept should be sufficient for most people.</p>",
        "id": 482902110,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731882774
    },
    {
        "content": "<p>Maybe to talk out loud a bit about one aspect that makes all this hard.</p>\n<p>Here's a concrete subtle difficulty reading \"Conceptual Mathematics\" helped clarify for me.</p>\n<p>When we teach kids stuff for the first time, they learn an algorithm for addition, many parents get upset if you try to teach a second algorithm for addition.</p>\n<p>But eventually, you want to start talking about sets, that is as abstract associations from one box of stuff to another. From this lens \"+\" abstracts over all the possible algorithms, and the category of sets is the setting where those abstract compositions are then composed.</p>\n<p>This is already very subtle and difficult for most people (If I recall correctly, some 20% of people fail algebra). But is a necessary step to keep the category we're exploring tractable.</p>\n<p>Blanchard's example alludes to moments where this thinking is emphasized, but I don't think this is reliably emphasized, even in calculus classes. People tend to think of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo><mo>=</mo><mn>2</mn><mi>x</mi></mrow><annotation encoding=\"application/x-tex\">f(x) = 2x</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\">x</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">2</span><span class=\"mord mathnormal\">x</span></span></span></span> as an algorithm, rather than an abstract association of elements.</p>\n<p>If issues like this are hard to get under control and understood, categories only seem harder to my mind.</p>\n<p>(But I'm still curious about thoughts on how to overcome this)</p>",
        "id": 482902558,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731883242
    },
    {
        "content": "<p>For me it is more than mere compositionality. Sure it is a key concept, but this we created is a new language, a language that is context dependent, universal, one can even design industrial processes using it ... now take the coproduct and here it is a pencil case <span aria-label=\"magic\" class=\"emoji emoji-1fa84\" role=\"img\" title=\"magic\">:magic:</span> or a pair of glasses .. <span aria-label=\"top hat\" class=\"emoji emoji-1f3a9\" role=\"img\" title=\"top hat\">:top_hat:</span></p>",
        "id": 482902694,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731883399
    },
    {
        "content": "<p>Personally, I think that the concepts of function, variable, equation needs to be taught much earlier than it is currently being taught right now. These concepts should be introduced around the time they are learning multiplication and division of natural numbers in the primary school curricula. Get it clear in the minds of students from a young age that the arithmetic operations are abstract functions and that different algorithms are implementations of said abstract functions. </p>\n<p>And there have been studies conducted that show that people can learn what a function is and what an equation is and what a variable is at that young of an age, and that they eventually do better at later courses such as school algebra.</p>",
        "id": 482902833,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731883555
    },
    {
        "content": "<p>Yes! To my mind, learning how to apply a function (at least in some simple cases) is a much simpler thing than learning how to deal with fractions, or learning how to \"distribute\" multiplication over addition. And we teach those things pretty early.</p>",
        "id": 482903009,
        "sender_full_name": "David Egolf",
        "timestamp": 1731883685
    },
    {
        "content": "<p>This btw  is a good thread for Master's students on the teaching track  (I am referring to the German system).</p>",
        "id": 482903116,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731883818
    },
    {
        "content": "<p>and it is getting broader, that's more to it than CT I guess, well-done!</p>",
        "id": 482903145,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731883851
    },
    {
        "content": "<p>But yeah, going back to the original question</p>\n<ul>\n<li>Can we start learning category theory before learning any university level math?</li>\n</ul>\n<p>It is quite interesting that many people's responses to this question is to then ask and try to answer the question </p>\n<ul>\n<li>How can we (as teachers) teach category theory concepts / categorical thinking in the pre-university levels of mathematics?</li>\n</ul>\n<p>I feel like there is a hidden assumption here that everything learned before university has to be taught by teachers at school and incorporated into the curriculum.</p>",
        "id": 482904284,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731884966
    },
    {
        "content": "<p>Most things I've learned really well, I've learned from teachers. The younger I was the harder it was to learn on my own. </p>\n<p>That's not entirely true. I learned quite a bit of programming by myself, but I was fortunate to have access to programming classes from middle school into high school. Those classes made me a better programmer.</p>\n<p>The more I've grown to accept learning is a social process, the happier I've been, and the faster I've learned. I go so far as to think of my lessons as learning the world view of people I find interesting.</p>",
        "id": 482905189,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731885806
    },
    {
        "content": "<p>(but I acknowledge that I implicitly imposed that assumption onto the original question)</p>",
        "id": 482905251,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731885863
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482905189\">said</a>:</p>\n<blockquote>\n<p>Most things I've learned really well, I've learned from teachers. The younger I was the harder it was to learn on my own.</p>\n</blockquote>\n<p>Yes, that is also true. But that is why we have dedicated camps/schools and discussion forums and so forth for those interested in learning category theory, and also for other advanced subjects in mathematics as well. There is no need to try to impose category theory on the general population via the school mathematics curriculum. </p>\n<p>Back in the summer of 2022 we had a school for homotopy type theory and a number of teenagers showed up on the Discord server and the Zoom meetings to learn the subject, even though homotopy type theory is research level mathematics.</p>",
        "id": 482905493,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731886096
    },
    {
        "content": "<p>Wow! That's amazing!</p>",
        "id": 482905736,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731886346
    },
    {
        "content": "<p>Well if I were to rephrase my position slightly, it's asking a lot of teenagers to interpret material that was designed to be consumed by graduate students.</p>\n<p>By trying to understand how category theory relates to the standard curriculum, even if you don't introduce it into the standard curriculum, you might get ideas on how to introduce category theory in a way that requires less of students interested in learning it.</p>",
        "id": 482906298,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731886957
    },
    {
        "content": "<p>Well, this is why I think category theory will be introduced as a generalisation from set theory. Sets and finite sets and functions / relations / bijections are about as close as it gets to something in the standard curriculum which is closely related to category theory. </p>\n<p>In this case, the category theory taught would probably end up being enough category theory concepts to construct a Boolean topos and a Boolean power allegory, etc, so that you can say the category of sets and functions is this category and the category of sets and relations is this other category, etc...</p>\n<p>Like, I wouldn't even attempt to introduce functors and adjunctions and the Yoneda lemma for students who haven't taken university level mathematics, even though those are fundamental concepts in graduate level category theory.</p>",
        "id": 482907744,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731888296
    },
    {
        "content": "<p>I think generic functions between generic containers is very teachable in programming fwiw. If an aside is made saying \"by the way, you can do analogous stuff with Sets in math.\" I imagine that would get a student on the right track.</p>",
        "id": 482908128,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731888654
    },
    {
        "content": "<p>(I think this has even been alluded to in the above conversation)</p>",
        "id": 482908238,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731888771
    },
    {
        "content": "<p>I suppose that is true as well, but I'm not a programmer so all my intuition comes from category theory in mathematics rather than the programming / compsci side.</p>",
        "id": 482908274,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731888815
    },
    {
        "content": "<p>I think we agree, that there's a lot more \"structural\" thinking in the air, and school would benefit a lot by simply leaning much more heavily on this way of thinking, like by getting abstract sets and functions straightened out much earlier.</p>\n<p>I think the case for this could be easily motivated via programming classes, for example.</p>",
        "id": 482908885,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731889361
    },
    {
        "content": "<p>On the other hand, only a small portion of students ever take a programming class, so this proposed class would just be targeting those students.</p>",
        "id": 482909072,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731889551
    },
    {
        "content": "<p>Also I'm not even sure if generics are taught in an introductory programming class, if your category theory pathway relies on prior knowledge of generics.</p>",
        "id": 482909156,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731889611
    },
    {
        "content": "<p>Right I think there's an argument to get programming into the main curriculum. And that it could benefit the teaching of structural thinking in math. I also agree generics aren't usually taught, but I have successfully taught them when I've felt like a rebel.</p>",
        "id": 482909268,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731889705
    },
    {
        "content": "<p>I see programming being taught to many students as far more likely than a category theory inspired curriculum (but it's still fun to think about the latter)</p>",
        "id": 482909304,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731889762
    },
    {
        "content": "<p>Yeah, except in certain countries, there is no \"main curriculum\" for students past a certain age. </p>\n<p>Ireland for example has the Senior Cycle where students between ages 15 and 18 can choose which subjects to specialise in. There are about 36 different subjects, and one of the subjects is computer science / programming, but students only have to choose about 6-8 subjects to complete in order to graduate.</p>",
        "id": 482909947,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731890379
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482900648\">said</a>:</p>\n<blockquote>\n<p>So, \"being able to think abstractly\" is being presented as a relevant job skill that should be cultivated to foster a healthy economy.</p>\n</blockquote>\n<p>I feel sufficiently wise thinkers have always realized that art, music, philosophy, pure mathematics, etc. help develop people's minds in ways that really help society (including the economy)... you can see it in Plato, and probably many writers since then.  But when society becomes infected with short-termism, education devolves into \"training\", where students learn skills which they'll supposedly use on the job.</p>",
        "id": 482910602,
        "sender_full_name": "John Baez",
        "timestamp": 1731890977
    },
    {
        "content": "<p>But I still find the generics to be a bigger obstacles to the programming path to category theory. </p>\n<p>Ireland's computer science is taught using Python and Javascript. Javascript doesn't have typing and thus doesn't have generics, and Python's generics were only introduced to Python in 2022, so up until 2022, it was simply impossible for somebody in Ireland studying computer science in the senior cycle to learn about generics through their school.</p>",
        "id": 482910700,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731891068
    },
    {
        "content": "<p>I'm sympathetic to that argument regarding programming being a bad route from this point of view. I think essentially every pragmatic programming language with a mature type system is cumbersome to use.</p>\n<p>I don't think that's a problem intrinsic to type systems for introductory languages, but I agree that's a serious practical problem for my argument.</p>",
        "id": 482910865,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731891219
    },
    {
        "content": "<p>(The big educational advantage of a type system for education is it makes it easy for the computer to tell you what did wrong. But a lot more work needs to be done to make this work for young learners)</p>",
        "id": 482911090,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731891374
    },
    {
        "content": "<p>The typing can be introduced earlier than programming - in the mathematics curriculum. When teaching students about set theory, teachers should be emphasising that the 2 in the integers is not the same as the 2 in the real numbers, since they are in different sets / types. Aka, an ETCS / typed approach to set theory rather than a ZFC / untyped approach to set theory. </p>\n<p>Then when people move on to programming, they can draw on their typing intuition in mathematics when learning typed programming languages.</p>\n<p>Although I think that some countries don't include set theory in their mathematics curriculum, so this entire thing of teaching category theory from mathematics or programming may not even be possible without curriculum reform.</p>",
        "id": 482911398,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731891633
    },
    {
        "content": "<p>Yeah, I fully agree with your goals, and I think we might be getting fussed over details.</p>\n<p>I don't think I learned set theory until college, and my mindset when I started teaching was \"how do I convince parents this is useful, aha! programming!\" Regardless of how it's exactly done, there's an important cluster of ideas here that could be taught much earlier.</p>",
        "id": 482911640,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731891870
    },
    {
        "content": "<p>In Ireland, set theory is taught before the real numbers are introduced, so this is pretty early on in the mathematics curriculum.</p>",
        "id": 482911788,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731892016
    },
    {
        "content": "<p>I think Europe more generally was hugely influenced by Bourbaki and sought to implement some set theory and other 20th century mathematics into its school curriculum. While North America has more of a traditional 19th century mathematics curriculum.</p>",
        "id": 482911894,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731892093
    },
    {
        "content": "<p>There was an attempt to introduce sets in the 1960s I think, but it didn't really stick (everywhere) and was extremely controversial.</p>\n<p>I agree with you that sets would be a better abstract setting to understand these ideas than a programming language.</p>",
        "id": 482912018,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731892233
    },
    {
        "content": "<p>Actually there are recordings by the guy who tried to add Sets to the American mathematics curriculum, and I actually find them to be pretty inspiring:</p>\n<p><a href=\"https://digitalcollections.briscoecenter.org/collection/847\">https://digitalcollections.briscoecenter.org/collection/847</a></p>\n<p>I think it's a tragedy Max Beberman died as young as he did. American math education might've looked just a bit different if he had a little bit more time.</p>\n<p>(But this is getting off the rails of the main theme of this thread I think)</p>",
        "id": 482913016,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731893076
    },
    {
        "content": "<p>Though as a constructivist, I do have to say that I prefer the American curriculum over the Irish one. It means that I just have to assume the <a href=\"https://ncatlab.org/nlab/show/limited%20principle%20of%20omniscience\">[[limited principle of omniscience]]</a> when teaching mathematics rather than full excluded middle, since set theory isn't taught.</p>",
        "id": 482913416,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731893384
    },
    {
        "content": "<p>hahaha here we are again on the intuitionistic side of the story ... <span aria-label=\"face with hand over mouth\" class=\"emoji emoji-1f92d\" role=\"img\" title=\"face with hand over mouth\">:face_with_hand_over_mouth:</span></p>",
        "id": 482913725,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731893621
    },
    {
        "content": "<p>Wait now I am getting very curious about the US elementary school books ... I have to compare  'em with the Italian and German ones</p>",
        "id": 482915347,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731894932
    },
    {
        "content": "<p>I've always thought that string diagrams would be a great way to teach basic algebra.</p>\n<p>Right now, we use letters from the beginning of the alphabet <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi><mo separator=\"true\">,</mo><mi>b</mi><mo separator=\"true\">,</mo><mi>c</mi><mo separator=\"true\">,</mo><mo>…</mo></mrow><annotation encoding=\"application/x-tex\">a,b,c,\\ldots</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">c</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\">…</span></span></span></span> and letters from the end of the alphabet <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo separator=\"true\">,</mo><mi>y</mi><mo separator=\"true\">,</mo><mi>z</mi><mo separator=\"true\">,</mo><mo>…</mo></mrow><annotation encoding=\"application/x-tex\">x,y,z,\\ldots</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.04398em;\">z</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\">…</span></span></span></span> to distinguish constants and variables. This probably doesn't help kids who are already having trouble with the idea that letters can represent numbers.</p>\n<p>Diagrammatically, these look very different--a leaf node vs a wire.</p>",
        "id": 482915506,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1731895035
    },
    {
        "content": "<p>In the American context, there are these resources from Tufts University for teaching algebra in the elementary school level:</p>\n<ul>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/3rd-grade-early-algebra/\">3rd Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/4th-grade-early-algebra/\">4th Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/5th-grade-early-algebra/\">5th Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/middle-school-early-algebra/\">Middle School Early Algebra</a></li>\n</ul>",
        "id": 482916086,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731895438
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278008\">Spencer Breiner</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482915506\">said</a>:</p>\n<blockquote>\n<p>Right now, we use letters from the beginning of the alphabet <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi><mo separator=\"true\">,</mo><mi>b</mi><mo separator=\"true\">,</mo><mi>c</mi><mo separator=\"true\">,</mo><mo>…</mo></mrow><annotation encoding=\"application/x-tex\">a,b,c,\\ldots</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">c</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\">…</span></span></span></span> and letters from the end of the alphabet <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo separator=\"true\">,</mo><mi>y</mi><mo separator=\"true\">,</mo><mi>z</mi><mo separator=\"true\">,</mo><mo>…</mo></mrow><annotation encoding=\"application/x-tex\">x,y,z,\\ldots</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.04398em;\">z</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\">…</span></span></span></span> to distinguish constants and variables. This probably doesn't help kids who are already having trouble with the idea that letters can represent numbers.</p>\n</blockquote>\n<p>This is one reason why I think teachers should first introduce the concept that letters can represent numbers in the primary school curriculum, so that people have two or three years to digest the concept before they have to start distinguishing between \"variables\" and \"constants\".</p>",
        "id": 482916759,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731895892
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482916086\">said</a>:</p>\n<blockquote>\n<p>In the American context, there are these resources from Tufts University for teaching algebra in the elementary school level:</p>\n<ul>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/3rd-grade-early-algebra/\">3rd Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/4th-grade-early-algebra/\">4th Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/5th-grade-early-algebra/\">5th Grade Early Algebra</a></li>\n<li><a href=\"https://sites.tufts.edu/brizuelaresearch/lesson-materials/middle-school-early-algebra/\">Middle School Early Algebra</a></li>\n</ul>\n</blockquote>\n<p>Thank you for sharing!</p>",
        "id": 482917976,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731896776
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"705200\">Federica Pasqualone</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482915347\">said</a>:</p>\n<blockquote>\n<p>Wait now I am getting very curious about the US elementary school books ... I have to compare  'em with the Italian and German ones</p>\n</blockquote>\n<p>But at the elementary school level in America there aren't really any textbooks for mathematics if I remember correctly. I think actual textbooks begin with the prealgebra in American middle schools.</p>",
        "id": 482918157,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731896918
    },
    {
        "content": "<p>Really? O.o</p>",
        "id": 482921138,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731899384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"705200\">Federica Pasqualone</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482921138\">said</a>:</p>\n<blockquote>\n<p>Really? O.o</p>\n</blockquote>\n<p>Actually I should correct my statement. There are typically teacher textbooks for elementary school. The students don't usually get textbooks.</p>",
        "id": 482921890,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731900001
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482912018\">said</a>:</p>\n<blockquote>\n<p>There was an attempt to introduce sets in the 1960s I think, but it didn't really stick (everywhere)...</p>\n</blockquote>\n<p>I was born in 1961 and learned arithmetic in school in 1969 where it was taught using some set theory: the so-called 'new math'.  I don't remember the details but it worked for me.</p>",
        "id": 482922144,
        "sender_full_name": "John Baez",
        "timestamp": 1731900207
    },
    {
        "content": "<p>The problem with American \"new math\" isn't so much the set theory as it was everything else that got lumped in the program. </p>\n<p>Abstract algebra shouldn't have been taught until minimum after they have already learned their rationals, and then only maybe some basic theory on commutative rings and fields can be taught in preparation for the real numbers, but nothing else. Arithmetic in bases other than 10 should be left to the computer scientists and electrical engineers who have to deal with binary and hexadecimal. And so on. </p>\n<p>It was those other things that got the huge backlash from the American general public. I think had American new math just been set theory it would have lasted to the present day.</p>",
        "id": 482922737,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731900712
    },
    {
        "content": "<blockquote>\n<p>the 2 in the integers is not the same as the 2 in the real numbers, since they are in different sets / types</p>\n</blockquote>\n<p>This is an aside, but I actually think that's not a very good example, since one of the first things we try to do with any practical implementation of type theory is declare the map from the integers to the real numbers to be an implicit coercion so we can treat the two 2's as the same.  I think insisting that they're really different just makes people think you're being needlessly confusing.</p>\n<p>I think type theory is better sold as a way to formalize distinctions that practiced mathematicians already draw intuitively, and rule out statements that everyone agrees are meaningless, than to insist on distinctions that may be formally necessary in type theories but don't match most mathematicians' intuitions.</p>",
        "id": 482923122,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1731901006
    },
    {
        "content": "<p>Thank you to those who talked about the initial topic at the beginning of the thread! I might ask specific questions in specific threads later. The goal would be to write a document defending that this Zulip has unique features for education and research in math! I've found that there are \"math education\" and \"communication in math\" categories on the ArXiv so there would be a place to post something like this. Of course I'd like something focused and rigorous not like how this conversation finished  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span>  But this is true that didn't started it in the best way. I should have asked only one question.</p>",
        "id": 482942494,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731912779
    },
    {
        "content": "<p>Can you say a bit more about what you didn't like about how the conversation ended? So I can avoid contributing to the lack of rigour in the future <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 482962105,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1731919799
    },
    {
        "content": "<blockquote>\n<p>Category theory seems, to me, to be at a large disadvantage with respect to the above heuristic.</p>\n</blockquote>\n<p>I agree and I think the young age of CT plays a role in this problem. It's hard to come up with a question that doesn't require technical jargon, because category theory is <em>for the most part</em> jargon, taxonomy, or retrieving known facts as consequences of unifying principles. Which is also what takes aback many mathematicians who believe building language and streamlining ideas is grunt work, and we should instead single-handedly solve &lt;big name&gt;'s conjecture.</p>\n<p>Hence why the problem of teaching CT to non-mathematician has no easy solution. How do you convince someone, who doesn't know what you're classifying, that taxonomy is important? If someone is sitting in an empty room, the idea that they <em>need</em> a strategy to tidy it up and categorize the items in it sounds pretty moot.</p>",
        "id": 482969424,
        "sender_full_name": "fosco",
        "timestamp": 1731921920
    },
    {
        "content": "<p>on the other hand I also believe that there is a way, somewhere, to present ideas in category theory without much mathematical jargon (e.g.: \"you don't know things, but instead you know what things do when you shake the box they're into\"). And without making them sound like self-evident banalities. </p>\n<p>But combinatorics relies on stuff you can literally display on a table, and calculus spent centuries being <del>non-consensually touched</del> used by people who just wanted to solve an ODE, and didn't care much about the Cauchy-Lipschitz condition; category theory started to be used by non-mathematicians less than a blink-of-an-eye ago...</p>",
        "id": 482970443,
        "sender_full_name": "fosco",
        "timestamp": 1731922197
    },
    {
        "content": "<p>Yeah <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span> , I am sure there's already plenty of papers on math pedagogy around. Nihil sub sole novum.</p>",
        "id": 483004161,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731931585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482969424\">said</a>:</p>\n<blockquote>\n<p>Which is also what takes aback many mathematicians who believe building language and streamlining ideas is grunt work, and we should instead single-handedly solve &lt;big name&gt;'s conjecture.</p>\n</blockquote>\n<p>Why do many mathematicians have this attitude in the first place?</p>",
        "id": 483008502,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731932891
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"705200\">@Federica Pasqualone</span> Seriously? </p>\n<p>“There are already plenty of papers about mathematics [Insert the Latin sentence of Frederica]” </p>\n<p>I will say this any time someone want to write a math paper now.</p>",
        "id": 483016389,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731934973
    },
    {
        "content": "<p>You came and just started talking all over the place about elementary class math textbook in Germany, intuitionism and whatever</p>",
        "id": 483016743,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731935065
    },
    {
        "content": "<p>I wanted to talk about what makes this Zulip unique and how it affects people. But I didn’t know precisely what I wanted to talk about at the beginning</p>",
        "id": 483017305,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731935177
    },
    {
        "content": "<p>There have been really cool contributions about that at the beginning though</p>",
        "id": 483017547,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731935251
    },
    {
        "content": "<p>And then I thought that this is the topic I want to talk about: what makes this Zulip unique for math education and research in math</p>",
        "id": 483017795,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731935308
    },
    {
        "content": "<p>But I didn’t say I wanted to talk precisely about that now, sorry</p>",
        "id": 483017999,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731935369
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482882515\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Do some people felt offended some time on this Zulip? </li>\n</ul>\n</blockquote>\n<p>Discussions on the forum frequently get off track, which can annoy, offend, and frustrate some people. See </p>\n<p><a class=\"stream-topic\" data-stream-id=\"241990\" href=\"/#narrow/channel/241990-community.3A-discussion/topic/ACT.20pedagogy.20and.20hype.20.28cross.20post.29\">#community: discussion &gt; ACT pedagogy and hype (cross post)</a> </p>\n<p>for another egregious example of this phenomenon.</p>",
        "id": 483018033,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731935383
    },
    {
        "content": "<p>Usually what happens is that we then spin off the discussion into a separate thread. But I think we have exhausted that conversation so let us just move on.</p>",
        "id": 483018894,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1731935606
    },
    {
        "content": "<p>I will just ask precise questions in separate threads later. I must think about what I want to ask precisely. I will do this when I have more time, like this summer maybe.</p>",
        "id": 483021393,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731936249
    },
    {
        "content": "<p>I feel overwhelmed when people write a lot of messages and I don’t have the time to think about what I want to say.</p>",
        "id": 483022390,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731936504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"705200\">Federica Pasqualone</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/483004161\">said</a>:</p>\n<blockquote>\n<p>Yeah <span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> . About the correct ArXiv classification, I am sure there's already plenty of papers on math pedagogy around. Nihil sub sole novum.</p>\n</blockquote>\n<p>Actually I meant to encourage you. Here you are some great journals in math edu:  <a href=\"https://researchguides.library.vanderbilt.edu/mathed/journals\">https://researchguides.library.vanderbilt.edu/mathed/journals</a></p>",
        "id": 483036695,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731940136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"705200\">@Federica Pasqualone</span> I’m so sorry. I think I didn’t read “about the correct ArXiv classification” and I thought you wanted to say that there is nothing new in what I want to do</p>",
        "id": 483037898,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731940421
    },
    {
        "content": "<p>I’m a bit paranoid sometimes</p>",
        "id": 483039047,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731940725
    },
    {
        "content": "<p>I use to uplift others, not the contrary.</p>",
        "id": 483039433,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731940810
    },
    {
        "content": "<p>When I was younger I started reading <a href=\"https://monoskop.org/images/7/71/Bourdieu_Pierre_Passeron_Jean_Claude_The_Inheritors_1979.pdf\">this book</a> and I found it amazing. Before opening this book I thought sociology was bullshit but it blew my mind how Bourdieu and Passeron were able to analyse a phenomenon in society in a “scientific way” combining philosophical skill with real data. I think I’m going to read it completely to understand how you can write a lot of pages on a sociological question. I would love being able to write analysis of sociological phenomenons like a real sociologist. I would dream to be like Lawvere and Girard, and be able to write like a philosopher while being a mathematician or computer scientist ahah</p>",
        "id": 483040775,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1731941123
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/483008502\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482969424\">said</a>:</p>\n<blockquote>\n<p>Which is also what takes aback many mathematicians who believe building language and streamlining ideas is grunt work, and we should instead single-handedly solve &lt;big name&gt;'s conjecture.</p>\n</blockquote>\n<p>Why do many mathematicians have this attitude in the first place?</p>\n</blockquote>\n<p>Hah, good question. I think it comes, in part, from the image of mathematicians pictured by the media. Related meme:</p>\n<p><a href=\"/user_uploads/21317/c00cvkCvfO_lKAnm5cMaPXJT/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/c00cvkCvfO_lKAnm5cMaPXJT/image.png\" title=\"image.png\"><img data-original-dimensions=\"214x236\" src=\"/user_uploads/thumbnail/21317/c00cvkCvfO_lKAnm5cMaPXJT/image.png/840x560.webp\"></a></div>",
        "id": 483097677,
        "sender_full_name": "fosco",
        "timestamp": 1731955692
    },
    {
        "content": "<p>I agree that the image of mathematicians in the media is often misleading, but my own experience has been that most professional mathematicians are well-aware of this, and are also aware that big conjectures are rarely solved entirely by eccentric geniuses working in isolation but instead by putting together small contributions from many people, and moreover that solving big conjectures is not the only or even the primary goal of mathematics.  I feel like valuing small contributions is an orthogonal question to valuing language-building.</p>",
        "id": 483126736,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1731965270
    },
    {
        "content": "<p>(I do agree that language-building is undervalued in mathematics in general.)</p>",
        "id": 483127005,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1731965378
    },
    {
        "content": "<p>I think rather few mathematicians are actually working to solve \"big conjectures\".  But big conjectures do serve as a quick way of answering the question \"what are you trying to do and does it really matter?\"   Not a very good way... but for example:</p>\n<p>There's a lot of research connected to elliptic curves, modular curves, automorphic forms, L-functions, and a vast array of technology connected to these things, and people working on these things can point to the $1,000,000-dollar prizes for the Riemann Hypothesis and Birch--Swinnerton-Dyer conjecture as a quick way of noting that someone cares about this stuff - much easier than actually explaining what it is, or why it matters.</p>",
        "id": 483130742,
        "sender_full_name": "John Baez",
        "timestamp": 1731966731
    },
    {
        "content": "<p>This is one reason I was happy to help propound the <a href=\"https://ncatlab.org/nlab/show/cobordism%20hypothesis\">[[cobordism hypothesis]]</a> and more general <a href=\"https://ncatlab.org/nlab/show/tangle%20hypothesis\">[[tangle hypothesis]]</a>, biggish conjectures that require a pretty good theory of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-categories or <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">∞</mi><mo separator=\"true\">,</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(\\infty,n)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord\">∞</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">n</span><span class=\"mclose\">)</span></span></span></span>-categories to prove.</p>",
        "id": 483130936,
        "sender_full_name": "John Baez",
        "timestamp": 1731966821
    },
    {
        "content": "<p>I encourage other folks to propound intuitively appealing but (it may turn out) hard-to-prove conjectures in category theory, both to encourage its development and to give researchers goals to point to.   Language building is very important, and often you can only find the good conjectures after you've built the language in which they can be stated - but it's hard for most people to understand the virtues of language-building, while the idea of \"can you prove this?\" seems easier to understand.</p>\n<p>In categorical terms \"can you prove this?\" is about verifying a <em>property</em>, while many deeper problems involve <em>finding an interesting structure</em>, <em>finding interesting stuff</em>, etc.</p>",
        "id": 483132636,
        "sender_full_name": "John Baez",
        "timestamp": 1731967483
    },
    {
        "content": "<p>Note also that I called the tangle hypothesis a \"hypothesis\" because it was not precise enough to be a conjecture.  So in fact I was calling for the development of <em>structures</em>, <em>stuff</em> etc. required for precise statement of a conjecture!  But like Grothendieck's <a href=\"https://ncatlab.org/nlab/show/homotopy%20hypothesis\">[[homotopy hypothesis]]</a>, there was a \"pre-conjecture\" very clearly begging to be stated more precisely.</p>\n<p>There are definitely dangers in stating \"pre-conjectures\" that need to be made more precise: it's easy to get lost in vagueness.    We don't want category theory to be seen as the home of pre-conjectures.  So try to pose some precise, appealing yet difficult conjectures!</p>",
        "id": 483133079,
        "sender_full_name": "John Baez",
        "timestamp": 1731967663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482890340\">said</a>:</p>\n<blockquote>\n<p>I would love if we succeeded to write collectively an academic paper proving that such a Zulip is good for education and research.</p>\n</blockquote>\n<p>I did make this point in my last paper, although it's not what the paper was <em>about</em>. I also pointed to the benefits of informal maths discussions on platforms such as Mastodon. That said, it may not have a wide enough audience to get very far in exposing the world to the benefits of Zulip hahaha</p>",
        "id": 483892435,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732275648
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482896555\">said</a>:</p>\n<blockquote>\n<p>distance = rate <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>×</mo></mrow><annotation encoding=\"application/x-tex\">\\times</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord\">×</span></span></span></span> time is very useful; I doubt there's anything as simple <em>and simultaneously as useful</em> in category theory. </p>\n</blockquote>\n<p>I'm glad you wrote out what the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>r</mi></mrow><annotation encoding=\"application/x-tex\">r</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span></span></span></span> stands for in <span class=\"user-mention\" data-user-id=\"277352\">@Alex Kreitzberg</span> 's <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>d</mi><mo>=</mo><mi>r</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">d=rt</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">d</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6151em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span><span class=\"mord mathnormal\">t</span></span></span></span>, that's not the notation I learned for that equation ;)</p>",
        "id": 483892445,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732275651
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482905189\">said</a>:</p>\n<blockquote>\n<p>Most things I've learned really well, I've learned from teachers. The younger I was the harder it was to learn on my own. </p>\n</blockquote>\n<p>Kids aren't taught to learn autonomously in many (most?) places, so teachers are indispensible.</p>",
        "id": 483892683,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732275730
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482909072\">said</a>:</p>\n<blockquote>\n<p>On the other hand, only a small portion of students ever take a programming class, so this proposed class would just be targeting those students.</p>\n</blockquote>\n<p>I was going to disagree, but I found <a href=\"https://www.education.gouv.fr/reussir-au-lycee/choisir-ses-enseignements-de-specialite-au-lycee-pour-preparer-ses-etudes-superieures-325475\">some statistics</a> for high schools in France showing that 4.3 and 4.7% of students took the computer science option at the end of high school in 2021 and 2022 respectively. They choose three of thirteen specialisms, so that's not many; maybe it isn't offered everywhere.</p>",
        "id": 483894670,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732276479
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/482922737\">said</a>:</p>\n<blockquote>\n<p>Arithmetic in bases other than 10 should be left to the computer scientists and electrical engineers who have to deal with binary and hexadecimal. </p>\n</blockquote>\n<p>I disagree. Understanding how a number can be decomposed with respect to different bases is almost as important as understanding how a number decomposes into prime factors, and having access to these different ways of thinking about numbers is really essential to understanding (rather than just memorizing) operations we perform on numbers.</p>",
        "id": 483896127,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732277020
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Human.20sciences.20type.20questions.20related.20to.20Zulip/near/483022390\">said</a>:</p>\n<blockquote>\n<p>I feel overwhelmed when people write a lot of messages and I don’t have the time to think about what I want to say.</p>\n</blockquote>\n<p>If I had been around earlier I would have branched this topic sooner. Once I'm caught up, I think I will do that anyhow.</p>",
        "id": 483896827,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732277277
    },
    {
        "content": "<p>All done! For anyone catching up later, many intervening messages were moved to <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Teaching.20CT.20before.20university\">this topic</a>.</p>",
        "id": 483898256,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1732277837
    }
]