[
    {
        "content": "<p>I'm enjoying this:</p>\n<ul>\n<li>Alain Badiou, <em><a href=\"http://superdrive.pw/download/B01LYPPH5W\">In Praise of Mathematics</a></em>.</li>\n</ul>\n<p>It's in the form of an interview.</p>",
        "id": 544631094,
        "sender_full_name": "John Baez",
        "timestamp": 1760395788
    },
    {
        "content": "<p>A little piece:</p>\n<blockquote>\n<p>The contemporary mathematician is usually someone who<br>\nworks on an extremely complex and sophisticated regional area of<br>\nspecialization in mathematics. To be on his or her level, that is, to be<br>\nable to talk about it with him or her as an equal, is often something, as<br>\nI said, that less than a dozen people are capable of. Mathematical<br>\nelitism where creativity is concerned is extremely exclusive; it’s the<br>\nmost exclusive of all possible elitisms. Today, given the state of its<br>\ndissemination, you can’t just go into mathematics whenever you feel<br>\nlike. It’s not like inherited wealth: it’s not passed down, and average or<br>\nalready great, or even very great, knowledge isn’t sufficient. As a result,<br>\nmathematics has become very inaccessible. Strictly external references<br>\nexist and are reported in the press: someone who has discovered<br>\nsomething very important will win the Fields Medal, with the approval<br>\nof his tiny community, and, moreover, amid a widespread lack of<br>\ncomprehension.</p>\n<p>When it comes to philosophy, the problem is the exact opposite, since<br>\njust about anyone can be considered a philosopher now. Ever since<br>\nphilosophers have become “new,” people are very undemanding where<br>\nthey’re concerned, even at a basic level, I can assure you! In Plato’s,<br>\nDescartes’, and Hegel’s time, or even in the late nineteenth century, the<br>\nknowledge requirement for claiming you were a “philosopher”<br>\nconcerned virtually all the different types of knowledge and the<br>\npolitical, scientific, and esthetic discoveries of the time, while, today,<br>\nall you need to have are opinions and the right connections in the<br>\nmedia to make people think those opinions are universal, whereas<br>\nthey’re totally banal. Yet the difference between universality and<br>\nbanality should be crucial, after all, for a philosopher.</p>\n</blockquote>\n<p>The \"<a href=\"https://en.wikipedia.org/wiki/New_Philosophers\">new philosopher</a>\" business is a French thing that seems not to have impacted the Anglo-Saxon world very much.</p>",
        "id": 544631203,
        "sender_full_name": "John Baez",
        "timestamp": 1760395912
    },
    {
        "content": "<blockquote>\n<p>So the divergence between mathematics and philosophy also stems<br>\nfrom the fact that philosophy, owing to the shallow, reactionary figure<br>\nof “the new philosopher,” has undergone an incredible trivialization of<br>\nits status. The philosophy media stars are, it must be said, and strictly<br>\nin terms of the knowledge required to talk about what they talk about,<br>\nidiots. In mathematics, they’d be considered the equivalent of a very<br>\naverage high-school senior. This is, incidentally, an important virtue of<br>\nmathematics: it’s impossible to have frauds of that sort in it. But the<br>\nflip side of that virtue is that mathematics has become out of reach, or<br>\nthe object of bitter indifference, because of its elitist isolation from the<br>\nother regimes of knowledge. Obviously, with such a rigorous selection<br>\nprocess, we haven’t had any “new mathematicians,” that’s for sure.<br>\nAnd I don’t see how there could be any. A “new mathematician,” even<br>\ntoday, is someone who proves – either with great difficulty or<br>\nbrilliantly – previously unknown theorems, and you can’t produce<br>\nimitations or fakes of those, it’s absolutely impossible.</p>\n<p>So we’re dealing with a degree of separation between mathematics and<br>\nphilosophy that would have astonished most of our great classical or<br>\nmodern ancestors, many of whom, and some of the most famous ones,<br>\nI should point out, were also great mathematicians. Descartes was a<br>\nfoundational mathematician, the inventor of analytic geometry, which<br>\nis a sort of unification of geometry and algebra: he showed how a curve<br>\nin space, hence a geometric object, can be represented by an equation.<br>\nLeibniz was a mathematical genius, the founder of modern differential<br>\nand integral calculus. The last ones who even came close to them lived<br>\nsometime in the nineteenth century: perhaps Frege, perhaps<br>\nDedekind, perhaps Cantor in some respects, or Poincaré, who was<br>\ncertainly the last great figure of that particular model.</p>\n</blockquote>",
        "id": 544631331,
        "sender_full_name": "John Baez",
        "timestamp": 1760396023
    },
    {
        "content": "<p>This is just sort of snarky chat, but it's fun.  It gets a bit more substantial elsewhere.</p>",
        "id": 544632842,
        "sender_full_name": "John Baez",
        "timestamp": 1760397483
    },
    {
        "content": "<p>I watched a video today by a PhD student in homotopy theory discussing another video by a well-known ultrafinitist who sadly has lots of YouTube presence, but little mathematical to say. The phrase </p>\n<blockquote>\n<p>In mathematics, they’d be considered the equivalent of a very average high-school senior.</p>\n</blockquote>\n<p>feels apt for the ultrafinitist, sadly. (no names, not throwing stones in this place)</p>",
        "id": 544645684,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1760407953
    },
    {
        "content": "<p>And I say that as someone who is very sympathetic to ultrafinitism, as long as one is contributing more than saying \"but InFiNiTy DoEsN't MaKe SeNsE!!1!\"</p>",
        "id": 544656158,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1760415716
    },
    {
        "content": "<p>Indeed, new philosophers are not the best contribution to the world from France.</p>",
        "id": 544660535,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1760418459
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544631094\">said</a>:</p>\n<blockquote>\n<p>I'm enjoying this:</p>\n<ul>\n<li>Alain Badiou, <em><a href=\"http://superdrive.pw/download/B01LYPPH5W\">In Praise of Mathematics</a></em>.</li>\n</ul>\n<p>It's in the form of an interview.</p>\n</blockquote>\n<p>Hi John,  I clicked on your link, but cloudfare wants me to enter a device password to continue, and it keeps asking the same, over and over again...  No way to get rid of it.  Also when I click DOWNLOAD I get all sorts of junk in my Mac.  Doesn't seem to be a safe link...    Nevertheless I just got Badiou's text in French from Anna's archive  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 544661382,
        "sender_full_name": "Jorge Soto-Andrade",
        "timestamp": 1760419091
    },
    {
        "content": "<p>I would also appreciate a less suspect source to download from! I'm curious where Badiou goes with this. Does he suggest that philosophy should become more like maths? Or vice versa? Or is this him explaining why he uses mathematical ideas to guide/structure his philosophy?</p>",
        "id": 544667001,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1760422764
    },
    {
        "content": "<p>His one mention of category theory:</p>\n<blockquote>\n<p>Now, as it turned out, these three logical styles are useful, or even<br>\nnecessary, in certain branches of mathematics. To be sure, mainstream<br>\nmathematics always operates within classical logic. But in the context<br>\nof so-called Category theory, which is roughly the theory of relations<br>\n“in general,” with no pre-specification of given objects, paraconsistent<br>\nlogic is clearly operative. In certain categories similar to set<br>\nmathematics, such as Topoi theory (a topos is a category in which can<br>\nbe defined a relation similar to the classical relation of belonging, the<br>\nfamous ∈), the logic is essentially intuitionistic. Finally, the logical<br>\ncontext has in its turn become variable and no longer imposes<br>\nimmutable laws on the mind, even in mathematics. Philosophy has<br>\nknown this for quite some time: in the Hegelian system, the negation<br>\nof negation is not at all identical to the original affirmation. Its logic is<br>\ntherefore nonclassical. In my own system, the logic of pure being, of<br>\nbeing qua being, is classical, the logic of appearing is intuitionistic, and<br>\nthe logic of the event and of the truths dependent on it is<br>\nparaconsistent in terms of the Subject.</p>\n</blockquote>",
        "id": 544671426,
        "sender_full_name": "David Corfield",
        "timestamp": 1760424750
    },
    {
        "content": "<p>I'll just put the text here:</p>\n<ul>\n<li><a href=\"/user_uploads/21317/75LRfZhDfyo_-7eTvxcRQn0p/In-Praise-of-Mathematics-1st-Edition.pdf\">In Praise of Mathematics 1st Edition.pdf</a></li>\n</ul>\n<p>I got it from SciBooks, which seems like a perfectly respectable site, but I tried to shortcut the process for the rest of you and just give the download link, which may have been meant just for one person.</p>",
        "id": 544686107,
        "sender_full_name": "John Baez",
        "timestamp": 1760429806
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544667001\">said</a>:</p>\n<blockquote>\n<p>I would also appreciate a less suspect source to download from!</p>\n</blockquote>\n<p>See above.</p>\n<blockquote>\n<p>I'm curious where Badiou goes with this. Does he suggest that philosophy should become more like maths? Or vice versa? Or is this him explaining why he uses mathematical ideas to guide/structure his philosophy?</p>\n</blockquote>\n<p>He just thinks that mathematics holds a lot of ideas and methods that philosophers should know.   </p>\n<blockquote>\n<p><em>I’d like for us to explore in greater detail the links between philosophy and mathematics. You mentioned a moment ago that they were an old couple. Plato had already inscribed over the entrance to his Academy: “Let no one ignorant of geometry enter here.” How would you account for this close association?</em></p>\n<p>Mathematics and philosophy have indeed been connected right from their beginnings, even to the point where a variety of particularly famous philosophers – Plato, but also Descartes, Spinoza, Kant, and Searle – categorically declared that without mathematics there would have been no philosophy. So mathematics was conceived of very early on – and entirely explicitly in Plato’s case – as a sort of precondition in order for rational philosophy to come into being. Why? Simply because mathematics exemplified a knowledge process that “held up on its own,” so to speak. In other words, when you’ve got a proof, well, you’ve got a proof! This is nothing like when truth is proclaimed by a priest, a king, or a god. The priest, the king, or the god is right because they’re a priest, a king, or a god. What’s more, if you disagree with them, they’ll let you know about it … Whereas for mathematicians it’s completely different: they have to construct a knowledge process that will be shown to their colleagues and rivals. And if their proof is false, they’ll be told so.</p>\n<p>So from very early on, from the time of ancient Greece, mathematics was a world in which things considered to be true, to be proven, could circulate provided they were validated and accepted by the community of people who were “knowledgeable about it,” and not just because of the authority stemming from the mathematician’s calling himself a “mathematician.” On the contrary, the mathematician was somebody who, for the first time, introduced a universality completely free of any mythological or religious assumptions and that no longer took the form of a narrative but of a proof. Truth based on a narrative is “traditional” truth, of a mythological or revealed type. Mathematics swept aside all the traditional narratives: the proof depended only on a rational demonstration, shown to everyone and refutable in its very principle, so that someone who had put forward a hypothesis that was ultimately proved to be false had to accept that he was wrong.</p>\n</blockquote>\n<div class=\"codehilite\"><pre><span></span><code>\n</code></pre></div>",
        "id": 544689669,
        "sender_full_name": "John Baez",
        "timestamp": 1760430937
    },
    {
        "content": "<blockquote>\n<p><em>When did this capitulation, this “separation” between mathematics and philosophy, occur in historical terms?</em></p>\n<p>In my opinion, there was a turning point that began in the late<br>\nnineteenth century, a turning point that I would term antiphilosophical in a certain way, with brilliant personalities like Nietzsche or Wittgenstein, big stars whose genius I acknowledge but who moved philosophy’s agenda in a direction that had not been its direction since Plato. In particular, it was they who abandoned the idea that the comprehensive and systematic nature of philosophy had to be accepted, and this resulted in the risk of an indifference to mathematics. In my view, this rupture is especially serious in that the mathematics in use from the late nineteenth century on was in fact mathematics that drastically changed many things in the most essential philosophical concepts.</p>\n<p><em>Could you give us an example?</em></p>\n<p>I’ll focus on the concept of infinity, its history, and the contemporary state of the question and its consequences. On this issue alone, breathtakingly new and important research has been carried out in mathematics over the past fifty years. If you’re not familiar with it, what happens is that, when you say the word “infinity,” you actually have no idea what you’re talking about, because the mathematicians have worked on this concept and taken it to an unprecedented degree of complexity. If you don’t know anything about certain theorems from the 1970s or 1980s on the new figures of mathematical infinity, there’s no point in using the word “infinity” – at least in the context of rational thought.</p>\n<p>Likewise, in philosophy “logic” continues to be spoken about, but if you don’t take a close look at what has been going on in logic in terms of its constant formal re-creation, you’ll have a poor and false understanding of the word “logic.” In fact, logic, or rather logics, have become part of mathematics today. I’ll come back to this. But it’s clear that philosophers cannot be unaware of logic, and therefore of mathematized logic today.</p>\n<p>These two examples show that philosophy, if it separates from mathematics, heads for disaster, since a considerable number of the concepts it needs become, simply as a result of ignorance, obsolete.</p>\n</blockquote>",
        "id": 544690946,
        "sender_full_name": "John Baez",
        "timestamp": 1760431302
    },
    {
        "content": "<p>I would have asked him which results about infinity from the 1970s and 1980s he's talking about, to see if he's just bluffing.   The independence of the continuum hypothesis was shown in 1963, so he'd have to be talking about more advanced stuff.   Elsewhere he mentions the work of Woodin, so maybe he means something like that -  but I don't know that work very well, and I'd feel bad if there's really \"no point in using the word \"infinity\"\" without knowing that stuff.</p>",
        "id": 544693193,
        "sender_full_name": "John Baez",
        "timestamp": 1760431918
    },
    {
        "content": "<p>I haven't finished reading the book; so far he might be just showing off and talking up how great mathematics is, as the title <em>In Praise of Mathematics</em> indicates... but I'm still enjoying it.</p>",
        "id": 544693675,
        "sender_full_name": "John Baez",
        "timestamp": 1760432075
    },
    {
        "content": "<p>There's a clear path for a young Badiou today to invest their mathematical attention in category theory and its applications.</p>",
        "id": 544708234,
        "sender_full_name": "David Corfield",
        "timestamp": 1760436496
    },
    {
        "content": "<p>Yes, or even an old Badiou.  How old is Badiou?  Oh, 88.   Maybe I'll let him off the hook and not email him and tell him to study category theory.    I hope this book of his encourages young philosophers to study math.   They will then inevitably meet category theory, at least if they use social media.</p>",
        "id": 544730899,
        "sender_full_name": "John Baez",
        "timestamp": 1760443643
    },
    {
        "content": "<p>It's bad enough having suddenly to learn some double category theory in your early 60s!</p>",
        "id": 544750898,
        "sender_full_name": "David Corfield",
        "timestamp": 1760448881
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544730899\">said</a>:</p>\n<blockquote>\n<p>and tell him to study category theory</p>\n</blockquote>\n<p>Badiou already knows about category theory, cf. his <em>Mathematics of the Transcendental</em> book</p>",
        "id": 544753620,
        "sender_full_name": "Clémence Chanavat",
        "timestamp": 1760449547
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"637053\">Clémence Chanavat</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544753620\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544730899\">said</a>:</p>\n<blockquote>\n<p>and tell him to study category theory</p>\n</blockquote>\n<p>Badiou already knows about category theory, cf. his <em>Mathematics of the Transcendental</em> book</p>\n</blockquote>\n<p>The subtle difference between <em>knowing</em> and <em>knowing about</em>...</p>",
        "id": 544754894,
        "sender_full_name": "fosco",
        "timestamp": 1760449825
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544750898\">said</a>:</p>\n<blockquote>\n<p>It's bad enough having suddenly to learn some double category theory in your early 60s!</p>\n</blockquote>\n<p>Heh, but you were studying n-categories for a long time.</p>",
        "id": 544767595,
        "sender_full_name": "John Baez",
        "timestamp": 1760452754
    },
    {
        "content": "<p>By the way, this passage from Wikipedia makes Badiou sound like a bullshitter:</p>\n<blockquote>\n<p><em>L'Être et l'Événement</em> (English: <em>Being and Event</em>) is a <a href=\"https://en.wikipedia.org/wiki/Philosophy\">philosophy</a> book by Alain Badiou, published in January 1988 by <a href=\"https://en.wikipedia.org/wiki/%C3%89ditions_du_Seuil\">Éditions du Seuil</a>.  It uses mathematical <a href=\"https://en.wikipedia.org/wiki/Set_theory\">set theory</a> in its reasoning, using the <a href=\"https://en.wikipedia.org/wiki/Zermelo%E2%80%93Fraenkel_set_theory\">Zermelo–Fraenkel axioms</a> and the <a href=\"https://en.wikipedia.org/wiki/Continuum_hypothesis\">continuum hypothesis</a> extensively.</p>\n</blockquote>\n<p>I guess I just don't believe you can use the ZF axioms extensively to good effect in this sort of book.</p>",
        "id": 544825648,
        "sender_full_name": "John Baez",
        "timestamp": 1760471415
    },
    {
        "content": "<blockquote>\n<p>But philosophy has always been concerned about the problem of the<br>\nmultiplicity of languages, since it can always wonder: “What does my<br>\nthinking owe to this language that is particular? Doesn’t the<br>\nparticularity of a language make my supposedly universal discourse<br>\nless universal than it aspires to be?” </p>\n</blockquote>\n<p>this sounds to me a lot like stuff we talk about here.. in terms of \"models of a theory\", or Galois theory, Kleinian geometry etc. But i'm wondering what is the philosophy jargon for what Badiou is saying here? Is it one of those words like \"ontology\"? (i can never remember what this means...)</p>",
        "id": 545409662,
        "sender_full_name": "Simon Burton",
        "timestamp": 1760635647
    },
    {
        "content": "<p>In philosophy, ontology is the study of what sorts of things \"exist\", and more fundamentally what it <em>means</em> to \"exist\" or \"be\".   \"Onto-\" is a Greek root meaning \"being\".</p>\n<p>I don't think that's the main thing Badiou is addressing here, though there's been a big discussion in philosophy about how our ontology depends on the language we're using, and how <em>much</em> it depends.   Here he seems to be pointing us to the more general issue of <a href=\"https://en.wikipedia.org/wiki/Linguistic_relativity\">linguistic relativity</a>.</p>",
        "id": 545439072,
        "sender_full_name": "John Baez",
        "timestamp": 1760646339
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/544690946\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>These two examples show that philosophy, if it separates from mathematics, heads for disaster, since a considerable number of the concepts it needs become, simply as a result of ignorance, obsolete.</p>\n</blockquote>\n</blockquote>\n<p>I wonder if he would agree the converse is also true: often mathematics without philosophy, besides the formal and most utilitaristic aspects, is quite dull.</p>",
        "id": 546231036,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1761051904
    },
    {
        "content": "<p>Btw I learned of Badiou and his love of categories from <span class=\"user-mention\" data-user-id=\"450647\">@Gabriel Tupinambá</span>. He and <a href=\"https://www.theoreticalpractice.com/\">the STP group</a> are very fond of Badiou's <em>Logic of Worlds</em>, afair.</p>",
        "id": 546231794,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1761052082
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/In.20praise.20of.20mathematics/near/546231036\">said</a>:</p>\n<blockquote>\n<p>I wonder if he would agree the converse is also true: often mathematics without philosophy, besides the formal and most utilitaristic aspects, is quite dull.</p>\n</blockquote>\n<p>Here's André Weil taking \"metaphysics\" in a certain way that's more adequate for mathematics: <a href=\"http://denise.vella.chemla.free.fr/transc-Weil-metaphysique-1960.pdf\">De la métaphysique aux mathématiques</a>.</p>",
        "id": 546383120,
        "sender_full_name": "David Corfield",
        "timestamp": 1761118078
    },
    {
        "content": "<p>André Weil says</p>\n<blockquote>\n<p>Les lois non écrites de la mathématique moderne interdisent,<br>\nen effet, de publier des vues métaphysiques de cette espèce. Sans doute est-ce mieux<br>\nainsi ; autrement on serait accablé d’articles encore plus stupides, sinon plus inutiles,<br>\nque tous ceux qui encombrent à présent nos périodiques.</p>\n</blockquote>\n<p>In english (google translate)</p>\n<blockquote>\n<p>The unwritten laws of modern mathematics prohibit,<br>\nindeed, the publication of metaphysical views of this kind. It is doubtless better this way; otherwise we would be overwhelmed with articles even more stupid, if not more useless,<br>\nthan all those currently cluttering our periodicals.</p>\n</blockquote>\n<p>This one is harsh, but funny.</p>",
        "id": 546500378,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1761149868
    },
    {
        "content": "<p>Weil had strong opinions outside the strict mathematical that I think I disagree with more often than not.</p>",
        "id": 546570274,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761178296
    }
]