[
    {
        "content": "<p>He does not belabor the point. </p>\n<p>He assumes that we are not privy to the inner workings of other people's minds. But we are at a loss to interpret the movement of people's bodies and the noises they make without presuming that they are acting. That is, that they have ends they are aiming at, they are using means to attain those ends. The reason they aim at those ends is that they perceive that the change in the state of the world is preferable than the alternative. </p>\n<p>It is in this limited and fairly abstract sense that we \"know\" what people are doing when they act. The main point is that we cannot interpret human action from the physicist's perspective.</p>\n<p>This also extends to science itself. We interpret theories about the world in the context of them being created by acting rational beings. We understand theories not on the basis of laws of brain chemistry but on the basis of laws of logic.</p>",
        "id": 533993542,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755008759
    },
    {
        "content": "<p>How do I delete this <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span></p>\n<p>Posted in the wrong location</p>",
        "id": 533999542,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755010626
    },
    {
        "content": "<p>You can delete a post of yours by clicking on the 3 vertical gray dots to the right of your post and clicking \"delete\".</p>",
        "id": 534005601,
        "sender_full_name": "John Baez",
        "timestamp": 1755012520
    },
    {
        "content": "<p>Or a @moderators can do it if they're on browser rather than in the mobile app (as I currently am)</p>",
        "id": 534050590,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1755030317
    },
    {
        "content": "<p>Yeah, I'm on the mobile app, which I don't know how to use apparently <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span></p>",
        "id": 534063601,
        "sender_full_name": "Ondrej Dyck",
        "timestamp": 1755037614
    }
]