[
    {
        "content": "<p><a href=\"https://youtu.be/vtIzMaLkCaM?t=3015\">https://youtu.be/vtIzMaLkCaM?t=3015</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"vtIzMaLkCaM\" href=\"https://youtu.be/vtIzMaLkCaM?t=3015\"><img src=\"https://uploads.zulipusercontent.net/d8db8950d035a0e97e656ffd7759fede53d120bf/68747470733a2f2f692e7974696d672e636f6d2f76692f7674497a4d614c6b43614d2f6d7164656661756c742e6a7067\"></a></div><p><span class=\"user-mention silent\" data-user-id=\"424412\">Patrick Nicodemus</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/near/432309584\">said</a>:</p>\n<blockquote>\n<p>One thing I want to point out (not going to rewatch it right now so excuse errors/fabrications) is that at some point in the middle of the video he starts quoting some Marxist philosopher verbatim, maybe Laruelle? The quote is that the written word \"takes the form of value.\" This is an observation in a long line of Marxist sociology of value-form theory which is all about the dual nature of commodities as economic-material objects and as social objects (i.e., as bearers of value as a social relationship between people).</p>\n</blockquote>\n<p>Coming back to this post, I just had to go through it again and find that quote by a Marxist philosopher I mentioned. It wasn't Laruelle, it was Jean-Francois Lyotard.</p>\n<p><a href=\"http://Timestamp%2050:15\">https://youtu.be/vtIzMaLkCaM?t=3015</a></p>\n<blockquote>\n<p>The idea that language has only one function seems to me impoverished beyond measure. You have to think, \"Have --\" -- I urge you to think of language as having many different functions. The function of an academic piece is not to communicate your ideas, it's to change the ideas of an existing community. Now, sometimes you do that by communicating your ideas, sometimes you don't. But understand what it's for, and understand that your training has been all about revealing your head. You've been trained, it's in your blood that that's what you're supposed to do when you write, and that's just not the case. So, go to the bottom one (picks up paper, begins reading aloud from a passage of Jean-Francois Lyotard).</p>\n<blockquote>\n<p>Welcome to the world, the new world. We may thus expect a thorough exteriorization of knowledge with respect to the knower at whatever point he or she may occupy in the knowledge process. The old principle that the acquisition of knowledge is indissociable from the training of minds or even of individuals, is becoming obsolete, and will become ever more so.]</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>The relationship - Here's what he's talking about. When I was in school and somebody said \"Oh, she's amazing. This professor, she's professor so-and-so, she's AMAZING!\"<br>\nWhat we talked about? We talked about how much she had in her head. We said: She knows more about this - she's <em>forgotten</em> more than I will ever learn.<br>\nAnd what Lyotard is saying here is, that knowledge no longer has anything to do with the inside of individual heads. Now you talk about somebody being a great professor, what are you talking about, you're talking about what they have he or she has done in this exterior space between heads. Now it's not how smart they are, how much they know - it's what they've done in the space between heads, what they've exteriorized, what they've done out there. That's your job. It's not to reveal the interior of your head, it's to change what's going on in the spaces between heads, or however much you want to talk about the construction of knowledge. This is very unpleasant to lots of people.</p>\n<blockquote>\n<p>The relationship between the suppliers and users of knowledge to the knowledge they supply and use - that is, your relationship to your own knowledge - is now tending and will increasingly tend to assume the form already taken by the relationship of commodity producers and consumers to the commodities they produce and consume, that is, the form of value.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Your relationship to your own knowledge is the same as a relationship of a farmer to the wheat, or a miner to the coal. The relationship is the form of value and I bet for many of you that doesn't feel very good. People don't like that. I get that they don't like it, but I can tell you that's the way it is.</p>\n</blockquote>\n<p>The form of value is discussed in the book \"Essays on Marx's Theory of Value\" by I.I. Rubin if anybody wants to get some background on what he's talking about here.</p>",
        "id": 568822837,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1768834968
    },
    {
        "content": "<p>What I’m getting out of that is essentially “your knowledge doesn’t really matter if it’s stuck in your head”, which is quite unobjectionable. But I can’t make sense of what Lyotard is making a big deal of as <em>new</em> in all this. Has there indeed been a “thorough exteriorization of knowledge”? Perhaps, if this means the trend to put more knowledge in books, then onto computers, as history has unfolded. But then he seems to claim that this implies minds have less need to be trained, now, or something? I’m having trouble picking something out of that that’s not nonsense.</p>",
        "id": 568910898,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768861983
    },
    {
        "content": "<p>It is rather opaque, but what I seem to get out of it is this: individuals developing their own idiosyncratic expertise and passing it on to other individuals are having a harder time fitting into and being rewarded in the economy in the short term, compared to people who systematize and externalize their knowledge as teaching materials so that \"anyone\" can learn it, or even as artifacts like computer programs so that \"anyone\" can apply it without even learning it.  At the same time, people who do this reduce their own long-term value, as now \"anyone\" can take their place.  So they then have to get on this treadmill of producing knowledge and externalizing it.  In the past as you produced more knowledge you became more valuable as a person: the knowledge you produced was human capital, and your value would grow with the <em>amount</em> of knowledge you produced.  Now, increasingly, the knowledge you produce is a commodity, and your value only grows with the <em>rate</em> at which you produce knowledge.</p>\n<p>This change has upsides for the world as a whole, in that now all this knowledge that used to be locked up in individuals or small groups is more widely available and at less risk of being lost.  But for the relative position in society and economic security of knowledge producers, there are nothing but downsides.</p>",
        "id": 568928876,
        "sender_full_name": "James Deikun",
        "timestamp": 1768873877
    },
    {
        "content": "<p>3 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"233322\" href=\"/#narrow/channel/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/with/495335629\">#practice: communication &gt; On how to write a paper</a> by <span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span>.</p>",
        "id": 569006231,
        "sender_full_name": "Notification Bot",
        "timestamp": 1768910382
    },
    {
        "content": "<p>In this vein, the trend towards automating the production of knowledge (or at least attempts to do such things) mirror the historical trend towards industrialisation in the production of commodities and the corresponding reduction in value of the output of human producers of knowledge. <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span></p>",
        "id": 569006811,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1768910551
    },
    {
        "content": "<p>I guess this is like how industrialization reduces in the value of all other individually produced item, e.g. someone trying to make a living selling hand-crafted mugs is now competing against fairly cheap mass-produced mugs.   For mugs, the trick people try is selling mugs that are clearly too quirky to be mass-produced.    This is the \"boutique\" model, where you make things that signal some sort of status, and hope that people will buy them if they have some money to spare and are willing to spend it on status.</p>\n<p>So it's possible some sort of human knowledge producers will move to the boutique model.</p>",
        "id": 569092355,
        "sender_full_name": "John Baez",
        "timestamp": 1768931197
    },
    {
        "content": "<p>That helps to clarify the assertion, thanks, James. It still seems quite far from a proposition that I could actually go and check the truth of, let alone one whose truth has already been checked. In particular, for us as mathematicians, I'm not sure I see how our knowledge is more commoditized in this sense than it would have been for past generations. The idea rhymes in part with the \"publish or perish\" paradigm, but I think that's not what it's trying to claim, as it's not at all true that rapidly-publishing scientists externalize so much of their knowledge that they're now easily replaced. We also see that, though there's more and more easily accessible mathematical knowledge available to almost everyone in the world, in continues to be the case that almost nobody actually \"takes the place\" of a mathematician without being trained in a way that's not so different than how, say, Newton was trained. This is just the area I know best, of course many areas exist, but it's best to avoid Gell-Mann amnesia. So I'm quite unsure whether I suspect this change has actually occurred at all.</p>",
        "id": 569105297,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768935243
    },
    {
        "content": "<p>It's true that if the people trying to get AI's to automate research who Morgan references were to succeed, then something like this decoupling would seem to follow.</p>",
        "id": 569105409,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768935277
    },
    {
        "content": "<p>I'm not sure what Lyotard is claiming exactly, but I'm positive that isn't what the speaker Larry McEnerney is claiming. At 28:30 he states \"there are conversations moving through time, and there's a bunch of people, and they get to claim what knowledge is\", after giving an example of a PhD candidate getting denied their PhD for summarizing 30 years of a women's personal journals.</p>\n<p>My understanding of McEnerney's view, is your job as a grad student is to write stuff other academics will be willing to pay you to read. Which, he claims, requires socially constructed \"interest\" far more than \"literal accuracy\". So my, very philosophically impoverished, take on threading Marx into this is, it probably would've been better to reference Hegel's dialectics instead. </p>\n<p>I wouldn't be surprised if the Marxist intended something like ideas put into books make the value physical in a way a publisher can exploit, etc. But McEnerney is saying something like - the professor, or even the book, are only creating value if the listener's or reader's mind is being changed. In his view, students think of Euclid as good because it was a book of \"true facts\", but he believes they should instead change their perspective to \"it changed minds\".</p>\n<p>I would bet McEnerney would argue AI text generation is prone to fall for the fallacy \"more written down is better\". That the success of AI text generation for academics will be measured by the extent to which academics actually have their minds changed by the generated text they read.</p>\n<p>Anyways, the views folks have on the Marxist takes may be accurate and interesting, but I thought it'd be useful to comment on the presenter's view because I think the way he shared the quotes risks confusion.</p>",
        "id": 569114029,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1768938122
    },
    {
        "content": "<p>Thanks, Alex. That seems similar to the gloss I initially gave, and continues to seem unobjectionable, though granted some people do seem confused about whether it would be useful to, say, have AI generating lots of papers full of \"true facts.\"</p>",
        "id": 569118258,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768939703
    },
    {
        "content": "<p>To the extent that that's a productive interpretation, the Lyotard reference seems quite irrelevant. It reminds my more of Thurston's quite down-to-earth <em>Proof and Progress</em> within mathematics, or within philosophy of Searle's speech-act theory.</p>",
        "id": 569118449,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768939754
    },
    {
        "content": "<p>The 'we aim for understanding' claim of Thurston very much came to my mind. I used to joke when I was in my first postdoc and teaching first-year engineers that I was in the business of rewiring people's brains. Ideally I was changing their neural pathways so that they understood the material in some fashion, not merely that they could reproduce the true facts onto the page.</p>",
        "id": 569151544,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1768956161
    },
    {
        "content": "<p>Also, I don't think producing mathematical knowledge at the research level is quite comparable to producing for example a cookbook with personally-invented recipes. The difference in the number of people who can then use (or even intelligently reproduce with modifications, in their own book, or on their blog or whatever) the information in the latter, and the people who can know what to do with the former is vast. Perhaps it's merely a matter of degree, though.</p>",
        "id": 569157231,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1768959960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span> wrote:</p>\n<blockquote>\n<p>In particular, for us as mathematicians, I'm not sure I see how our knowledge is more commoditized in this sense than it would have been for past generations.</p>\n</blockquote>\n<p>Here's one way in which it is.  Someone gave me a subscription to Claude, and I can type in </p>\n<blockquote>\n<p>What's the K-theory of S^3?</p>\n</blockquote>\n<p>and get</p>\n<blockquote>\n<p>The K-theory of S³ (the 3-sphere) is:<br>\n<strong>K⁰(S³) ≅ ℤ</strong> (the integers) <strong>K¹(S³) ≅ 0</strong> (the trivial group)</p>\n<p>Here's the reasoning:</p>\n<p>Since S³ is a compact space, we can use the reduced K-theory, which for spheres gives us:</p>\n<p>K̃⁰(Sⁿ) ≅ ℤ if n is odd, and 0 if n is even K̃¹(Sⁿ) ≅ ℤ if n is even, and 0 if n is odd</p>\n<p>For S³ (where n = 3 is odd), this gives K̃⁰(S³) ≅ ℤ and K̃¹(S³) ≅ 0.</p>\n<p>The unreduced K-theory is related by K⁰(S³) = K̃⁰(S³) ⊕ ℤ ≅ ℤ ⊕ ℤ, but when we say \"the K-theory,\" we typically mean the reduced version, which is just ℤ in degree 0.</p>\n<p>This result reflects the fact that S³, being an odd-dimensional sphere, has interesting vector bundle structure. The generator of K̃⁰(S³) comes from considering the difference between a nontrivial vector bundle and a trivial one—for instance, related to the quaternionic Hopf fibration S³ → S⁷ → S⁴.</p>\n</blockquote>",
        "id": 569158321,
        "sender_full_name": "John Baez",
        "timestamp": 1768960739
    },
    {
        "content": "<p>This answer kind of sucks in some ways (e.g. it gives two contradictory formulas for K⁰(S³), and I don't think the quaternionic Hopf fibration is very relevant here), but the fact is that anyone can pay to access mathematical knowledge this way and never talk to a human.</p>",
        "id": 569158638,
        "sender_full_name": "John Baez",
        "timestamp": 1768960939
    },
    {
        "content": "<p>Perhaps it's a bit like the difference between getting pants the old way from a tailor and buying cheap  mass-made pants that don't fit very well.</p>",
        "id": 569158898,
        "sender_full_name": "John Baez",
        "timestamp": 1768961129
    },
    {
        "content": "<p>mathematical-ish \"knowledge\" (with truthiness, if not actual truth)</p>",
        "id": 569158913,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1768961134
    },
    {
        "content": "<p>Sure, John, although on the one hand, this video is far pre-AI, and on the other, if AI is commoditizing our knowledge, shouldn’t we be getting paid? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 569162497,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768963709
    },
    {
        "content": "<p>Yeah, I wasn't trying to guess what Lyotard meant - if I were, I might have watched the video.  <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<blockquote>\n<p>if AI is commoditizing our knowledge, shouldn’t we be getting paid?</p>\n</blockquote>\n<p>\"Should\" in what sense?   Morally yeah, but I think commoditizing a product often means the original producers get shafted.   Like the cheap factory-made Mexican knockoffs of Navajo rugs - the Navajo aren't getting a cent from those!</p>",
        "id": 569163194,
        "sender_full_name": "John Baez",
        "timestamp": 1768964330
    },
    {
        "content": "<p>Cutting-edge mathematical knowledge isn't getting commodified yet to the extent of knowledge in some other fields, but it is getting notably <em>more</em> commodified.  With new modalities for teaching materials like blog posts and routine recording of talks, plus open access, preprints, and even highly bundled access to the old journals, while it does still really matter if you were a graduate student, it matters a lot less than it used to <em>whose</em> graduate student you were, and to the extent that it does matter, mentoring skills matter more and particular expertise matter less than they used to.  I think using the example of Newton is actually deceptive here, because there were a lot less different subfields of mathematics in those days and a lot less mathematical knowledge overall, so they were in a more similar situation to us in some ways than people in the intervening years.</p>",
        "id": 569170123,
        "sender_full_name": "James Deikun",
        "timestamp": 1768970044
    },
    {
        "content": "<p>Hmm. I’m not sure I find the claim that it doesn’t matter as much whose student you were very plausible. Nor am I sure that there’s some past state in which good graduate advising meant communicating expertise in some way distinct from good mentoring which is now different. To mention Thurston again, he was a canonical example of a top-notch mentor, but not in a way at all extricable from his particular expertise in geometry.</p>",
        "id": 569170300,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1768970211
    },
    {
        "content": "<p>It's not like it was a sudden cliff, at least so far.  But it's generally true, in all fields of knowledge, that the number of idiosyncratic, direct person-to-person interactions needed between production of knowledge and its eventual application is trending downward.</p>\n<p>A field that probably has fallen off a cliff in this way is home cooking.  With food blogs and especially vlogs it's now possible to be properly initiated in a completely different cooking tradition than the one your family passed down, and without even actually meeting a cook from that tradition.  The closest you really have to come now is getting a sense for the taste profile from restaurants, all the actual techniques you can pick up from blogs/vlogs.</p>",
        "id": 569171537,
        "sender_full_name": "James Deikun",
        "timestamp": 1768971219
    },
    {
        "content": "<p>Yes, it's a much clearer point about cooking. It makes sharper the question of how much implicit knowledge is still getting dropped via the online media. I'm still not sure it's the case that many people are becoming successful restauranteurs via YouTube training without direct apprenticeship. But I have personal opinions about how to avoid breaking the gastrique in your sauce a l'orange which would have been pretty unimaginable to my family two generations ago. I guess it's similar in math and perhaps everywhere: the commoditization process favors the more legible and more enjoyable sides of knowledge at the cost of more implicit or more boring-but-important ones. So 3Blue1Brown is extremely popular with genuinely high-quality material, but there still don't seem to be many people actually learning how to write a real paper on their own.</p>",
        "id": 569328042,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1769020577
    },
    {
        "content": "<p>If anything, Grant Sanderson at 3b1b has taught people it's possible to make high-quality mathematics videos, showed them how my example, and also shared his tools (<a href=\"https://github.com/3b1b/manim\">manim</a> which led to the <a href=\"https://pypi.org/project/manim/\">community edition</a>) that other people now also use for explaining mathematical ideas on YouTube.</p>",
        "id": 569381570,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1769040065
    },
    {
        "content": "<p>The goal was I think in his case explicitly raising the bar for other people to create an ecosystem of knowledge sharing, promoting good mathematics communication generally.</p>",
        "id": 569382098,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1769040275
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438995\">James Deikun</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Knowledge.20as.20value/near/569171537\">said</a>:</p>\n<blockquote>\n<p>A field that probably has fallen off a cliff in this way is home cooking.  With food blogs and especially vlogs it's now possible to be properly initiated in a completely different cooking tradition than the one your family passed down, and without even actually meeting a cook from that tradition.  The closest you really have to come now is getting a sense for the taste profile from restaurants, all the actual techniques you can pick up from blogs/vlogs.</p>\n</blockquote>\n<p>This is a fantastic example of what  Bernard Stiegler’s book <em>For a New Critique of Political Economy</em> referred to as hypomnesis, and it is where the Marxism connects. Steigler makes the point that hypomnesis' tendency to commodify knowledge lends itself to value alienation. This is in contrast to <em>anamnesis</em> applied generationally, exactly like you mentioned here, where know-how is passed down generation to generation. My understanding of the argument is that knowledge exteriorization allows for turning \"work\" into a process of unskilled tasks, which leads to worker alienation, while anamnesis leaves the worker in control of their productive means.</p>",
        "id": 575358771,
        "sender_full_name": "dan pittman",
        "timestamp": 1771868816
    },
    {
        "content": "<p>Apparently I mentioned this a little shy of two years ago in the preceding discussion <span aria-label=\"man facepalming\" class=\"emoji emoji-1f926-200d-2642\" role=\"img\" title=\"man facepalming\">:man_facepalming:</span></p>\n<p>(lightly edited to avoid superfluous mentions)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"284213\">dan pittman</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/near/437695678\">said</a>:</p>\n<blockquote>\n<p>A few years ago I read Bernard Stiegler's <em>A New Critique of Political Economy</em>, a book that really expands on what you're getting at. Stiegler talks about writing itself being a tool for oppression, that the abstraction of the written word is what paves the way for the separation of the capitalist and working classes—this is in contrast with a more apprentice-based passing on of information, where productivity's teleology is for the flourishing of the producer, not in service of the accumulation of capital for the capitalist.</p>\n</blockquote>",
        "id": 575361198,
        "sender_full_name": "dan pittman",
        "timestamp": 1771869513
    }
]