[
    {
        "content": "<p>Anyone else fascinated and bewildered by Lawvere's excursions into Hegel? A lot of the CT in them is still over my head, but I have studied Hegel (though I'm not an expert). What do mathematicians make of this stuff?</p>",
        "id": 242456638,
        "sender_full_name": "Josh Lalonde",
        "timestamp": 1623511886
    },
    {
        "content": "<p>I'd say about 99% of category theorists don't care about it at all, but a few people who have dug into it find it really interesting.</p>",
        "id": 242461031,
        "sender_full_name": "John Baez",
        "timestamp": 1623517333
    },
    {
        "content": "<p>One of those people is Urs Schreiber, and he writes a lot on the nLab, so you can find a fair amount about Hegel and category theory on the nLab.</p>",
        "id": 242461043,
        "sender_full_name": "John Baez",
        "timestamp": 1623517379
    },
    {
        "content": "<p>But I would say: learn relevant category theory before trying to see whether, or how, it's connected to Hegel's ideas.   You'll need to understand the category theory pretty well before having a chance to see how it's connected to Hegel.  </p>\n<p>(Personally I find the category theory itself a lot more interesting, so I'm never very motivated to read Hegel, or think about Lawvere's remarks on Hegel.)</p>",
        "id": 242461126,
        "sender_full_name": "John Baez",
        "timestamp": 1623517490
    },
    {
        "content": "<p>I haven't actually tried reading Hegel, but what I've heard of it through Urs doesn't really sell me that there's anything going on there.</p>",
        "id": 242475388,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1623535990
    },
    {
        "content": "<p>Hegel can be very difficult to read, and so I have not read much of him. Especially as I was brought up in the Analytic tradition founded by Betrand Russell on his work \"Principia Mathematica\". Russell valued mathematical clarity over all, and opposed it to what he saw as (British) Hegelian obscurity. But Russell also brought in the theory of types, which Urs Schreiber states \"was later recognised as formalising the Hegelian notions Russell had meant to supercede\" <a href=\"https://twitter.com/SchreiberUrs/status/1403312452494925824\">https://twitter.com/SchreiberUrs/status/1403312452494925824</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/SchreiberUrs/status/1403312452494925824\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/84f0025a8170dc239a636a5e7aa02d9a8fc93bb9/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313032313336333130313337383237333238312f6b773576307a334d5f6e6f726d616c2e6a7067\"></a><p><a href=\"https://twitter.com/DavidCorfield8\">@DavidCorfield8</a> <a href=\"https://twitter.com/lastpositivist\">@lastpositivist</a> …it was Russell who introduced type theory \n<a href=\"https://t.co/Q2uvrQxByV\">http://ncatlab.org/nlab/show/type+theory#Russell03</a>\nin an effort to lay foundations for maths &amp; analytic philosopy;\nthe very types (aka object) which were later recognized\n<a href=\"https://t.co/1Ogcn6vOWr\">http://ncatlab.org/nlab/show/objective+and+subjective+logic</a>\nas formalizing the Hegelian notions Russell had meant to supercede!</p><span>- Urs Schreiber (@SchreiberUrs)</span></div></div>",
        "id": 242502394,
        "sender_full_name": "Henry Story",
        "timestamp": 1623580020
    },
    {
        "content": "<p>Russell's mathematics also failed to take account of Modalities, which he relegated to magical thinking.  Yet modalities were later mathematicised from 1954 onwards with Kripke, Hintikka, David Lewis, etc... and that turned analytic philosophy on its head. Recent work in Category Theory states that <a href=\"https://academic.oup.com/comjnl/article-abstract/54/1/31/336864\">Modal Logics are Coalgebraic</a>. And even more recent work by <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> I believe develops modalities in HoTT. </p>\n<p>A student of David Lewis, <a href=\"https://en.wikipedia.org/wiki/Robert_Brandom\">Robert Brandom</a> who started working on inconsistency, and made his name in the merging of analytic philosophy and pragmatism, has a way of explaining Hegel that dissipates a lot of the obscurity. Many of his lectures are online such as this  <a href=\"https://www.youtube.com/watch?v=eK6kmLIixnI\">18 lecture series on Hegel at the university of Leipzig</a> where by minute 10 he is looking at Hegel's critique of representationalism, whose source is the discovery by Galileo and Descartes of the relation (isomorphism) between algebra and geometry.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"eK6kmLIixnI\" href=\"https://www.youtube.com/watch?v=eK6kmLIixnI\"><img src=\"https://uploads.zulipusercontent.net/3933fd274865cf7d8e2a743a54d028f0f395026c/68747470733a2f2f692e7974696d672e636f6d2f76692f654b366b6d4c4969786e492f64656661756c742e6a7067\"></a></div><p>In his book \"Between Saying and Doing\" Brandom invokes a relation between language and action where he hints at a relation to Category Theory. Perhaps  somewhere around the algebra/colagebra duality? (that would make a lot of sense) It would be interesting to pick that up.</p>",
        "id": 242502773,
        "sender_full_name": "Henry Story",
        "timestamp": 1623580452
    },
    {
        "content": "<p>I really dislike analytic philosophy, while I found Hegel enlightening from multiple points of view.</p>",
        "id": 242508668,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623588517
    },
    {
        "content": "<p>The reason for my disliking is that at its core analytic philosophy often ends up being mathematics in disguise. Given this, I'd go for the real thing.</p>",
        "id": 242508754,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623588610
    },
    {
        "content": "<p>Continental philosophy is full of obscure concepts, metaphysics, stuff that is difficult/impossible to formalize. Still, it's stuff that makes you think and get new perspectives. A mathematician reading continental philosophers should either discard everything as nonsense (the lazy reaction) or find exciting challenges everywhere</p>",
        "id": 242508804,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623588698
    },
    {
        "content": "<p>What Lawvere seems to be saying in the article linked to by Urs, is that Hegel had gotten some deep mathematical intuitions right. So that would make him a mathematician too :-) And Russell did not have the mathematical/logical tools to understand modalities, so he was less of a mathematician than usually thought.  Now Analytic philosophers are working with insight on Hegel too. </p>\n<p>Perhaps it is the process that is important.</p>",
        "id": 242509189,
        "sender_full_name": "Henry Story",
        "timestamp": 1623589224
    },
    {
        "content": "<p>What I mean is that the process of analytic philosophy is one of formalization. Better definitions, being very precise about the language used, etc etc</p>",
        "id": 242511046,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623591498
    },
    {
        "content": "<p>It always seemed to me like doing mathematics with the wrong tools</p>",
        "id": 242511059,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623591513
    },
    {
        "content": "<p>Continental philosophy is completely different, which is why many scientists do not like it. But, personally, I already do mathematics. If I look to another field, I'm interested in what I cannot easily do</p>",
        "id": 242511083,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623591556
    },
    {
        "content": "<p>Which is why the insights of continental philosophy always seemed more captivating to me</p>",
        "id": 242511089,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623591570
    },
    {
        "content": "<p>Well that was (kind of) Gian-Carlo Rota's opinion in his essay on the 'pernicious influence of mathematics upon philosophy'.</p>",
        "id": 242511227,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1623591726
    },
    {
        "content": "<p>Aside from his work in combinatorics, he wrote quite a few essays (and apparently gave lectures at MIT) on phenomenology</p>",
        "id": 242511239,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1623591771
    },
    {
        "content": "<p>I have always been crossing borders...  I started doing a Philosophy Baccaleaureat in France, then did Maths A levels then went to University to studied analytic philosophy around 1988 (because I had learn programming very early and got interested in AI and symbolic machines). The first year of Analytic Philosophy got me very depressed, but I emerged from that by discovering modal logic and Ruth Garett Millikan's Language Thought and Other Biological Categories. I then ran out of money and ended up pretty much on the street, so I went to computing, did an MSC at Imperial and then ended up at AltaVista in the 1990s where I worked on the BabelFish machine translation service. Then I worked at Sun on the Semantic Web, and realised that this was actually philosophical engineering (a phrase Tim Berners-Lee coined). As I was in France I somehow went to Bernard Stiegler's Seminars (he was a student of Derrida) and so got a  to catch up on the continental view. Programming the semantic web led me to Category Theory and here I am. <br>\nThere are good things to get from all these areas as well as bad things to avoid.</p>",
        "id": 242511359,
        "sender_full_name": "Henry Story",
        "timestamp": 1623591946
    },
    {
        "content": "<p>What I like about (early) analytic philosophy is not the content per se (since I agree that much of it should be done as mathematics) but in the sense the meta-content: the choice of questions to ask. In that, even quite old analytic philosophy is still way ahead of mathematics itself. In some sense, mathematics is strongly catching up \"just now\", forced by the advent of both symbolic computation and interactive theorem provers to re-examine some fundamental ideas.</p>\n<p>Of course, thinking about equality was one of the first big questions, which we know has been massively resurgent with the rise of HoTT. But also, denotational semantics is omnipresent in the writing of Frege and Russell (of course they don't call it that). It took until Lawvere's syntax-semantics adjuntions for non-logicians to look at syntax as an object of study at all. And even then, it seems it's only computer scientists who generally study it. As another example, <em>substitution</em> is recognized as a fundamental operation in CS (and the root of the above adjunction), and section 1.1 of Taylor's \"Practical Foundations of Mathematics\", but still not much of a concept in 'mathematics'. <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>α</mi></mrow><annotation encoding=\"application/x-tex\">\\alpha</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.0037em;\">α</span></span></span></span>-equivalence is another linked example. It is mostly hand-waved away in first-year calculus, and never mentioned again, even though a proper formalization turns out to be extremely difficult. The fact that asking the question about the mathematics <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>α</mi></mrow><annotation encoding=\"application/x-tex\">\\alpha</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.0037em;\">α</span></span></span></span>-equivalence eventually leads one to Nominal Sets and the Schanuel Topos should be a strong signal of a massive missed opportunity.</p>\n<p>So many concepts that arise naturally when implementing mathematics are still under-explored in mathematics : intension vs extension, <a href=\"https://mathoverflow.net/questions/29413/defining-variable-symbol-indeterminate-and-parameter\">symbol vs variable vs indeterminate vs parameter</a>, richer concepts of \"plugging in\" than substitution, the difference in reasoning about open versus closed terms, structural properties of theory presentations, the exact meaning of 'definition', having let bindings be part of the vocabulary instead of being in the meta-vocabulary [both of these have non-trivial size implications that lead to interesting questions], and I'm sure I could find a dozen more (starting at the MO question <a href=\"https://mathoverflow.net/questions/56677/what-notions-are-used-but-not-clearly-defined-in-modern-mathematics?noredirect=1&amp;lq=1\">What notions are used but not clearly defined in modern mathematics</a>).</p>\n<p>But the present is quite exciting. In 1998, when I was first asking such questions (because I was trying to find some explanation that would guide me in fixing 'deep' bugs in Maple), there was little available. In 2010, I <a href=\"https://mathoverflow.net/questions/29413/defining-variable-symbol-indeterminate-and-parameter\">asked</a> about symbol vs ... etc, and got few answers, with the best one from a computer scientist! But, in parallel, the <a href=\"https://ncatlab.org/nlab/show/computational+trilogy#rosetta_stone\">computational trinity</a> was really being developed. It extremely edifying to compare the 3 columns and see the concepts that are 'simple' in one that correspond to really complicated or 'recent' concepts in 1 or 2 of the others. </p>\n<p>I'll even tout a bit of my own work: if instead of looking at 'logical equivalence' as a fundamental notion of \"the same\", one takes inspiration from the preservation of <a href=\"https://en.wikipedia.org/wiki/Quantum_information\">Quantum Information</a> as a fundamental consideration, port it from physics to computation, you end up with a reversible programming language - a simple exposition is in <a href=\"https://arxiv.org/abs/1811.03678\">Embracing the Laws of Physics: Three Reversible Models of Computation</a> (accepted 3 years ago, yet to be printed by the journal). The basic lesson is that proof terms for rigs (and its categorified version, with a bit more structure, <a href=\"https://www.cas.mcmaster.ca/~carette/publications/esop2.pdf\">Symmetric Rig Groupoids</a>) are not only a fine programming language, you get a full set of 'program transformation' rules from looking at the coherence conditions from the categorical side. So that's 2 out of 3. What emerges as the natural thing on the 3rd leg? Algebra! The point being that Boolean logic has and and or as idempotent operations, where neither product nor coproduct are (neither in category theory nor in type theory).</p>",
        "id": 242515523,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1623596880
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242511239\">said</a>:</p>\n<blockquote>\n<p>Aside from his work in combinatorics, he wrote quite a few essays (and apparently gave lectures at MIT) on phenomenology.</p>\n</blockquote>\n<p>I studied Husserl and Heidegger in courses taught by Rota, and it was <em>great.</em>   He taught these courses in the math department because the philosophy department wouldn't allow it - and he was in the math department.</p>",
        "id": 242530293,
        "sender_full_name": "John Baez",
        "timestamp": 1623617881
    },
    {
        "content": "<p>Thanks to these courses I joined a discussion group where we read large portions of Heidegger and later Plato out loud, and discussed it.    It's a lot of fun to read Plato's dialogues out loud with different people taking different parts - especially the earlier dialogues, which are really dialogues.</p>",
        "id": 242530424,
        "sender_full_name": "John Baez",
        "timestamp": 1623618015
    },
    {
        "content": "<p>I don' t know Husserl much, but Heidegger is the bomb.</p>",
        "id": 242538322,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623629407
    },
    {
        "content": "<p>I studied both analytic and continental philosophy in grad school. What I find fascinating is the interplay of informal and formal thinking. There is always a creative tension between the philosophers who want to tidy everything up into a perfect quasi-formal system, and the gadflies who delight in poking intuitive holes in those systems. Even setting aside the analytic-continental divide, you have the internal divide between Russel-style mathematical philosophy and the linguistic pragmatism of the later Wittgenstein or the Oxford ordinary language philosophers. The strange thing is that although this debate about logic vs linguistic praxis is a central driving dynamic of 20th Century analytic philosophy, there is not much self-conscious awareness of this among philosophers. Not much meta-theorizing about it. </p>\n<p>I find there to be a sort of Hegelian flavour to this idea, the thesis - antithesis tension between the informal/intuitive philosophy and the attempt at making it all rigorous. We have yet to reach a  stable synthesis on this front, although many have tried (Merleau-Ponty, Imre Lakatos, Charles Taylor, and Michael Friedman, to name a few).</p>",
        "id": 242546940,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1623641035
    },
    {
        "content": "<p>My own work engages Deleuze who was explicitly and emphatically anti-Hegelian; his position was that Hegel subjugated difference to identity, when Deleuze argued identity should be born of difference. Deleuze was concerned with the creation of new things, with novelty, and argues this takes the form of a <em>lack</em> of an essentialized identity (if all identities are always already constituted, then there is no novelty). As <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> said earlier, analytic philosophy tends to want precise definitions and to get more and more precise, and the project of Deleuze throws this out not wanting to pin down identities from the outset but rather to account for the genesis of identities and how identities are changing in time.</p>\n<p>This lack of identity I feel can resonate with Grothendieck topology; the old topology joke of coffee mug vs donut being that we can talk about structure without fixing an identity, paired with the arrow-theoretic language of category theory allows for referring to an object not as an essentialized fixed identity in-itself but as the product of relationships, as a definition by means of internal structure which is allowed to change in time, like how “one hole object” allows the deformation of identity from coffee mug —&gt; donut. (My notions about G-topology bringing together topology and category theory may be wrong or not quite right, I've only just begun! <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>\n<p>Most of my Hegel knowledge comes filtered through the lens of Deleuze’s critiques, but as I understand it, Deleuze would argue that the thesis-antithesis-synthesis takes identity for granted and is using starting terms whose creation is bracketed aside and is creating new terms through a difference <em>between</em> identities (difference subjugated to identity) and not how difference in itself is productive of identity.</p>\n<p>I only just finished my undergrad, so I’m certainly the runt of this Zulip litter, but I wanted to communicate that there is indeed interest in the conversations continental philosophy and category theory are having! (Hegelian or otherwise! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 242753499,
        "sender_full_name": "Zachary Hait",
        "timestamp": 1623771786
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242502773\">said</a>:</p>\n<blockquote>\n<p>A student of David Lewis, <a href=\"https://en.wikipedia.org/wiki/Robert_Brandom\">Robert Brandom</a> who started working on inconsistency, and made his name in the merging of analytic philosophy and pragmatism, has a way of explaining Hegel that dissipates a lot of the obscurity. Many of his lectures are online such as this  <a href=\"https://www.youtube.com/watch?v=eK6kmLIixnI\">18 lecture series on Hegel at the university of Leipzig</a> where by minute 10 he is looking at Hegel's critique of representationalism, whose source is the discovery by Galileo and Descartes of the relation (isomorphism) between algebra and geometry.</p>\n<p>In his book \"Between Saying and Doing\" Brandom invokes a relation between language and action where he hints at a relation to Category Theory. Perhaps  somewhere around the algebra/colagebra duality? (that would make a lot of sense) It would be interesting to pick that up.</p>\n</blockquote>\n<p>Re: &ldquo;the merging of analytic philosophy and pragmatism&rdquo;</p>\n<p>Them's fightin' words to this Peircean &hellip; but I'll have to save it for another day ;) JA</p>",
        "id": 242757903,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1623773304
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"386601\">Zachary Hait</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242753499\">said</a>:</p>\n<blockquote>\n<p>My own work engages Deleuze who was explicitly and emphatically anti-Hegelian; his position was that Hegel subjugated difference to identity, when Deleuze argued identity should be born of difference. ...</p>\n</blockquote>\n<p>It would be interesting to know what Urs Schreiber who has a very deep knowledge of Category Theory and of Hegelian thinks of this. (He does not seem to be present here though.)</p>",
        "id": 242766074,
        "sender_full_name": "Henry Story",
        "timestamp": 1623776834
    },
    {
        "content": "<p>If you want to talk to Urs, try the <a href=\"https://nforum.ncatlab.org/\">nForum</a>.</p>",
        "id": 242772654,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1623779519
    },
    {
        "content": "<p><a href=\"https://twitter.com/meta_nomad/status/1404586002665119749\">Today on Twitter:</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/meta_nomad/status/1404586002665119749\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/76fe45c6e42a5bebb337b250980a3bae670c6158/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313339383034383537373238313330323532392f4b41336e4334627a5f6e6f726d616c2e6a7067\"></a><p>Awful day today. I had 2 volumes of the collected work of Hegel in my car and someone broke in and left 2 more. <a href=\"https://t.co/sgANpdplce\">https://twitter.com/meta_nomad/status/1404586002665119749/photo/1</a></p><span>- Meta (@meta_nomad)</span><div class=\"twitter-image\"><a href=\"https://t.co/sgANpdplce\"><img src=\"https://uploads.zulipusercontent.net/450c2a087ba4acc873ee1381c8e915a0a5e68297/68747470733a2f2f7062732e7477696d672e636f6d2f6d656469612f4533345868714a586f414159754e732e6a70673a7468756d62\"></a></div></div></div>",
        "id": 242784286,
        "sender_full_name": "John Baez",
        "timestamp": 1623784356
    },
    {
        "content": "<p>Somone should throw in a copy of the NLab too. :-)</p>",
        "id": 242787838,
        "sender_full_name": "Henry Story",
        "timestamp": 1623785833
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242766074\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"386601\">Zachary Hait</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242753499\">said</a>:</p>\n<blockquote>\n<p>My own work engages Deleuze who was explicitly and emphatically anti-Hegelian; his position was that Hegel subjugated difference to identity, when Deleuze argued identity should be born of difference. ...</p>\n</blockquote>\n<p>It would be interesting to know what Urs Schreiber who has a very deep knowledge of Category Theory and of Hegelian thinks of this. (He does not seem to be present here though.)</p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/242772654\">said</a>:</p>\n<blockquote>\n<p>If you want to talk to Urs, try the <a href=\"https://nforum.ncatlab.org/\">nForum</a>.</p>\n</blockquote>\n<p>Just applied for an account, I'll make a post there later tonight if all goes smoothly <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 242791468,
        "sender_full_name": "Zachary Hait",
        "timestamp": 1623787473
    },
    {
        "content": "<p>I was just pointed on Twitter to the following 2016 Book <a href=\"https://www.google.de/books/edition/Diagrammatic_Immanence/bjVYDwAAQBAJ?hl=de&amp;gbpv=1&amp;printsec=frontcover\">Diagrammatic Immanence</a> by <span class=\"user-mention\" data-user-id=\"318643\">@Rocco Gangle</span> which mixes philosophy and category theory. <br>\nIt has chapters on </p>\n<ol>\n<li>Spinoza,  </li>\n<li>Categories and Functors </li>\n<li>Peirce </li>\n<li>Presheaves </li>\n<li>Deleuze </li>\n<li>Adjunctions and Topoi... </li>\n</ol>\n<p>So that should then provide some useful background to then see how Hegel would fit in.</p>",
        "id": 243317317,
        "sender_full_name": "Henry Story",
        "timestamp": 1624216936
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243317317\">said</a>:</p>\n<blockquote>\n<p>I was just pointed on Twitter to the following 2016 Book <a href=\"https://www.google.de/books/edition/Diagrammatic_Immanence/bjVYDwAAQBAJ?hl=de&amp;gbpv=1&amp;printsec=frontcover\">Diagrammatic Immanence</a> by <span class=\"user-mention silent\" data-user-id=\"318643\">Rocco Gangle</span> which mixes philosophy and category theory. <br>\nIt has chapters on </p>\n<ol>\n<li>Spinoza,  </li>\n<li>Categories and Functors </li>\n<li>Peirce </li>\n<li>Presheaves </li>\n<li>Deleuze </li>\n<li>Adjunctions and Topoi... </li>\n</ol>\n<p>So that should then provide some useful background to then see how Hegel would fit in.</p>\n</blockquote>\n<p>I know Rocco Gangle personally at Endicott College. He cites me (more than once) as a resource in that book. I am not sure that he has ever proved a theorem on his own, or at least clarified the proof of a known theorem. Nor am I sure that he has publicly announced a mathematical conjecture, or that he has ever taught a course in mathematics. I also have the overwhelming impression that he is a totally gifted if not charismatic teacher of philosophy. It may be that he is a brilliant student and teacher of philosophy, but he seems to be addicted to, or has  a crushing envy of, a certain corner of diagrammatic mathematics.</p>\n<p>I once told Eilenberg that I wanted to do \"mathematical metaphysics,\" to which he replied, \"Better to do metaphysical mathematics.\" I was briefly a graduate student of Lawvere, and I can confidently say that he embodies metaphysical mathematics.</p>",
        "id": 243771946,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1624534639
    },
    {
        "content": "<p>I think I heard someone say something like that about David Corfield  not having proven a mathematical theorem, but that he asked some surprisingly good questions.<br>\nThe role of philosophers may be to ask questions. That is what they are know for :-)</p>",
        "id": 243773129,
        "sender_full_name": "Henry Story",
        "timestamp": 1624535495
    },
    {
        "content": "<p>The mathematics in the book is simple enough that I think even I could put together a course now and explain it at this point. The top concept Rocco brings in is that of adjunctions.  So as a result the book should be very accessible to people who have followed Deleuze and Peirce. <br>\nI guess the interest in Diagrammatic Mathematics would come from him also being a Deleuzian, as Deleuze gave long courses on Diagrams and it is quite central to his thought - as I understand. See this page <a href=\"https://newmaterialism.eu/almanac/d/diagram.html\">for example</a>, but there seems to be quite a literature on it. <br>\nIn any case I was hanging out with Deleuzians about 10 years ago and heard a lot about Diagrams as I was also discovering them in CT too.  That gave me an extra push to want to learn Category Theory, as I wanted to know what the best mathematics were first, so that I could ground my reading of those. (Of course I had other reasons to learn CT too from Functional Programming). Hence the reason why this book is so interesting too now for me.</p>",
        "id": 243774439,
        "sender_full_name": "Henry Story",
        "timestamp": 1624536198
    },
    {
        "content": "<p>Another thing is that with this book in hand we have two mappings of Philosophers to CT: </p>\n<ul>\n<li>Urs Schreibers pages on nLab</li>\n<li>Rocco Gangle's interpretation of Deleuze</li>\n</ul>\n<p>So now we should go to Urs Schreiber to get his point of view on this. I am still waiting for <span class=\"user-mention\" data-user-id=\"386601\">@Zachary Hait</span> to start the thread on the Nlab. I guess we'll get some answer that will take 100 years to digest :-)</p>",
        "id": 243775079,
        "sender_full_name": "Henry Story",
        "timestamp": 1624536508
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243774439\">said</a>:</p>\n<blockquote>\n<p>See this page <a href=\"https://newmaterialism.eu/almanac/d/diagram.html\">for example</a>, but there seems to be quite a literature on it. </p>\n</blockquote>\n<p>Re:</p>\n<blockquote>\n<p>Initially Guattari borrows the term from Charles Sanders Peirce’s semiotics, who described Diagram as an “icon of relation” (Peirce, 1931-36, p. 531). Guattari tried to delink Diagram from the signifier-signified polarity inherent to Pierce’s use, in order to elaborate Diagram as a direct link/access to the real whilst bypassing representation.</p>\n</blockquote>\n<p>Dear Henry,<br>\nAlready we see the nubie confusion of Peirce's triadic sign relation (object-sign-interpretant) with Saussure's dyadic relation (&ldquo;signifier-signified polarity&rdquo;).&nbsp;  Used to be folks distinguished Peirce's <em>semiotics</em> from Saussure's <em>semiology</em> but more lately The Continentals have decided <em>semiotics</em> is a sexier word ... so there are a few things to clear up here.&nbsp; There will be no <em>bypassing representation</em> on either the premisses or the premises of Peirce's semiotics.<br>\nRegards,<br>\nJon</p>",
        "id": 243780625,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1624539171
    },
    {
        "content": "<p>Ah thanks for pointing that out. <br>\nI had selected a page randomly from those in Google's search results for \"Deleuze\" and \"Diagram\" just to make the point that that the relation of Deleuze, Diagrams and Peirce is quite a theme.  Reading Rocco's book, I think he sees a unity of thought in Spinoza, Peirce and Deleuze in that all three are seen as resisting the \"signifier signified polarity\" that comes from Descartes' working out the consequences of the power of algebra in describing the world (a point Brandom also makes btw in relation to Hegel).</p>",
        "id": 243784021,
        "sender_full_name": "Henry Story",
        "timestamp": 1624540757
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243784021\">said</a>:</p>\n<blockquote>\n<p>Ah thanks for pointing that out. <br>\nI had selected a page randomly from those in Google's search results for \"Deleuze\" and \"Diagram\" just to make the point that that the relation of Deleuze, Diagrams and Peirce is quite a theme.  Reading Rocco's book, I think he sees a unity of thought in Spinoza, Peirce and Deleuze in that all three are seen as resisting the \"signifier signified polarity\" that comes from Descartes' working out the consequences of the power of algebra in describing the world (a point Brandom also makes btw in relation to Hegel).</p>\n</blockquote>\n<p>Speak of the Devil <span aria-label=\"smiling devil\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling devil\">:smiling_devil:</span> <a href=\"https://inquiryintoinquiry.com/2013/02/14/chateau-descartes/\">Château Descartes</a><br>\nIt's good to note, though, for all Peirce's critique of cartesian dualism, the two were congruent as far as rationalism goes.&nbsp; Catalyzed no doubt by the influence of Kant, Peirce went further and integrated rational and empirical sources of knowledge within his prescient theory of information.</p>",
        "id": 243788192,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1624542537
    },
    {
        "content": "<blockquote>\n<p>David Corfield not having proven a mathematical theorem,</p>\n</blockquote>\n<p>well, not sure that's true anymore: <a href=\"https://arxiv.org/abs/2105.02871\">https://arxiv.org/abs/2105.02871</a> </p>\n<blockquote>\n<p>Fundamental weight systems are quantum states<br>\nDavid Corfield, Hisham Sati, Urs Schreiber</p>\n</blockquote>\n<p>I was watching the discussion that went into this on the nForum, and David C was definitely providing both insight and calculations!</p>",
        "id": 243863421,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1624580648
    },
    {
        "content": "<p>Yes, and putting together a book that does a good job of covering the most important Category Theory intutions from Awodey's \"Category Theory\" book (Awodey is also a Philosopher by the way), and putting together an argument tying Spinoza, Peirce and Deleuze with Category Theory is not a small feat. It has the ability to open up the interest of CT to a large group of thinkers. It probably should be translated into French. Remember that in France Philosophy is part of final year studies of all 17 year-olds, as well as mathematics.</p>",
        "id": 243875514,
        "sender_full_name": "Henry Story",
        "timestamp": 1624596743
    },
    {
        "content": "<p>So I have finished the book, and essentially it covers the work up in Category Theory up the 1980ies with Toposes, which is also about the time that Deleuze was writing. There is a  <a href=\"https://ndpr.nd.edu/reviews/diagrammatic-immanence-category-theory-and-philosophy/\">good review</a> of the book. </p>\n<p>There is one mention of coalgebras, which I think is of fundamental philosophical importance. There is some introduction to Duality though I think that CT brings such deep insights there, that it should be enough to convert any philosopher. And recently as I learned about monoidal categories and open systems (eg biological negentropic ones) that is a very important concept to have at one's disposal. But I guess there is infinitely more. I just have not understood them yet :-)</p>",
        "id": 243876535,
        "sender_full_name": "Henry Story",
        "timestamp": 1624598106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243876535\">said</a>:</p>\n<blockquote>\n<p>So I have finished the book, and essentially it covers the work up in Category Theory up the 1980ies with Toposes, which is also about the time that Deleuze was writing. There is a  <a href=\"https://ndpr.nd.edu/reviews/diagrammatic-immanence-category-theory-and-philosophy/\">good review</a> of the book. </p>\n<p>There is one mention of coalgebras, which I think is of fundamental philosophical importance. There is some introduction to Duality though I think that CT brings such deep insights there, that it should be enough to convert any philosopher. And recently as I learned about monoidal categories and open systems (eg biological negentropic ones) that is a very important concept to have at one's disposal. But I guess there is infinitely more. I just have not understood them yet :-)</p>\n</blockquote>\n<p>Many thanks to links of reviews of the Gangle \"immanence\" book (that philosophical word is terribly mysterious, being fraught with theological associations, unlike most mathematical terms). I tend to take seriously the opinion and evidence offered by Alan Sokal and Jean Bricmont in \"Fashionable Nonsense\" that Gilles Deleuze has published work that is \"devoid of both logic and sense.\" They quote at length passages of his writing, and about one of them, \"This passage contains at least a dozen scientific terms used without rhyme or reason, and the discourse oscillates between nonsense (\"a function is a Slow-motion\") and truisms (\"science constantly advances accelerations.\") About a lengthy passage by Deleuze's long-time collaborator, Felix Guittari, they write, \"This passage contains the most brilliant melange of scientific, pseudo-scientific, and philosophical jargon that we have ever encountered; only a genius could have written it.\" Brilliant though Gangle may be, he is no genius, so him writing to philosophers about a subject in which he has never taken a course, category theory, is potentially not so good for philosophy, and meaningless for mathematics. </p>\n<p>On a personal note, for years I thought I was being a creative electronic music engineer. I even have two patents in that area, and created a successful product for my then-employer, ElectroHarmonix. BUT, the fact is, and it took a long while to realize this, I have near-zero musical ability. Combined with a mediocre talent for electronics, that was not something I should have fooled myself into pursuing so passionately. Likewise, I would say that a philosopher interested in category theory diagrams would best progress by getting interested in <em>category theory</em>, take a course in it from a categorist, and also realize that there are many other kinds of interesting diagrams in mathematics besides those of our beloved subject.</p>",
        "id": 243926700,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1624632867
    },
    {
        "content": "<p>Hi Ellis, thanks for your feedback.</p>\n<p>I have been studying Category Theory just as you suggest: to get to the core of the ideas without intermediaries, and practically to help me build the next generation Secure decentralised Web (see the <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/web.20cats\">web-cats channel</a>). That is really what I need to get back to!! </p>\n<p>But I just had to read this book. Rocco Gangle gets the mathematics right enough to help get people interested in this area.  For me the advantage is that I can now perhaps go in the opposite direction, from those mathematics to perhaps a generous understanding of the works of the philosophers he discusses.  Well when I get some  time, someday!</p>\n<p>Note that for most people the Nlab is indistinguishable from nonsense. So I tend to be a bit carefuly about these types of carricatures that schools of thoughts have of others, especially when they cross national borders. </p>\n<p>Here just yesterday I found out how existentialist talk of one being blinded by Nothing, can make sense. I  <a href=\"https://math.stackexchange.com/questions/4182053/proof-that-⋁-is-not-right-adjoint-to-diagonal-functor-on-2?noredirect=1#comment8668694_4182053\">asked a question on Math StackExchange</a> only to find that I had ignored nothing and it came to bite me in the backside. :-)</p>",
        "id": 243930801,
        "sender_full_name": "Henry Story",
        "timestamp": 1624634750
    },
    {
        "content": "<p>There’s also work in contemporary philosophy that tries to bridge the analytical/continental gap by drawing inspiration from both Hegel and contemporary mathematics. <br>\nI think it’s interesting to explore connections between such “mathematical philosophy” works by Fernando Zalamea and Reza Negarestani, and the more “philosophical mathematics” mentioned,  by Lawvere and Corfield.</p>",
        "id": 244110249,
        "sender_full_name": "Eran Meir",
        "timestamp": 1624865502
    },
    {
        "content": "<p>For those interested in Hegel, Robert Brandom, whose supervisor was \"counterfactuals\" <a href=\"https://andrewmbailey.com/dkl/\">David K. Lewis</a>, and who has been developing over the past 30 years the philosophy of analytic pragmatism - the merging of insights from analytic philosophy and american pragmatists (everyone except it seems Peirce) - has in the past 15 years or so been focusing on Hegel. He was a committee member on <span class=\"user-mention\" data-user-id=\"392792\">@Kohei Kishida</span>'s PhD thesis <a href=\"http://d-scholarship.pitt.edu/10224/\">Generalized Topological Semantics for First-Order Modal Logic</a> along with <span class=\"user-mention\" data-user-id=\"276770\">@Steve Awodey</span> , and other famous personalities. So he knows about Category Theory, and he mentions a commuting diagram once in his book <a href=\"https://books.google.de/books?id=IksAy_MgFOUC&amp;printsec=frontcover&amp;source=gbs_atb#v=onepage&amp;q=category%20theory&amp;f=false\">Between Saying &amp; Doing: Towards an Analytic Pragmatism</a> when talking about the relation between action and language.  One could even argue that his explanation of language games is closely modeled on introduction and elimination rules.  <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> wrote recently <a href=\"https://twitter.com/DavidCorfield8/status/1422489526568620039\">https://twitter.com/DavidCorfield8/status/1422489526568620039</a> .</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/DavidCorfield8/status/1422489526568620039\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/974717edcab841967c545845f1fd040478ca9982/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313033323537313132363532303636383136302f4a39573072334b455f6e6f726d616c2e6a7067\"></a><p><a href=\"https://twitter.com/andrejbauer\">@andrejbauer</a> As an inferentialist (meaning derives from introduction/elimination) Brandom's on the good side, and his 'making explicit' fits well with 'logic as punctuation'. It just needs an injection of type theory.</p><span>- David Corfield (@DavidCorfield8)</span></div></div>",
        "id": 248697779,
        "sender_full_name": "Henry Story",
        "timestamp": 1628314216
    },
    {
        "content": "<p>So Robert Brandom recently gave a talk on Hegelian Logic, where he makes the case that the Hegelian logic builds on the notion of incompatible properties (e.g. Red is incompatible with Green, Blue, ... A Circle is incompatible with a square, a triangle, etc... but a circle can be red or green or blue,...) and that this is the basis on which he builds up modal logic.  This is in contrast he argues to the whole logical tradition from Boole, Frege, Russel, Wittgenstein, Tarski building on pretty much a uniform notion of Sets which do not come a-priori with notions of incompatibility, end up only being able to add those at the end, with modal logic, where Hegel puts that in right at the beginning.<br>\n<span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> wrote up a review on how this maps to ideas in type theory<br>\n<a href=\"https://twitter.com/DavidCorfield8/status/1422459558279196697\">https://twitter.com/DavidCorfield8/status/1422459558279196697</a><br>\nPut that way it is a little underwhelming, but also very enlightening. <br>\nIt could be that Brandom is providing Hegelians roots for a theory of types?</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/DavidCorfield8/status/1422459558279196697\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/974717edcab841967c545845f1fd040478ca9982/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313033323537313132363532303636383136302f4a39573072334b455f6e6f726d616c2e6a7067\"></a><p>Prompted by <a href=\"https://twitter.com/bblfish\">@bblfish</a> I watched Robert Brandom's talk from January \"Introduction to Hegel's Logic\", <a href=\"https://t.co/znLgwwuPei\">https://www.youtube.com/watch?v=PcroynVFDjg&amp;ab_channel=BobBrandom</a>.\n\nAs ever when listening to philosophers pushing against orthodox logical means, I'm left thinking they'd be so much better off with a type theory. (1/n)</p><span>- David Corfield (@DavidCorfield8)</span></div></div>",
        "id": 248697943,
        "sender_full_name": "Henry Story",
        "timestamp": 1628314559
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243926700\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281126\">Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/243876535\">said</a>:</p>\n<blockquote>\n<p>So I have finished the book, and essentially it covers the work up in Category Theory up the 1980ies with Toposes, which is also about the time that Deleuze was writing. There is a  <a href=\"https://ndpr.nd.edu/reviews/diagrammatic-immanence-category-theory-and-philosophy/\">good review</a> of the book. </p>\n<p>There is one mention of coalgebras, which I think is of fundamental philosophical importance. There is some introduction to Duality though I think that CT brings such deep insights there, that it should be enough to convert any philosopher. And recently as I learned about monoidal categories and open systems (eg biological negentropic ones) that is a very important concept to have at one's disposal. But I guess there is infinitely more. I just have not understood them yet :-)</p>\n</blockquote>\n<p>Many thanks to links of reviews of the Gangle \"immanence\" book (that philosophical word is terribly mysterious, being fraught with theological associations, unlike most mathematical terms). I tend to take seriously the opinion and evidence offered by Alan Sokal and Jean Bricmont in \"Fashionable Nonsense\" that Gilles Deleuze has published work that is \"devoid of both logic and sense.\" They quote at length passages of his writing, and about one of them, \"This passage contains at least a dozen scientific terms used without rhyme or reason, and the discourse oscillates between nonsense (\"a function is a Slow-motion\") and truisms (\"science constantly advances accelerations.\") About a lengthy passage by Deleuze's long-time collaborator, Felix Guittari, they write, \"This passage contains the most brilliant melange of scientific, pseudo-scientific, and philosophical jargon that we have ever encountered; only a genius could have written it.\" Brilliant though Gangle may be, he is no genius, so him writing to philosophers about a subject in which he has never taken a course, category theory, is potentially not so good for philosophy, and meaningless for mathematics. </p>\n<p>On a personal note, for years I thought I was being a creative electronic music engineer. I even have two patents in that area, and created a successful product for my then-employer, ElectroHarmonix. BUT, the fact is, and it took a long while to realize this, I have near-zero musical ability. Combined with a mediocre talent for electronics, that was not something I should have fooled myself into pursuing so passionately. Likewise, I would say that a philosopher interested in category theory diagrams would best progress by getting interested in <em>category theory</em>, take a course in it from a categorist, and also realize that there are many other kinds of interesting diagrams in mathematics besides those of our beloved subject.</p>\n</blockquote>\n<p>I have to agree here.  The book felt very opaque in many places, some of the math was sloppy, and I'm not quite sure what some of the diagrams are even trying to mean. <br>\nAlso, I very much dislike how Gangle began the book with sweeping size issues under the conceptual rug while also trying to advocate for the 'diagrammatic immanence\" of category theory.  In fact, size issues bring into question any theory of immanence.</p>",
        "id": 248750476,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1628394044
    },
    {
        "content": "<p>Also, here's an uncomfortable question: since Urs is a founder of the nlab and has put a lot of effort into a site almost universally used by online category theorists and enthusiasts, is it possible that there is a bias in the community towards understanding Hegel categorically simply because it's on the nlab, other than the works of other philosophers?</p>",
        "id": 248751473,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1628395730
    },
    {
        "content": "<p>I think the (very slight) bias among category theorists toward Hegel comes from the fact that Lawvere liked Hegel, not so much the fact that Schreiber read Lawvere and thus got to like Hegel.</p>\n<p>I think it's a very slight bias because of all the category theorists I know, only a few care about Hegel.</p>",
        "id": 248757147,
        "sender_full_name": "John Baez",
        "timestamp": 1628406784
    },
    {
        "content": "<p>It seems like it was more of a thing back in the topos theory heyday, particularly amongst Lawvere’s students and peers.</p>",
        "id": 248758260,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1628408908
    },
    {
        "content": "<p>J. Lambek actually has a paper on the influence of Heraclitus on mathematics (interestingly enough)</p>",
        "id": 248758276,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1628408985
    },
    {
        "content": "<p>I think Hegel is particularly attractive to category theorists because basically all of his work relies on rational thinking (so much as to lead him to postulate that \"what is real is rational, what is  rational is real\"). Yet, he really tried to deal with stuff that one wouldn't usually put within reach of rationality, such as god, metaphysics, ethics etc. And indeed, when one tries to formalize Hegel's thinking mathematically it doesn't really quite work. Some philosophers decided then to take a completely different road, that led to developments in logic, type theory etc (mainly analytic philosophy) while others decided to disregard mathematical formalization and deal with conceptual stuff in other terms (mainly continental philosophy). I guess that some category theorists think that the difficulty in formalizing Hegel just stemmed from the inadequacy of the mathematics of that time, and that category theory may actually provide a way to do so.</p>",
        "id": 248762574,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1628416543
    },
    {
        "content": "<p>Also, he was a bete noir of the analytic movement which eventually led to the currently entrenched mode of thinking about the philosophy of mathematics (overuse of FOL, over emphasis on syntax, etc..) which category theory somewhat rebels against</p>",
        "id": 248762702,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1628416742
    },
    {
        "content": "<p>Re \"Bete Noir of the analytic movement\". That is why Brandom's going back to Hegel <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/248697943\">I mentioned above</a> is so intriguing.<br>\nBrandom actually writes very clearly, but he never uses Category Theory. So it would be nice to have a bridge. I wonder what Urs' view on that are. But for that I guess one would have to go to the NLab discussion forum.</p>",
        "id": 248763926,
        "sender_full_name": "Henry Story",
        "timestamp": 1628418726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> <a href=\"#narrow/stream/229134-philosophy/topic/Lawvere.20and.20Hegel/near/248697779\">said</a>:</p>\n<blockquote>\n<p>For those interested in Hegel, Robert Brandom, whose supervisor was \"counterfactuals\" <a href=\"https://andrewmbailey.com/dkl/\">David K. Lewis</a>, and who has been developing over the past 30 years the philosophy of analytic pragmatism &mdash; the merging of insights from analytic philosophy and american pragmatists (everyone except it seems Peirce) &mdash; has in the past 15 years or so been focusing on Hegel.</p>\n</blockquote>\n<p>Pragmatism without Peirce is like a day without sunshine &mdash; foggy <span aria-label=\"foggy\" class=\"emoji emoji-1f301\" role=\"img\" title=\"foggy\">:foggy:</span> and all wet <span aria-label=\"rainy\" class=\"emoji emoji-1f327\" role=\"img\" title=\"rainy\">:rainy:</span> &mdash; there's actually a subliterature of Peirce commentary which reads him as just another philosopher in the vein of Hegel.&nbsp; I count my lucky stars I never encountered it when I started out or I never would have looked into his work.</p>",
        "id": 248770695,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1628429173
    },
    {
        "content": "<p>It is definitely an interesting question as to why Brandom has not looked at Peirce (yet?).</p>",
        "id": 248770781,
        "sender_full_name": "Henry Story",
        "timestamp": 1628429323
    },
    {
        "content": "<p>Don't know.&nbsp; I largely quit following analytic philosophy after Quine, who already had one foot out the door, but I'd guess it's the same reason Russell preferred the straw punching bag of Wm. James to wrestling with Peirce and again why Rorty et&nbsp;al. tried to cobble together a neo-pragmatism without its sole.</p>",
        "id": 248771197,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1628429905
    }
]