[
    {
        "content": "<p>Just sharing some semi-idle thoughts.</p>\n<p>I often find, in practice, that our ordinary mathematical language struggles with referring to things which are “located” or “embodied”, as in: “this thing here that I am pointing at”, and it is not hard to see why; logical foundations of all flavours postulate that mathematical objects can only be “created”---added to our context---as variables, that is as disembodied names, and all we can do to refer to names is give them other names.<br>\nEven works that try to explicitly ground logic into location such as Girard's <a href=\"https://link.springer.com/chapter/10.1007/3-540-44802-0_3\">Locus Solum</a> accept that location be encoded e.g. in a list of numbers.</p>\n<p>One thing I find is that this creates a kind of “cognitive barrier” between abstract and computational mathematics, since indeed computation is naturally “embodied and located”, which is modelled by e.g. the head of a Turing machine or concretely a memory cell accessed by a processor, but these very here-and-now concepts also can only be referred to through an encoding if one is to prove something about them.</p>\n<p>Recently I've been reading something about <a href=\"https://en.wikipedia.org/wiki/Piaget%27s_theory_of_cognitive_development\">Piaget's theory of cognitive development</a> and it struck me how different this creation of mathematical objects as “disembodied names” is from our own creation as individuals, which is as an embodied, located “I” which interacts with the world around itself.</p>\n<p>It got me wondering: could we have taken (or take) a different turn, where instead of mathematical objects as names, we went for mathematical objects <em>as actors</em>---have a foundation of mathematics where the primitive specification is <em>what can I do, what can I experience, as an embodied mathematical object of a certain type</em>? <br>\nThen instead of starting our proofs with </p>\n<blockquote>\n<p>Let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> be a natural number.</p>\n</blockquote>\n<p>perhaps we would start them with</p>\n<blockquote>\n<p>I am a natural number.</p>\n</blockquote>\n<p>Philosophically, such a turn could have something in common with set-theoretic foundations, in the focus on the “concrete embodiment” of objects, as well as categorical foundations, in the focus on the structural and relational aspect (an object is what an object does in relation with everything else), as well as <a href=\"https://en.wikipedia.org/wiki/Laws_of_Form\">Laws of Form</a> in the focus on action and creation, but I feel it would also have something different from all of them.</p>\n<p>I am very much an amateur in mathematical philosophy, so I am wondering if you know some precedents of this sort of idea, or you see obvious flaws, or have anything to say about it.</p>",
        "id": 505629361,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741945882
    },
    {
        "content": "<p>Off-topic, but the quote from the Cordwainer Smith novel at the beginning of <em>Locus Solum</em> is so fascinating. One of the more engaging starts to a paper I've seen.</p>",
        "id": 505660160,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1741954732
    },
    {
        "content": "<p>Some scattered thoughts:</p>\n<ul>\n<li>\n<p>Certain forms of maths education looks to embody the concepts. Have your class of children physically move themselves into two equal groups. What is it to embody a set of even cardinality? I've tried to mime <em>modus ponens</em> in my logic classes before. I recall some dance company danced the Snake Lemma.</p>\n</li>\n<li>\n<p>The non-indexical quality of mathematics carries through to physics. You're provided with a map, but don't know where you're located on it.</p>\n</li>\n<li>\n<p>There was a trend in <em>Science Studies</em> which looked to give scientific objects more agency. Cf. Bruno Latour's 'actor-network theory' which includes non-human actors. Aimed though at laboratory science.</p>\n</li>\n<li>\n<p>Is this tied to your idea of types as their own little “computational universes”?</p>\n</li>\n</ul>",
        "id": 505673556,
        "sender_full_name": "David Corfield",
        "timestamp": 1741958560
    },
    {
        "content": "<p>Thank you David, those are really nice points. The terminology of “indexical” vs “non-indexical” was not part of my vocabulary but seems clearly appropriate.</p>\n<p>The “types as computational universes” idea [sorry to other readers, this was discussed in a non-public platform] is somewhat tangentially related; one of the things that sparked this thought was reflecting on the “terms as pasting diagrams” part of it.<br>\nSo, there, you have terms which have a spatial/geometric nature, and that nature is entirely effective, explicit, and computable; and also one of the most useful operations that one can perform is to paste two such terms <em>at some subterm</em> of one of them, that is a “located part”.<br>\nSo I was thinking about how there is something very simple and very concrete about this operation of pasting, how if <em>I</em> was a term, I would just <em>know</em> about my subterms, and if I wanted to paste with another term, it would go something like:</p>\n<blockquote>\n<ul>\n<li>Where should I paste myself?</li>\n<li>Here.</li>\n</ul>\n</blockquote>\n<p>and it would be done; a little bit like interacting with a doctor,</p>\n<blockquote>\n<ul>\n<li>Where does it hurt?</li>\n<li>Here.</li>\n</ul>\n</blockquote>\n<p>But instead I have to pick a <em>specific encoding</em> and then have to <em>explicitly describe the location</em> with respect to this encoding, and there is something a little bit perverse and unnatural about it, like every interaction with the doctor having to be like</p>\n<blockquote>\n<ul>\n<li>Where does it hurt?</li>\n<li>Under my right fifth rib, about an inch from the sternum.</li>\n</ul>\n</blockquote>\n<p>I don't know if this is something that can actually be “fixed” by some change of language; I am just wondering.</p>",
        "id": 505679568,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741960071
    },
    {
        "content": "<p>Funny, I have recently resorted to the term \"indexical property\" while trying to explain why it is mathematically nontrivial to encode a proposition like \"it's raining\" because it underlies subtle details like time specification and all sorts of other restraints, plus some sentences contain the \"I\" pronoun and all other sorts of mysterious tokens. </p>\n<p>I was left with a question similar to what <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span>  asked, ever since.</p>",
        "id": 505681183,
        "sender_full_name": "fosco",
        "timestamp": 1741960458
    },
    {
        "content": "<p>I should add that I think many ideas of categorical logic already resonate with this; the idea itself of “internal logic”, as well as languages such as FOLDS (or univalent HoTT) that cannot “tell apart equivalent objects”, I think, go in the direction of putting ourselves in the “perspective” of a mathematical object living inside its own universe and with a more limited set of “probes” for gaining information about its surroundings...</p>",
        "id": 505686013,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741961642
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Mathematics.20founded.20on.20.28located.29.20action/near/505681183\">said</a>:</p>\n<blockquote>\n<p>why it is mathematically nontrivial to encode a proposition like \"it's raining\" because it underlies subtle details like time specification</p>\n</blockquote>\n<p>Did you ever see <a href=\"https://golem.ph.utexas.edu/category/2020/05/in_further_praise_of_dependent.html\">my treatment</a> of the indexicality of \"It rains\"?</p>\n<p><a href=\"/user_uploads/21317/1s9MFpPjWcSpo2GAKwLl0zsR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/1s9MFpPjWcSpo2GAKwLl0zsR/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"832x612\" src=\"/user_uploads/thumbnail/21317/1s9MFpPjWcSpo2GAKwLl0zsR/image.png/840x560.webp\"></a></div>",
        "id": 505686276,
        "sender_full_name": "David Corfield",
        "timestamp": 1741961721
    },
    {
        "content": "<p>Is there such a thing as a multimodal logic that is suited for expressing a kind of “existentialist” system, where “everything that happens, happens <em>to someone</em>”? <br>\nI feel that would give some kind of solution in the spirit I am suggesting: <br>\n“Every time John lights a cigarette, it rains”<br>\ncould be parsed as<br>\n“[Suppose] I am John. Every time I light a cigarette, it rains.”<br>\nwhere the fact that the raining is happening <em>here</em> is simply the default given by the statement being “from John's viewpoint”; in fact, just as in natural language, it is the opposite case that needs to be made explicit, by reference to an explicit location.</p>",
        "id": 505692337,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741963309
    },
    {
        "content": "<p>Funny how one mentions the time but not the place. But then maybe one doesn't need to.</p>\n<p>\"I light a cigarette, and it rains.\"</p>\n<p>But maybe it's because \"time\" is playing the role of something like \"occasion\" or more technically \"spacetime event\".</p>",
        "id": 505695708,
        "sender_full_name": "David Corfield",
        "timestamp": 1741964088
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Mathematics.20founded.20on.20.28located.29.20action/near/505673556\">said</a>:</p>\n<blockquote>\n<p>I recall some dance company danced the Snake Lemma.</p>\n</blockquote>\n<p>I still think there was something like that, but I've come across also <a href=\"https://www.simonsfoundation.org/2022/05/09/math-and-dance-collide-at-dance-of-the-diagram/\">this dance representation</a> of the <a href=\"https://ncatlab.org/nlab/show/differential+cohomology+diagram\">[[hexagon diagram]]</a> of differential cohomology.</p>\n<p>Thinking more about giving voice to mathematical entities, I think it does form a part of mathematical pedagogy. Your treating a quadratic equation with a child and you say after a time \"It's crying out to be factorized\".</p>\n<p>Terms of a type are crying out to have elimination rules applied to them.</p>",
        "id": 505736125,
        "sender_full_name": "David Corfield",
        "timestamp": 1741974858
    },
    {
        "content": "<p>Yes, I was thinking about elimination rules (or destructors) when I wrote about pasting diagrams knowing about their subdiagrams... <br>\nI feel like, if I were a term of a type, destructors would be something like the parts of me that are readily accessible to me, the way that certain parts of my body are readily accessible for my use, to the point that they are not conceptualised as having a separate existence from me.<br>\nE.g. the relation between a term of a pair type and its left and right projection is somewhat like the relation between myself and my left and right hand... I can see them as separate entities but they are integrated and immediately accessible to me as an agent in the world...</p>",
        "id": 505759787,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741983471
    },
    {
        "content": "<p>Of course, my main question remains--- what could be a rigorous form of mathematics that is adapted to the metaphor of mathematical objects as agents?</p>",
        "id": 505760243,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1741983679
    },
    {
        "content": "<p>The only thing I can think to mention here is <a href=\"https://plato.stanford.edu/entries/two-dimensional-semantics/\">two-dimensional semantics</a> which is trying to get at a logic of indexicals and designation across worlds. It's trying to navigate a way between speaking of things picked out by description and picked out by indexical designation.</p>",
        "id": 505821912,
        "sender_full_name": "David Corfield",
        "timestamp": 1742024895
    },
    {
        "content": "<p>In the case of mathematics, it would be dealing with things like </p>\n<blockquote>\n<p>2 could have been 3.</p>\n</blockquote>\n<p>In one typical reading this is absurd. Like saying</p>\n<blockquote>\n<p>The least prime could have been 3.</p>\n</blockquote>\n<p>But is OK in the sense of </p>\n<blockquote>\n<p>I'm thinking of a number. It's 2 but it could have been 3. </p>\n</blockquote>\n<p>It's like </p>\n<blockquote>\n<p>The 44th POTUS needn't have been POTUS.</p>\n</blockquote>\n<p>In the sense of Obama, it's true; in the sense of the person holding that office, it's false.</p>\n<p>It's much to do with the essence of something. How far can one go before </p>\n<blockquote>\n<p>Obama needn't have been X</p>\n</blockquote>\n<p>doesn't make sense?</p>\n<blockquote>\n<p>Obama needn't have had anything like the genome he has?</p>\n</blockquote>\n<p>Presumably with mathematics we usually take the essence of an entity to be its structural role, so can't think of counterfactuals.</p>",
        "id": 505830168,
        "sender_full_name": "David Corfield",
        "timestamp": 1742031426
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Mathematics.20founded.20on.20.28located.29.20action/near/505830168\">said</a>:</p>\n<blockquote>\n<p>In the case of mathematics, it would be dealing with things like </p>\n<blockquote>\n<p>2 could have been 3.</p>\n</blockquote>\n<p>In one typical reading this is absurd. Like saying</p>\n<blockquote>\n<p>The least prime could have been 3.</p>\n</blockquote>\n<p>But is OK in the sense of </p>\n<blockquote>\n<p>I'm thinking of a number. It's 2 but it could have been 3. </p>\n</blockquote>\n<p>It's like </p>\n<blockquote>\n<p>The 44th POTUS needn't have been POTUS.</p>\n</blockquote>\n<p>In the sense of Obama, it's true; in the sense of the person holding that office, it's false.</p>\n</blockquote>\n<p>More generally, I think the context is necessary to make sense of whether a statement is true or false or absurd or unprovable or whatever.</p>",
        "id": 505854046,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1742049512
    },
    {
        "content": "<p>At least some of these examples look like ones in which the ambiguity would be resolved if the computational “engine” evaluating a sentence was made explicit---for example, </p>\n<blockquote>\n<p>The 44th POTUS needn't have been POTUS.</p>\n</blockquote>\n<p>would presumably lead to different outcomes if “The 44th POTUS” is evaluated eagerly rather than lazily. </p>\n<p>Some of the ideas I've expressed both here and in the “types as small computational universes” proposal go in this direction; I think the following are all compatible:</p>\n<ul>\n<li>Computations (which, Curry-Howard-ly, may sometimes be deductions) should be first-class citizens and concrete parts of the specification of a type or of a mathematical theory</li>\n<li>We can rethink mathematics in a way that focusses on the “agency” and the “perspective” of mathematical objects</li>\n<li>Thus, the logical/computational engine attached to a mathematical object serves as “logic from the viewpoint of that object”; each mathematical object interacts with and reasons about other objects according to its own (concretely defined) logic</li>\n</ul>",
        "id": 505877928,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742066737
    },
    {
        "content": "<p>And also, the “existentialist” principle I suggested earlier:</p>\n<ul>\n<li>Everything that happens, happens <em>from some viewpoint</em>, including the evaluation of statements</li>\n</ul>",
        "id": 505879156,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1742067651
    },
    {
        "content": "<p>I may be obsessed with Philippe Descola (anthropologist) recently, but it seems to me that \"giving agency to mathematical objects\" resonates with his classification of <a href=\"https://dn720001.ca.archive.org/0/items/beyond-nature-and-culture/Beyond%20Nature%20and%20Culture.pdf\">modes of identifications</a> with entities (humans and non-humans). I tried to summarize his ideas in this <a href=\"#narrow/channel/229111-community.3A-general/topic/.22Category.20Theory.20is.20Being.20Co-Opted.22/near/541777638\">thread</a>. (There, I think I was out of topic, which I may also be here.)</p>",
        "id": 542703675,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1759399636
    },
    {
        "content": "<p>This resonates a lot with me, coming from (imperative/usual) programming, where we directly act on parts of the world around us. IMO, the key difference is <em>mutability</em>, which is always (at least traditionnally) captured functionnally in a \"copy-and-write\" manner in mathematics: for example, Turing machines are modelled by describing the whole state before and after each operation. Same with other kind of e.g. monoid actions, where to reason on our action we leave our pov to get this \"omniscient picture\" of every possible moment, by considering the whole space of states.</p>\n<p>Another more concrete action is modifying a field of a record in programming, e.g. \"house.animals.dogs.add(Rupert)\".<br>\nI reason on this by describing the whole house before, and the whole house after, as following:</p>\n<div class=\"codehilite\"><pre><span></span><code>let house2 =\n    let (fields_before_animals.., animals, fields_after_animals..) = house in\n    let (fields_before_dogs.., dogs, fields_after_dogs..)\n    (fields_before_animals.., (fields_before_dogs.., Rupert::animals, fields_after_dogs..), fields_after_animals..)\n</code></pre></div>\n<p>This clearly lose the way we point at dogs in the house, and has an inadequate complexity. This pattern is captured by lenses, which allows to express directly this idea of acting of fields (\"here in the house\") - and arguably more faithfully by linear lenses, which capture this crucial idea of fields being not duplicated nor removed.</p>\n<p>However, acting on a field is still a quite basic action in my mutable world. We can also act on things through remote accesses: I was (and hopefully going back soon to) working on mutable borrowing in Rust, which gives you temporary exclusive access to part of something, and allow you to act on it. Lenses cannot express mutable borrowing in general, and lots of recent works proposed to capture them at different levels (from e.g. RustBelt which is very expressive but \"low-level\", to e.g. Creusot and Aeneas which are higher-level but don't handle as much patterns).</p>\n<p>So, I feel like such mathematics would have high-level functionalities that translate to a setting where objects are manipulated in a substructural system (out of which we can leverage essential properties, see e.g. the frame rule in separation logic), though this is far from addressing everything.</p>",
        "id": 543746003,
        "sender_full_name": "Sidney Congard",
        "timestamp": 1759929563
    },
    {
        "content": "<p>Ah, for another example, I get something similar from tactic languages in proof assistants, e.g. using \"rewrite <code>a=b</code> at the second occurrence of <code>pat</code>\": we act somewhere in our world (i.e. hypotheses and goal) with the given equality while using a different language to specify where do we act, instead of e.g. using the elimination pattern (thus writing down the motive that is instantiated with the state \"before\" and the state \"after\")</p>",
        "id": 543746954,
        "sender_full_name": "Sidney Congard",
        "timestamp": 1759929841
    }
]