[
    {
        "content": "<p>There is a good discussion going on about <a href=\"#narrow/stream/271602-general.3A-co.2Fappreciation/topic/Ren.C3.A9.20Guitart\">Rene Guitart</a> on the co-appreciation channel, where he is appreciated as a serious category theorists whose work started in the 1970ies in publications such as <a href=\"http://www.numdam.org/volume/DIA_1979__1/\">Revue Diagrammes</a>. </p>\n<p>The title of that publication intrigued me, as Deleuze <a href=\"#narrow/stream/229134-philosophy/topic/Deleuze\">also discussed here</a> had taken the notion of a Diagram from Peirce and developed it in a number of widely discussed directions. The impression I get is that the notion of relationality is very important for Deleuze and so I wonder how much Deleuze may have known of Category Theory: Was he inspired by it? was he a secret category theoretician, writing CT under another name? It seems likely that Rene Guitart may be able to answer such questions, as it is quite possible that they met. </p>\n<p>Rene Guitart has supervised Philosophical/Mathematical thesis on the Diagram (see links on co-appreciation thread), and has been in discussion with a very famous French Philosopher Badiou (whome I know little of, other than that he starts from set theory, and in the past ten years has been making strides towards Category Theory). </p>\n<p>Here is a recent article from December 2020 <a href=\"https://ojs.zrc-sazu.si/filozofski-vestnik/article/view/9854\">Infinity between Two Ends. Dualities, Algebraic Universes, Sketches, Diagrams</a> </p>\n<blockquote>\n<p>The article affixes a resolutely structuralist view to Alain Badiou’s proposals on the infinite, around the theory of sets. Structuralism is not what is often criticized, to administer mathematical theories, imitating rather more or less philosophical problems. It is rather an attitude in mathematical thinking proper, consisting in solving mathematical problems by structuring data, despite the questions as to foundation. It is the mathematical theory of categories that supports this attitude, thus focusing on the functioning of mathematical work. From this perspective, the thought of infinity will be grasped as that of mathematical work itself, which consists in the deployment of dualities, where it begins the question of the discrete and the continuous, Zeno’s paradoxes. It is, in our opinion, in the interval of each duality ― “between two ends”, as our title states ― that infinity is at work. This is confronted with the idea that mathematics produces theories of infinity, infinitesimal calculus or set theory, which is also true. But these theories only give us a grasp of the question of infinity if we put ourselves into them, if we practice them; then it is indeed mathematical activity itself that represents infinity, which presents it to thought. We show that tools such as algebraic universes, sketches, and diagrams, allow, on the one hand, to dispense with the “calculations” together with cardinals and ordinals, and on the other hand, to describe at leisure the structures and their manipulations thereof, the indefinite work of pasting or glueing data, work that constitutes an object the actual infinity of which the theory of structures is a calculation. Through these technical details it is therefore proposed that Badiou envisages ontology by returning to the phenomenology of his “logic of worlds”, by shifting the question of Being towards the worlds where truths are produced, and hence where the subsequent question of infinity arises.</p>\n</blockquote>\n<p>It may not have been translated from French yet. In the article he distiguishes his work from that of Badiou and Deleuze, by reference directly to work in Category Theory.</p>",
        "id": 244112009,
        "sender_full_name": "Henry Story",
        "timestamp": 1624866739
    }
]