[
    {
        "content": "<p>I think that certain parts of theoretical physics which have virtually no hope of being tested by the scientific method within our lifetimes, such as string theory or loop quantum gravity or most other theories of quantum gravity, should be regarded as part of natural philosophy rather than science. </p>\n<p>The whole point of science is the use of the scientific method in testing hypotheses and theories. There is nothing special about coming up with hypotheses and theories - philosophers come up hypotheses and theories all the time, and the ones in quantum gravity just happen to be very mathematics heavy. But lacking any scientific experiments to either back or disprove its theories, the entire field of quantum gravity is more like other branches of philosophy than other branches of science.</p>",
        "id": 464538026,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724386095
    },
    {
        "content": "<p>I quit working on quantum gravity because I wanted to accomplish something useful.   I'd say it's currently what <a href=\"https://plato.stanford.edu/entries/lakatos/\">Lakatos</a> called a 'degenerating research programme':</p>\n<blockquote>\n<p>To begin with, the unit of scientific evaluation is no longer the individual theory (as with Popper), but the <em>sequence</em> of theories, the <em>research programme</em>. We don’t ask ourselves whether this or that theory is scientific or not, or whether it constitutes good or bad science. Rather we ask ourselves whether the <em>sequence</em> of theories, the research programme, is scientific or non-scientific or constitutes good or bad science. Lakatos’s basic idea is that a research programme constitutes <em>good</em> science—the sort of science it is rational to stick with and rational to work on—if it is <em>progressive</em>, and <em>bad</em> science—the kind of science that is, at least, intellectually <em>suspect</em>—if it is <em>degenerating</em>. What is it for a research programme to be progressive? It must meet two conditions. Firstly it must be <em>theoretically</em> progressive. That is, each new theory in the sequence must have excess empirical content over its predecessor; it must predict novel and hitherto unexpected facts (FMSRP: 33). Secondly it must be <em>empirically</em> progressive. Some of that novel content has to be corroborated, that is, <em>some</em> of the new “facts” that the theory predicts must turn out to be true. As Lakatos himself put the point, a research programme “is <em>progressive</em> if it is both theoretically and empirically progressive, and <em>degenerating</em> if it is not” (FMSRP: 34). Thus a research programme is degenerating if the successive theories do not deliver novel predictions or if the novel predictions that they deliver turn out to be false.</p>\n</blockquote>",
        "id": 464582192,
        "sender_full_name": "John Baez",
        "timestamp": 1724401286
    },
    {
        "content": "<p>For example, Hawking's theory of black hole radiation used accepted principles to get a novel result: black holes radiate.  While this theory isn't testable for black holes (now, or maybe ever), it's been tested in systems analogous to black holes, like <a href=\"https://en.wikipedia.org/wiki/Sonic_black_hole\">acoustic black holes</a>, and it works.</p>",
        "id": 464583075,
        "sender_full_name": "John Baez",
        "timestamp": 1724401482
    },
    {
        "content": "<p>However, the issue it raised, the so-called 'black hole information paradox', has led to an ever-spiraling set of unverifiable theories that aren't clearly making any progress - at least, not in my opinion.</p>",
        "id": 464583368,
        "sender_full_name": "John Baez",
        "timestamp": 1724401593
    },
    {
        "content": "<p>On the other hand, work on quantum gravity has led to exciting mathematics, and it might well be profitably considered a branch of mathematics, or actually several branches of mathematics.   </p>\n<p>I wish people working on quantum gravity could accept the fact that they're doing \"physics-inspired mathematics\", which is worth working on for its own sake, and stop pretending that they are doing physics.   Unfortunately, since many of them work in physics departments, they can't say this.</p>",
        "id": 464584671,
        "sender_full_name": "John Baez",
        "timestamp": 1724402085
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464584671\">said</a>:</p>\n<blockquote>\n<p>I wish people working on quantum gravity could accept the fact that they're doing \"physics-inspired mathematics\", which is worth working on for its own sake, and stop pretending that they are doing physics.   Unfortunately, since many of them work in physics departments, they can't say this.</p>\n</blockquote>\n<p>I'm actually fine with quantum gravity researchers remaining in physics departments and saying that they are doing physics. What they shouldn't be doing is calling themselves scientists; they should be calling themselves natural philosophers. </p>\n<p>Physics began as a branch of natural philosophy (see for example Aristotelian physics) and some parts of physics only became a science in the 1600s when some physicists adopted the scientific method for their work in their part of physics. The hypothesis that the world was made of atoms was a long standing hypothesis in natural philosophy dating back to Democritus in ancient Greece but only became testable using the scientific method and part of science in the early 1900s. Quantum gravity in 2024 is in the same position as the atomic hypothesis was before the 1900s - lots of theorising but no readily available experiments, rendering it part of natural philosophy.</p>",
        "id": 464619592,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724410654
    },
    {
        "content": "<blockquote>\n<p>I quit working on quantum gravity because I wanted to accomplish something useful. I'd say it's currently what <a href=\"https://plato.stanford.edu/entries/lakatos/\">Lakatos</a> called a 'degenerating research programme'. </p>\n</blockquote>\n<p>Quantum gravity has always been a degenerating research programme in the Lakatos sense ever since the graviton was proposed in the 1930s, because it has always been \"intellectually suspect\" and \"bad science\" - unlike the case for electromagnetism and the strong and weak forces, there is no scientific evidence that gravity is quantum, no experiments done or observations made that gravity is indeed quantum; thus quantum gravity has never been empirically progressive.</p>",
        "id": 464624792,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724411976
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464583075\">said</a>:</p>\n<blockquote>\n<p>For example, Hawking's theory of black hole radiation used accepted principles to get a novel result: black holes radiate.  While this theory isn't testable for black holes (now, or maybe ever), it's been tested in systems analogous to black holes, like <a href=\"https://en.wikipedia.org/wiki/Sonic_black_hole\">acoustic black holes</a>, and it works.</p>\n</blockquote>\n<p>Black hole radiation is a hypothesis in natural philosophy which currently isn't testable and so isn't part of science. More generally, using logic and mathematics and currently accepted principles in physics to derive novel hypothesis isn't science in and of itself, what makes it science is the scientific method - testing of the hypothesis using experiment or observation, which is lacking here. </p>\n<p>Acoustic black holes are part of science but they aren't gravitational black holes, so aren't part of quantum gravity - they rather belong to fluid dynamics. This is an example where progress in a mathematically heavy part of natural philosophy did lead to progress in science elsewhere, but one shouldn't confuse science with mathematical natural philosophy.</p>",
        "id": 464627740,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724412803
    },
    {
        "content": "<p>The existence of gravitational waves is another example of a hypothesis in natural philosophy which became science. Sure the existence of gravitational waves is mathematically derivable from Einstein's theory of general relativity, but that didn't mean that gravitational waves needed to exist in the real world - equally it could have been that general relativity was wrong and needed to be replaced with something else. The existence of gravitational waves only became part of science when Joseph Weber started to construct the first gravitational wave detectors in the late 1960s, and it was eventually confirmed in 2017 by the LIGO team. But before the failed Weber bar experiments, gravitational waves were solely the realm of philosophical thought experiments based on the mathematics of general relativity.</p>",
        "id": 464630317,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724413753
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671813\">Madeleine Birchfield</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464619592\">said</a>:</p>\n<blockquote>\n<p>Quantum gravity in 2024 is in the same position as the atomic hypothesis was before the 1900s - lots of theorising but no readily available experiments, rendering it part of natural philosophy.</p>\n</blockquote>\n<p>There are lots of readily available experiments. <a href=\"https://dx.doi.org/10.1088/1361-6382/aaf9ca\">https://dx.doi.org/10.1088/1361-6382/aaf9ca</a></p>",
        "id": 464636953,
        "sender_full_name": "JR",
        "timestamp": 1724415649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"658891\">JR</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464636953\">said</a>:</p>\n<blockquote>\n<p>There are lots of readily available experiments. <a href=\"https://dx.doi.org/10.1088/1361-6382/aaf9ca\">https://dx.doi.org/10.1088/1361-6382/aaf9ca</a></p>\n</blockquote>\n<p>Then let me modify my statement. Most proposed quantum gravity theories out there, such as string theory and loop quantum gravity and asymptotic safety and entropic gravity and Euclidean twister unificaiton, do not have readily available experiments for them - and this is what John Baez and most other physicists are referring to when talking about \"quantum gravity\".</p>",
        "id": 464638747,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724416028
    },
    {
        "content": "<p>The situation with the quantum gravity theories right now is like if somebody proposed quantum electrodynamics in the 1800s before light was discovered to have quantum properties, and after 50 years somebody finally got around to merely proposing an experiment for the photoelectric effect to see whether light is actually quantum, but nobody has done the experiment yet.</p>",
        "id": 464639998,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724416377
    },
    {
        "content": "<p>In the 1800s nobody knew quantum mechanics, so nobody except a magician could have proposed QED, whereas now we know all the other forces are described using quantum thory, and we know thermodynamics is inconsistent with classical field theory, so it's hard to imagine gravity is <em>not</em> quantum mechanical in nature too.  People have tried having gravity not be quantized, and so far it hasn't worked well, not only for thermodynamic reasons but because coupling quantum fields to classical ones causes trouble.  So it was inevitable that physicists would study quantum gravity, and they found many results that seem robust, which we believe even before they've been tested (just as we all believed antimatter would fall down even before the experiment was finally possible).  But there are other aspects of quatum gravity where everyone is stuck, and those naturally get the most attention.</p>",
        "id": 464642750,
        "sender_full_name": "John Baez",
        "timestamp": 1724417148
    },
    {
        "content": "<blockquote>\n<p>So it was inevitable that physicists would study quantum gravity, and they found many results that seem robust, which we believe even before they've been tested (just as we all believed antimatter would fall down even before the experiment was finally possible). But there are other aspects of quatum gravity where everyone is stuck, and those naturally get the most attention.</p>\n</blockquote>\n<p>And that is perfectly fine, because physicists are first and foremost natural philosophers, who then become scientists when they subject their theories to the scientific method. And as natural philosophers, they can believe whatever they want about their theories and competing rival theories of quantum gravity if nobody has subjected them to the scientific method yet.</p>",
        "id": 464643780,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724417464
    },
    {
        "content": "<p>I partially bring this topic up because there have been philosophers of science like Richard Dawid who have been proposing \"post-empirical science\" to describe what's going on in string theory and quantum gravity, and we already have a name for that being used hundreds of years into the past - natural philosophy. </p>\n<p>Post-empirical science is a contradiction - science is empirical by definition, and to say that something is post-empirical means that it has moved beyond science.</p>",
        "id": 464646283,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724418389
    },
    {
        "content": "<p>Peter Woit talks about Richard Dawid's \"post-empirical science\" in</p>\n<p><a href=\"https://www.math.columbia.edu/~woit/wordpress/?p=10931\">https://www.math.columbia.edu/~woit/wordpress/?p=10931</a></p>\n<p>Where I disagree with also are those like George Ellis and Joe Silk in that blog post who insist that physics is a branch of science. No, it is a branch of natural philosophy where many portions of it have become part of science through physicists' use of the scientific method, but there have always been some parts of physics which are beyond scientific experiment due to technological or economic limitations or whatever other reasons, and so aren't part of science, and there will likely always continue to be parts of physics which will be beyond scientific experiment in the forseeable future, such as whether supersymmetric particles will show up at the Planck scale.</p>",
        "id": 464648241,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724418997
    },
    {
        "content": "<p>Since I brought up Peter Woit, I should say that physics as natural philosophy is precisely the part of physics that is \"not even wrong\". </p>\n<p>A lot of these contentious debates in physics will go away when physicists stop trying to claim that everything they do is science and begin to delineate which parts of physics are science and which parts are natural philosophy that hasn't been scientifically tested.</p>",
        "id": 464649011,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724419303
    },
    {
        "content": "<p>But surely they insist that physics is science for the same reason that they insist that developing theories of QG is physics: because their funding sources (and hence careers) are on the line. If you're not under the progressive banner of \"Science\", you won't have as much support. The motivation is sociological even if the classification debate is philosophical.</p>",
        "id": 464654198,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1724421162
    },
    {
        "content": "<p>Yes, it is currently more prestigious to be a scientist than a philosopher right now, but that wasn't always the case historically, and it may not always be the case in the future. If society ends up turning against \"Science\" in the future, then the physicists calling themselves scientists can rebrand themselves as natural philosophers and then they might have a chance at preserving what we know of in physics for future generations.</p>",
        "id": 464655991,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724421803
    },
    {
        "content": "<p>More importantly, a significant part of science is the ability to replicate experiments to demonstrate the validity of scientific results for contemporary society. One reason we know that general relativity is currently scientifically true in various domains is because there are currently people replicating experiments and observations in their labs first done in the 1910s and 1920s and the results have all been in accordance with general relativity. </p>\n<p>However, much of the evidence for the Higgs boson and other parts of the standard model has come from various particle colliders such as the LEP and its replacement the LHC. </p>\n<p>Now, there is currently debate over whether there will be funding for a replacement particle collider when the LHC stops performing experiments and gets decommissioned in the future. If no replacement particle collider ever gets built due to lack of funding, eventually a new generation of physicists will grow up not being able to replicate the experiments at the LEP and the LHC, won't be able to detect the Higgs boson, and won't have anybody around who still remembers when scientists at CERN did perform experiments to detect the Higgs. </p>\n<p>In this case, I highly doubt that \"the Higgs boson exists today\" remains a scientific truth to those future physicists, because all that the physicists will have is the fact that \"the LHC detected the Higgs in 2012\" and they no longer have any way of verifying whether the experiments at the LHC are still true in their time, or whether something has changed in the years between LHC and their contemporary society potentially yielding different results for the experiments, thus requiring physicists to go beyond the standard model. While \"the Higgs boson existed in 2012\" is verifiable fact, \"the Higgs boson exists today\" becomes just another hypothesis in natural philosophy which is beyond scientific experiment.</p>",
        "id": 464659431,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724422993
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464584671\">said</a>:</p>\n<blockquote>\n<p>On the other hand, work on quantum gravity has led to exciting mathematics, and it might well be profitably considered a branch of mathematics, or actually several branches of mathematics.   </p>\n<p>I wish people working on quantum gravity could accept the fact that they're doing \"physics-inspired mathematics\", which is worth working on for its own sake, and stop pretending that they are doing physics.   </p>\n</blockquote>\n<p>There is also the issue that mathematics itself has had a revolution in rigour in the late 19th century and early 20th century, and many of the things done in quantum gravity won't be accepted by mathematicians these days because nobody knows how to rigourously define them - such as the path integral. Now whether non-rigourous mathematics should still be considered mathematics is another question entirely.</p>",
        "id": 464662340,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724423990
    },
    {
        "content": "<p>I think that as governments and universities and research institutes gradually cut funding to particle physics experiments and redirect them elsewhere, i.e. to astrophysics, condensed matter, etc, a lot of standard model physics will in the future become like what quantum gravity is today, still being studied as theory by physicists in physics departments but with no contemporary connections to scientific experiment.</p>",
        "id": 464667555,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724425565
    },
    {
        "content": "<p>Trying to use the results of the LHC in the 2010s and 2020s to justify the truth of the standard model after the LHC has been shut down runs straight into the problem of induction. What the proponents of a new particle collider are trying to do is to set up a replacement for the LHC so that they can circumvent the problem of induction by directly testing for the Higgs and etc using the scientific method, so that the standard model can avoid becoming the next quantum gravity / string theory.</p>",
        "id": 464668104,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724425713
    },
    {
        "content": "<p>I'm not sure I entirely agree that the scientific method is what makes science science - that seems like a kind of grammatical prescriptivism. I would usually say science and natural philosophy refer to the same thing - my not very expert understanding is that the natural philosophers pioneered the scientific method and it's just a quirk of linguistics that the word science took over at some point. That's just a terminology thing though, I'm not disagreeing with the points made.</p>",
        "id": 464812098,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1724489690
    },
    {
        "content": "<p>Would you consider psychology, political science, economics, and other social sciences to be part of natural philosophy?</p>",
        "id": 464821430,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724496065
    },
    {
        "content": "<p>Because to me, it is only the <a href=\"https://en.wikipedia.org/wiki/Natural_science\">natural sciences</a> which is a part of natural philosophy. The other parts of sciences are parts of different philosophies - political science is part of political philosophy, linguistics is part of the philosophy of language, etc.</p>",
        "id": 464822941,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724496606
    },
    {
        "content": "<p>What unites all the sciences together and distinguishes itself from the rest of philosophy is that they use the scientific method.</p>",
        "id": 464822956,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724496626
    },
    {
        "content": "<p>Fair point about the natural sciences versus the other ones.</p>\n<p>I agree that the scientific method is a hugely important thing in science, and possibly \"the\" thing that caused it to become mostly culturally separate from philosophy (which in some ways I think was a mistake for both fields, but I can't deny it happened). I'm just skeptical that there's any good definition of science besides \"science is what scientists do\".</p>\n<p>This is partly because the scientific method isn't all that much of a monolithic thing in itself, and might be just as difficult to define as science is. I found [1] quite enlightening about differences in the scientific method between historical sciences like geology versus experimental sciences like physics.</p>\n<p>There's all sorts of edge cases too - are people using the scientific method when they test conjectures about the Ising model in 3 dimensions by simulating it numerically? What about sciences like artificial life and synthetic biology, where the goal is often (not always) to demonstrate the plausibility of a hypothesis by showing that it's in-principle possible, and hence the methodology is sometimes closer to engineering than science, even though the question is often a scientific one? Is a mathematician using the scientific method if they guess a conjecture and then try to prove or disprove it? My guess is that it isn't really possible to pin down the scientific method precisely enough to give these questions definite answers, without drawing some arbitrary distinction somewhere.</p>\n<p>[1] Cleland, Carol E. \"<a href=\"https://www.journals.uchicago.edu/doi/abs/10.1093/bjps/axq024?journalCode=bjps\">Prediction and explanation in historical natural science</a>.\" <em>The British Journal for the Philosophy of Science</em> (2011).</p>",
        "id": 464927197,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1724554825
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276071\">Nathaniel Virgo</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464927197\">said</a>:</p>\n<blockquote>\n<p>This is partly because the scientific method isn't all that much of a monolithic thing in itself, and might be just as difficult to define as science is. I found [1] quite enlightening about differences in the scientific method between historical sciences like geology versus experimental sciences like physics.</p>\n</blockquote>\n<p>The fields might have different scientific methods, but what they have in common is that they have <em>a</em> scientific method and are <em>using</em> them to test their theories. That can't really be said about the different theories of quantum gravity like string theory or loop quantum gravity at the moment. So, </p>\n<p><span class=\"user-mention silent\" data-user-id=\"276071\">Nathaniel Virgo</span> <a href=\"#narrow/stream/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/464927197\">said</a>:</p>\n<blockquote>\n<p>I'm just skeptical that there's any good definition of science besides \"science is what scientists do\".</p>\n</blockquote>\n<p>The problem with this is that this definition ends up making science and philosophy the same thing, since string theorists and loop quantum gravity theorists and asymptotic safety theorists all call themselves scientists but do not use the scientific method of physics at all, but rather other ways of reasoning and justifying their beliefs, such as logic and mathematics and aesthetic philosophical arguments like beauty, the naturalness principle, and the anthropic principle.</p>",
        "id": 465025947,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724602175
    },
    {
        "content": "<p>And maybe that is all there is to is, that science <em>is</em> philosophy.</p>",
        "id": 465026290,
        "sender_full_name": "Madeleine Birchfield",
        "timestamp": 1724602547
    },
    {
        "content": "<p>This was how I see it as well:  For me, philosophy is based on critical thinking. The scientific method is the practice of applying critical thinking  specifically to empirical observations. And other areas of philosophy apply it to different kinds of things.</p>",
        "id": 489514550,
        "sender_full_name": "Jencel Panic",
        "timestamp": 1734449833
    },
    {
        "content": "<p>I have no interest in trying to define \"science\" or the \"scientific method\", but it's worth noting that physics often \"goes out on a limb\", developing theories that nobody can test (yet, anyway), and often these limbs come crashing down.  String theory and loop quantum gravity are crashing down as we speak, but there are plenty of earlier examples.  Helge Kragh's book <em><a href=\"https://global.oup.com/academic/product/higher-speculations-9780198726371\">Higher Speculations: Grand Theories and Failed Revolutions in Physics and Cosmology</a></em> is a great history of them.  We have enough evidence to start theorizing about why this happens and what the results are.</p>",
        "id": 489562073,
        "sender_full_name": "John Baez",
        "timestamp": 1734465405
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/229134-theory.3A-philosophy/topic/Science.20vs.20natural.20philosophy/near/489562073\">said</a>:</p>\n<blockquote>\n<p>String theory and loop quantum gravity are crashing down as we speak</p>\n</blockquote>\n<p>Off topic, but is there a good place you recommend to read about this? (Either that is completely popular, or that is intended for a technical audience but doesn't require <em>too</em> much math-physics background?) I've heard this opinion recently from several peers of mine at Penn, but know literally nothing about it. Is it that they have failed to make testable predictions, which I've always understood to be a (very serious) criticism of these theories, or are there new negative results?</p>",
        "id": 489563879,
        "sender_full_name": "Riley Shahar",
        "timestamp": 1734466066
    },
    {
        "content": "<p>(Sorry---I should have scrolled up! I joined the zulip after the preceeding conversation, so at first I only saw the two recent messages.)</p>",
        "id": 489565093,
        "sender_full_name": "Riley Shahar",
        "timestamp": 1734466540
    },
    {
        "content": "<p>Neither string theory nor loop quantum gravity truly make testable predictions, in the following sense: starting from the core theory, without adding <em>ad hoc</em> assumptions or making vast leaps of logic, these theories predict essentially nothing that we see around us, much less make new predictions that we can test with experiments today.</p>\n<p>However, physicists are not shy about making <em>ad hoc</em> assumptions and making vast leaps of logic, especially when they want to make some testable predictions!</p>\n<p>(There is also much debate about what counts as an <em>ad hoc</em> assumption or a leap of logic.)</p>\n<p>So string theorists have a long track record of 'predicting' particles and other effects that are just out of reach by current detection methods, and claiming that future experiments will see them.  Then when these experiments are carried out, these predictions are always falsified.  But string theorists argue that  the core of string theory is not falsified, only the extra <em>ad hoc</em> assumptions and leaps of logic.  So string theory carries on.  </p>\n<p>And yet, despite having installed string theorists in top positions at most institutions of theoretical physics research, string theory is gradually becoming more and more unpopular.  Ordinary physics departments are less likely to hire string theorists than they were 10 years ago - and that was also true 10 years ago.   So it seems the tree branch is slowly breaking off the tree, and will crash onto the forest floor, opening up a bit more light for new plants to grow.</p>\n<p>If you want to read more about this, the canonical texts are</p>\n<ul>\n<li>Peter Woit, <em>Not Even Wrong</em>.</li>\n</ul>\n<p>and</p>\n<ul>\n<li>Sabine Hossenfelder, <em>Lost in Math</em>.</li>\n</ul>",
        "id": 489573422,
        "sender_full_name": "John Baez",
        "timestamp": 1734470148
    },
    {
        "content": "<p>Peter's book is more technical, Sabine's is more polemical.</p>",
        "id": 489573948,
        "sender_full_name": "John Baez",
        "timestamp": 1734470406
    },
    {
        "content": "<p>Loop quantum gravity has similar problems, but far fewer people work on it, and it hasn't managed to dominate institutions of higher learning, so there aren't books being written about its failure.   It's more like an ordinary theory that fails to make progress - there have been many.</p>",
        "id": 489574637,
        "sender_full_name": "John Baez",
        "timestamp": 1734470728
    },
    {
        "content": "<p>Thank you! This makes a lot of sense; definitely will check out the books.</p>",
        "id": 489577879,
        "sender_full_name": "Riley Shahar",
        "timestamp": 1734472280
    },
    {
        "content": "<p>Here is a good quick intro:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=8JYwmxZBjZQ\">Is string theory dead?</a><div class=\"youtube-video message_inline_image\"><a data-id=\"8JYwmxZBjZQ\" href=\"https://www.youtube.com/watch?v=8JYwmxZBjZQ\"><img src=\"https://uploads.zulipusercontent.net/37664483973f145d50721c9a9a7720db3f9c5a2f/68747470733a2f2f692e7974696d672e636f6d2f76692f384a59776d785a426a5a512f64656661756c742e6a7067\"></a></div></li>\n</ul>",
        "id": 489584560,
        "sender_full_name": "John Baez",
        "timestamp": 1734475348
    }
]