[
    {
        "content": "<p>I've posted a new preprint on the arXiv called <a href=\"https://arxiv.org/abs/2106.15042\">LNL polycategories and doctrines of linear logic</a>.  Here's the abstract:</p>\n<blockquote>\n<p>We define and study LNL polycategories, which abstract the judgmental structure of classical linear logic with exponentials. Many existing structures can be represented as LNL polycategories, including LNL adjunctions, linear exponential comonads, LNL multicategories, IL-indexed categories, linearly distributive categories with storage, commutative and strong monads, CBPV-structures, models of polarized calculi, skew multicategories, as well as ordinary cartesian and symmetric multicategories and monoidal categories, polycategories, and linearly distributive and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous categories. To study such classes of structures uniformly, we define a notion of LNL doctrine, such that each of these classes of structures can be identified with the algebras for some such doctrine. We show that free algebras for LNL doctrines can be presented by a sequent calculus, and that every morphism of doctrines induces an adjunction between their 2-categories of algebras.</p>\n</blockquote>\n<p>One of my goals with this paper is to fill in some of the \"missing foundation\" for the not-yet-existent chapter 3 of my <a href=\"http://mikeshulman.github.io/catlog/catlog.pdf\">categorical logic notes</a>.  Another is to set up the definitions needed for a conjectural extension of <a href=\"https://arxiv.org/abs/2004.08487\">*-autonomous envelopes and 2-conservativity of duals</a> to theories with exponential modalities.  Along the way I was surprised to find how many special cases of LNL polycategories have already been studied in the literature under different names with different technologies.</p>",
        "id": 244366457,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1625014247
    },
    {
        "content": "<p>I suppose possibly the middle of LICS was not the best time to post this preprint, but I couldn't wait any longer to get it off my to-do list. (-:  It'll still be there next week.  (Or next month.)</p>",
        "id": 244377783,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1625029242
    },
    {
        "content": "<p>The continual stream of examples of structures in the literature that are special cases of LNL polycategories is highly satisfying! The entries-only presentation is a neat solution to the combinatorics problem too. I need to come back and revisit the sections on doctrines (especially the connection between the SOA and inductive definitions, which sounds intriguing), but what I've read so far is very clear and compelling.</p>",
        "id": 244410357,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1625053636
    },
    {
        "content": "<p>This looks very interesting! I wonder if it's possible to give proof nets for LNL polycategories.</p>",
        "id": 244691833,
        "sender_full_name": "Chad Nester",
        "timestamp": 1625227037
    },
    {
        "content": "<p>Surely!</p>",
        "id": 244705947,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1625234363
    }
]