[
    {
        "content": "<p>(I was away this week, so didn't get a chance to post this before the talk, but am posting it now in case anybody wants to discuss it!)</p>",
        "id": 243210843,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1624052414
    },
    {
        "content": "<p><em>Abstract:</em><br>\nWouldn't it be great if monoidal categories were nice and easy? They are! We will discuss how a monoidal category embeds into a \"nice\" one, and how a \"nice\" monoidal category consists of global sections of a sheaf of \"easy\" monoidal categories. This theorem cleanly separates \"spatial\" and \"temporal\" directions of monoidal categories.</p>\n<p>More precisely, \"nice\" means that certain morphisms into the tensor unit have joins that are respected by tensor products, namely those morphisms that are central and idempotent with respect to the tensor product. By \"easy\" we mean that the topological space of which these central idempotents form the opens is a lot like a singleton space, namely local.</p>\n<p>Categorifying flabby sheaves in the appropriate way makes the representation functorial from monoidal categories to schemes of local monoidal categories. The representation respects many properties of monoidal categories: if a monoidal category is closed/traced/complete/Boolean, then so are its local stalks. As instances we recover the Lambek-Moerdijk-Awodey sheaf representation for toposes, the Stone representation of Boolean algebras, the representation by germs of open subsets of a topological space, and the Takahashi representation of Hilbert modules as continuous fields of Hilbert spaces.</p>\n<p>YouTube: <a href=\"https://youtu.be/XHCa8vk_T00\">https://youtu.be/XHCa8vk_T00</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"XHCa8vk_T00\" href=\"https://youtu.be/XHCa8vk_T00\"><img src=\"https://uploads.zulipusercontent.net/eab2867c723216009bc38418046f49a661b6307b/68747470733a2f2f692e7974696d672e636f6d2f76692f5848436138766b5f5430302f64656661756c742e6a7067\"></a></div>",
        "id": 243210866,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1624052444
    }
]