[
    {
        "content": "<p><time datetime=\"2022-06-16T17:00:00Z\">2022-06-16T17:00:00+00:00</time> </p>\n<p><strong>Christoph Benzmueller</strong>: <em>Logico-pluralistic exploration of foundational theories with computers</em></p>\n<p>Symbolic knowledge representation and reasoning (KR&amp;R) is a key aspect of human intelligence. Among other things, it enables scientists to explore new theories, declaratively describe them, and share them with colleagues. In the natural sciences, abstract theories often arise from observations and experiments; in other fields, such as metaphysics, they may result from pure thought experiments, possibly without data from which to start (and learn from). Strong AI without explicit symbolic KR&amp;R capabilities thus seems unthinkable. But how can the exploration of abstract theories, especially fundamental theories of metaphysics and mathematics, including logical formalisms, be fruitfully supported on computers? </p>\n<p>In this talk, I review recent contributions in which a logico-pluralistic KR&amp;R methodology and infrastructure, called LogiKEy, has been successfully applied to the exploration and assessment of foundational theories in metaphysics and mathematics. One such exploratory study on the axiomatic foundations of category theory, conducted jointly with Dana Scott and students at FU Berlin, will be described in some more detail. Since LogiKEy also supports exploration and assessment of ethical and legal theories, it also has applications in the areas of trusted AI and AI&amp;Law.</p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=c3qfeSmhN-8\">https://www.youtube.com/watch?v=c3qfeSmhN-8</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"c3qfeSmhN-8\" href=\"https://www.youtube.com/watch?v=c3qfeSmhN-8\"><img src=\"https://uploads.zulipusercontent.net/c0cca8a91565c5e768718ee44fc05b0f44940e07/68747470733a2f2f692e7974696d672e636f6d2f76692f6333716665536d684e2d382f64656661756c742e6a7067\"></a></div>",
        "id": 285994107,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1655156861
    }
]