[
    {
        "content": "<p>this Thursday (the 28th) at 17:00 UTC (back to our usual time)</p>",
        "id": 259086872,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1635250511
    },
    {
        "content": "<p><strong>Dorette Pronk</strong>: <em>Doubly Lax Colimit of Double Categories with Applications</em></p>\n<p>Thus far, lax and oplax pseudo colimits of double categories have been considered in two flavours [2]: horizontally lax and vertically lax, based on the notions of horizontal and vertical transformations (respectively) between double functors. Also, the diagrams of double categories have typically been indexed by a 2-category.</p>\n<p>In this work we introduce diagrams indexed by a double category; in order to make sense of this we will map into a version of the quintets of the category of double categories, because this category itself is only enirched in double categories and is often taken as a 2-category. Between the new indexing functors we introduce a new notion of transformation, namely doubly lax transformation. We then introduce a double categorical version of the Grothendieck construction and show that it has a universal property as doubly lax colimit of the diagram; i.e., a colimit that is lax with respect to the new transformations.</p>\n<p>As applications we obtain:</p>\n<p>— a universal property as lax colimit for the Grothendieck construction for bicategories described in [1];</p>\n<p>— a universal property for the elements construction for double categories;</p>\n<p>— a notion of fibration for double categories, different from the internal one described by Street and others;</p>\n<p>— a double categorical generalization of the classical tom Dieck fundamental groupoid for a space with an action by a topological group.</p>\n<p>This is joint work with Marzieh Bayeh (University of Ottawa) and Martin Szyld (Dalhousie University).</p>",
        "id": 259086890,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1635250531
    },
    {
        "content": "<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a><br>\nYouTube: <a href=\"https://youtu.be/0OesTY87uao\">https://youtu.be/0OesTY87uao</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"0OesTY87uao\" href=\"https://youtu.be/0OesTY87uao\"><img src=\"https://uploads.zulipusercontent.net/b165cdf817661f8cb1eb46b3d2563471519dbe22/68747470733a2f2f692e7974696d672e636f6d2f76692f304f65735459383775616f2f64656661756c742e6a7067\"></a></div>",
        "id": 259086924,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1635250562
    },
    {
        "content": "<p>starting in 5!</p>",
        "id": 259418906,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1635440052
    },
    {
        "content": "<p>(minutes, that is)</p>",
        "id": 259418916,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1635440057
    }
]