[
    {
        "content": "<p>Today (the 10th of June) at 17:00 UTC:</p>\n<p><strong>A category of hybrid systems</strong> (Eugene Lerman)<br>\nHybrid systems are dynamical systems that exhibit both continuous time evolution and abrupt transitions. Examples include mechanical systems (e.g., a ball bouncing off a floor) and cyber-physical systems (e.g., a room with a thermostat). Definitions of a hybrid dynamical systems vary widely in literature but they usually include directed graphs, spaces with vector fields attached to the nodes of graphs and partial maps or, more generally, relations attached to the edges of graphs. The vector fields are used to model continuous evolution and the relations the abrupt transitions.</p>\n<p>I wanted to understand if analogues of coupled cell networks of Golubitsky, Stewart and their collaborators (these are highly structured coupled systems of ODEs) make sense for hybrid dynamical systems. In order to do that I needed to make sense of open hybrid systems, their interconnection, networks of hybrid systems and maps between networks of hybrid systems.</p>\n<p>Proceeding by analogy with continuous time systems I introduced the notion of a hybrid phase space and its underlying manifold. A hybrid phase space can be succinctly defined as double functor. Hybrid phase spaces form a category HyPh with morphisms coming from vertical natural transformations. A hybrid dynamical system is a pair (A,X) where A is a hybrid phase space and X is a vector field on the manifold U(A) underlying A. I then constructed a category HyDS of hybrid dynamical system. The definition of HyDS passes a couple of sanity checks.</p>\n<p>Using the foundation laid out above James Schmidt and I showed that one can also define hybrid surjective submersions, hybrid open systems, their interconnections and networks of hybrid systems. This way one can model systems of bouncing balls and several interconnected rooms with separate thermostats.</p>\n<p><em>References:</em> arXiv:1612.01950 [math.DS] and arXiv:1908.10447 [math.DS] (DOI: 10.1016/j.geomphys.2019.103582).</p>\n<hr>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=B_EBoVAPEJI\">https://www.youtube.com/watch?v=B_EBoVAPEJI</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"B_EBoVAPEJI\" href=\"https://www.youtube.com/watch?v=B_EBoVAPEJI\"><img src=\"https://uploads.zulipusercontent.net/7be53125f751825eeeae5e76bbb589eb70af55c3/68747470733a2f2f692e7974696d672e636f6d2f76692f425f45426f564150454a492f64656661756c742e6a7067\"></a></div>",
        "id": 242214342,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1623334935
    }
]