[
    {
        "content": "<p>Thursday the 2nd of December, 17:00 UTC<br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=Ra-PLnog_M0\">https://www.youtube.com/watch?v=Ra-PLnog_M0</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Ra-PLnog_M0\" href=\"https://www.youtube.com/watch?v=Ra-PLnog_M0\"><img src=\"https://uploads.zulipusercontent.net/9d0fd6667f120539c38b6b869c0b80056cf4673a/68747470733a2f2f692e7974696d672e636f6d2f76692f52612d504c6e6f675f4d302f64656661756c742e6a7067\"></a></div>",
        "id": 263011813,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638194541
    },
    {
        "content": "<p><strong>Evan Patterson</strong>: <em>Categories of diagrams in data migration and computational physics</em></p>\n<p>Diagrams are among the most fundamental and ubiquitous concepts of category theory. Less appreciated are the several notions of morphism between diagrams in a category. After reviewing the resulting categories of diagrams, this talk will explain their central role in two recent projects by the author and collaborators. First, due to their close connections with limits and colimits, the categories of diagrams provide a natural syntax for defining flexible data migrations between categorical databases. We describe a prototype implementation of this system in Catlab.jl. In the second part of the talk, we explain how \"Tonti diagrams,\" diagrammatic presentations of physics equations expressed in vector calculus or exterior calculus, can be formalized using category-theoretic diagrams. When combined with a suitable discretization scheme, such as the discrete exterior calculus (DEC), the result is a diagrammatic and compositional approach to building numerical simulators of physical systems.</p>",
        "id": 263011844,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638194561
    },
    {
        "content": "<p>starting in 25 minutes!</p>",
        "id": 263464267,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638462825
    }
]