[
    {
        "content": "<p>Thursday the 3rd of March, 17:00 UTC</p>",
        "id": 273534501,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1646073551
    },
    {
        "content": "<p>This talk bridges between two major paradigms in computation, the <em>functional</em>, at basis computation from input to output, and the <em>interactive</em>, where computation reacts to its environment while underway. Central to any compositional theory of interaction is the dichotomy between a system and its environment. Concurrent games and strategies address the dichotomy in fine detail, very locally, in a distributed fashion, through distinctions between Player moves (events of the system) and Opponent moves (those of the environment). A functional approach has to handle the dichotomy much more ingeniously, through its blunter distinction between input and output. This has led to a variety of functional approaches, specialised to particular interactive demands. Through concurrent games we can more clearly see what separates and connects the differing paradigms, and show how:</p>\n<p>— to lift functions to strategies; the \"Scott order\" intrinsic to concurrent games plays a key role in turning functional dependency to causal dependency.</p>\n<p>— several paradigms of functional programming and logic arise naturally as subcategories of concurrent games, including stable domain theory; nondeterministic dataflow; geometry of interaction; the dialectica interpretation; lenses and optics; and their extensions to containers in dependent lenses and optics.</p>\n<p>— to transfer enrichments of strategies (such as to probabilistic, quantum or real-number computation) to functional cases.</p>",
        "id": 273534511,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1646073557
    },
    {
        "content": "<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=ywHNG6DYAGg\">https://www.youtube.com/watch?v=ywHNG6DYAGg</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ywHNG6DYAGg\" href=\"https://www.youtube.com/watch?v=ywHNG6DYAGg\"><img src=\"https://uploads.zulipusercontent.net/be2102488e7cc446574d73912144e56764ef1ba8/68747470733a2f2f692e7974696d672e636f6d2f76692f7977484e473644594147672f64656661756c742e6a7067\"></a></div>",
        "id": 273534523,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1646073568
    },
    {
        "content": "<p>starting in 5 minutes!</p>",
        "id": 274002181,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1646326389
    }
]