[
    {
        "content": "<p><time datetime=\"2022-06-09T17:00:00Z\">2022-06-09T17:00:00+00:00</time></p>\n<p><strong>Nicolas Behr</strong>: <em>Fundamentals of Compositional Rewriting Theory</em></p>\n<p>This presentation is based upon [1] (joint work with R. Harmer and J. Krivine).</p>\n<p>Categorical rewriting theory is a research field in both computer science and applied category theory, with a rich history spanning over 50 years of active developments, starting with the pioneering work of Ehrig in the 1970s.</p>\n<p>In this talk, I will present recent results [1] on a novel foundation for reasoning about rewriting theories via so-called compositional rewriting double categories (crDCs). The design principles followed in this approach are the typical \"unify and conquer\" strategy of applied category theory and a particular variant of the notion of compositionality.</p>\n<p>To wit, crDCs permit to formulate a wide variety of categorical rewriting semantics uniformly, whereby the horizontal category for a given semantics models the rewriting rules, while the vertical category models matchings and co-matchings of rules into objects, and where the squares model so-called direct derivations (i.e., individual rewriting steps). Even before considering compositionality, it is already noteworthy that in order for crDCs to be well-defined, strong constraints are imposed upon the horizontal and vertical categories and the squares of the crDC, which in effect suggest categories with adhesivity properties (e.g., toposses, quasi-toposses, adhesive HLR categories,...) as natural starting points for constructing crDCs. In this sense, the notion of crDCs thus permits to justify the by now standard approach for categorical rewriting theories developed over the past 20 years as being based upon categories with adhesivity properties (starting with the seminal work of Lack and Sobocinski on adhesive categories) from a clear mathematical high-level perspective.</p>\n<p>Compositionality, on the other hand, is a much deeper mathematical property that a categorical rewriting theory may carry. This property entails the existence of so-called Concurrency and Associativity Theorems. The former concerns being able to reason on two-step rewriting sequences via implementing the overall effect of the two-step rewrite via a composite rule applied in a single rewrite step, and vice versa. The Associativity Theorem then implies that the operation of forming compositions of rewriting rules is, in a certain sense, associative. Compositionality is a necessary and crucial ingredient in the stochastic mechanics and rule algebra formalism developed by Behr et al. since 2015, and which permits to provide a mathematically fully consistent and universal formalism for continuous- [2] and discrete-time Markov Chains [3] (central to applications of rewriting to bio- and organo-chemistry, social network modeling, etc.) and rule-algebraic combinatorics [4].</p>\n<p>A central result of [1] is then that a sufficient set of conditions on a double category to model a <em>compositional</em> rewriting theory consists in requiring certain fibrational properties for the vertical source and target functors from squares of the double categories, i.e., that they are (residual) multi-opfibrations. I will sketch how these fibrational properties in conjunction with the other crDC axioms yield a completely uniform proof of both the Concurrency and the Associativity Theorems, and, time permitting, how a large variety of categorical rewriting semantics indeed fall under the umbrella of our novel crDC formalism.</p>\n<p>Finally, I will provide an overview of open questions and potential fruitful cross-connections of crDC theory with the TIC and broader ACT communities.</p>\n<p>[1] N. Behr, R. Harmer and J. Krivine, \"Fundamentals of Compositional Rewriting Theory\", <a href=\"http://arxiv.org/abs/2204.07175\">arxiv.org/abs/2204.07175</a></p>\n<p>[2] N. Behr, J. Krivine, J.L. Andersen, D. Merkle (2021), \"Rewriting theory for the life sciences: A unifying theory of CTMC semantics\", <a href=\"http://doi.org/10.1016/j.tcs.2021.07.026\">doi.org/10.1016/j.tcs.2021.07.026</a></p>\n<p>[3] N. Behr, B.S. Bello, S. Ehmes, R. Heckel (2021), \"Stochastic Graph Transformation For Social Network Modeling\", <a href=\"http://doi.org/10.4204/EPTCS.350.3\">doi.org/10.4204/EPTCS.350.3</a></p>\n<p>[4] N. Behr (2021), \"On Stochastic Rewriting and Combinatorics via Rule-Algebraic Methods\", <a href=\"http://dx.doi.org/10.4204/EPTCS.334.2\">dx.doi.org/10.4204/EPTCS.334.2</a></p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\nYouTube: <a href=\"https://youtu.be/n4_68mk3c00\">https://youtu.be/n4_68mk3c00</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"n4_68mk3c00\" href=\"https://youtu.be/n4_68mk3c00\"><img src=\"https://uploads.zulipusercontent.net/ea410e0f40e064745c57028f09a80c6d6c4bc019/68747470733a2f2f692e7974696d672e636f6d2f76692f6e345f36386d6b336330302f64656661756c742e6a7067\"></a></div>",
        "id": 285132156,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1654531195
    }
]