[
    {
        "content": "<p><time datetime=\"2022-06-30T17:00:00Z\">2022-06-30T17:00:00+0:00</time></p>\n<p><strong>Noam Zeilberger</strong>: <em>Parsing as a lifting problem and the Chomsky-Schützenberger representation theorem</em></p>\n<p>Joint work with Paul-André Melliès.</p>\n<p>In “Functors are Type Refinement Systems” [1], we argued for the idea that rather than being modelled merely as categories, type systems should be modelled as functors p : D → T from a category D whose morphisms are typing derivations to a category T whose morphisms are the terms corresponding to the underlying subjects of those derivations. One advantage of this fibrational point of view is that the notion of typing judgment receives a simple mathematical status, as a triple (R,f,S) consisting of two objects R, S in D and a morphism f in T such that p(R)=dom(f) and p(S)=cod(f). The question of finding a typing derivation for a typing judgment (R,f,S) then reduces to the lifting problem of finding a morphism α : R → S such that p(α)=f. We developed this perspective in a series of papers, and believe that it may be usefully applied to a large variety of deductive systems, beyond type systems in the traditional sense. In this work [2], we focus on derivability in context-free grammars, a classic topic in formal language theory with wide applications in computer science.</p>\n<p>The talk will begin by explaining how derivations in any context-free grammar G may be naturally encoded by a functor of operads p : Free S → W[Σ] from a freely generated operad into a certain “operad of spliced words”. This motivates the introduction of a more general notion of context-free grammar over any category C, defined as a finite species S equipped with a color denoting the start symbol and a functor of operads p : Free S → W[C] into the operad of spliced arrows in C. We will see that many standard concepts and properties of context-free grammars and languages can be formulated within this framework, thereby admitting simpler analysis, and that parsing may indeed be profitably considered from a fibrational perspective, as a lifting problem along a functor from a freely generated operad.</p>\n<p>The second half of the talk will be devoted to a new proof of the Chomsky-Schützenberger Representation Theorem. An important ingredient is the identification of a left adjoint C[−] : Operad → Cat to the operad of spliced arrows functor W[−] : Cat → Operad. This construction builds the contour category C[O] of any operad O, whose arrows have a geometric interpretation as “oriented contours” of operations. A direct consequence of the contour / splicing adjunction is that every finite species equipped with a color induces a universal context-free grammar, generating a language of tree contour words. Finally, we prove a generalization of the Chomsky-Schützenberger Representation Theorem, establishing that any context-free language of arrows over a category C is the functorial image of the intersection of a C-chromatic tree contour language and a regular language.</p>\n<p>[1] P.-A. Melliès and N. Zeilberger, Functors are type refinement systems, POPL 2015</p>\n<p>[2] P.-A. Melliès and N. Zeilberger, Parsing as a lifting problem and the Chomsky-Schützenberger representation theorem, to appear at MFPS 2022, preliminary version available at <a href=\"http://hal.archives-ouvertes.fr/hal-03702762\">hal.archives-ouvertes.fr/hal-03702762</a></p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=AX8tpQSi8v8\">https://www.youtube.com/watch?v=AX8tpQSi8v8</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"AX8tpQSi8v8\" href=\"https://www.youtube.com/watch?v=AX8tpQSi8v8\"><img src=\"https://uploads.zulipusercontent.net/06517e44b14abfb381570eff21a2d1139300543a/68747470733a2f2f692e7974696d672e636f6d2f76692f41583874705153693876382f64656661756c742e6a7067\"></a></div>",
        "id": 287596222,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1656344571
    }
]