[
    {
        "content": "<p>This Thursday (18th of November) at 17:00 UTC.<br>\nZoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=JEOKvG1zcbY\">https://www.youtube.com/watch?v=JEOKvG1zcbY</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"JEOKvG1zcbY\" href=\"https://www.youtube.com/watch?v=JEOKvG1zcbY\"><img src=\"https://uploads.zulipusercontent.net/cc8fed0ead3375b3756fb2efa569990b7a44895c/68747470733a2f2f692e7974696d672e636f6d2f76692f4a454f4b7647317a6362592f64656661756c742e6a7067\"></a></div>",
        "id": 261495672,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636982575
    },
    {
        "content": "<p><strong>Paolo Perrone</strong>: <em>The rise of quantitative category theory</em></p>\n<p>In several domains of applications, category theory can be useful to add conceptual clarity and scalability to mathematical models. However, ordinary categories often fail to grasp some quantitative aspects: the total cost of a certain strategy, the number of composite steps, the discrepancy between a concrete construction and its ideal model, and so on.</p>\n<p>In order to incorporate these aspects, it is helpful to switch to a \"quantitative\" version of categories: weighted categories. These are particular enriched categories where each arrow carries a number, or \"weight\", as in a weighted graph. The composition of paths comes with a triangle inequality, analogous to the one of metrics and norms, which equips universal properties with quantitative bounds. Most results in category theory have a weighted analogue, which often carries additional geometric or analytic significance. Weighted categories have been around since early work of Lawvere, but only in the last few years researchers are starting to recognize their importance. More and more recent papers are using them in fields as diverse as topological data analysis, geometry, and probability theory, some times even rediscovering the concepts independently.</p>\n<p>In this talk we are going to see what it's like to work with weighted categories, their relationship with graphs, and the quantitative aspects about limits and colimits. We will also define a weighted analogue of lenses, and use it to express liftings of transport plans between probability measures.</p>",
        "id": 261495720,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636982597
    },
    {
        "content": "<p>Here is a relevant preprint, <a href=\"https://arxiv.org/abs/2110.06591\">https://arxiv.org/abs/2110.06591</a>.<br>\nFor the lenses part, I suggest the work of Bryce Clarke <a href=\"http://www.tac.mta.ca/tac/volumes/35/44/35-44abs.html\">here</a> and <a href=\"https://arxiv.org/abs/2009.06835v1\">here</a>.</p>\n<p>Anyway, the talk will not assume any previous knowledge of either lenses, or enriched categories.</p>",
        "id": 261915438,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1637235287
    },
    {
        "content": "<p>starting pretty soon!</p>",
        "id": 261955714,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1637254526
    }
]