[
    {
        "content": "<p>30th of September, at the <strong><em>unusual time of 15:00 UTC</em></strong>!</p>",
        "id": 255235770,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632842824
    },
    {
        "content": "<p>YouTube: <a href=\"https://youtu.be/rt0a84vzYrc\">https://youtu.be/rt0a84vzYrc</a><br>\nZoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"rt0a84vzYrc\" href=\"https://youtu.be/rt0a84vzYrc\"><img src=\"https://uploads.zulipusercontent.net/7126a95d9626bbb63c49151eacff76ac0e297aec/68747470733a2f2f692e7974696d672e636f6d2f76692f727430613834767a5972632f64656661756c742e6a7067\"></a></div><p><em>Abstract:</em></p>\n<p>In Lawvere theories the central role is played by categories with finite products. The free category with finite products on one object (FinSet^op) is the Lawvere theory of the empty algebraic theory, and the free category with finite products on a signature (of an algebraic theory) has a concrete description as a category of classical syntactic terms. But, using a theorem due to Thomas Fox, we can also capture these categories nicely using string diagrams.</p>\n<p>The string diagrammatic approach gets you further than ordinary syntax. In a POPL 21 paper with Ivan Di Liberti, Fosco Loregian and Chad Nester, we developed a Lawvere-style approach to algebraic theories with partially defined operations. It turns out that in this setting, instead of categories with finite products, the relevant concept is discrete cartesian restriction categories (dcrc). And string diagrams are the right syntax for this setting: they let us describe the free dcrc on an object and the free dcrc on a signature. I will sketch some of our results and talk about some of the ramifications, including a string diagrammatic description of categories with free finite limits.</p>",
        "id": 255235850,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632842868
    },
    {
        "content": "<p>this starts in two hours, which is two hours earlier than the normal time!</p>",
        "id": 255568471,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1633006628
    }
]