[
    {
        "content": "<p><strong>Last colloquium of 2021!</strong></p>\n<p>Thursday the 9th of December,  17:00 UTC</p>\n<p><em>Abstract:</em><br>\n(Joint work with Jon Sterling and Yue Niu)</p>\n<p>The informal phase distinction between compile-time and run-time in programming languages is formally manifested by the distinction between kinds, which classify types, and types, which classify code. The distinction underpins standard programming methodology whereby code is first type-checked for consistency before being compiled for execution. When used effectively, types help eliminate bugs before they occur.</p>\n<p>Program modules, in even the most rudimentary form, threaten the distinction, comprising as they do both types and programs in a single unit. Matters worsen when considerating \"open\" modules, with free module variables standing for its imports. To maintain the separation in their presence it is necessary to limit the dependency of types, the static parts of a module, to their imported types. Such restrictions are fundamental for using dependent types to express modular structure, as originally suggested by MacQueen.</p>\n<p>To address this question Moggi gave an \"analytic\" formulation of program modules in which modules are explicitly separated into their static and dynamic components using tools from category theory. Recent work by Dreyer, Rossberg, and Russo develops this approach fully in their account of ML-like module systems. In this talk we consider instead a \"synthetic\" formulation using a proposition to segregate the static from the dynamic, in particular to define static equivalence to manage type sharing and type dependency</p>\n<p><em>Robert Harper is a Professor of Computer Science at Carnegie Mellon, where he has been a member of faculty since 1988. He is past recipient of the Allen Newell Award for research excellence and the Herbert Simon Award for teaching excellence. He is author of Practical Foundations for Programming Languages, a textbook account of programming language theory. His work focuses on the application of type theory to program development, language design, compiler construction, and mechanized proof.</em></p>",
        "id": 263862174,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638802974
    },
    {
        "content": "<p>YouTube: <a href=\"https://www.youtube.com/watch?v=7DYkyB1Rm3I\">https://www.youtube.com/watch?v=7DYkyB1Rm3I</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"7DYkyB1Rm3I\" href=\"https://www.youtube.com/watch?v=7DYkyB1Rm3I\"><img src=\"https://uploads.zulipusercontent.net/28e4ad41ae7bfdc516ed01555b87a097f2ab66aa/68747470733a2f2f692e7974696d672e636f6d2f76692f3744596b794231526d33492f64656661756c742e6a7067\"></a></div>",
        "id": 263862209,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1638802988
    }
]