[
    {
        "content": "<p>the Topos Institute Colloquium resumes this coming Thursday, with Samson Abramsky talking about \"The logic of contextuality\", which bridges between category theory, sheaf theory, graph theory, and quantum information — very exciting!<br>\n<a href=\"https://researchseminars.org/talk/ToposInstituteColloquium/4/\">https://researchseminars.org/talk/ToposInstituteColloquium/4/</a></p>",
        "id": 228819317,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614880460
    },
    {
        "content": "<p>here's the abstract (though Samson has said that he doesn't intend to cover everything, and that the talk will be as self-contained as possible!)</p>\n<hr>\n<p>(joint work with Rui Soares Barbosa)</p>\n<p>Contextuality is a key signature of quantum non-classicality, which has been shown to play a central role in enabling quantum advantage for a wide range of information-processing and computational tasks. We study the logic of contextuality from a structural point of view, in the setting of partial Boolean algebras introduced by Kochen and Specker in their seminal work. These contrast with traditional quantum logic a la Birkhoff--von Neumann in that operations such as conjunction and disjunction are partial, only being defined in the domain where they are physically meaningful.</p>\n<p>We study how this setting relates to current work on contextuality such as the sheaf-theoretic and graph-theoretic approaches. We introduce a general free construction extending the commeasurability relation on a partial Boolean algebra, i.e. the domain of definition of the binary logical operations. This construction has a surprisingly broad range of uses. We apply it in the study of a number of issues, including:</p>\n<ul>\n<li>\n<p>establishing the connection between the abstract measurement scenarios studied in the contextuality literature and the setting of partial Boolean algebras;</p>\n</li>\n<li>\n<p>formulating various contextuality properties in this setting, including probabilistic contextuality as well as the strong, state-independent notion of contextuality given by Kochen--Specker paradoxes, which are logically contradictory statements validated by partial Boolean algebras, specifically those arising from quantum mechanics;</p>\n</li>\n<li>\n<p>investigating a Logical Exclusivity Principle, and its relation to the Probabilistic Exclusivity Principle widely studied in recent work on contextuality as a step towards closing in on the set of quantum-realisable correlations;</p>\n</li>\n<li>\n<p>developing some work towards a logical characterisation of the Hilbert space tensor product, using logical exclusivity to capture some of its salient quantum features.</p>\n</li>\n</ul>",
        "id": 228819396,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614880498
    },
    {
        "content": "<p>this is happening in half an hour!<br>\nZoom: <a href=\"https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09\">https://topos-institute.zoom.us/j/5344862882?pwd=Znh3UlUrek41T3RLQXJVRVNkM3Ewdz09</a><br>\nYouTube: <a href=\"https://youtu.be/fHnBJcQHIDM\">https://youtu.be/fHnBJcQHIDM</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"fHnBJcQHIDM\" href=\"https://youtu.be/fHnBJcQHIDM\"><img src=\"https://i.ytimg.com/vi/fHnBJcQHIDM/default.jpg\"></a></div>",
        "id": 229879587,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1615480131
    },
    {
        "content": "<p>What a great talk! Amazing subject</p>",
        "id": 229897867,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1615486086
    },
    {
        "content": "<p>definitely! I'd love to hear more about the sheaf-theoretic aspects of this whole story too</p>",
        "id": 229898731,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1615486414
    },
    {
        "content": "<p>Me too. I'm guilty of not having read Abramsky's paper on sheaves and contextuality, though. I might want to start from there!</p>",
        "id": 229924179,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1615496144
    },
    {
        "content": "<p>Having read a bunch of it (&amp; contributed modestly), I recommend \"contextuality, cohomology and paradox\" as an entry point instead of the paper that started the whole thing. Not that there's anything wrong with the original, but  CCP might get you up to speed faster.</p>",
        "id": 229955768,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1615510164
    },
    {
        "content": "<p>Thanks! I believed I hadn't heard about it before, but apparently I did: lots of purple links in the google search</p>",
        "id": 229993656,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1615538277
    },
    {
        "content": "<p>(Silly comment: checking out the references, I see the paper cites itself, thereby introducing a non-tivial cohomology in the graph of citations)</p>",
        "id": 229994027,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1615538496
    },
    {
        "content": "<p>Link for all the lazy people out there <a href=\"http://www.cs.ox.ac.uk/qpl2015/preproceedings/27.pdf\">http://www.cs.ox.ac.uk/qpl2015/preproceedings/27.pdf</a> - looks super interesting and it's only 4 pages long so I might even <em>actually</em> read it!</p>",
        "id": 230025282,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1615554377
    },
    {
        "content": "<p>The version I had in mind is longer (but still shorter than the big A-B-paper): <a href=\"https://arxiv.org/abs/1502.03097\">https://arxiv.org/abs/1502.03097</a> I forgot that there's also this 4-page version around</p>",
        "id": 230041562,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1615560911
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/269484-seminar.3A-Topos.20Colloquium/topic/Samson.20Abramsky.3A.20.22The.20logic.20of.20contextuality.22/near/229994027\">said</a>:</p>\n<blockquote>\n<p>(Silly comment: checking out the references, I see the paper cites itself, thereby introducing a non-trivial cohomology in the graph of citations)</p>\n</blockquote>\n<p>Does it cite itself for a good reason, or just to make the directed first cohomology group of the citation graph nontrivial?</p>",
        "id": 230053968,
        "sender_full_name": "John Baez",
        "timestamp": 1615565043
    },
    {
        "content": "<p>That <em>is</em> a good reason</p>",
        "id": 230055913,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1615565543
    },
    {
        "content": "<p>I suspect that it's the four page version citing the full version.</p>",
        "id": 230056064,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1615565630
    },
    {
        "content": "<p>But then the full version needs to cite the four-pager!   <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 230056664,
        "sender_full_name": "John Baez",
        "timestamp": 1615565833
    },
    {
        "content": "<p>Turns out the full version contains the sentence \"For further details and development of the ideas, see the full version of the paper [2].\" It seems like this is missing from the shorter version (perhaps due to space constraints?)</p>",
        "id": 230057347,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1615566074
    },
    {
        "content": "<p>I wonder if this approach could be interesting for the study of Bayesian networks in \"inconsistent states\".</p>\n<p>The idea is this: you start with a Bayesian network and an associated probability distribution. Then you get data and update some of the nodes, but you fail to propagate this information throughout the network for whatever reason (computational constraints, sheer laziness). Now your network is in a locally consistent but globally inconsistent state: the local marginals no longer cohere to a well-defined global joint probability. My understanding is that humans do this all the time!</p>",
        "id": 230240144,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1615730512
    },
    {
        "content": "<p>This is a very interesting idea... maybe with implications for some very practical topics like distributed sensor networks</p>",
        "id": 230245007,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1615735445
    },
    {
        "content": "<p>I was hoping to find some inspiration in his chapter on <a href=\"https://link.springer.com/chapter/10.1007/978-3-642-41660-6_2\">relational databases</a> but it is completely \"timeless\". There's no talk about updating tables and such.</p>",
        "id": 230262971,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1615750636
    }
]