[
    {
        "content": "<p>this Thursday at 17:00 UTC, as per usual :-)</p>",
        "id": 275257719,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1647273779
    },
    {
        "content": "<p><strong>Zoé Christoff:</strong> <em>The logic of social influence in networks</em></p>\n<p>This talk gives an introduction to the use of logical tools in understanding social influence and social networks phenomena. Individuals often form their opinions by interpreting the behavior of others around them, and by reasoning about how those others have formed their opinions. This leads to several well-known herd phenomena, such as informational cascades, bystander effect, pluralistic ignorance, bubbles, and polarization. For instance, in the case of informational cascades, agents in a sequence imitate one another’s choices despite having diverging private evidence, sometimes leading the whole community to make the worst possible choice. Similar cascading mechanisms are at the heart of diffusion phenomena in social networks.</p>\n<p>I first show how an epistemic logic modeling allows to make precise the conditions for such cascades to form, as well as prove their inescapability. I then turn to what logical tools can do for analysing information flow and influence in social networks. I illustrate how extremely simplified models can yield surprising new results, for instance about stabilization conditions of diffusion processes. Finally, I discuss how logic might help us further understand how social networks affect collective decision making processes.</p>\n<p><strong>Zoom:</strong> <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\n<strong>YouTube:</strong> <a href=\"https://youtu.be/pY2m_nSDkEQ\">https://youtu.be/pY2m_nSDkEQ</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"pY2m_nSDkEQ\" href=\"https://youtu.be/pY2m_nSDkEQ\"><img src=\"https://uploads.zulipusercontent.net/7d5f690ac1865a969a07eadfaf1ab818dc98a8a8/68747470733a2f2f692e7974696d672e636f6d2f76692f7059326d5f6e53446b45512f64656661756c742e6a7067\"></a></div>",
        "id": 275257811,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1647273812
    },
    {
        "content": "<p>starting in 5 minutes!</p>",
        "id": 275692249,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1647536212
    }
]