[
    {
        "content": "<p>Okay, folks!   In the fifth talk of the <a href=\"https://sites.google.com/ucr.edu/actucr/\" title=\"https://sites.google.com/ucr.edu/actucr/\">ACT@UCR seminar</a>, <a href=\"http://gbaz.github.io/\" title=\"http://gbaz.github.io/\">Gershom Bazerman</a> will tell us about a localic approach to the semantics of dependency, conflict, and concurrency!</p>\n<p>He'll give his talk on Wednesday April 29th at 5 pm UTC, which is 10 am in California, or 1 pm on the east coast of the United States, or 6 pm in England.  It will be held online via Zoom, here:</p>\n<p><a href=\"https://ucr.zoom.us/j/607160601\" title=\"https://ucr.zoom.us/j/607160601\">https://ucr.zoom.us/j/607160601</a></p>\n<p>You can see his talk slides <a href=\"http://math.ucr.edu/home/baez/mathematical/ACTUCR/Bazerman_Localic_Semantics.pdf\" title=\"http://math.ucr.edu/home/baez/mathematical/ACTUCR/Bazerman_Localic_Semantics.pdf\">here</a>.</p>\n<p>• Gershom Bazerman, A localic approach to the semantics of dependency, conflict, and concurrency.</p>\n<p><strong>Abstract.</strong>  Petri nets have been of interest to applied category theory for some time. Back in the 1980s, one approach to their semantics was given by algebraic gadgets called \"event structures.\" We use classical techniques from order theory to study event structures without conflict restrictions (which we term \"dependency structures with choice\") by their associated \"traces\", which let us establish a one-to-one correspondence between DSCs and a certain class of locales. These locales have an internal logic of reachability, which can be equipped with \"versioning\" modalities that let us abstract away certain unnecessary detail from an underlying DSC. With this in hand we can give a general notion of what it means to \"solve a dependency problem\" and combinatorial results bounding the complexity of this. Time permitting, I will sketch work-in-progress which hopes to equip these locales with a notion of conflict, letting us capture the full semantics of general event structures in the form of homological data, thus providing one avenue to the topological semantics of concurrent systems. This is joint work with Raymond Puzio.</p>",
        "id": 195492746,
        "sender_full_name": "John Baez",
        "timestamp": 1588036019
    },
    {
        "content": "<p>I should mention that some of the questions about related work were about the \"event structures for petri nets with persistence\" paper and related. that's cited in the arxiv paper of ours (<a href=\"https://arxiv.org/abs/2004.05688\" title=\"https://arxiv.org/abs/2004.05688\">https://arxiv.org/abs/2004.05688</a>) as related work, since it has a similar notion of a \"splitting\" construction, though we go somewhat different places with it.</p>",
        "id": 195749215,
        "sender_full_name": "Gershom",
        "timestamp": 1588184038
    },
    {
        "content": "<p>Hi!</p>",
        "id": 195749312,
        "sender_full_name": "John Baez",
        "timestamp": 1588184082
    },
    {
        "content": "<p>I just grabbed some coffee.</p>",
        "id": 195749342,
        "sender_full_name": "John Baez",
        "timestamp": 1588184100
    },
    {
        "content": "<p>wish i could discuss the talk here but im running up VERY close to some deadlines on some stuff i need to get done lately so i should probably go work on that :T</p>",
        "id": 195749449,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588184162
    },
    {
        "content": "<p>cool stuff though :&gt;</p>",
        "id": 195749510,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588184174
    },
    {
        "content": "<p>The part of your talk I liked the best, <span class=\"user-mention\" data-user-id=\"276650\">@Gershom</span>, was the part connecting Petri nets and various kinds of posets, since those are two things I've thought about a bit, but not much together.</p>",
        "id": 195749540,
        "sender_full_name": "John Baez",
        "timestamp": 1588184192
    },
    {
        "content": "<p>Let me just blab about that a bit.</p>",
        "id": 195749598,
        "sender_full_name": "John Baez",
        "timestamp": 1588184226
    },
    {
        "content": "<p>Ok sarah, looking forward to thoughts from you at your leisure. As I mentioned, there's a _lot_ of the \"depleted\" perspective thats run through our work :-)</p>",
        "id": 195749609,
        "sender_full_name": "Gershom",
        "timestamp": 1588184235
    },
    {
        "content": "<p>Any Petri net gives a commutative monoidal category where the objects are markings and the morphisms are generated by transitions: roughly, the morphisms are ways to go from one marking to another, allowed by the transitions.</p>",
        "id": 195749668,
        "sender_full_name": "John Baez",
        "timestamp": 1588184271
    },
    {
        "content": "<p>The commutative monoidal structure comes from <em>adding</em> markings, i.e. adding numbers of tokens in each place.</p>",
        "id": 195749793,
        "sender_full_name": "John Baez",
        "timestamp": 1588184315
    },
    {
        "content": "<p>We can then \"deplete\" (=decategorify) this commutative monoidal category and get a commutative monoidal poset, which I'd call the \"reachability poset\".</p>",
        "id": 195749854,
        "sender_full_name": "John Baez",
        "timestamp": 1588184350
    },
    {
        "content": "<p>So this seems to be a basic ingredient in some of these discussions, though as you mention people then tend to restrict the class of Petri nets they consider.</p>",
        "id": 195749928,
        "sender_full_name": "John Baez",
        "timestamp": 1588184396
    },
    {
        "content": "<p>Then another fun thing to do is take the set of downsets of your commutative monoidal poset and get a commutative quantale!</p>",
        "id": 195750021,
        "sender_full_name": "John Baez",
        "timestamp": 1588184429
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> I'm glad. I added that especially for you and your \"crowd\" :-P </p>\n<p>I should add that I didn't give the full definition of conflict in a general event structure. Its something called a context, which is also P(P(E)), and it is downward closed. It is thought of as the set of \"nonconflicting\" collections of events. So if a,b,c don't conflict, then a,b don't conflict. To a topologist this is immediately the same data as a simplicial complex, which also helps motivate applying algebraic topological methods.</p>",
        "id": 195750040,
        "sender_full_name": "Gershom",
        "timestamp": 1588184440
    },
    {
        "content": "<p>I think I'll need to re-read your slides a few times to organize my thoughts about what you said: how various restricted kinds of Petri nets correspond, or can be turned into, various kinds of posets and other structures...</p>",
        "id": 195750401,
        "sender_full_name": "John Baez",
        "timestamp": 1588184626
    },
    {
        "content": "<p>So far I've just been doing things with <em>all</em> Petri nets, since that seems mathematically natural.</p>",
        "id": 195750477,
        "sender_full_name": "John Baez",
        "timestamp": 1588184655
    },
    {
        "content": "<p>I will say that what you've sketched is in a sense \"simpler\" than the constructions given by Winskel et al. They have a whole collection of \"unfoldings\" of petri nets into this subclass of occurence nets, which then map to event structures, which then gives rise to \"families of configurations\" which is where they find the order-theoretic structure.</p>\n<p>My slides don't given enough detail to explain this all formally, but the papers they reference are very nice and readable, so they were intended as an \"invitation\" to that stuff. The Winskel 86 paper is really the best place to start, since it is lengthy and rich...</p>",
        "id": 195750587,
        "sender_full_name": "Gershom",
        "timestamp": 1588184724
    },
    {
        "content": "<p>I'd known about it but somehow not dared to read it.</p>",
        "id": 195750727,
        "sender_full_name": "John Baez",
        "timestamp": 1588184789
    },
    {
        "content": "<p>Being a mathematician I like \"simpler\", of course...</p>",
        "id": 195750763,
        "sender_full_name": "John Baez",
        "timestamp": 1588184814
    },
    {
        "content": "<p>But now I feel the need for more territory to explore, and you've just pointed me to a lot of it.</p>",
        "id": 195750804,
        "sender_full_name": "John Baez",
        "timestamp": 1588184842
    },
    {
        "content": "<p>Anyway, somewhere along the way, you get the elements of your posets not simply corresponding to markings at one point in time, but, I believe, corresponding to markings over markings and where they \"come from\"</p>\n<p>I will say that if I could read that paper, you certainly could :-P. There's also a lot of categories of petri nets flying about in that paper, but I don't know how to relate them to your setup, because they necessarily contain initial markings.</p>",
        "id": 195750893,
        "sender_full_name": "Gershom",
        "timestamp": 1588184883
    },
    {
        "content": "<p>You can take a subcategory of the category of markings and executions that we usually work with which contains everything reachable from an initial marking.</p>",
        "id": 195751044,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588184964
    },
    {
        "content": "<p>Do you think that would be related to any of these categories you're talking about?</p>",
        "id": 195751173,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185008
    },
    {
        "content": "<p>It sounds very plausible!</p>",
        "id": 195751231,
        "sender_full_name": "Gershom",
        "timestamp": 1588185040
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195750893\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195750893\">said</a>:</p>\n<blockquote>\n<p>Anyway, somewhere along the way, you get the elements of your posets not simply corresponding to markings at one point in time, but, I believe, corresponding to markings over markings and where they \"come from\"</p>\n</blockquote>\n<p>Okay, that's interesting already.  Not just markings but \"paths of markings\", which I guess are called something like \"firing sequences\" in the Petri net literature.</p>",
        "id": 195751343,
        "sender_full_name": "John Baez",
        "timestamp": 1588185102
    },
    {
        "content": "<p>What is meant by \"markings over markings\"? Maybe I'm misreading that part</p>",
        "id": 195751499,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185166
    },
    {
        "content": "<p>In the commutative monoidal category firing sequences give morphisms, but different firing sequences can give the same morphism, for example if you can do A and then B or do B and then A, and they don't cause any conflict, those count as the same morphism.</p>",
        "id": 195751532,
        "sender_full_name": "John Baez",
        "timestamp": 1588185182
    },
    {
        "content": "<p>typo, I meant something like \"markings over time\"</p>",
        "id": 195751564,
        "sender_full_name": "Gershom",
        "timestamp": 1588185194
    },
    {
        "content": "<p>(I deliberately didn't think about \"markings over markings\" - a trained mathematician learns to not pay much attention to things that don't make sense.)</p>",
        "id": 195751631,
        "sender_full_name": "John Baez",
        "timestamp": 1588185227
    },
    {
        "content": "<p>It sounded potentially interesting.</p>",
        "id": 195751719,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185252
    },
    {
        "content": "<p>right, so you have \"configurations enabling other configurations\" which is closer to P(E) x P(E) -&gt; 2, which is chu-like.</p>",
        "id": 195751780,
        "sender_full_name": "Gershom",
        "timestamp": 1588185282
    },
    {
        "content": "<p>So anyway, there's a lot of fun to be had categorically with \"paths of markings\" or \"marking evolutions over time\" or \"firing sequences\" or whatever you want to call them.</p>",
        "id": 195751799,
        "sender_full_name": "John Baez",
        "timestamp": 1588185294
    },
    {
        "content": "<p>Especially since I was thinking taking these reachability subcategories might give something like a fibration.</p>",
        "id": 195751804,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185297
    },
    {
        "content": "<p>Anyway, I will start thinking about these things.  Thanks, <span class=\"user-mention\" data-user-id=\"276650\">@Gershom</span>!</p>",
        "id": 195752264,
        "sender_full_name": "John Baez",
        "timestamp": 1588185514
    },
    {
        "content": "<p>I was curious about what the \"with choice\" refers to specifically in pre-DSCs.</p>",
        "id": 195752370,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185588
    },
    {
        "content": "<p>The choice is you have E -&gt; P(P(E)) and not just E -&gt; P(E). So events have a \"choice\" of where they come from.</p>",
        "id": 195752454,
        "sender_full_name": "Gershom",
        "timestamp": 1588185621
    },
    {
        "content": "<p>oh, so the choice is like non-determinism?</p>",
        "id": 195752499,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185649
    },
    {
        "content": "<p>It's non-determinism in the past, not the future.</p>",
        "id": 195752566,
        "sender_full_name": "John Baez",
        "timestamp": 1588185679
    },
    {
        "content": "<p>If you have $100 you could have earned it by working, or could have found it on the street, but not both...</p>",
        "id": 195752618,
        "sender_full_name": "John Baez",
        "timestamp": 1588185707
    },
    {
        "content": "<p>So \"$100 in pocket\" maps to</p>",
        "id": 195752699,
        "sender_full_name": "John Baez",
        "timestamp": 1588185735
    },
    {
        "content": "<p>{ {earning $100}, {finding $100 in street}}</p>\n<p>That's an example of our map E <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>↦</mo></mrow><annotation encoding=\"application/x-tex\">\\mapsto</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.522em;vertical-align:-0.011em;\"></span><span class=\"mrel\">↦</span></span></span></span> P(P(E)).   I like this idea.</p>",
        "id": 195752735,
        "sender_full_name": "John Baez",
        "timestamp": 1588185759
    },
    {
        "content": "<p>Yep! The general problem is that non-determinism (or \"choice\") and conflict both give nice topological structures, but the two topological structures are apparently unrelated. So you try to put them together and all the nice properties fail. In a sense, the original Pratt literature on chu-spaces was motivated by concurrency models where they said \"ok, so let's let everything fail and try to pretend its a space anyway\". The Winskel stuff says \"ok, lets not handle choice, and just handle conflict\". Ever since then they've been trying to add back choice. Our approach says \"let's handle choice, then try to put in conflict later.\"</p>",
        "id": 195752775,
        "sender_full_name": "Gershom",
        "timestamp": 1588185777
    },
    {
        "content": "<p>I should mention the paper covers what the free distributive lattice is, which is the downsets of the upsets, and it shows that it has a different internal logic, which is better for reasoning about branching choice in some ways, and it gives a quotient relation on this internal logic which should correspond to \"contracting\" a big collection of nodes in a petri net to a single \"black box\"</p>",
        "id": 195753010,
        "sender_full_name": "Gershom",
        "timestamp": 1588185916
    },
    {
        "content": "<p>I'm super interested in this connection between concurrency and directed topology.</p>",
        "id": 195753123,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185980
    },
    {
        "content": "<p>Oh, does this contracting produce another Petri net?</p>",
        "id": 195753148,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1588185996
    },
    {
        "content": "<p>we have cites in the paper to some intro stuff on directed topology. It was invented and motivated by trying to model concurrency. Grandis is the categorically richer stuff but the other big team with the book is the one with a lot more \"hands on\" stuff that's approachable. I think their stuff runs off in weird directions because it starts with point-set stuff, so they do a lot of work to \"recover\" more abstract stuff from there.</p>\n<p>We don't handle the petri net case, but the stuff about \"versions\" in the paper should be able to be \"pulled back\" into the petri net story. Algorithmically it can be useful I think, because it lets you \"quotient\" away structure thats easy to compute with so you have a simpler problem to solve.</p>",
        "id": 195753503,
        "sender_full_name": "Gershom",
        "timestamp": 1588186170
    },
    {
        "content": "<p>directed topology can also be seen as trying to \"munge\" two undirected topologies (i.e. choice and conflict). This is because there's a nice posetal structure to each and you somehow want \"both at once\".</p>",
        "id": 195753673,
        "sender_full_name": "Gershom",
        "timestamp": 1588186259
    },
    {
        "content": "<p>in directed topology its not \"choice\" and \"conflict\" so much as \"dependency\" and \"compatibility\" to be precise, but <em>waves hands</em></p>",
        "id": 195753768,
        "sender_full_name": "Gershom",
        "timestamp": 1588186307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> here's the book I was thinking of (could have sworn there was a pdf preprint easily accessible, but can't find it now) <a href=\"https://sfx.aub.aau.dk/sfxaub?sid=pureportal&amp;doi=10.1007/978-3-319-15398-8\" title=\"https://sfx.aub.aau.dk/sfxaub?sid=pureportal&amp;doi=10.1007/978-3-319-15398-8\">https://sfx.aub.aau.dk/sfxaub?sid=pureportal&amp;doi=10.1007/978-3-319-15398-8</a> -- note it share some authors with the patch theory stuff mentioned in the discussion...</p>",
        "id": 195754950,
        "sender_full_name": "Gershom",
        "timestamp": 1588186846
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span> btw one fun problem in the \"depleted\" world is if Bruns-Lakser is some sort of \"depleted\" version of the envelopes of the sort that mike was talking about (i.e. coming from Hyland). I don't know of a good general \"theory of envelopes\" but would love to learn of one! Perhaps its just another name for some subset of a theory of (co)reflections?</p>",
        "id": 195755770,
        "sender_full_name": "Gershom",
        "timestamp": 1588187204
    },
    {
        "content": "<p>I was shocked when Mike said taking the Hyland envelope was not a left (2-)adjoint.  Maybe I'm misremembering the details, because there were a few envelopes running around in that talk.</p>",
        "id": 195755939,
        "sender_full_name": "John Baez",
        "timestamp": 1588187280
    },
    {
        "content": "<p>But yeah, the term \"envelope\" seems to be showing up when we have two (2-)categories of gadgets <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> is a reflective subcategory of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span></span></span></span>.</p>",
        "id": 195756124,
        "sender_full_name": "John Baez",
        "timestamp": 1588187349
    },
    {
        "content": "<p>Or something like that: some sort of left adjoint <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>L</mi><mo>:</mo><mi>B</mi><mo>→</mo><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">L : B \\to A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">L</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span> that \"improves\" objects of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span></span></span></span> to make them objects of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi></mrow><annotation encoding=\"application/x-tex\">A</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span></span></span></span>.</p>",
        "id": 195756189,
        "sender_full_name": "John Baez",
        "timestamp": 1588187387
    },
    {
        "content": "<p>It seems to mainly be used when our gadgets are posets of some sort.</p>",
        "id": 195756299,
        "sender_full_name": "John Baez",
        "timestamp": 1588187431
    },
    {
        "content": "<p>Here is a talk by ray at CT octoberfest where he talks about how we've been thinking about completions (envelopes) more generally and attempting to relate them to forbidden configurations: <a href=\"https://jh.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=676ab6d0-e298-4b5a-b866-aaf200d61558\" title=\"https://jh.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=676ab6d0-e298-4b5a-b866-aaf200d61558\">https://jh.hosted.panopto.com/Panopto/Pages/Viewer.aspx?id=676ab6d0-e298-4b5a-b866-aaf200d61558</a> </p>\n<p>We don't have a \"general\" procedure for picking any old algebraic structure and getting the completion this way.  But there's definitely a general pattern that mike talked about where you take a presheaf category and pick out only the \"right\" presheaves, which are the ones that respect the desired algebraic structure. I would like to relate this to the theory of canonical extensions as given in <a href=\"https://www.irif.fr/~mgehrke/TopologicalDualityandAlgebraicCompletions.pdf\" title=\"https://www.irif.fr/~mgehrke/TopologicalDualityandAlgebraicCompletions.pdf\">https://www.irif.fr/~mgehrke/TopologicalDualityandAlgebraicCompletions.pdf</a></p>",
        "id": 195757678,
        "sender_full_name": "Gershom",
        "timestamp": 1588188034
    },
    {
        "content": "<p>I think frequently words like \"envelope\" are used when A-objects remember \"some fragment\" of the structure of B-objects, and the point is to embed an A-object into a B-object preserving that fragment.  So for instance the universal enveloping algebra of a Lie algebra is an associative algebra such that the embedding preserves the Lie bracket, a \"fragment\" of the structure of an associative multiplication.  Similarly, the Hyland envelope of a polycategory is a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous category such that the embedding preserves the polycategory structure (and, for the enhanced version I described, also some existing tensors and cotensors), a fragment of the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous structure.  Sometimes these envelopes have a universal property, sometimes not -- or, at least, not obviously.</p>",
        "id": 195758744,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588188512
    },
    {
        "content": "<p>I'm positive the Hyland envelope is not a left adjoint to something obvious like the forgetful functor from <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous categories to polycategories; it's way too big for that.  (In a technical sense -- the Hyland envelope of a small polycategory is a <em>large</em> <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous category.)  The first \"modules\" step in its construction is a sort of presheaf construction (in fact it does happen to be a presheaf category on an appropriately chosen domain), hence some kind of left adjointy \"free cocompletion\" modulo size -- but then we do a Chu construction to that, whose most straightforward universal property is as a <em>right</em> adjoint.</p>",
        "id": 195759117,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588188682
    },
    {
        "content": "<p>I wouldn't be surprised, however, if there were <em>some</em> way to express the Hyland envelope as a left adjoint (modulo size).  The Hyland envelope for polycategories is a lot like the <a href=\"https://ncatlab.org/nlab/show/Isbell+envelope\" title=\"https://ncatlab.org/nlab/show/Isbell+envelope\">Isbell envelope</a> for 1-categories, and Richard Garner showed in <a href=\"https://arxiv.org/abs/1410.7108\" title=\"https://arxiv.org/abs/1410.7108\">The Isbell monad</a> that the Isbell envelope of C is the \"free category with a cylinder factorization system\" generated by C.  So perhaps there is some structure like that that the Hyland envelope also adds freely.</p>",
        "id": 195759534,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588188932
    },
    {
        "content": "<p>Note that the Dedekind-MacNeillie completion is the posetal version of the Isbell envelope. So that does lend itself to the question \"what is the Bruns-Lakser completion a posetal version of\" and further, if in that categorical setting, we can extract out what the two have in common.</p>",
        "id": 195771069,
        "sender_full_name": "Gershom",
        "timestamp": 1588194902
    },
    {
        "content": "<p>There was also a question in chat in the zoom related to this, which is how this stuff relates to the \"conservative cocompletion\" given in A Categorical Theory of Patches (originally due to Kelly): \"the full subcategory of presheaves on C whose objects, considered as functors, preserve finite limits\".  This is very similar to the definition given of Bruns-Lakser in the paper by the authors of that name, which is \"the poset of downsets of P, restricted to those downsets which themselves have joins distributing over meets\". </p>\n<p>So mathematically they're very similar. The two differences are of course that the conservative cocompletion is a construction on categories and not just posets, and that it just gives colimits freely which would \"just\" be adding joins in a posetal context, while Bruns-Lakser adds enough structure to ensure that joins distribute over meets. But as discussed, a fair number of these completions feel like instances of a single very general construction, and it would be good to pin that down.</p>",
        "id": 195772219,
        "sender_full_name": "Gershom",
        "timestamp": 1588195505
    },
    {
        "content": "<p>There are multiple ways we can consider \"thickened\" versions of the construction, but if we could take \"meet semilattice\" to thicken to \"cartesian category\" and \"distributive lattice\" to thicken to \"distributive category\". Then the distributive completion of a cartesian category is actually its coproduct completion: by freely adding coproducts, we get the distributivity property for free.</p>",
        "id": 195773815,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1588196321
    },
    {
        "content": "<p>This may be found in Cockett's <em>Introduction to distributive categories</em>.</p>",
        "id": 195773861,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1588196351
    },
    {
        "content": "<p>I think a similar property holds for the cocompletion of a finitely complete category, though I'm not sure of a reference right now.</p>",
        "id": 195773989,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1588196427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> Thanks for the reference. I think that this \"free coproduct completion\" as described is quite different than an envelope. In particular, it does not seem to be idempotent? The \"conservative cocompletion\", like Dedekind-MacNeillie and Bruns-Lakser, is idempotent, and so we have a reflector. They do mention that the Karoubi envelope (<a href=\"https://ncatlab.org/nlab/show/Karoubi+envelope\" title=\"https://ncatlab.org/nlab/show/Karoubi+envelope\">https://ncatlab.org/nlab/show/Karoubi+envelope</a>) also gives a distributive category, and that seems to be more similar as a construction. But when you decategorify the karoubi envelope what you get is the completion of a preorder into a poset...</p>",
        "id": 195777372,
        "sender_full_name": "Gershom",
        "timestamp": 1588198735
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195773989\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195773989\">said</a>:</p>\n<blockquote>\n<p>I think a similar property holds for the cocompletion of a finitely complete category, though I'm not sure of a reference right now.</p>\n</blockquote>\n<p>hi, the thing that rings a bell for me  in this context is Joyal and H. Hu's work in <a href=\"https://www.sciencedirect.com/science/article/pii/S1571066105801628\" title=\"https://www.sciencedirect.com/science/article/pii/S1571066105801628\">https://www.sciencedirect.com/science/article/pii/S1571066105801628</a> <br>\nthis is about bicompletions of categories, when you start from a *-autonomous category</p>",
        "id": 195779006,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1588199990
    },
    {
        "content": "<p>I wouldn't be surprised if Kelly, author of <em>Enriched Categories</em>, did an enriched version of \"conservative completions\", by considering enriched presheaves that preserve a chosen class of limits.   Then the Bool-enriched case of these might give various nice \"envelopes\" or \"completions\" of posets.</p>",
        "id": 195779677,
        "sender_full_name": "John Baez",
        "timestamp": 1588200531
    },
    {
        "content": "<p>Just a wild guess.</p>",
        "id": 195779715,
        "sender_full_name": "John Baez",
        "timestamp": 1588200573
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195779677\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195779677\">said</a>:</p>\n<blockquote>\n<p>I wouldn't be surprised if Kelly, author of <em>Enriched Categories</em>, did an enriched version of \"conservative completions\", by considering enriched presheaves that preserve a chosen class of limits.</p>\n</blockquote>\n<p>Yes, it's in section 3.12 of his book.</p>",
        "id": 195789316,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588208972
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195777372\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195777372\">said</a>:</p>\n<blockquote>\n<p>The \"conservative cocompletion\", like Dedekind-MacNeillie and Bruns-Lakser, is idempotent, and so we have a reflector.</p>\n</blockquote>\n<p>If I understood your definition of conservative completion correctly (\"the full subcategory of presheaves on C whose objects, considered as functors, preserve finite limits\") then no, I don't think it is idempotent.  The only way I can think of that might yield an idempotent operation is to consider categories equipped with some specified collection of colimits and consider the \"completion\" operation that takes the full subcategory of presheaves that preserve those specified colimits.  Then you could equip the completion with the collection of <em>all</em> small colimits and hope that it would be its own completion in that sense, analogously to how a Grothendieck topos is equivalent to the category of sheaves on itself for its canonical topology.  But restricting to finite covers/colimits breaks it, since the canonical topology is not finite.</p>",
        "id": 195789467,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588209185
    },
    {
        "content": "<p>Ah I left out a \"finite\" or two in the description. Let me paste directly the definition from the mimram/di giusto paper i was poorly paraphrasing (<a href=\"https://arxiv.org/abs/1311.3903\" title=\"https://arxiv.org/abs/1311.3903\">https://arxiv.org/abs/1311.3903</a>)</p>\n<p><a href=\"/user_uploads/21317/KVTFaVm2DuZo3hpF19BHiYDK/image.png\" title=\"image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/KVTFaVm2DuZo3hpF19BHiYDK/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/KVTFaVm2DuZo3hpF19BHiYDK/image.png\"></a></div>",
        "id": 195793748,
        "sender_full_name": "Gershom",
        "timestamp": 1588215187
    },
    {
        "content": "<p>Ah yes, that works: if you restrict to those objects that are finite colimits of representables, then I can believe it's idempotent.</p>",
        "id": 195794564,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588216466
    },
    {
        "content": "<p>In looking at that, I was inspired to take a look at Mimram's habilitation thesis, which is quite interesting for an overview of a lot of the same stuff I've been interested in <a href=\"https://hal.inria.fr/tel-01783442/\" title=\"https://hal.inria.fr/tel-01783442/\">https://hal.inria.fr/tel-01783442/</a> . In that, the section on categorical patch theory is similar to that in the paper, but it notes that a counterexample was found to one of the later claims in the paper (not the cocompletion). That counterexample, iirc, is why a some of the promised future work on that approach has not come to fruition (but as people can see from the thesis, and subsequent work as well, a lot of other good work on related but distinct topics has been developed instead!)</p>",
        "id": 195794917,
        "sender_full_name": "Gershom",
        "timestamp": 1588216943
    },
    {
        "content": "<p>I don't know whether it is appropriate to mention this here but let me try anyway.  So far as I have seen, all the online conferences are being conducted via the Zoom app. Is it safe to use it when, e.g., Google has banned its employees from using it due to security concerns?</p>",
        "id": 195838544,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1588253530
    },
    {
        "content": "<p>I do prefer jitsi, which is free and opensource, but I guess it depends from uni to uni, often it's not up to the single research groups to choose what to use.</p>",
        "id": 195853538,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588259538
    },
    {
        "content": "<p>Our university uses Zoom so that's what I'm using.   I could use jitsi if someone explained how to do it, but I'm lazy.</p>",
        "id": 195856226,
        "sender_full_name": "John Baez",
        "timestamp": 1588260476
    },
    {
        "content": "<p>You just do <code>meet.jit.si/nameOfYourMeeting</code>and that's it. <code>NameOfYourMeeting</code>can be created on the fly without doing any setup work</p>",
        "id": 195856490,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588260583
    },
    {
        "content": "<p>If you are even lazier, there's a camera button below the box in which you type that will set a link up for you</p>",
        "id": 195856566,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588260605
    },
    {
        "content": "<p><a href=\"https://meet.jit.si//104755149472049\" title=\"https://meet.jit.si//104755149472049\">Click to join video call</a></p>",
        "id": 195856575,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588260608
    },
    {
        "content": "<p>:D</p>",
        "id": 195856582,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588260611
    },
    {
        "content": "<p>Jitsi has a lot of the functions zoom has, like screen share, mute/unmute, set password for a conversation, raise your hand, etc, and as for zoom you can join with your phone. There is no desktop application, so everything is in browser.</p>",
        "id": 195856641,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588260643
    },
    {
        "content": "<p>How do other people join the meeting?  Usually when I have a meeting I do it with other people.</p>",
        "id": 195857818,
        "sender_full_name": "John Baez",
        "timestamp": 1588261143
    },
    {
        "content": "<p>(I'm not being sarcastic because I doubt it's easy.  I just enjoy joking around.)</p>",
        "id": 195858004,
        "sender_full_name": "John Baez",
        "timestamp": 1588261204
    },
    {
        "content": "<p>They all click on the link</p>",
        "id": 195858461,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588261397
    },
    {
        "content": "<p>If I do <a href=\"http://meet.jit.si/MyMeeting\" title=\"http://meet.jit.si/MyMeeting\">meet.jit.si/MyMeeting</a> everyone visiting that address will be in the same room</p>",
        "id": 195858509,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588261421
    },
    {
        "content": "<p>So if you have to invite someone just copy paste the link <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 195858616,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588261453
    },
    {
        "content": "<p>Maybe another option is to use Google Meet (that's what we use at our university) or even Skype <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> .</p>",
        "id": 195858791,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1588261550
    },
    {
        "content": "<p>Do these other options compare to Zoom in terms of quality at scale?  The last time I tried anything non-Zoom the quality was far inferior.</p>",
        "id": 195928701,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588303805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> , my personal experience of using Google Meet is great. However, it supports only 100 persons (as far as I know).</p>",
        "id": 195931296,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1588307775
    },
    {
        "content": "<p>Jitsi is giving me zero issues atm.</p>",
        "id": 195953776,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588333980
    },
    {
        "content": "<p>I didn't fully work this out, but I suspect the law for \"lacks $M_3$\"  can be formulated as something like: </p>\n<p>forall a b c. a /\\ b = a /\\c = b /\\ c ==&gt; (a\\/b) /\\ (a \\/ c) = a.</p>\n<p>(which should also hold in the dual)</p>\n<p>Another, condition I wrote down  some  time ago that might formulate it (haven't done the work to compare them and see equivalence yet again, so its all sketchy) is</p>\n<p>a \\/ b = a \\/ b \\/ c &amp; a /\\ b = a /\\ b /\\ c  iff a &gt;= c ||  b &gt;= c || a &lt;= c || b &lt;= c</p>\n<p>This second condition is a more straightforward transcription of the rule, and so it perhaps offers a bit less insight.</p>\n<p>But either way we can see that \"no $M_3$\" is a  condition about a sort of \"weak atomicity\" of information, or about how we  can recover data about atoms from meets and joins.</p>\n<p>While the other condition along with this, upper semimodularity, is more well studied (see e.g. the wikipedia article for some various characterizations) I have less intuition for the \"intuitive meaning\" of its logical expression. It feels like a condition about \"no hidden atoms\" perhaps, just as semimodularity can be interpreted.</p>",
        "id": 196002225,
        "sender_full_name": "Gershom",
        "timestamp": 1588362700
    },
    {
        "content": "<p>I also asked on mathoverflow and got another answer that confirms there's no way to have a variety of lattices with this property (there's another argument too, which follows from covering varieties of D and the investigation there): <a href=\"https://mathoverflow.net/questions/359113/class-of-lattices-that-excludes-m-3\" title=\"https://mathoverflow.net/questions/359113/class-of-lattices-that-excludes-m-3\">https://mathoverflow.net/questions/359113/class-of-lattices-that-excludes-m-3</a></p>\n<p>Note that both conditions we give (no M_3, and semimodularity) are hard to tackle by these traditional methods. In the latter case, it can't be tackled because every variety of semimodular lattices consists entirely of modular lattices.</p>\n<p>Related to our work on idempotent completions, Ray and I have been kicking around an approach (discussed in his talk which I linked above) that is more general than varieties, in that sentences need not be identities, but may instead be expressions in regular logic, which translate to \"extension properties\". Our hope is that this will let us get something in some ways more general than the HSP theorem. We put it aside a bit to focus more on the dependency structure stuff, but it would be nice to pick it up again.</p>",
        "id": 196025588,
        "sender_full_name": "Gershom",
        "timestamp": 1588381733
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/196002225\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/196002225\">said</a>:</p>\n<blockquote>\n<p>I didn't fully work this out, but I suspect the law for \"lacks $M_3$\"  can be formulated as something like: </p>\n<p>forall a b c. a /\\ b = a /\\c = b /\\ c ==&gt; (a\\/b) /\\ (a \\/ c) = a.</p>\n<p>(which should also hold in the dual)</p>\n</blockquote>\n<p>Cool!  I don't get it, but it's nice to see an equational law for this property.  (It took me quite a while to grok modularity, so it's not surprising that I don't instantly get this one.)</p>",
        "id": 196026278,
        "sender_full_name": "John Baez",
        "timestamp": 1588382944
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"295542\">Sayantan Roy</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195838544\" title=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195838544\">said</a>:</p>\n<blockquote>\n<p>I don't know whether it is appropriate to mention this here but let me try anyway.  So far as I have seen, all the online conferences are being conducted via the Zoom app. Is it safe to use it when, e.g., Google has banned its employees from using it due to security concerns?</p>\n</blockquote>\n<p>FWIW, it seems that <a href=\"https://www.schneier.com/blog/archives/2020/04/secure_internet.html\" title=\"https://www.schneier.com/blog/archives/2020/04/secure_internet.html\">Zoom has made some progress</a> on improving their security in response to the recent criticism and scrutiny.</p>",
        "id": 196110125,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588522381
    },
    {
        "content": "<p>Btw, <span class=\"user-mention\" data-user-id=\"276692\">@Bob Coecke</span> I mentioned in my talk that your work had made some use of the Bruns-Lakser construction (which I described a characterization of). It seemed to me that you had since moved on and no longer were continuing that approach, but this is just from a quick skim of the literature. In any case, I am curious about what came of that line of work.</p>",
        "id": 196977456,
        "sender_full_name": "Gershom",
        "timestamp": 1589007569
    },
    {
        "content": "<p>Hi, I haven't done anything since 1999 with that, but it became part of the topos approach to some extend.  The best place for this is Dan Marsden's MSc thesis (which he should publish!): <a href=\"http://www.cs.ox.ac.uk/people/bob.coecke/Marsden.pdf\" title=\"http://www.cs.ox.ac.uk/people/bob.coecke/Marsden.pdf\">http://www.cs.ox.ac.uk/people/bob.coecke/Marsden.pdf</a></p>",
        "id": 197005133,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1589048579
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/April.2029th.3A.20Gershom.20Bazerman/near/195856641\">said</a>:</p>\n<blockquote>\n<p>Jitsi has a lot of the functions zoom has, like screen share, mute/unmute, set password for a conversation, raise your hand, etc, and as for zoom you can join with your phone. There is no desktop application, so everything is in browser.</p>\n</blockquote>\n<p>There is a phone app, though...works pretty well.</p>",
        "id": 201386457,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1592571949
    }
]