[
    {
        "content": "<p>Nina Otter will give the last talk of this spring's ACT@UCR seminar.   She will give her talk on Wednesday June 3rd at 5 pm UTC, which is 10 am in California, or 1 pm on the east coast of the United States, or 6 pm in the UK. It will be held online via Zoom, here:</p>\n<p><a href=\"https://ucr.zoom.us/j/607160601\">https://ucr.zoom.us/j/607160601</a></p>",
        "id": 198939406,
        "sender_full_name": "John Baez",
        "timestamp": 1590607321
    },
    {
        "content": "<ul>\n<li>A unified framework for equivalences in social networks</li>\n</ul>\n<blockquote>\n<p>One of the main concerns in network science is the study of social positions and roles. By \"position\" social scientists usually mean a collection of actors who have similar ties to other actors, while a \"role\" is a specific pattern of ties among actors or positions. Since the 1970s a lot of research has been done to develop these concepts in a rigorous way. An open question in the field is whether it is possible to perform role and positional analysis simultaneously. In joint work with Mason Porter we explore this question by proposing an approach motivated by ideas of a category-theoretic nature. In this talk I will introduce role and positional analysis, present some well-studied examples from social network science, and what new insights this approach might gives us.</p>\n</blockquote>",
        "id": 198939818,
        "sender_full_name": "John Baez",
        "timestamp": 1590607490
    },
    {
        "content": "<p>Afterwards we will discuss her talk here!</p>",
        "id": 198940480,
        "sender_full_name": "John Baez",
        "timestamp": 1590607789
    },
    {
        "content": "<p>Alas, I couldn't attend the zoom session, but am very interested. Recording? Slides? Other related info available?<br>\nThanks.</p>",
        "id": 198961394,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1590618336
    },
    {
        "content": "<p>Are you talking about Nina Otter's talk, which has not happened?   Slides and video will eventually be available here:</p>\n<p><a href=\"https://johncarlosbaez.wordpress.com/2020/05/27/values-and-inclusivity-in-act/\">https://johncarlosbaez.wordpress.com/2020/05/27/values-and-inclusivity-in-act/</a></p>",
        "id": 198963164,
        "sender_full_name": "John Baez",
        "timestamp": 1590619635
    },
    {
        "content": "<p>Slides and videos of <em>all</em> ACT@UCR talks either are or will become available here:</p>\n<p><a href=\"https://johncarlosbaez.wordpress.com/2020/03/24/actucr-seminar/\">https://johncarlosbaez.wordpress.com/2020/03/24/actucr-seminar/</a></p>",
        "id": 198963217,
        "sender_full_name": "John Baez",
        "timestamp": 1590619674
    },
    {
        "content": "<p>We're planning to change the format of Nina's talk.  She writes, in part:</p>\n<blockquote>\n<p>Many shops on the street in which my apartment is in Downtown LA have been looted, and looters even broke into the first floor of my building, but luckily my neighbors were able to put out the fire and get them out. I am in Europe, but my neighbors write to me that it almost feels like being in a war in Downtown LA, and at the moment I am very worried about everyone in the US. I deeply wish I was there to help protesters or small non-profits in need, or help clean up my neighborhood. </p>\n<p>I am writing to you because in the current circumstances I do feel that it would not be right to go on with business as usual and give my talk on Wednesday. Instead I would like to suggest to do the following. We have a problem with lack of diversity in the category theory community, both in demographic as well as geographic terms. The current pandemic, and the fact that all activities are now taking place remotely, gives us the opportunity to involve  people from geographically distant areas, or people who would otherwise find it difficult to travel, even within the US. Thus, I would like to use the slot allocated for my talk on Wednesday to have a discussion on what concrete steps we can take now to make our community more diverse, and give opportunities to students and researchers from underprivileged backgrounds.</p>\n</blockquote>",
        "id": 199406964,
        "sender_full_name": "John Baez",
        "timestamp": 1591037015
    },
    {
        "content": "<p>Awesome :). It has been quite startling for me having attended quite a few conferences without seeing a single black person in it (I do realize that there are more under-presented minorities but the lack of black people has been egregious and blatant while, for instance, sexism in academia is at least addressed to some extent). It is great to see senior academics willing to discuss and do something about it.</p>",
        "id": 199409079,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1591038137
    },
    {
        "content": "<p>I ran a workshop on this last fall at UCR:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2019/10/14/diversity-workshop-at-ucr/\">Diversity Workshop at UCR</a>.</li>\n</ul>\n<p>Some people who really work hard on getting math to be more inclusive and break down the walls that keep lots of people out were involved: Edray Goins, Ami Radunskaya, Abba Gumel, Marissa Loving and Eugenia Cheng.</p>",
        "id": 199516916,
        "sender_full_name": "John Baez",
        "timestamp": 1591114746
    },
    {
        "content": "<p>Here is the title and abstract for the discussion that <span class=\"user-mention\" data-user-id=\"307077\">@Nina Otter</span>, <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> and others will lead tomorrow (Wednesday June 3rd)</p>\n<ul>\n<li>Values and Inclusivity in the Applied Category Theory Community.</li>\n</ul>\n<p>Nina's slides are here:</p>\n<p><a href=\"http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf\">http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf</a></p>",
        "id": 199517172,
        "sender_full_name": "John Baez",
        "timestamp": 1591114870
    },
    {
        "content": "<p><strong>Abstract.</strong> Saddened by the current events, we are taking this opportunity to pause and reflect on what we can do to change the status quo and try to bring about real and long-lasting change. Thus, we are holding a discussion aimed at finding concrete solutions to make the Applied Category Theory community more inclusive, and also to reflect about the values that our community would like to stand for and endorse, in particular, in terms of which sources of funding go against our values. While this discussion is specific to the applied category theory community, we believe that many of the topics will be of interest also to people in other fields, and thus we welcome anybody with an interest to attend. The discussion will consist of two parts: we will have first several people give short talks to discuss common issues that we need to address, as well as present specific plans for initiatives that we could take. We believe that the current pandemic, and the fact that all activities are now taking place remotely, gives us the opportunity to involve people who would otherwise find it difficult to travel, because of disabilities, financial reasons or care-taking responsibilities. Thus, now we have the opportunity to come up with new types of mentoring, collaborations, and many other initiatives that might have been difficult to envision until just a couple of months ago. The second part of the discussion will take place on the category theory community server, and its purpose is to allow for a broader participation in the discussion, and ideally during this part we will be able to flesh out in detail the specific initiatives that have been proposed in the talks.</p>",
        "id": 199517372,
        "sender_full_name": "John Baez",
        "timestamp": 1591114959
    },
    {
        "content": "<p>The discussion will be at the originally scheduled time and place: Wednesday June 3rd at 5 pm UTC, which is 10 am in California, or 1 pm on the east coast of the United States, or 6 pm in the UK. It will be held online via Zoom, here:</p>\n<p><a href=\"https://ucr.zoom.us/j/607160601\">https://ucr.zoom.us/j/607160601</a></p>",
        "id": 199517504,
        "sender_full_name": "John Baez",
        "timestamp": 1591115030
    },
    {
        "content": "<p>The discussion will go something like this:</p>\n<ul>\n<li>\n<p>(Nina Otter: introduction, and some potential initiatives)</p>\n</li>\n<li>\n<p>Jade Master: Experience in setting up an online research community for minorities in ACT</p>\n</li>\n<li>\n<p>Brendan Fong: Statement of values for ACT community</p>\n</li>\n<li>\n<p>Emily Riehl: Experience at MATRIX institute</p>\n</li>\n<li>\n<p>Christian Williams: Quick overview of ACT server</p>\n</li>\n</ul>",
        "id": 199644501,
        "sender_full_name": "John Baez",
        "timestamp": 1591202610
    },
    {
        "content": "<p>I can't join the call today, but I will leave my 50c here speaking as an organiser of the 2nd ACT school last year. (Nina and Brendan were organisers of the 1st one). I think that's a role that has a lot of responsibility here, as an entry point to our community. Overall we could have done worse, but also a lot better. The biggest issue I was thinking about at the time was the extreme lack of geographic diversity: despite being a mostly-online thing, I think everybody selected was based in western Europe, Canada, USA or Australia. Two reasons for that. Stupid reason is we had an effective budget of zero and we just couldn't select anyone who couldn't guarantee funding from their institution to travel to Oxford. More interesting reason is that in practice, a strong letter of recommendation from someone we trust outweighed basically every other factor. And no surprises for guessing where those people are based</p>",
        "id": 199645548,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591203108
    },
    {
        "content": "<p>Here's 50 cent more from one of this year's organizer. This year's school isn't perfect. However, also thanks to what previous organizers told us (Jules, Daniel Cicala, Brendan Fong and Nina Otter), we tried to make the school more accessible, trying to address the issues that Jules rightfully pointed out. In particular, we gave less weight to who wrote the recommendation letters (provided they were serious people).<br>\nBut mostly, we had the luck of finding a big \"accessibility\" sponsor, Protocol Labs, who gave us funding to help people fly to Boston from everywhere in the world. <br>\nOur luck seems to have ended there: about 5 minutes after finding such funding, Corona came...</p>",
        "id": 199646296,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591203491
    },
    {
        "content": "<p>Zoom demanded a software upgrade before I could join the meeting. This, of course, prompted a wave of petty irritation on my part — why can’t people get <em>supposedly critical infrastructure software</em> correct on the first go? — which I am riding into a more serious concern about the entire academic world centralizing upon a single mediocre product. Surely “monoculture is bad” and “flexibility is key to resilience” are lessons we’re smart enough to take to heart…</p>\n<p>I'm not particularly evangelical on the subject of free/open-source/what-have-you software, but I do have a bad feeling about this.</p>",
        "id": 199649341,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591204888
    },
    {
        "content": "<p>And I was avoiding conference travel, which I found both psychologically deleterious and ecologically unjustifiable, probably to the detriment of my own career. So, the community's \"pivot to video\" has given me just a bit of the unpleasant sensation that I grabbed the monkey's paw.</p>",
        "id": 199650794,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591205628
    },
    {
        "content": "<p>We're past the point in time where we need quick solutions that \"just work\" immediately \"out of the box\". Now the spring term is done, and we're not trying to find a way to give tomorrow's seminar or hold next week's office hours. Instead, we're seeking options for annual conferences and the fall semester. This is an opportunity to double-check the choices we've made so far and examine which of them might have been made differently under less time pressure.</p>\n<p>There may not be a <em>direct</em> link between selecting a particular software package and the cause of minority representation in science, but as the saying goes, \"the standard you walk past is the standard you accept\". What are we accepting when we blithely follow the path that Silicon Valley, of all places, lays out for us?</p>",
        "id": 199652156,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591206272
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284048\">Blake C. Stacey</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199649341\">said</a>:</p>\n<blockquote>\n<p>Zoom demanded a software upgrade before I could join the meeting. This, of course, prompted a wave of petty irritation on my part — why can’t people get <em>supposedly critical infrastructure software</em> correct on the first go? — which I am riding into a more serious concern about the entire academic world centralizing upon a single mediocre product. Surely “monoculture is bad” and “flexibility is key to resilience” are lessons we’re smart enough to take to heart…</p>\n<p>I'm not particularly evangelical on the subject of free/open-source/what-have-you software, but I do have a bad feeling about this.</p>\n</blockquote>\n<p>There <em>is</em> free/libre online conferencing software.  I know of one, Jitsi, but I haven't tried it.</p>",
        "id": 199652533,
        "sender_full_name": "Hendrik Boom",
        "timestamp": 1591206446
    },
    {
        "content": "<p>Jitsi has been suggested in other conversations that I've been following, and I will give it a test run when I can make an opportunity.</p>",
        "id": 199653682,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591206983
    },
    {
        "content": "<p>In terms of being a \"more welcoming\" or at least \"less intimidating\" place for newcomers (which is important in increasing the scope and diversity of people involved) I would suggest people consider adopting some variant of the recurse center's social rules, either on the zulip, or also perhaps at ACT conferences, etc. as well <a href=\"https://www.recurse.com/social-rules\">https://www.recurse.com/social-rules</a></p>\n<ul>\n<li>No well-actually’s</li>\n<li>No feigned surprise</li>\n<li>No backseat driving</li>\n<li>No subtle -isms</li>\n</ul>",
        "id": 199654903,
        "sender_full_name": "Gershom",
        "timestamp": 1591207543
    },
    {
        "content": "<p>+1 to Recurse's social rules — I'm currently in my second batch there 👋🏽</p>",
        "id": 199655263,
        "sender_full_name": "Jasdev Singh (he/him)",
        "timestamp": 1591207601
    },
    {
        "content": "<p>Also I would note that many american universities, including e.g. UCR, are legally barred from carrying out explicit affirmative action policies. But for events and conferences that are not, perhaps they should just explicitly do so.</p>",
        "id": 199655294,
        "sender_full_name": "Gershom",
        "timestamp": 1591207622
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199645548\">said</a>:</p>\n<blockquote>\n<p>I can't join the call today, but I will leave my 50c here speaking as an organiser of the 2nd ACT school last year. (Nina and Brendan were organisers of the 1st one). I think that's a role that has a lot of responsibility here, as an entry point to our community. Overall we could have done worse, but also a lot better. The biggest issue I was thinking about at the time was the extreme lack of geographic diversity: despite being a mostly-online thing, I think everybody selected was based in western Europe, Canada, USA or Australia. Two reasons for that. Stupid reason is we had an effective budget of zero and we just couldn't select anyone who couldn't guarantee funding from their institution to travel to Oxford. More interesting reason is that in practice, a strong letter of recommendation from someone we trust outweighed basically every other factor. And no surprises for guessing where those people are based</p>\n</blockquote>\n<p>In general, however, I think Jules' comment, and also Jade's talk, are pointing out a big, uncomfortable truth of academia: very often, reinforcement of the status quo comes disguised as \"meritocracy\". Or better, <em>proxies</em> to meritocracy. For example, coming from a famous institution.</p>",
        "id": 199655339,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591207648
    },
    {
        "content": "<p>Oh, Emily is talking about it right now :) great</p>",
        "id": 199655447,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591207692
    },
    {
        "content": "<blockquote>\n<p>very often, reinforcement of the status quo comes disguised as \"meritocracy\". </p>\n</blockquote>\n<p>Lamentably true.</p>",
        "id": 199655537,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591207741
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"299803\">Hendrik Boom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199652533\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"284048\">Blake C. Stacey</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199649341\">said</a>:</p>\n<blockquote>\n<p>Zoom demanded a software upgrade before I could join the meeting. This, of course, prompted a wave of petty irritation on my part — why can’t people get <em>supposedly critical infrastructure software</em> correct on the first go? — which I am riding into a more serious concern about the entire academic world centralizing upon a single mediocre product. Surely “monoculture is bad” and “flexibility is key to resilience” are lessons we’re smart enough to take to heart…</p>\n<p>I'm not particularly evangelical on the subject of free/open-source/what-have-you software, but I do have a bad feeling about this.</p>\n</blockquote>\n<p>There <em>is</em> free/libre online conferencing software.  I know of one, Jitsi, but I haven't tried it.</p>\n</blockquote>\n<p>Agreed. Zoom has started as the \"emergency solution\", and right now, with all the conferences coming, not many have time to try out, learn, and accept other technologies (yet), but you are 100% right. As one of the \"media persons\" in the ACT community, I'd be very happy to look for other solutions (even open source) in the longer term, after these summer conferences. I have already a couple of ideas in mind, and any additional idea is welcome. <br>\nBy the way, I've tried Jitsi. It doesn't have the quality and features of Zoom, but it's solid and reliable. <br>\nIn any case, I feel this should go in a separate thread.</p>",
        "id": 199655670,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591207809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199655447\">said</a>:</p>\n<blockquote>\n<p>Oh, Emily is talking about it right now :) great</p>\n</blockquote>\n<p>Is the call still going on? (I had to be somewhere else, now I'm trying to join but Zoom is broken in general today)</p>",
        "id": 199655761,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591207861
    },
    {
        "content": "<p>yep, come</p>",
        "id": 199655780,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591207872
    },
    {
        "content": "<blockquote>\n<p>In any case, I feel this should go in a separate thread.</p>\n</blockquote>\n<p>Sounds fine to me. And I should probably wait until I gather more data (try running a group meeting or two, etc.) before blathering on too much more! :-)</p>",
        "id": 199655894,
        "sender_full_name": "Blake C. Stacey",
        "timestamp": 1591207931
    },
    {
        "content": "<p>Has someone created a stream called \"Values\"?   We should do that.</p>",
        "id": 199658403,
        "sender_full_name": "John Baez",
        "timestamp": 1591209203
    },
    {
        "content": "<p><a href=\"#narrow/stream/241990-values\">https://categorytheory.zulipchat.com/#narrow/stream/241990-values</a></p>",
        "id": 199658461,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1591209235
    },
    {
        "content": "<p>So, maybe we should talk over there if it's generally about \"values\".</p>",
        "id": 199659655,
        "sender_full_name": "John Baez",
        "timestamp": 1591209822
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>Agreed. Zoom has started as the &quot;emergency solution&quot;, and right now, with all the conferences coming, not many have time to try out, learn, and accept other technologies (yet), but you are 100% right. As one of the &quot;media persons&quot; in the ACT community, I&#39;d be very happy to look for other solutions (even open source) in the longer term, after these summer conferences. I have already a couple of ideas in mind, and any additional idea is welcome.\nBy the way, I&#39;ve tried Jitsi. It doesn&#39;t have the quality and features of Zoom, but it&#39;s solid and reliable.\nIn any case, I feel this should go in a separate thread.\n</code></pre></div>\n\n\n<p>Zoom was doing corporate teleconferencing when Covid-19 hit.  Suddenly their user base increases a hundredfold.  They are having trouble keeping up with the demand, and they are working hard trying to keep up with security problems the increased usage and visibility has exposed.</p>",
        "id": 199660516,
        "sender_full_name": "Hendrik Boom",
        "timestamp": 1591210270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199654903\">said</a>:</p>\n<blockquote>\n<p>In terms of being a \"more welcoming\" or at least \"less intimidating\" place for newcomers (which is important in increasing the scope and diversity of people involved) I would suggest people consider adopting some variant of the recurse center's social rules, either on the zulip, or also perhaps at ACT conferences, etc. as well <a href=\"https://www.recurse.com/social-rules\">https://www.recurse.com/social-rules</a></p>\n</blockquote>\n<p>I agree 100%. These should be a part of the guidelines, when we get around to making them. This server is not about showing how smart you are. It's about learning together.</p>",
        "id": 199660846,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591210429
    },
    {
        "content": "<p>Can't help but notice that the \"basic questions\" feed suffers from an extreme variation in what \"basic\" means. It's the obvious place for total beginners, but it also seems to be the destination for, roughly speaking, anything that would be closed as not research-level on MathOverflow</p>",
        "id": 199662330,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591211234
    },
    {
        "content": "<p>Yes, we're going to make a better stream, if not a whole category for actual beginners or anyone who feels \"innocent\" with respect to some subfield. We'll have to see how to keep things simple there.</p>",
        "id": 199662479,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591211320
    },
    {
        "content": "<p>I posted some questions I had on \"Basic Questions\" just because there's no stream for \"Advanced Questions\".</p>",
        "id": 199668166,
        "sender_full_name": "John Baez",
        "timestamp": 1591213890
    },
    {
        "content": "<p>I thought <a class=\"stream\" data-stream-id=\"229136\" href=\"/#narrow/stream/229136-theory.3A-category-theory\">#theory: category theory</a> is the \"advanced questions\" stream....</p>",
        "id": 199668308,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591213942
    },
    {
        "content": "<p>Well, that's also the \"let me tell you about what I just found out\" stream, and a lot of other things.</p>",
        "id": 199668360,
        "sender_full_name": "John Baez",
        "timestamp": 1591213968
    },
    {
        "content": "<p>I don't really like the term \"Basic Questions\".    I guess it's supposed to make people less scared to ask \"stupid questions\".</p>",
        "id": 199668410,
        "sender_full_name": "John Baez",
        "timestamp": 1591213991
    },
    {
        "content": "<p>But what if you have a question and you're not sure it's \"Basic\"?</p>",
        "id": 199668429,
        "sender_full_name": "John Baez",
        "timestamp": 1591214004
    },
    {
        "content": "<p>Maybe it's helpful, maybe it's not - I can't tell.  I'll consider it successful if it gets people to ask lots of questions.</p>",
        "id": 199668597,
        "sender_full_name": "John Baez",
        "timestamp": 1591214078
    },
    {
        "content": "<p>Right, the intention is to be free to ask \"stupid questions\", where people can't get mad about it.</p>",
        "id": 199668628,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214095
    },
    {
        "content": "<p>but I think some of the questions I see there are sorta advanced...</p>",
        "id": 199668665,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214122
    },
    {
        "content": "<p>I like the idea of a topic \"Stupid questions\", but I guess it's not really a good idea.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 199668669,
        "sender_full_name": "John Baez",
        "timestamp": 1591214125
    },
    {
        "content": "<p>I don't think it's possible to decide in an objective way what counts as a \"basic\" question.</p>",
        "id": 199668706,
        "sender_full_name": "John Baez",
        "timestamp": 1591214151
    },
    {
        "content": "<p>Maybe it really should be called \"any level of question is fine, even basic\"</p>",
        "id": 199668832,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214203
    },
    {
        "content": "<p>Questions could range from \"what is category theory?\" to \"what's a category?\" to \"what's a colimit?\" to \"do monoidal functors automatically preserve monoids?\" to... whatever.  They're all \"basic\" from some viewpoint or other.</p>",
        "id": 199668849,
        "sender_full_name": "John Baez",
        "timestamp": 1591214210
    },
    {
        "content": "<p>Why not just <code>learning: questions</code>? Why add a qualifier at all?</p>",
        "id": 199669096,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1591214336
    },
    {
        "content": "<p>That might be a good idea</p>",
        "id": 199669208,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591214392
    },
    {
        "content": "<p>I think the idea was that if someone goes to some stream and sees me asking whether compact objects in presheaf categories are all finite colimits of representables, they may get scared to ask \"what's a compact object?\"  </p>\n<p>I don't know the solution, but the goal should be to make people comfortable with asking questions.</p>",
        "id": 199669309,
        "sender_full_name": "John Baez",
        "timestamp": 1591214421
    },
    {
        "content": "<p>My original thought was that I want to encourage people to ask things they think might be \"below\" the general knowledge level of the group.</p>",
        "id": 199669332,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214430
    },
    {
        "content": "<p>The problem with any variation on \"basic questions\" is that if I come to ask a basic question and I see the stream containing questions that don't look basic to me, I'm going to be intimidated</p>",
        "id": 199669343,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591214433
    },
    {
        "content": "<p>Yes, I think this is a problem.</p>",
        "id": 199669383,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214456
    },
    {
        "content": "<p>Yup.</p>",
        "id": 199669409,
        "sender_full_name": "John Baez",
        "timestamp": 1591214464
    },
    {
        "content": "<p>\"sorry, you're question is too advanced <em>BAN</em>\"</p>",
        "id": 199669447,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591214482
    },
    {
        "content": "<p>We could have one called \"Esoteric Questions\".   <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 199669500,
        "sender_full_name": "John Baez",
        "timestamp": 1591214510
    },
    {
        "content": "<p>Here are my slides, in case anybody would like them: <a href=\"/user_uploads/21317/c4qjCLmnGCEt-o_5nem2RW3W/values_ACT.pdf\">values_ACT.pdf</a></p>",
        "id": 199670209,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591214804
    },
    {
        "content": "<p>instead of \"basic questions\" what about \"no question too basic\"</p>",
        "id": 199671459,
        "sender_full_name": "Gershom",
        "timestamp": 1591215497
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276650\">Gershom</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199654903\">said</a>:</p>\n<blockquote>\n<p>In terms of being a \"more welcoming\" or at least \"less intimidating\" place for newcomers (which is important in increasing the scope and diversity of people involved) I would suggest people consider adopting some variant of the recurse center's social rules, either on the zulip, or also perhaps at ACT conferences, etc. as well <a href=\"https://www.recurse.com/social-rules\">https://www.recurse.com/social-rules</a></p>\n<ul>\n<li>No well-actually’s</li>\n<li>No feigned surprise</li>\n<li>No backseat driving</li>\n<li>No subtle -isms</li>\n</ul>\n</blockquote>\n<p>For this to work, it's important that there be firm moderation to make sure such social rules are being followed. Some of my experiences here, in this Zulip chat, have been some of my worst online experiences in terms of feeling talked at, talked down to, and disrespected at a basic level. In such cases, there needs to be a moderator one can reach to get things sorted out.</p>",
        "id": 199679573,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1591219932
    },
    {
        "content": "<p>Wow!   If that's how you feel you'll just love Twitter, Todd.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 199681807,
        "sender_full_name": "John Baez",
        "timestamp": 1591221226
    },
    {
        "content": "<p>I'm sorry it's been so problematic.</p>",
        "id": 199681869,
        "sender_full_name": "John Baez",
        "timestamp": 1591221246
    },
    {
        "content": "<p>I don't <em>generally</em> have the impression that lots of people are feeling bad about conversations here; a couple conversations stand out in my mind as being unusual, and I think one or two of them involved you...</p>",
        "id": 199682143,
        "sender_full_name": "John Baez",
        "timestamp": 1591221391
    },
    {
        "content": "<p>I'm surprised by this - maybe I'm oblivious, or maybe desensitised from twitter.... there <em>should</em> be a place you can bring this up, but we have a more specific problem that the \"governance\" features provided by Zulip are basic to nonexistent..... specifically the problem is you can either talk to one individual in a private message, or totally in public, but there's nothing in between</p>",
        "id": 199682218,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591221441
    },
    {
        "content": "<p>There is a little moderation but it mostly amounts to sometimes renaming and moving threads to more appropriate places</p>",
        "id": 199682247,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591221467
    },
    {
        "content": "<p>I think there are two options in between. You can create a private stream, and only invite specific people. You can also create a group chat.</p>",
        "id": 199683252,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591222088
    },
    {
        "content": "<p>It's very easy to set up threads open only to subsets of people.</p>",
        "id": 199683267,
        "sender_full_name": "John Baez",
        "timestamp": 1591222101
    },
    {
        "content": "<p>I think the whole \"governance\" problem will become more of an issue if this place really catches on.  So far my impression is that a few people are using it to talk with each other and having lots of fun doing so, and \"governance\" is hardly ever needed.</p>",
        "id": 199683409,
        "sender_full_name": "John Baez",
        "timestamp": 1591222203
    },
    {
        "content": "<p>Yet.</p>",
        "id": 199683415,
        "sender_full_name": "John Baez",
        "timestamp": 1591222206
    },
    {
        "content": "<p>I'm sorry to hear that, Todd. It will be a big task to moderate such a large group of people, but we'll figure it out. For now, everyone please feel free to let me know about any issues; if you don't want to confront someone, I can talk to them privately as a third party.</p>",
        "id": 199683444,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591222236
    },
    {
        "content": "<p>I think three times I've told someone to chill out, and it seemed to work.</p>",
        "id": 199683507,
        "sender_full_name": "John Baez",
        "timestamp": 1591222285
    },
    {
        "content": "<p>If the number of active users expands (which btw is currently completely dwarfed by the number of <em>inactive</em> users), governance will inevitably become an issue.   It always does.</p>",
        "id": 199683629,
        "sender_full_name": "John Baez",
        "timestamp": 1591222354
    },
    {
        "content": "<p>By the way: right now, Christian, I would not call this a \"large group of people\".    It's puny.</p>",
        "id": 199683673,
        "sender_full_name": "John Baez",
        "timestamp": 1591222392
    },
    {
        "content": "<p>There are about 20-30 people who talk regularly here, and probably 10 who do it a lot.</p>",
        "id": 199683779,
        "sender_full_name": "John Baez",
        "timestamp": 1591222447
    },
    {
        "content": "<p>Why do you think I avoid Twitter, John? <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>  It's that, and the fact I don't need yet another time-suck in my life.</p>",
        "id": 199683801,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1591222464
    },
    {
        "content": "<p>You're missing a lot of great flame wars, Todd.</p>",
        "id": 199683822,
        "sender_full_name": "John Baez",
        "timestamp": 1591222479
    },
    {
        "content": "<p>Just kidding.  Actually I find math twitter very peaceful, in part because it's so easy to block or mute people who are annoying.</p>",
        "id": 199683883,
        "sender_full_name": "John Baez",
        "timestamp": 1591222524
    },
    {
        "content": "<p>Everyone loves to exclaim how friendly math twitter is.</p>",
        "id": 199683914,
        "sender_full_name": "John Baez",
        "timestamp": 1591222545
    },
    {
        "content": "<p>It would be interesting to see what happens to the numbers here if it automatically deleted people if they were inactive for, say, a month.</p>",
        "id": 199683969,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591222565
    },
    {
        "content": "<p>It would quickly drop by a factor of 10.</p>",
        "id": 199683998,
        "sender_full_name": "John Baez",
        "timestamp": 1591222584
    },
    {
        "content": "<p>Unless of course there are lots of lurkers!  Which there probably are!</p>",
        "id": 199684013,
        "sender_full_name": "John Baez",
        "timestamp": 1591222600
    },
    {
        "content": "<p>I tend to forget how many people just silently lurk, because for <em>me</em> that's an incomprehensible use of time.</p>",
        "id": 199684035,
        "sender_full_name": "John Baez",
        "timestamp": 1591222624
    },
    {
        "content": "<p>Yes, please don't say this is a small group of people. There are lots of people reading and occasionally participating. You don't have to be talkative to be a part of the server.</p>",
        "id": 199684744,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591223048
    },
    {
        "content": "<p>It's comparable to reading a book, I think.</p>",
        "id": 199684859,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591223125
    },
    {
        "content": "<p>Of course people who merely lurk don't contribute to any \"governance\" problems.</p>",
        "id": 199684883,
        "sender_full_name": "John Baez",
        "timestamp": 1591223154
    },
    {
        "content": "<p>What I meant about it being small is that the number of people talking is comparable to an extended family or very small tribe, where you just need an \"elder\" (namely me) to occasionally step in and shame people when they start acting too obnoxious.</p>",
        "id": 199685006,
        "sender_full_name": "John Baez",
        "timestamp": 1591223239
    },
    {
        "content": "<p>But past a certain size that approach always breaks down.</p>",
        "id": 199685023,
        "sender_full_name": "John Baez",
        "timestamp": 1591223256
    },
    {
        "content": "<p>as a quick survey, just today 35 people have posted. (today in Pacific time)</p>",
        "id": 199685038,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591223271
    },
    {
        "content": "<p>But I know what you mean. This is why I really want to make this place more inviting for everyone.</p>",
        "id": 199685183,
        "sender_full_name": "Christian Williams",
        "timestamp": 1591223363
    },
    {
        "content": "<p>Good!  Today we're having a conference and we had a talk.   A lot of those 35 people are not \"regulars\".</p>",
        "id": 199685219,
        "sender_full_name": "John Baez",
        "timestamp": 1591223389
    },
    {
        "content": "<p>I think there needs to be a clear way for a user to contact a moderator about a concern they have, if they are made to feel unwelcome in any way.</p>",
        "id": 199685234,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1591223401
    },
    {
        "content": "<p>It's when you get a crowd of \"regulars\" that frictions and antipathies develop.</p>",
        "id": 199685286,
        "sender_full_name": "John Baez",
        "timestamp": 1591223414
    },
    {
        "content": "<p>Yes, I agree with Nathanael.</p>",
        "id": 199685307,
        "sender_full_name": "John Baez",
        "timestamp": 1591223430
    },
    {
        "content": "<p>It would be nice if Zulip distinguished moderators from other users in the panel to the right, so it was easy to know whom to contact.</p>",
        "id": 199685332,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1591223457
    },
    {
        "content": "<p>I don't know what sort of people/organizations \"normally\" use Zulip and what they do about governance.</p>",
        "id": 199685385,
        "sender_full_name": "John Baez",
        "timestamp": 1591223515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199685234\">said</a>:</p>\n<blockquote>\n<p>I think there needs to be a clear way for a user to contact a moderator about a concern they have, if they are made to feel unwelcome in any way.</p>\n</blockquote>\n<p>which conference? QPL?</p>",
        "id": 199685518,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591223609
    },
    {
        "content": "<p>No, this:</p>",
        "id": 199685544,
        "sender_full_name": "John Baez",
        "timestamp": 1591223639
    },
    {
        "content": "<p><a href=\"#narrow/stream/238032-Categorical-Probability.20and.20Statistics.202020.20workshop\">https://categorytheory.zulipchat.com/#narrow/stream/238032-Categorical-Probability.20and.20Statistics.202020.20workshop</a></p>",
        "id": 199685553,
        "sender_full_name": "John Baez",
        "timestamp": 1591223642
    },
    {
        "content": "<p>Oh right, whoops.</p>",
        "id": 199685607,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591223679
    },
    {
        "content": "<p>a lot of \"governance\" is not actually using moderation tools or the threat, which is heavy-handed. it is people with certain authority more proactively asking people to chill, or reminding them when they may be inadvertently making people feel small (i.e. well-actuallying) and encouraging them to present their points in a more positive way.</p>",
        "id": 199693530,
        "sender_full_name": "Gershom",
        "timestamp": 1591230176
    },
    {
        "content": "<p>As a MathOverflow moderator, I can say that publicly asking people to \"chill\" or reprimanding them in any way often requires a great deal of tact, for example avoiding situations where someone feels ganged up on. Having a private word can often work better (and sometimes even that can be touchy).</p>",
        "id": 199694248,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1591230903
    },
    {
        "content": "<p>I agree, but I'd also point out that doing things publicly (but with a massively light touch) also encourages others.</p>",
        "id": 199694321,
        "sender_full_name": "Gershom",
        "timestamp": 1591230967
    },
    {
        "content": "<p>Nina Otter's slides are here:</p>\n<p><a href=\"http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf\">http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf</a></p>\n<p>You can see a video of the whole discussion here:</p>\n<p><a href=\"https://www.youtube.com/watch?v=dn_whW1DIws&amp;feature=emb_logo\">https://www.youtube.com/watch?v=dn_whW1DIws&amp;feature=emb_logo</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"dn_whW1DIws\" href=\"https://www.youtube.com/watch?v=dn_whW1DIws&amp;feature=emb_logo\"><img src=\"https://i.ytimg.com/vi/dn_whW1DIws/default.jpg\"></a></div>",
        "id": 199807054,
        "sender_full_name": "John Baez",
        "timestamp": 1591303973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/199807054\">said</a>:</p>\n<blockquote>\n<p>Nina Otter's slides are here:</p>\n<p><a href=\"http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf\">http://math.ucr.edu/home/baez/mathematical/ACTUCR/Otter_Diversity.pdf</a></p>\n<p>You can see a video of the whole discussion here:</p>\n<p><a href=\"https://www.youtube.com/watch?v=dn_whW1DIws&amp;feature=emb_logo\">https://www.youtube.com/watch?v=dn_whW1DIws&amp;feature=emb_logo</a></p>\n</blockquote>\n<p>Those are the slides I shared before the talk, I changed a couple of things! I had shared here yesterday the version of slides I had used during the talk.</p>",
        "id": 199807526,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591304251
    },
    {
        "content": "<p>Okay, I'll grab them and replace that file.</p>",
        "id": 199809064,
        "sender_full_name": "John Baez",
        "timestamp": 1591305169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307077\">@Nina Otter</span> while I think your change of topic for your seminar talk was a good idea, and I'm glad you did it, I would still like to learn more about your previous topic “A Unified Framework for Equivalences in Social Networks” and would eagerly read anything you made public about it.</p>\n<p>I also figure those two topics have some overlap....</p>",
        "id": 200025691,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1591538843
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/229966-ACT.40UCR-seminar/topic/June.203rd.3A.20Nina.20Otter/near/200025691\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"307077\">Nina Otter</span> while I think your change of topic for your seminar talk was a good idea, and I'm glad you did it, I would still like to learn more about your previous topic “A Unified Framework for Equivalences in Social Networks” and would eagerly read anything you made public about it.</p>\n<p>I also figure those two topics have some overlap....</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"297945\">@Bob Haugen</span>  thank you for your interest! I am giving a version of that talk  on 19 June at 3pm GMT+1 (details on how to attend to follow), and because of a job application I'll have to upload a first preprint (probably unpolished) to the arxix in 10 days</p>",
        "id": 200033837,
        "sender_full_name": "Nina Otter",
        "timestamp": 1591551074
    },
    {
        "content": "<p>Here is the link to join a version of that talk that I am giving this Friday at 4pm GMT+2. Please <em>don't</em> share this link. <a href=\"https://teams.microsoft.com/l/meetup-join/19%3ameeting_YjZmNWI5YzktMzUzYi00ZWQyLWEwMzEtOTM0NWI1M2UyNDVi%40thread.v2/0?context=%7b%22Tid%22%3a%22cc95de1b-97f5-4f93-b4ba-fe68b852cf91%22%2c%22Oid%22%3a%2265333355-af03-41e8-bdf6-21be62c5cf1b%22%7d\">https://teams.microsoft.com/l/meetup-join/19%3ameeting_YjZmNWI5YzktMzUzYi00ZWQyLWEwMzEtOTM0NWI1M2UyNDVi%40thread.v2/0?context=%7b%22Tid%22%3a%22cc95de1b-97f5-4f93-b4ba-fe68b852cf91%22%2c%22Oid%22%3a%2265333355-af03-41e8-bdf6-21be62c5cf1b%22%7d</a>&gt;</p>",
        "id": 201185730,
        "sender_full_name": "Nina Otter",
        "timestamp": 1592420322
    },
    {
        "content": "<p><a href=\"https://www.maths.ox.ac.uk/node/35964\">https://www.maths.ox.ac.uk/node/35964</a></p>",
        "id": 201185765,
        "sender_full_name": "Nina Otter",
        "timestamp": 1592420347
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 201187761,
        "sender_full_name": "John Baez",
        "timestamp": 1592421364
    }
]