[
    {
        "content": "<p>Here is the document I will review with the group at tomorrow's meeting. <a href=\"/user_uploads/21317/DYpJmwEinm0EHj6_hxDERozG/Abstracts-and-Notes.pdf\">Abstracts-and-Notes.pdf</a> </p>\n<p>It includes a digest of six papers that I have selected as candidates for our first reading. Several of the papers' authors are on here, so if anybody reads this and feels that I have done a poor job picking out the key points, please let me know.</p>",
        "id": 202167597,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1593232804
    },
    {
        "content": "<p>I'm going to periodically update this post as I browse the papers. First, I'll write the key points and my interest. At the end, I'll chose the top 2. <br>\n<strong>McCullagh.</strong> <br>\n<strong>Numbers: 2, 5, 6, 11</strong><br>\nStatistical model, parametrized statistical model, Bayesian model, extension of a model. <br>\nI'm interested in understanding how one compiles data into a statistical model (or what statistical models are compatible with that data), and how to make inference based on that model. What is an extension of a model and in what sense does inference require a model to be extendable? My interest in the categorical aspects are towards quantum mechanical generalizations (this occurs for all papers unless otherwise specified). <br>\n<strong>Morse and Sacksteder</strong><br>\n<strong>Numbers: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11</strong> yikes I'm sorry all of this sounds interesting and is written in a language familiar to me (invariants, etc). <br>\nComparing experiments and sufficiency from a categorical perspective.<br>\n<strong>Simpson</strong><br>\n<strong>Numbers: 5</strong><br>\nI'm curious if Simpson claims that the Giry monad has a conceptual definition rather than a specific construction (probability measures on a space). <br>\n<strong>Patterson</strong><br>\n<strong>Numbers: 3, 5, 7</strong><br>\nI have little coding experience, but if the requirements are minimal, I would be interested in picking some up for the purpose of examples. I'm thinking this could be useful in parametric Bayesian updating, which I am very interested in learning about. <br>\n<strong>Perrone</strong><br>\n<strong>Numbers: 3, 6, 7</strong><br>\nProbability monads, convex monotone maps as lax morphisms, disintegrations<br>\nMy interest in this may vary, but ATM, it is more on lax affine morphisms and the section on disintegrations (for two separate projects, one on entropy and one on conditional expectations). I am curious to see how the adjunction related to the Kantorovich monad is explained in terms of Choquet theory.<br>\n<strong>Fritz</strong><br>\n<strong>Numbers: 4, 7, 8, 12</strong><br>\nSufficient statistics, conditional independence. <br>\nI'd like to know what a statistic is, how it is related to a statistical model (from McCullagh), and what it means for such a statistic to be sufficient. I assume it means sufficient for prediction/extrapolation, so it seems also related to extendability of a model. I also want to know how much of probability and statistics can be phrased in the Markov category language (and what are their limitations).<br>\nMy top two choices for papers are<br>\n<strong>1. Morse &amp; Sacksteder</strong><br>\n<strong>2. Fritz</strong> (although I have read much of it, I think it is a good place to start)</p>",
        "id": 202194778,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1593276465
    },
    {
        "content": "<p><a href=\"join/077iqsv6tve4vgi0vus83oxq/\">https://categorytheory.zulipchat.com/join/077iqsv6tve4vgi0vus83oxq/</a></p>",
        "id": 202195830,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593278074
    },
    {
        "content": "<p><strong>McCullagh</strong></p>\n<ul>\n<li>This seems somewhat interesting as far as the philosophy of statistics is concerned and getting the fundamentals right, but it doesn't seem too connected to modelling the details of statistical inference as such otherwise.</li>\n<li>3, 4, 5, 11</li>\n</ul>\n<p><strong>Morse &amp; Sacksteder</strong></p>\n<ul>\n<li>This seems almost identical to some of my projects, so I feel like I should have read it already, but I haven't <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></li>\n<li>3, 4, 11</li>\n</ul>\n<p><strong>Simpson</strong></p>\n<ul>\n<li>Based on the abstract, I don't see anything relevant to me personally. I guess learning some very basics of Giry monad and examples of computations with it is the most interesting part to me.</li>\n</ul>\n<p><strong>Patterson</strong></p>\n<ul>\n<li>Structuralist approach to data analysis sounds super cool, and I like the nuanced modelling of statistical theories. Chapters 3 and 4 are more interesting to me.</li>\n<li>3, 5, 7, 10, 11</li>\n</ul>\n<p><strong>Perrone</strong></p>\n<ul>\n<li>This is also very much related to my work and interests, especially the stuff on L-ordered spaces. I didn't put it in the selection below, because I have already read parts of it and I feel like I can understand it pretty well on my own, but I am more than happy to go through it in more detail and discuss its contents.</li>\n<li>2, 4, 7, 11, 17</li>\n</ul>\n<p><strong>Fritz</strong></p>\n<ul>\n<li>This is a great paper, I have read it in great detail already, but I am happy to discuss its contents with the rest of the group.</li>\n</ul>\n<p><strong>Top papers: (1) Patterson, (2) Morse &amp; Sacksteder</strong></p>\n<p>Generally, I think am actually the most interested in learning about how the categorical modelling of statistical concepts relates to the actual practice of statistics and understanding what are the main obstructions towards bringing the categorical language closer to the practice.</p>",
        "id": 202197153,
        "sender_full_name": "Tomáš Gonda",
        "timestamp": 1593280177
    },
    {
        "content": "<p>McCullagh - Interesting ponts: 4, 5. - I'm curious about how they model how something \"makes sense\".<br>\nMorse- Interesting points: 11 - Invariants are always interesting.<br>\nSimpson - Interesting points: 1, 3 - The idea of a probability sheaf is nice and I imagine related to stuff like contextuality. I'd like to know more<br>\nPatterson - 2, 7, 10 - I'm curious to know more about links between statistical models and logic. <br>\nPerrone - 2, 5 - I have no idea of what Kantorovich duality is, but I'm interested! <br>\nFritz - 1 - Markov categories seem interesting</p>\n<p>Top papers: (1) Simpson, (2) Patterson</p>",
        "id": 202197294,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593280329
    },
    {
        "content": "<p>Morse 1,6 Connection of samples and experiments can we relate how human model decisions and beliefs in this same framework?<br>\nSimpson 3 Sheaves come up so much would like to learn more about applied to probability.<br>\nPatterson 2,3,4 10 The whole paper really. We are essentially data science experiments trying to navigate the world and update our mental models of it. Connecting the abstract categorical account with the pragmatics of dealing with data and a decision is very interesting to me to understand better.<br>\nFritz 1,4 Much of how we judge events and decide on actions is relative to a context or evidence. Applying the categorical notions to conditional probability is relevant and might provide constraints on models of behavior. <br>\nTop Papers (1) Patterson (2) Fritz</p>",
        "id": 202197335,
        "sender_full_name": "Britt Anderson",
        "timestamp": 1593280431
    },
    {
        "content": "<p><strong>McCullagh</strong> (5, 7): The problem of formalizing what it means for a statistical model to have a natural extension to a larger set of observational units is a good one. I'm interested in how this might be related to replicability problems in science, see e.g. this paper on the <a href=\"https://psyarxiv.com/jqw35\">\"generalizability crisis\"</a>. I think that category theory should have something to say about how statistical models from different experiments are compatible with each other (or not).</p>\n<p><strong>Morse and Sacksteder</strong> (10, 11, 12): I'm curious about the \"complete set of invariants\" for statistical isomorphism. IIRC, <a href=\"https://www.ams.org/books/mmono/053/\">Cencov's book</a> has some material on complete sets of invariants. It would be good to understand how this all fits together.</p>\n<p><strong>Simpson</strong> (1, 2, 3): I like the goal of formalizing the <a href=\"https://terrytao.wordpress.com/2010/01/01/254a-notes-0-a-review-of-probability-theory/\">idea</a> that probabilistic concepts (unlike measure-theoretic ones) must be invariant under extension of the underlying probability space.</p>\n<p><strong>Patterson</strong>: [I am the author, so I won't say anything here.]</p>\n<p><strong>Perrone</strong> (10, 11, 12): I'm interested in better understanding how orders on a measurable space can be extended to metrics on the space of probability measures on that space.</p>\n<p><strong>Fritz</strong>: This paper is the most comprehensive treatment of Markov categories yet written. Ch. 3-4 of my thesis build on ideas from this and other papers on categories of Markov kernels and their abstraction as Markov categories. The paper has lots of good examples and results.</p>\n<p>Top papers to start with: (1) McCullagh, (2) Perrone</p>",
        "id": 202197379,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1593280446
    },
    {
        "content": "<p>McCullagh: 2, 4, 5, 9, 10<br>\nI'm interested in how to represent statistical models algebraically for computation. This paper seems like a natural place to start.</p>\n<p>Morse: 2, 3<br>\nThis idea of isomorphism between \"statistical systems\" seems like it could be useful to being able reason about relationship betwen various statistical approachs to scientific problems.</p>\n<p>Simpson: 1<br>\nI know nothing of sheaves, but I'm open to learning about them.</p>\n<p>Patterson: 1, 3, 4, 5, 10, 11<br>\nI am an applied statistician, scientist, and developer of statistical software, so this paper is the most directly relevant to me. I'm mostly interested in the algebra of statistical theories.</p>\n<p>Perrone: 1<br>\nThe heavy categorical language is all a bit beyond my curent categorical knowledge, but I'm game to hang on for dear life and learn.</p>\n<p>Fritz: 1, 3, 13<br>\nI really like the idea of understanding key statistical concepts in categorical terms. I'm curious how this will shape statistics in the future.</p>\n<p>Top Papers: (1) McCullagh, (2) Patterson</p>",
        "id": 202197385,
        "sender_full_name": "Bradley Saul",
        "timestamp": 1593280463
    },
    {
        "content": "<p>For all the papers, my main interest is judging whether I can even follow them well enough to actually participate in this reading group.</p>\n<p>Peter McCullagh<br>\n3</p>\n<p>Norman Morse and Richard Sacksteder<br>\n3</p>\n<p>Alex Simpson<br>\n1</p>\n<p>Evan Patterson<br>\n2,  5, 7</p>\n<p>Paolo Perrone<br>\n1</p>\n<p>Tobias Fritz<br>\n1</p>\n<p>Top Papers: (1) McCullagh, (2) Morse</p>",
        "id": 202197386,
        "sender_full_name": "Ramshreyas Rao",
        "timestamp": 1593280464
    },
    {
        "content": "<p>McCullagh. 2, 3, 4, 8, 10. Defining the concepts in terms of category theory sounds interesting.</p>\n<p>Morse. The abstract is not clear for me, so no input on that paper.</p>\n<p>Simpson. 2, 3, 5. Presenting probability-theoretic notions in categorical fashions seems interesting.</p>\n<p>Patterson. 2, 3, 7, 10. I am particularly interested in language-indepentent program representations and enriching those representations using ontologies.</p>\n<p>Perrone. 1. The abstract is quite technical that I'm not able to parse, so no summary.</p>\n<p>Fritz. 1, 3, 10, 11. Similarly to Simpson, presentation of probability in categorical terms sounds interesting.</p>\n<p>Top papers: (1) Patterson, (2) Fritz.</p>",
        "id": 202197393,
        "sender_full_name": "Andrew Shulaev",
        "timestamp": 1593280496
    },
    {
        "content": "<p>For me, hard to identify specific points for focus or by relevance without at least skim reading the papers, partly because the points are interlinked.</p>\n<p>I last officially studied statistics some years ago, but was never entirely convinced by the way it was presented, which is why I'm here.</p>\n<p>My two papers would be (1) Patterson and (2) Perrone.</p>",
        "id": 202197410,
        "sender_full_name": "Robin Taylor (he/him)",
        "timestamp": 1593280538
    },
    {
        "content": "<p>I'm posting this for a friend (I'll try to send him an invite if I have the possibility to do that):</p>\n<ol>\n<li>Perrone</li>\n<li>Fritz</li>\n</ol>",
        "id": 202197484,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1593280638
    },
    {
        "content": "<p>McCullagh 4. 8.<br>\nAs a wannabe data scientist, I would like to learn how to use the categorical language (which I found pretty natural) to make my work as precise as possible.</p>\n<p>Morse &amp; Stacksteder 9. 10.<br>\nEquivalence notions are useful in general</p>\n<p>Simpson 4. 5.<br>\nGiry monad is used to define categorically Bayesian Networks, which are used in the field of Algorithmic Fairness to quantify bias</p>\n<p>Patterson 2.<br>\nSee McCullagh</p>\n<p>Perrone 4. 5.<br>\nI'd like to learn something about monads</p>\n<p>Fritz 1. 4. <br>\nConditional independence is central in the inference of causal structures</p>\n<p>(1) Simpson (2) Fritz</p>",
        "id": 202197499,
        "sender_full_name": "Simone Fabbrizzi",
        "timestamp": 1593280673
    },
    {
        "content": "<p>McCullagh: 2. 3. 4. 5. 6. 7. 10.<br>\nStatistics feels like a messy collection of practical recipes to me. Something conceptual like this might help me understand it better.</p>\n<p>Morse/Sacksteder:<br>\nFrom the abstract I have no idea what this paper is about.</p>\n<p>Simpson: 1.-5.<br>\nSounds great, but I would rather just read it alone.</p>\n<p>Patterson: 1.-5., 7.-11.<br>\nThis sounds _awesome_!! The zoo of examples is great, the connection to software is great - it seems to be something that might make sense to the Machine Learning people in my department. Also great that we have the author with us.</p>\n<p>Perrone:<br>\nAgain, I am not sure what this is about.</p>\n<p>Fritz: 1.-13.<br>\nI like the flexibility of this abstract approach. That makes it good to play with, and I already have an example I want to study (related to semantics of propositional logics)</p>\n<p>Top papers:<br>\n(1) McCullagh (2) Patterson</p>",
        "id": 202197500,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1593280674
    },
    {
        "content": "<p>pmarriot says: </p>\n<ol>\n<li>McCullagh</li>\n<li>Fritz</li>\n</ol>",
        "id": 202197542,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1593280690
    },
    {
        "content": "<p>McCullagh 3 5 11<br>\nI am interested in how this relates to Bayesian Decision Theory, and<br>\nhow it motivates priors.</p>\n<p>Morse<br>\nI don't understand the motivation for the definitions.</p>\n<p>Simpson 1 4 5<br>\nThis seems pretty essential to understanding probability in general.</p>\n<p>Patterson 2 3 5 11<br>\nThis is not related to my work but it seems cool.</p>\n<p>Perrone 1 4 5<br>\nThe first couple chapters seem important but I don't know the<br>\nterminology to discern what the later chapters are about.</p>\n<p>Fritz 1 3 4 5 6 10 11<br>\nI would like to know more about Markov stuff and conditioning.</p>\n<p>Top papers: (1) Simpson (2) Fritz</p>",
        "id": 202197545,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1593280695
    },
    {
        "content": "<p>For me:<br>\nMcCullagh: 4, 5, 10, 12<br>\nMorse: 3, 9, 11<br>\nSimpson: 1, 3, 4<br>\nPatterson: 2, 7, 9, 10<br>\nPerrone: 2, 5, 11, 16<br>\nFritz: 1, 7, 11<br>\ntop choices to start with: (1) McCullagh, (2) Perrone</p>",
        "id": 202197558,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1593280730
    },
    {
        "content": "<p>McCullagh - What is a Statistical Model?<br>\n    2, 3, 9,10,11, 4, 5<br>\n    A categorical definition of a statistical model seems like an good first step in studying categorical statistics</p>\n<p>Morse<br>\n    3, 12, 1<br>\n    Sounds like flow models in unsupervised learning: <a href=\"https://www.youtube.com/watch?v=JBb5sSC0JoY&amp;list=PLwRJQ4m4UJjPiJP3691u-qWwPGVKzSlNP&amp;index=3\">https://www.youtube.com/watch?v=JBb5sSC0JoY&amp;list=PLwRJQ4m4UJjPiJP3691u-qWwPGVKzSlNP&amp;index=3</a></p>\n<p>Simpson<br>\n    1,2,3<br>\n    Sheaves are cool. </p>\n<p>Patterson<br>\n    1,2,3,5,7,10,11<br>\n    I'm curious how this relates to McCullagh's definition of a statistical model. I'm interested in the ontology.</p>\n<p>Perrone<br>\n    I don't understand most of these points, so can't mark the most interesting points to me.</p>\n<p>Fritz<br>\n    1, 7, 13<br>\n    I'm interested in Markov Decision Processes, I'd like to use a categorical perspective. I am more familiar with probability than statistics.</p>\n<p>Top Papers: (1) McCullagh, (2) Fritz</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"JBb5sSC0JoY\" href=\"https://www.youtube.com/watch?v=JBb5sSC0JoY&amp;list=PLwRJQ4m4UJjPiJP3691u-qWwPGVKzSlNP&amp;index=3\"><img src=\"https://i.ytimg.com/vi/JBb5sSC0JoY/default.jpg\"></a></div>",
        "id": 202197580,
        "sender_full_name": "Michael Fishman",
        "timestamp": 1593280768
    },
    {
        "content": "<p>Patterson   The Algebra &amp; Machine Representation of Statistical Models<br>\n        4, 6, 8, 9, 10, 11<br>\nFritz       A synthetic approach to Markov Kernels,<br>\n        conditional independence and theorems on sufficient statistics<br>\n        9-13</p>",
        "id": 202197587,
        "sender_full_name": "win cuthbert",
        "timestamp": 1593280784
    },
    {
        "content": "<p>If I counted correctly, <br>\nPeople's first/second/sum choices:<br>\nMcCullagh 7/0/7<br>\nMorse 2/2/4<br>\nSimpson 3/0/3<br>\nPatterson 3/3/6<br>\nPerrone 1/3/4<br>\nFritz 0/7/7</p>",
        "id": 202198866,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1593282560
    },
    {
        "content": "<p>i've read evan's thesis, and intend to read both perrone &amp; fritz, simpson, and mccullagh.</p>",
        "id": 202199012,
        "sender_full_name": "eric brunner",
        "timestamp": 1593282749
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296639\">Arthur Parzygnat</span> <a href=\"#narrow/stream/232160-learning.3A-reading.20groups/topic/Statistics.20reading.20group.E2.80.93.E2.80.93'Housekeeping'/near/202198866\">said</a>:</p>\n<blockquote>\n<p>If I counted correctly, <br>\nPeople's first/second/sum choices:<br>\nMcCullagh 7/0/7<br>\nMorse 2/2/4<br>\nSimpson 3/0/3<br>\nPatterson 3/3/6<br>\nPerrone 1/3/4<br>\nFritz 0/7/7</p>\n</blockquote>\n<p>Thanks!</p>",
        "id": 202199823,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1593283964
    },
    {
        "content": "<p>Thanks everybody for your feedback! I look forward to reading with you all and learning from each other.</p>",
        "id": 202200005,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1593284223
    },
    {
        "content": "<p>Also, if anybody has additional papers that are not on the list here:<br>\n<a href=\"https://wiki.functorialwiki.org/act/show/Statistics+reading+group\">https://wiki.functorialwiki.org/act/show/Statistics+reading+group</a></p>\n<p>Please post your suggestions! I want this list to be an easy go-to a resource for people looking to get into categorical statistics and probability, so the more papers the better.</p>",
        "id": 202203553,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1593289506
    }
]