[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> , <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> , <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span> , <span class=\"user-mention\" data-user-id=\"308584\">@Jacques Distler</span>  @ Everybody</p>\n<p>Here we go:   <a href=\"https://functorialwiki.org\">https://functorialwiki.org</a></p>\n<p>Open for business.   </p>\n<p>All are welcome.</p>",
        "id": 200807037,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592124281
    },
    {
        "content": "<p>What I owe you next is a tutorial on how to \"kick the tires around\" with the wiki software, which is Instiki.   We are fortunate to be in the company of <span class=\"user-mention\" data-user-id=\"308584\">@Jacques Distler</span> , who is the active maintainer of Instiki.   Notably, he has enhanced Instiki to support TIKZ.    You will see this on the demo pages of the new wiki.</p>",
        "id": 200808764,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592127817
    },
    {
        "content": "<p>As you will see, I created it as a \"multiweb\" site, with each web providing a different subcontext.</p>",
        "id": 200808829,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592127939
    },
    {
        "content": "<p>After browsing around, your first assignment is to go to the Notebook web, and start fiddling around.</p>",
        "id": 200808883,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592127984
    },
    {
        "content": "<p>Start by editing the Sandbox.   Put some text in it, save it, and see what the results looks like.</p>",
        "id": 200808963,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128122
    },
    {
        "content": "<p>Next, start looking at how various pages on the ACT web are written.   Pick a page, scroll to the bottom, and press the Edit button to see the source.   Then just cancel out.</p>",
        "id": 200809025,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128209
    },
    {
        "content": "<p>Take snippets from pages, and add them to the Sandbox.</p>",
        "id": 200809036,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128244
    },
    {
        "content": "<p>See this page on the <a href=\"https://wiki.functorialwiki.org/act/show/Nine+lemma\">Nine lemma</a> for an example of using TikZ-CD.</p>",
        "id": 200809106,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128374
    },
    {
        "content": "<p>Next, you can help out by contributing to the Reading lists page on the main ACT web.   This is a blank slate at the moment.   Here is the stub that I wrote for the master <a href=\"https://wiki.functorialwiki.org/act/show/Reading+lists\">Reading lists</a> page.   This page is intended to be an index, with one link for each specialized reading list.   Right now, as you can see, I added a single line, for a Petri net reading list page.</p>",
        "id": 200809253,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128653
    },
    {
        "content": "<p>To begin with, you can add lines for any ideas about other reading lists of interest.   Once we have enough of them, they can be grouped under headings.</p>",
        "id": 200809312,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128746
    },
    {
        "content": "<p>Notice that I didn't even create the page for the Petri net reading list page!   This is indicated by the question mark next to the link on the master reading lists page.   Click on that question mark to open a form that will create the page (when you save it).  Be bold!</p>",
        "id": 200809394,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592128879
    },
    {
        "content": "<p>The most developed reference material that I have put together is under the <a href=\"https://wiki.functorialwiki.org/act/show/Courses\">Courses</a> page.</p>",
        "id": 200809464,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592129029
    },
    {
        "content": "<p>There is a lot of open-ended work to be done under <a href=\"https://wiki.functorialwiki.org/act/show/Conferences+and+seminars\">Conferences and seminars</a>.</p>",
        "id": 200809565,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592129178
    },
    {
        "content": "<p>Notice that there I only started on the page for the 2019 AMS conference.  My vision for this is a nicely formatted page, with titles, abstracts and links to the talk slides.   Help needed here!</p>",
        "id": 200809750,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592129493
    },
    {
        "content": "<p>A note on creating pages.   For the sake of wiki coherence, the preferred mode of creating a page is to first link to it on some other page that needs it, and then press the question mark on the link, to get the page actually created.   This minimizes the number of  pages which are unreachable from the home page of a web.   If there's no natural place to make a link to your new page, you can always create a link in the Sandbox, and then click through it to create the page.</p>",
        "id": 200810199,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592130265
    },
    {
        "content": "<p>So, if I wanted to create a page on Marine ecology, I would add the wikilink text [[Marine ecology]] somewhere.    If nothing else, you can save this link to the Sandbox, and click through it there.</p>",
        "id": 200810283,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592130393
    },
    {
        "content": "<p>There is a shortcut, however, which works in some cases.   Begin by searching for \"Marine ecology.\"    That will show you if there is already similar material - which might make you reconsider your decision as to whether to create the page after all.    If no sufficiently similar pages are found, then at the bottom of the search results you will see a link that allows you to create the page.   If that option does not show up, then you'll need to create the wikilink, in some other page.</p>",
        "id": 200810453,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592130690
    },
    {
        "content": "<p>Notice in the \"Blog\" web, I have started on a project to <a href=\"https://wiki.functorialwiki.org/blog/show/Blogs+to+review\">explore and inventory</a> blogs that are of interest to ACT.   This is open-ended, and could use all the editing help it can get.</p>",
        "id": 200810648,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592130999
    },
    {
        "content": "<p>!!!!!!!!!!!!!!!!!</p>",
        "id": 200810873,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592131445
    },
    {
        "content": "<p>Ok, if we're doing this for real, we'd better have somewhere to discuss it. Optimistically, something that is to this as the nForum is to the nLab</p>",
        "id": 200811618,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592132774
    },
    {
        "content": "<p>We could start with a stream here, and then decide where to go from there.    One possibility is the Azimuth Forum, which I am running on a server.   Or, I have a clean-slate Vanilla forum that we could use, on the same server.</p>",
        "id": 200811979,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592133446
    },
    {
        "content": "<p>I was going to suggest a stream here on Zulip</p>",
        "id": 200811984,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592133459
    },
    {
        "content": "<p>Yes, that was what I was thinking of, and is written on the homepage.</p>",
        "id": 200812033,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592133503
    },
    {
        "content": "<p>A downside of that is you need an invitation link just to read, whereas the nForum you can read without creating an account</p>",
        "id": 200812046,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592133550
    },
    {
        "content": "<p>Right now to get on here you need to magically know who the admins are, and then you need to manually contact one of us for an invitation link</p>",
        "id": 200812053,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592133578
    },
    {
        "content": "<p>I suggested dropping the invite system here <a href=\"#narrow/stream/229122-general.3A-meta/topic/going.20public/near/197530235\">https://categorytheory.zulipchat.com/#narrow/stream/229122-general.3A-meta/topic/going.20public/near/197530235</a> and consensus was against me</p>",
        "id": 200812173,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592133760
    },
    {
        "content": "<p>Well, one thing at a time.   Where will the stream best fit in the Zulip classification?</p>",
        "id": 200812256,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592133867
    },
    {
        "content": "<p>I'd suggest #practice: ACT wiki</p>",
        "id": 200812269,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592133903
    },
    {
        "content": "<p>I just did that, and it seems you did too.   However, it looks like I made a mistake by typing the # in the name.   (Sorry.)  Are you able to delete the one that I just created?</p>",
        "id": 200812770,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592134797
    },
    {
        "content": "<p>Signing off now, have been up all night :)</p>",
        "id": 200812828,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592134886
    },
    {
        "content": "<p>Yeah, I'll deal with it. I get time zone advantage here</p>",
        "id": 200812886,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1592134954
    },
    {
        "content": "<p>Thanks</p>",
        "id": 200813085,
        "sender_full_name": "David Tanzer",
        "timestamp": 1592135348
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span>, super impressive!</p>",
        "id": 200816747,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1592141428
    },
    {
        "content": "<p>I'll point out a couple of things of potential interest to people who either have or are planning to create websites of their own.</p>\n<ol>\n<li>Instiki's Tikz support is provided by a <a href=\"https://github.com/distler/tex2svg\">web service</a> which runs either standalone or in a Docker container. Send it a Tikz fragment, it returns an SVG document suitable for sticking in a web page. As such, it might be useful to anyone building a dynamically-generated website.</li>\n<li>Instiki's least-publicized feature is that it also provides an <a href=\"https://golem.ph.utexas.edu/wiki/instiki/show/itex+Endpoint\">itex web service</a>. Send it an <a href=\"https://golem.ph.utexas.edu/~distler/blog/itex2MMLcommands.html\">itex</a> fragment and it returns a MathML document suitable for sticking in a web page.</li>\n</ol>",
        "id": 200829526,
        "sender_full_name": "Jacques Distler",
        "timestamp": 1592162243
    },
    {
        "content": "<p>Great! Just a question: for 'technical' pages (idk, monoidal category, topos, monad, etc) what's the expected content? In other words, will those pages be like their nlab sisters with a side of ACT remarks, or...?</p>",
        "id": 201948167,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1593077396
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"275932\">@Matteo Capucci</span>, there's no defined expectation at this point -- though there has been some preliminary discussion about this on the stream <a class=\"stream\" data-stream-id=\"243548\" href=\"/#narrow/stream/243548-practice.3A-ACT-wiki\">#practice: ACT wiki</a>.    My feeling is that at this early stage it's more important to let people write in a style that is comfortable for them, and get some content to work with, rather than being prescriptive.   That said, if one bears in mind that we are working in an applied context, which is to include practitioners in application domains, that a wholly different tone than the nLab would naturally come into play.</p>",
        "id": 202042772,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593132940
    },
    {
        "content": "<p>There, I gave my vision of how the tone could be on the wiki.   But it's all up for discussion.</p>\n<blockquote>\n<p>For a paradigmatic example, natural transformations and monads deserve to be presented to aspiring functional programmers.    This will fall naturally into  a theory section of the wiki.    But it's clear how different the article on monads here could be than the nLab version, which strives for maximal generality, abstraction and mathematical completeness.   Here the goal is to present enough theory - in a pedagogical style, with good examples, and possibly review sections - to give a theoretical orientation that will help people to \"get the job done.\"</p>\n</blockquote>",
        "id": 202043143,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593133499
    },
    {
        "content": "<p>But if one wanted to write an article that was more general in tone, along with application notes, then why not.   If anything turned out to be worthy of the nLab, we can encourage the author to cross post.   It's still a different context.</p>",
        "id": 202044430,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593135300
    }
]