[
    {
        "content": "<p><strong>Why don't we start discussing what do we have to do to coordinate and apply for a massive grant to make this happen?</strong></p>",
        "id": 194329872,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1587053865
    },
    {
        "content": "<p>Think about it. There's plenty of people here from all sorts of academic institutions. Some of them are even in a position where their influence matters. There's ppl working in business. There are programmers. Virtually, we have what we need to make our voice heard, at least.</p>",
        "id": 194330025,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1587053918
    },
    {
        "content": "<p>So let's stop talking about how the system \"should look\", and let's start talking about \"how do we get the money to start working on it seriously\"</p>",
        "id": 194330095,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1587053947
    },
    {
        "content": "<p>That's my proposal :D</p>",
        "id": 194330113,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1587053953
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Funding.20the.20revolution/near/194330095\" title=\"#narrow/stream/233322-practice.3A-communication/topic/Funding.20the.20revolution/near/194330095\">said</a>:</p>\n<blockquote>\n<p>So let's stop talking about how the system \"should look\", and let's start talking about \"how do we get the money to start working on it seriously\"</p>\n</blockquote>\n<p>Morgan and I have convergent ideas about how the system \"should look\", which I've observed earlier on, so that's already settled. In terms of how to get the money to start working on it, I think something along the lines of an expansion of Bob's program in QNLP to try to extract some insights from recent work in NLP is a first step.</p>",
        "id": 194331904,
        "sender_full_name": "(=_=)",
        "timestamp": 1587054657
    },
    {
        "content": "<p>It might seem a bit more idealistic, but on the graphical side, I've often thought that a similar system could be useful for graphically representing a large code base; is there a way we could talk a large software company like Epic (I mention them only because I have a friend who works there) into investing resources into a non-proprietary framework if it were a joint project with other funding sources?</p>",
        "id": 194332805,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1587055066
    }
]