[
    {
        "content": "<p>Caregory Theory is fairly heterodox in my fields of interest (statistics, probability and applied math). Still, I want to include judiciously selected uses of Category Theory in my work.</p>\n<p>I have two questions:</p>\n<p>(1) Does anyone have advice on how to get published in a reputable journal in these fields without sacrificing my research interests to 'marketability'?</p>\n<p>(2) I am a beginning grad student at a CUNY school. I don't have any real  mentorship and I am still unsure of how to gain a grasp of the largely unofficial editorial standards that dictate what gets published. Additionally, the journal articals I have read almost never provide insignt into the larger conversation (in contrast with, say, psychology or social science literature, where every introduction triangulates a few open problems). Maybe there are better sources I should br reading? Does anyone have advice on how to figure out what is considered \"good\" publishable work in stats and applied mathematics? And more generally how to develop a feel for open problems? (Not the big problems listed on Wikipedia, but the smaller more soluable ones)</p>",
        "id": 199032817,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590677548
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Getting.20Published/near/199032817\">said</a>:</p>\n<blockquote>\n<p>Category Theory is fairly heterodox in my fields of interest (statistics, probability and applied math). Still, I want to include judiciously selected uses of Category Theory in my work.</p>\n<p>I have two questions:</p>\n<p>(1) Does anyone have advice on how to get published in a reputable journal in these fields without sacrificing my research interests to 'marketability'?</p>\n</blockquote>\n<p>If you're trying to publish in statistics or probability while using category theory, you should talk to <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span>, a statistics grad student at Stanford who is facing exactly this situation.  Also you should read his <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Probability.20and.20Statistics\">thesis</a>.</p>\n<blockquote>\n<p>(2) I am a beginning grad student at a CUNY school. I don't have any real  mentorship....</p>\n</blockquote>\n<p>You need to fix that right away.  You can't succeed in this game without having a mentor - or better, multiple mentors, like one in category theory and one in probability or statistics.</p>\n<blockquote>\n<p>I am still unsure of how to gain a grasp of the largely unofficial editorial standards that dictate what gets published.</p>\n</blockquote>\n<p>Talk to people and skim lots of journal articles to get a sense of which journals publish which kinds of things.   Different journals are different so there is no quick explanation of how they all work.   </p>\n<p>Never start writing paper unless you have some idea of where you want to publish it - because that decision affects everything about how you'll write the paper.    </p>\n<p>Never try to publish a paper in a journal until you've looked at dozens of papers in that journal and feel you understand what they're like.  Don't expect them to ever accept a paper that's radically different in content, format, style, etc.</p>\n<blockquote>\n<p>Additionally, the journal articles I have read almost never provide insignt into the larger conversation (in contrast with, say, psychology or social science literature, where every introduction triangulates a few open problems.</p>\n</blockquote>\n<p>What kind of articles are you reading?  Category theory?  Probability?  Statistics?  People in all these subjects <em>do</em> like to talk about big ideas and the philosophy of the field.  At least the good people do.</p>\n<blockquote>\n<p>Maybe there are better sources I should be reading? </p>\n</blockquote>\n<p>When you're getting started on anything, books are much better than journals.  Books lay out a systematic worldview - if they're any good.  Articles often contribute small incremental results that only make sense if you have the worldview. </p>\n<p>Books, books, books - read lots of books!</p>\n<p>Also, you need to know how to read journal articles.  The most important parts of an article are the abstract, the introduction and the references.   You read the introduction, it'll often say something like \"Isbell duality [9] was generalized to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∞</mi></mrow><annotation encoding=\"application/x-tex\">\\infty</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord\">∞</span></span></span></span>-categories by Goudschmidt [3].\"   If your reaction is \"huh?\", then you have to read [9] and [3].    That's what those references are there for.   You don't read a single paper: you read <em>the literature</em>.  You dig back down into the literature until you reach stuff you understand; then you work your way up.</p>\n<p>Often I just go straight to the bibliography of a paper to see what easier papers I should be reading.</p>\n<blockquote>\n<p>Does anyone have advice on how to figure out what is considered \"good\" publishable work in stats and applied mathematics? </p>\n</blockquote>\n<p>Talk to experts who actually earn their living publishing papers in those fields - I don't.   This is one reason you need mentors.  </p>\n<p>Skim lots of papers in those fields to get a sense for what gets published in different journals, ranging from midline journals to \"prestigious\" ones.</p>\n<blockquote>\n<p>And more generally how to develop a feel for open problems? </p>\n</blockquote>\n<p>This is why people have thesis advisors.  </p>\n<p>Also, listen to lots of talks.   This is one reason people go to conferences and seminars - to find out what are the  open problems.    A lot of conferences and seminars are online now, so you're in luck.   Go to <a href=\"https://researchseminars.org/\">https://researchseminars.org/</a> and choose the topic \"statistics theory\".    I see <em>lots</em> of talks on probability and statistics, including an \"online open probability school\" starting next week, with talks about open problems on branching random walks.</p>\n<p>Good luck!</p>",
        "id": 199056290,
        "sender_full_name": "John Baez",
        "timestamp": 1590688012
    },
    {
        "content": "<blockquote>\n<p>If you're trying to publish in statistics or probability while using category theory, you should talk to @Evan Patterson, a statistics grad student at Stanford who is facing exactly this situation. Also you should read his thesis.</p>\n</blockquote>\n<p>We already spoke briefly about a month ago and I've already started reading his thesis. I intend to get back in touch once I've read a bit more. I'll have to ask him about the publishing issue. </p>\n<blockquote>\n<p>(2) I am a beginning grad student at a CUNY school. I don't have any real mentorship....</p>\n<p>You need to fix that right away. You can't succeed in this game without having a mentor - or better, multiple mentors, like one in category theory and one in probability or statistics.</p>\n</blockquote>\n<p>Yes. I'm open to suggestions on how to build these kinds of relationships remotely––as that is the only option right now. I may have been too shy about seeking mentorship outside of my own college. At Hunter College, the ratio of tenured / tenure track professors (potential mentors) to adjuncts is quickly reaching that of the Rational to the Irrational Numbers. That is to say, it's very irrational these days!</p>\n<blockquote>\n<p>Never start writing paper unless you have some idea of where you want to publish it - because that decision affects everything about how you'll write the paper.</p>\n</blockquote>\n<p>Very good advice! Though from where I stand, it's general enough to be of the same ilk as 'buy low and sell high.' I will do more research on how to implement this advice.</p>\n<blockquote>\n<p>What kind of articles are you reading? Category theory? Probability? Statistics? People in all these subjects do like to talk about big ideas and the philosophy of the field. At least the good people do.</p>\n</blockquote>\n<p>Clearly I am revealing my lack of experience here. Maybe I am just not knowledgable enough yet to pick up on the clues to the <em>accessible</em> yet still open problems (as opposed to the big philosophical ideas––which are highlighted with neon flashing lights in CT, as you've mentioned). Perhaps this will change with more experience.</p>\n<p>Thank you for your extensive response <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> . I appreciate you taking the time to address my questions!</p>",
        "id": 199103106,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590713442
    },
    {
        "content": "<blockquote>\n<p>I'm open to suggestions on how to build these kinds of relationships remotely––as that is the only option right now. </p>\n</blockquote>\n<p>Yes, that makes it much tougher.   Have you been taking classes?   Anyone you take a class from is a potential mentor.  The available options may not be ideal, but asking people questions is usually better than not.</p>\n<p>You can also watch a bunch of talks by some mathematician or statistician you like, read some of their papers, then email them and ask them questions.  Or ask questions at their online talks!   </p>\n<p>Questions from someone who has taken the trouble to read one's work are often treated favorably.</p>\n<blockquote>\n<blockquote>\n<p>Never start writing paper unless you have some idea of where you want to publish it - because that decision affects everything about how you'll write the paper.</p>\n</blockquote>\n<p>Very good advice! Though from where I stand, it's general enough to be of the same ilk as 'buy low and sell high.' I will do more research on how to implement this advice.</p>\n</blockquote>\n<p>Well, if you're wanting to write papers in probability, you should get to know all the main probability theory journals.   Read papers in those journals, and get a sense for what kinds of papers they accept.   Same for any other subject.   Then, when you start writing a paper, have in mind which journal you're going to submit it to, and write in the style of the papers in those journals as much as possible.</p>\n<p>For example when I publish in <em>TAC</em> I'd never stoop to defining a lax monoidal functor, because in that journal it's assumed everyone knows what that is, and if I <em>did</em> define it people would instantly be suspicious that I was an outsider.    I might however define the Heisenberg algebra, since that's a concept in mathematical physics. </p>\n<p>But if I published about the same topic in a journal of mathematical physics, it would work the other way around.</p>\n<p>This is one of many rules of thumb, that you will acquire by reading papers in different journals and paying attention.  I don't think anyone has ever bothered to list them all.  </p>\n<blockquote>\n<blockquote>\n<p>What kind of articles are you reading? Category theory? Probability? Statistics? People in all these subjects do like to talk about big ideas and the philosophy of the field. At least the good people do.</p>\n</blockquote>\n</blockquote>\n<p>You didn't answer my question, by the way.</p>\n<blockquote>\n<p>Clearly I am revealing my lack of experience here. Maybe I am just not knowledgeable enough yet to pick up on the clues to the <em>accessible</em> yet still open problems (as opposed to the big philosophical ideas––which are highlighted with neon flashing lights in CT, as you've mentioned). Perhaps this will change with more experience.</p>\n</blockquote>\n<p>Oh, I didn't quite get that you were talking about how to find open problems to work on.    People usually hint at open problems in the conclusions of their papers.  But to find open problems it's much better to attend talks.   People tend to talk about what they're trying to do and haven't quite done, etc.   You can even ask questions like \"what are some open problems in this area?\"   And while you are in a very bad time for meeting people in person, you are living in the golden age of <a href=\"https://researchseminars.org/\">online talks</a>.   </p>\n<p>I guess if I were in your situation I'd make sure to attend at least one talk a day (during weekdays), and ask a question at each one!  </p>\n<p>The <a href=\"http://math.ucr.edu/home/baez/ACT@UCR/\">ACT@UCR seminar talks</a> are brimming with open problems, though maybe it takes some skill to see them.  You can also ask the speakers questions right here.  One of the speakers, Tai-Danae Bradley, just got her degree from the CUNY graduate school.  She might be able to offer some advice.</p>",
        "id": 199104002,
        "sender_full_name": "John Baez",
        "timestamp": 1590714486
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Getting.20Published/near/199056290\">said</a>:</p>\n<blockquote>\n<p>Never start writing a paper unless you have some idea of where you want to publish it - because that decision affects everything about how you'll write the paper.</p>\n</blockquote>\n<p>I've heard lots of people say this.  But I have never listened, and somehow I've managed to publish a few papers anyway. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>\n<p>For me, writing a paper is part of the process by which I understand and solve a problem.  Often I get halfway through writing a paper -- or even all the way through -- before realizing that I actually want to write a different paper.  Only after the paper is finished do I have a global feel for the story that it's actually telling; so only then do I feel I can really think about where would be a good place to try to publish it.  Of course, sometimes I have to modify the paper somewhat to make it more publishable in a particular venue, but I feel that it works best for me to first write the paper the way it wants to be, and only then think about whether it should pretend to be something a bit different for publicity's sake.</p>",
        "id": 199106135,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1590717214
    },
    {
        "content": "<blockquote>\n<p>Yes, that makes it much tougher. Have you been taking classes? Anyone you take a class from is a potential mentor. The available options may not be ideal, but asking people questions is usually better than not.</p>\n</blockquote>\n<p>I'm taking Analysis and Advanced Probability during the first summer session right now. </p>\n<blockquote>\n<p>You didn't answer my question, by the way.</p>\n</blockquote>\n<p>I've been looking through articles from the four journals published by the Institute of Mathematical Statistics (applied and pure probability and statistics). Still trying to get a feel for the terrain. I'm not sure if I made this clear, but I'm currently a Masters student, and I didn't get a math degree as an undergrad. I'm planning to pursue a Ph.D. elsewhere after finishing this degree. </p>\n<blockquote>\n<p>But to find open problems it's much better to attend talks.</p>\n</blockquote>\n<p>This is not something I would have assumed. Thank you for telling me.</p>\n<blockquote>\n<p>I guess if I were in your situation I'd make sure to attend at least one talk a day (during weekdays), and ask a question at each one!</p>\n</blockquote>\n<p>Oh boy, I wish I had time to do that right now! Though there's never enough time. Between classes and my Category Theory reading groups, I'm pushing my limit. But there will never be `enough time.' You've inspired me to commit to attending at least one talk per week––which is better than nothing.</p>",
        "id": 199106890,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590718013
    },
    {
        "content": "<blockquote>\n<p>For me, writing a paper is part of the process by which I understand and solve a problem. Often I get halfway through writing a paper -- or even all the way through -- before realizing that I actually want to write a different paper. Only after the paper is finished do I have a global feel for the story that it's actually telling; so only then do I feel I can really think about where would be a good place to try to publish it...</p>\n</blockquote>\n<p>That's fair. I suppose one limiting factor for me is that I may not be competent to solve an interesting problem yet!</p>",
        "id": 199107208,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590718429
    },
    {
        "content": "<p>Hi Oliver, I'd be happy to advise, as best I can, about ideas related to CT + stats, but maybe some more general thoughts would also be helpful. First, it sounds like you're just starting your graduate education. I would not stress out too much right now about knowing exactly what you want to research and where to publish it. When I started my PhD in Stats, I didn't have the faintest idea what I wanted to do within the field (and at least in the US, this seems fairly common). I also didn't know the first thing about category theory. Focus on your classes and follow John's advice to seek out mentors, who can help you find a topic to start on. This doesn't have to be the topic that will define your research career!</p>\n<p>You mentioned that you were looking at the top journals of the IMS (Ann. Prob., Ann. Stat., etc). I am pretty sure that the only paper with the word \"functor\" in it ever published in Annals of Statistics is McCullagh's 2002 paper. I don't know how that happened but it probably didn't hurt that McCullagh was by then a famous statistician. (To be clear, that's not a criticism of the paper, but an observation that it is far outside what is typically published in that journal.) If your goal is to publish in Ann. Stat. or Ann. Prob., then realistically you'll have to adapt yourself and your research to what you see there. Of course, depending on your <em>real</em> goal, it may or may not matter whether you publish there. If your goal is to eventually get an academic job as a theoretical statistician, publishing in Annals of Statistics would be great for your career. If you have other goals, it will matter less or not at all. Ultimately, you'll have to decide what you value. But for now, I'd just focus on the first steps: taking classes, getting familiar with the fields you're interested in, and finding good mentors.</p>",
        "id": 199109118,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1590720889
    },
    {
        "content": "<blockquote>\n<p>Focus on your classes and follow John's advice to seek out mentors, who can help you find a topic to start on. This doesn't have to be the topic that will define your research career!</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span> , Yes, good advice. Getting As and building relationships are very important. Though it would be nice to publish some part or elaboration of my Masters' Thesis in a mid-ranked journal if possible <span aria-label=\"sunglasses\" class=\"emoji emoji-1f60e\" role=\"img\" title=\"sunglasses\">:sunglasses:</span></p>\n<blockquote>\n<p>If your goal is to publish in Ann. Stat. or Ann. Prob., then realistically you'll have to adapt yourself and your research to what you see there.</p>\n</blockquote>\n<p>That's fair. I'm reading those journals partly because I'm trying to get a feel for what the community as a whole cares about, and partly because I don't know which stats journals would be open to the limited use of CT (or just more generally open to the concept of new variates––such as linguistic variates). What are some of the journals that you pay the most attention to?</p>\n<blockquote>\n<p>Of course, depending on your real goal, it may or may not matter whether you publish there. If your goal is to eventually get an academic job as a theoretical statistician, publishing in Annals of Statistics would be great for your career. If you have other goals, it will matter less or not at all</p>\n</blockquote>\n<p>I'm curious what your goals are. What sort of career are you hoping to pursue now that you've finished your Ph.D.?</p>",
        "id": 199145617,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590754598
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Getting.20Published/near/199106890\">said</a>:</p>\n<blockquote>\n<p>I'm not sure if I made this clear, but I'm currently a Masters student, and I didn't get a math degree as an undergrad. I'm planning to pursue a Ph.D. elsewhere after finishing this degree.</p>\n</blockquote>\n<p>No, I didn't get that.  Sounds good.  There's a lot of math to learn; I started studying it intensively pretty early on and took four college courses in high school, but I still learned about 80% of the math I know after getting my PhD.   There's a lot to learn about the whole practice of math (or statistics, or whatever) before you can start cranking out papers.</p>\n<blockquote>\n<p>But to find open problems it's much better to attend talks.</p>\n<p>This is not something I would have assumed. Thank you for telling me.</p>\n</blockquote>\n<p>Oh good, I did something useful!  Yes, this is one main reason people go to talks and conferences: to learn what counts as the cutting edge, what's just been done, what's not been done yet and what people hope to do.   A lot of this happens in conversations after talks.  (You can see some of that here.)</p>\n<blockquote>\n<p>I guess if I were in your situation I'd make sure to attend at least one talk a day (during weekdays), and ask a question at each one!</p>\n<p>Oh boy, I wish I had time to do that right now! Though there's never enough time. Between classes and my Category Theory reading groups, I'm pushing my limit. But there will never be 'enough time.' You've inspired me to commit to attending at least one talk per week––which is better than nothing.</p>\n</blockquote>\n<p>Okay, as long as you're keeping yourself busy doing good stuff that's good.  But yes, you can pick out one talk a week from the nice menu at <a href=\"http://researchseminars.org\">researchseminars.org</a>.</p>",
        "id": 199198146,
        "sender_full_name": "John Baez",
        "timestamp": 1590779276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Getting.20Published/near/199106135\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Getting.20Published/near/199056290\">said</a>:</p>\n<blockquote>\n<p>Never start writing a paper unless you have some idea of where you want to publish it - because that decision affects everything about how you'll write the paper.</p>\n<p>I've heard lots of people say this.  But I have never listened, and somehow I've managed to publish a few papers anyway. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>\n</blockquote>\n<p>Good!  My problem may be a bit worse than yours since I usually have to decide whether a paper is going to be in a mathematical physics journal, a standard pure math journal, or <em>Theory and Applications of Categories</em> - and they are completely different in what they accept.  To add to my woes, I've started publishing in computer science journals, which I still haven't really figured out yet.  I feel I need to decide early on which way a paper is going.</p>\n</blockquote>",
        "id": 199198851,
        "sender_full_name": "John Baez",
        "timestamp": 1590779621
    },
    {
        "content": "<p>By the way, <span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span>, I know you said you were busy, but you should try to attend the <a href=\"#narrow/stream/238032-Categorical-Probability.20and.20Statistics.202020.20workshop/topic/Schedule/near/199211625\">Categorical Probability and Statistics</a> workshop next week!   If that's the area you want to work in, you should get to know these people.</p>",
        "id": 199229863,
        "sender_full_name": "John Baez",
        "timestamp": 1590800588
    },
    {
        "content": "<p>Yes, that one is already in my calendar!</p>",
        "id": 199229916,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590800655
    },
    {
        "content": "<p>I'm also planning to hand one of my reading groups to someone else and replace it with a seminar group on CT applied to statiatics and probability (we'll read papers like Evan's Thesis. I have a whole list compiled). More on that to come.</p>",
        "id": 199229944,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1590800730
    },
    {
        "content": "<p>Good!</p>",
        "id": 199229961,
        "sender_full_name": "John Baez",
        "timestamp": 1590800761
    }
]