[
    {
        "content": "<p>Lately I have been watching this video. <a href=\"https://www.youtube.com/watch?v=aFwVf5a3pZM\">https://www.youtube.com/watch?v=aFwVf5a3pZM</a> it's somewhat long, but a very enjoyable listening -with good ideas, delivered in an effective manner, by a pragmatic intelligence.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"aFwVf5a3pZM\" href=\"https://www.youtube.com/watch?v=aFwVf5a3pZM\"><img src=\"https://uploads.zulipusercontent.net/2c41bad1a0a526e19e2a8a31cb88bb2c74dceafb/68747470733a2f2f692e7974696d672e636f6d2f76692f6146775666356133705a4d2f64656661756c742e6a7067\"></a></div><p>I'd like to do two things now: outline what I think is the main content of it (to save time to those who don't have an hour to invest in listening) and ask to the community, are these advices good for a mathematician? Are they good for a category theorist?</p>\n<p>The main argument of the lecture is: you don't write to explain things, but instead to change how other people view those things. Readers lose you at page 1 because they don't see anything valuable in what you write, and then complain, reject your paper, reject your proposal. And then you're miserable!<br>\nInstead. Effective writing is \"valuable\", gives readers proof that some well-established belief was in fact a misconception, argues that something is invalid. It's organized and persuasive, but most of all it challenges readers' preconceptions. It complies to the implicit codes of the community it is directed to (and thus, interdisciplinary writing is near-to-impossible to achieve).</p>\n<p>Some of these remarks are banal; some of these are just common sense; some of these are cynical and surrender to the status-quo of academia (but, according to the lecturer's words, for the greater good of saving people's careers). </p>\n<p>I believe some do not apply at all to the practice of Mathematics, and even less to category theory. For example, just one example among many, a mathematician also writes to demonstrates that something is possible, because we not only display our opinions when we write, instead we form opinions about mathematical objects starting from some backup, some evidence. Giving evidence, and interpretation for that evidence, is unavoidable and precious even if the claim is \"yes, Fermat last theorem is true\" or \"this problem is indeed NP-hard as we expected\". These statements are the exact opposite of underlying a discontinuity, because Mathematics has a (relatively) objective way to measure what is valuable contribution, and discern it from what is instead \"creating new knowledge by counting the number of people in this room\". <br>\nI suspect this applies to other disciplines as well, so this is the part of his speech I find more difficult to buy.</p>\n<p>Anyway, I found this interesting and certainly a nice topic to engage my community with: we all struggle with having our work rejected/misunderstood/underappreciated. <br>\nMost of the times, of course, it's the referee's fault ;-) </p>\n<p>Jokes apart: </p>\n<ul>\n<li>what do you think of this video (if you feel you have enough time to watch it)?</li>\n<li>what are in your opinion the \"codes\" of our community?</li>\n<li>To what extent do <em>you</em> think this tips and tricks apply to writing mathematical text?</li>\n<li>Delivering your ideas effectively is a process doomed to fail, that we all keep learning forever. Advice from experienced people is always precious. How do <em>you</em> try to write good mathematics?</li>\n</ul>",
        "id": 432209988,
        "sender_full_name": "fosco",
        "timestamp": 1712662422
    },
    {
        "content": "<p>Another point that I found inspiring is move out from the scholarly attitude of \"showing off what you know\" opposed to \"here's a thing I noticed, hope it contributes to the general discourse in a fruitful way!\"<br>\nAgain, though, I don't feel this applies to mathematics, where a totally valuable piece of work is \"here's a building block that avoids my successors some hard work on a pesky problem\" or \"here's something Euler conjectured: too bad it's actually false\".</p>",
        "id": 432211441,
        "sender_full_name": "fosco",
        "timestamp": 1712662747
    },
    {
        "content": "<p>Something I'm starting to understand is that I must not write for myself but for other people. The issue is that writing is also very useful for myself so that I forget the ultimate goal. Writing for other people necessitate to explain things that I assume part of the background or that I find distracting when focusing on proving stuff. When I start to write I'm still doing the research although I think that I've thought enough about the topic so that everything will fall easily in place -- which is almost never verified. Because everything is still a bit uncertain, I don't want to lose time on explaining the background or writing a paragraph explaining why I choose this name for this concept that I introduce. What I'm already doing is that I write the introduction at the end. I assume this is standard practice? In this way, I don't lose time with the already known background while writing the body of the paper. Now, it seems that I still have to write more about the background and the motivations. I thought that mathematicians didn't like informal discussions but I've been asked specifically to provide more of them.</p>",
        "id": 432294064,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1712682198
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/near/432294064\">said</a>:</p>\n<blockquote>\n<p>What I'm already doing is that I write the introduction at the end. I assume this is standard practice?</p>\n</blockquote>\n<p>It is a common practice, and I've often heard this advice given.</p>\n<p>Funnily enough, I find that about half the time, I write the introduction last, but the other half of the time, I find that I have to write it first in order to orient myself on the agenda, even the \"ideology,\" of the paper.</p>",
        "id": 432297360,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1712683159
    },
    {
        "content": "<p>Sometimes I write it first and then rewrite it last.</p>",
        "id": 432297530,
        "sender_full_name": "John Baez",
        "timestamp": 1712683202
    },
    {
        "content": "<p>Like Evan, I often need to write an introduction that summarizes the paper before I can tell what the paper is about!  But this summary is not a summary of the final finished paper.</p>",
        "id": 432297749,
        "sender_full_name": "John Baez",
        "timestamp": 1712683264
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/near/432294064\">said</a>:</p>\n<blockquote>\n<p>Now, it seems that I still have to write more about the background and the motivations. I thought that mathematicians didn't like informal discussions but I've been asked specifically to provide more of them.</p>\n</blockquote>\n<p>I think it's easy to get this impression because often mathematicians often don't bother to state the background and motivations, assuming perhaps that the reader already has them in the mind, but in my experience nobody ever complains about a gentle introduction that explains what is going on and why in plain terms.</p>",
        "id": 432298610,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1712683519
    },
    {
        "content": "<p>There are some referees who complain about this... but there are referees who complain about almost everything!</p>",
        "id": 432299412,
        "sender_full_name": "John Baez",
        "timestamp": 1712683725
    },
    {
        "content": "<p>It's <em>definitely</em> important to explain background and motivation, especially if you want anyone to read your papers.  (Some people seem like they don't care about that.)</p>",
        "id": 432299604,
        "sender_full_name": "John Baez",
        "timestamp": 1712683785
    },
    {
        "content": "<p>I've seen this video and I really strongly recommend it. I've shared it with others as well.<br>\nIt's very insightful. Even if you don't agree - and like Fosco there are many things I disagree with in it - it's worth watching and forming your own opinion</p>\n<p>One thing I want to point out (not going to rewatch it right now so excuse errors/fabrications) is that at some point in the middle of the video he starts quoting some Marxist philosopher verbatim, maybe Laruelle? The quote is that the written word \"takes the form of value.\" This is an observation in a long line of Marxist sociology of value-form theory which is all about the dual nature of commodities as economic-material objects and as social objects (i.e., as bearers of value as a social relationship between people).</p>\n<p>So this line is essentially saying that words are going the same way as commodities, at some point in early economic history physical goods were understood solely in terms of their material benefit to people (the use-value of a TV is that I can watch the Simpsons on it) but we now think of them as \"having value\", there's a certain social power embodied in them (I can sell my TV and then use the money to pay people to do things.)</p>\n<p>I don't really mean to suggest that the speaker is a Marxist. If anything the video is a somewhat cynical embracing of Marxist theory - embacing the positive content in particular (words are like commodities) but not the normative content (this is oppressive and exploitative) - instead, as Fosco says, the advice is to adapt to the objective reality of capitalist society.</p>",
        "id": 432309584,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1712686450
    },
    {
        "content": "<p>Love the direction you're taking this <span class=\"user-mention\" data-user-id=\"424412\">@Patrick Nicodemus</span>. A few years ago I read Bernard Stiegler's <em>A New Critique of Political Economy</em>, a book that really expands on what you're getting at. Stiegler talks about writing itself being a tool for oppression, that the abstraction of the written word is what paves the way for the separation of the capitalist and working classes—this is in contrast with a more apprentice-based passing on of information, where productivity's teleology is for the flourishing of the producer, not in service of the accumulation of capital for the capitalist. It's a really fascinating perspective but is ultimately \"unproductive\" in today's reality, kind of like you and <span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> concluded.</p>",
        "id": 437695678,
        "sender_full_name": "dan pittman",
        "timestamp": 1715188638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"284213\">@dan pittman</span> </p>\n<p>Reading that \"writing is a tool for oppression\" made me wonder how it fits with (also Marxist) slogan: \"<a href=\"https://disqus.com/home/discussion/nature-3/sensing_with_tools_extends_somatosensory_processing_beyond_the_body/\">tools are extended body parts</a>\".</p>\n<p>I could be wrong, but is there anything that doesn't lend itself to be used as a tool for this or that (even good water will kill me, if I drink too much ;)</p>\n<p>Then there are poets (Peeps Or Endangered Things ;) hellbent on championing the cause of the destitute underserved subaltern: the word that was there since the very beginning, cursing prosaics like me for the inhumanity that is domesticating language (grammar, meaning, ... the whole shebang).  Being a Buddhist heavy on nonviolence (dictating not only visible acts, but also invisible thoughts and feelings), I went <a href=\"https://www.mercurius.one/home/artefacts-of-articulation\">verse</a> ;)</p>\n<p>Here's my take <a href=\"https://conceptualmathematics.wordpress.com/2022/08/30/on-writing-well/\">on writing</a>, where PROPER reigns supreme.  There is a proper way to say or write about whatever I am writing and it changes with the subject matter (which is not unlike: the way we think about things depends on the nature of things).</p>",
        "id": 484193369,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1732495986
    },
    {
        "content": "<p>Going back a bit, titles and introductions are probably the most important parts of any kind of writing, perhaps second only to the main point.  They have to do the heavy lifting of convincing the readers that their time is better spent reading what you wrote than not.  The main point can't make its impact if no one reads it!</p>\n<p>This makes interdisciplinary writing <em>hard</em> because you have to grab and keep the attention of people with different values and mindsets, but not impossible.  In CT we are used to the idea that different fields can be bridged with a common abstraction.  Perhaps this same philosophy, and/or a complementary philosophy of using a common \"concretion\", is what it takes to make a successful interdisciplinary paper?  I don't know the answer, but I balk hard at the idea that interdisciplinary writing is impossible.  After all, it is a rather one-dimensional person that is only interested in a single discipline to the exclusion of all others.</p>",
        "id": 495332127,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1737565834
    },
    {
        "content": "<p>To draw and keep attention, there is value in borrowing from well-established literary techniques; they're typically well-established because they work.  Furthermore, following tradition can make it easier for others (including future-you) to assimilate your ideas.  For example, the overall structure can take the form of tension rising to a climax with a clear denouement, while the details can use stylistic hooks like analogy, alliteration, repetition, parallelism, rhyme, meter, and repetition.  And one can think of the abstract of a paper as analogous to the literary technique of <em>in medias res</em>.  On the other hand, breaking from tradition creates an instant tension that can either make your writing more memorable or more miserable to read (or both).</p>",
        "id": 495332204,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1737565859
    },
    {
        "content": "<p>I'll end for now with an example of the importance of titles and intros: this thread has been on my to-read list for about nine months until I finally read it today.  The title, \"On how to write a paper\", makes it sound valuable to me (I want to read this!!), but the intro post being taller than my computer screen–and the way the \"message read\" features work in zulip–made me reluctant to get started (do I really want to read this?).</p>\n<p>For now, I've bookmarked the video.  I may or may not have more to say after I spend the time to watch it.</p>",
        "id": 495332447,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1737565929
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/On.20how.20to.20write.20a.20paper/near/495332127\">said</a>:</p>\n<blockquote>\n<p>Going back a bit, titles and introductions are probably the most important parts of any kind of writing, perhaps second only to the main point.</p>\n</blockquote>\n<p>Agreed!  I gave a bunch of math writing tips in my paper <a href=\"https://www.ams.org/journals/notices/202409/rnoti-p1175.pdf\">Why mathematics is boring</a>, and among other things I wrote:</p>\n<blockquote>\n<p>Of the people who see your math paper, 90% will read only the title. Of those who continue, 90% will read only the abstract. Of those who go still further, 90% will read only the introduction, and then quit. Thus, it pays to put a huge amount of energy into making the front end of your paper clear and enticing. This can reduce those 90% figures (which I made up) to about 80%, leading ultimately to an eightfold increase in the number of people who read beyond your paper’s introduction.</p>\n</blockquote>",
        "id": 495335629,
        "sender_full_name": "John Baez",
        "timestamp": 1737566922
    }
]