[
    {
        "content": "<p>I read plenty of papers so I have a rough idea how one should look like. I only read a few grant applications, so I have no idea how those are written. Can you point me to some examples?</p>",
        "id": 437785341,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1715242912
    },
    {
        "content": "<p>Nathanaël Fijalkow shares his experience on the process of becoming a CNRS researcher <a href=\"https://games-automata-play.com/blog/applying_cnrs/\">here</a>. In particular, he shares a <a href=\"http://games-automata-play.com/wp-content/uploads/2022/06/projet_recherche-1.pdf\">document</a> that I think looks close to a grant application (it is in French though).</p>",
        "id": 437792240,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1715247001
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 437797147,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1715249798
    },
    {
        "content": "<p>(btw, that must be the coolest academic website I've ever seen, right after <a href=\"https://www.kurims.kyoto-u.ac.jp/~motizuki/top-english.html\">Mochizuki</a>'s of course)</p>",
        "id": 437797265,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1715249877
    },
    {
        "content": "<p>Different grant agencies provide different guidance on what applications to <em>those agencies</em> must be like, e.g. specific sections the application must or should contain.  I've recently become familiar with that for the NSF, but if you're not applying to an NSF grant the rules will be different.   Maybe you're only asking about the agency-independent aspects, but there's a lot that's agency-dependent.</p>",
        "id": 437824706,
        "sender_full_name": "John Baez",
        "timestamp": 1715263402
    },
    {
        "content": "<p>I can share an NSF application with you, but you probably won't be applying to an NSF grant.</p>",
        "id": 437824894,
        "sender_full_name": "John Baez",
        "timestamp": 1715263469
    },
    {
        "content": "<p>I just asked a friend about this who sits on NSF grant reviews. He said government agencies must supply the information about the winning grants which show what the different agencies are looking for.</p>",
        "id": 437826155,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1715263957
    },
    {
        "content": "<p>Yes, there's a lot of such information easily available online from the NSF.   However there is also a lot of skill involved in writing a good grant application, so looking at examples is useful.</p>",
        "id": 437827526,
        "sender_full_name": "John Baez",
        "timestamp": 1715264455
    },
    {
        "content": "<p><a href=\"https://austinhenley.com/blog/500kgrant.html\">Here</a> is an example of a successful NSF application for a CAREER Award: a special 5-year grant that can only be applied for by an individual researcher in the first 6 years of their career.</p>",
        "id": 437827992,
        "sender_full_name": "John Baez",
        "timestamp": 1715264618
    },
    {
        "content": "<p>I would recommend asking whoever has the most information about the particular agency and grant you're applying for.  That might include people who have applied (hopefully successfully) to that agency and grant in the past, a \"program officer\" or equivalent at the agency who manages the grant or the general area, and whoever in the sponsored programs office at your institution knows the most about that agency and grant.</p>",
        "id": 437840131,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1715269031
    },
    {
        "content": "<p>I know basically everything there is to know about the grant and agency I'm applying to, what I'm looking for are examples of writing up a legit research proposal. It's hard to be technical about a proposal and at the same time not too much, speculative but not overpromising. I learn by imitation so having examples to read would be very helpful.</p>",
        "id": 437944588,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1715329611
    },
    {
        "content": "<p>You are probably not applying to the Australian Research Council, but I can tell you that is basically black magic, and it really helps to know someone who has been on the expert panel to let you know how it <em>really</em> works.</p>",
        "id": 437944820,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1715329721
    },
    {
        "content": "<p>The process is, apart from the tails, basically a lottery, but dressed up as being based on expert assessment and rankings.</p>",
        "id": 437944948,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1715329796
    },
    {
        "content": "<p>It depends a lot on the grant application. If you are looking for usual academic grants I've heard the process is very involved and kinda terrible. Horizon grants from the EU are even worse than that, the bureaucratic definition of hell. If you are looking for grants in the enterprise sector instead it can be very different. Many grants in my line of work are 1-pagers for instance. My personal record for writing a winning grant submitted to the Ethereum Foundation has been ~70 minutes from the time I first saw the questions on the form. This probably won't give you points for tenure but hey, it contributes to paying bills!</p>",
        "id": 438984103,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1715854185
    }
]