[
    {
        "content": "<p>Every so often I get asked to referee a paper for a journal that describes itself as \"general interest\", and in particular am asked to evaluate whether the paper is \"suitable for a general-interest journal\" or would \"only be of interest to specialists\".  I have no idea what this means.</p>\n<p>If I take the phrase literally, then it seems like a very high bar.  All fields of mathematics are so specialized that it seems very rare to me that a paper would actually be of interest to a completely arbitrary mathematician.  However, when I peruse the contents of recent issues of such journals (even very prestigious ones), I find approximately zero papers that are of interest to <em>me</em>, or that I even understand well enough to evaluate.  When I occasionally do run across a paper that I understand, I can rarely isolate any difference between it and papers published in more \"specialized\" journals.  So it seems that this high bar I would initially imagine is not the intended one.  But then what <em>does</em> the phrase mean?</p>",
        "id": 231747900,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616648112
    },
    {
        "content": "<p>My take is that it's a euphemism for \"topics at the centre of mathematics\", or with a longer history, like number theory and differential/algebraic geometry and analysis. Somehow everyone is supposed to care about these more.</p>\n<p>And the fact that Advances in Mathematics publishes relatively high amounts of category theory (compared to other high-tier \"general interest\" journals)  is only because Ross is on the editorial board there.</p>",
        "id": 231771408,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616665597
    },
    {
        "content": "<p>I think that David very synthetically described the whole phenomenon.</p>\n<p>While I agree that \"general interest\" is indeed not well defined, it is almost evident what they actually mean. Unfortunately, in order to make sense of my previous statement, I will have to dive in a quite boring discussion. Be patient.</p>\n<p>I encourage everyone to open scimago and give a look at the most impacted maths journal (<a href=\"https://www.scimagojr.com/journalrank.php?area=2600\">https://www.scimagojr.com/journalrank.php?area=2600</a>). Of coruse, one should polish a little bit the noise generated by applied mathematics, but once this is done, you remain with a selection of \"Tier A\" journals. Let me list a couple of names that you probably already know.</p>\n<ol>\n<li>Journal of the American Mathematical Society</li>\n<li>Annals of Mathematics</li>\n<li>Inventiones Mathematicae</li>\n<li>Acta Mathematica</li>\n<li>Duke Mathematical Journal</li>\n<li>Annales Scientifiques de l'Ecole Normale Superieure</li>\n<li>Compositio Mathematica</li>\n</ol>\n<p>These journals are by fare the most cited in pure mathematics, and somehow define trends and \"Fields-medal\" areas. One should not be so naive to think that these are journals. The scientific publishing policy of a journal is set by the scientific bias of its Editorial board. So, the next step of our analysis is to list all the editors of these journals. I will not include the list as it would be too long, but everybody that wants to have a good understanding of our community should spend some time doing this exercise.</p>\n<p>Ok, once you have this list, you are ready to define what they \"evidently\" mean by \"general interest\". That is, a paper that contains the same keywords of the papers written by the list of editors we just created.</p>\n<p>Now, of course this is an incredibly silly definition of \"general interest\", but it is very much practical and somehow also unavoidable. It is hard to me to stress enough on the word \"unavoidable\", very often in science our idealism does not allow us to understand that some phenomena are not choice-driven, they are just Nash equilibria of the system. In particular, players did not collectively decide to fall in this \"hole\". Each player was/is player his/her strategy. (This is an important remark to the general and cliché critique to capitalism as an economical system).</p>\n<p>Now, let me dedicate a couple of words about the importance of \"political statements\". In the previous discussion it is evident that to claim that something is of \"general interest\" is essentially either \"praise the winners\" or a political statement. </p>\n<p>Should we claim that a CT-paper deserves to be on Advances? As a fact, this is the practical problem that we encounter. Now, if one spends time studying the publications about CT on Advances, one finds very technical papers having no impact on \"general mathematics\", nor \"trendy mathematics. It is thus evident that some of us have decided to state (consciously or unconsciously) that CT should enter in the Heaven/Mafia/Protected circle of those fields that rule the subject.</p>\n<p>My very personal opinion is that we should push our best technical achievements that truly contains original and ambitious results for these journals, or papers that gather/link/connect different areas of mathematics in a truly new and original way. Notice that, as trivial as it may seems, the previous statement is saying that some technical papers whose motivations would be un-understandable to the \"TIER-A editors\" should not be accepted by Advances. This scales back the political statement that CT deserves to be trendy \"on the spot\" and instead invests on the long-term-strategy that high-quality product will eventually make the rest of CT easier to digest by the mathematical community.</p>\n<p>So, long story short, I personally support modest political statements against the above-stated definition of \"general interest\".</p>\n<p>The reason for which I do not like the strong political statement of accepting a too technical paper for a very prestigious journal is that we are trying to save ourselves, reproducing a very mafia-like approach, which we should softly fight. We should not try to join the french nobelty of the 18th century, we should softly, and slowly start an intellectual revolution that re-thinks trends in mathematics. Moreover, pushing for a \"bad paper\" on a \"good journal\" will just make our reputation worse on the long run. A fraud is a fraud.</p>",
        "id": 231785999,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1616672770
    },
    {
        "content": "<p>So \"general interest\" is whatever the generals of maths are interested in? <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span>  <span aria-label=\"military medal\" class=\"emoji emoji-1f396\" role=\"img\" title=\"military medal\">:military_medal:</span></p>",
        "id": 231802133,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1616679834
    },
    {
        "content": "<p>whatever the generic mathematician (0) is interested in</p>",
        "id": 231826968,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1616687624
    },
    {
        "content": "<p>Mike wrote:</p>\n<blockquote>\n<p>Every so often I get asked to referee a paper for a journal that describes itself as \"general interest\", and in particular am asked to evaluate whether the paper is \"suitable for a general-interest journal\" or would \"only be of interest to specialists\". I have no idea what this means.</p>\n</blockquote>\n<p>Ivan has given a detailed sociological analysis of this, but I think there's a pretty simple way to tell what's a general-interest journal.  </p>\n<p>Some journals have names of specific fields within mathematics in their title, like <em>Communications in Mathematical Physics</em>, <em>Communications in Algebra</em>, <em>Theory and Applications of Categories</em>, <em>Topology</em>.    These are not general-interest journals.</p>\n<p>Others don't, like <em>Transactions of the American Mathematical Society</em>, <em>Advances in Mathematics</em>, <em>Pacific Journal of Mathematics</em>, <em>Duke Mathematical Journal</em>.  These are general-interest journals.</p>",
        "id": 231837492,
        "sender_full_name": "John Baez",
        "timestamp": 1616691406
    },
    {
        "content": "<p>The sociology comes in when you try to figure out which papers actually get accepted by these general-interest journals.</p>",
        "id": 231837634,
        "sender_full_name": "John Baez",
        "timestamp": 1616691459
    },
    {
        "content": "<p>I recently got a paper rejected by <em>Transactions of the AMS</em> where one fairly positive referee said that the category theory wouldn't be understood by most readers so we should move the examples to the front, and another more negative referee said all the proofs seemed pretty straightforward.  (This was not at all true - it was one of the more difficult papers I've written, and after it was rejected we figured out a way to massively simplify the proofs using more abstraction.)</p>",
        "id": 231839358,
        "sender_full_name": "John Baez",
        "timestamp": 1616692012
    },
    {
        "content": "<p>I've published in <em>Transactions of the AMS</em> before, but I've never tried submitting a paper that involves category theory, and I wouldn't have done it except that one of my young coauthors needs to get papers published in \"good journals\" - e.g., not category theory journals.</p>",
        "id": 231839733,
        "sender_full_name": "John Baez",
        "timestamp": 1616692135
    },
    {
        "content": "<p>The discussion of what a general interest journal is and whether and when to try to publish in one is interesting, but at the moment I'm more interested in how to behave when I'm asked to referee for such a journal.</p>",
        "id": 231839969,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616692216
    },
    {
        "content": "<p>Also, \"general interest\" isn't the same as \"Tier A\".  I guess all the \"Tier A\" journals are general-interest, but there are also lower-prestige journals that don't have names of specific fields in their title and give instructions to referees of this sort.  I guess perhaps the general interest journals tend to be higher prestige than specialist ones (although I have a very low opinion of my ability to judge the prestige of a journal), perhaps because they have a much wider possible arena for submissions and so are forced to be more selective, but not all of them are Tier A.</p>",
        "id": 231840673,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616692466
    },
    {
        "content": "<p>I think one should just interpret the condition 'general interest' in terms of existential quantifiers, not universal quantifiers :-)</p>\n<p>One possible interpretation of 'general interest' is: 'of interest to people in more than one area of mathematics'.</p>\n<p>Another interpretation is: 'of interest also to some people who don't understand it'. For example, if the paper deals with a problem that can be formulated in non-technical terms, then potentially someone could be interested without understanding the technical details of the approach to the problem.</p>\n<p>A third experiment is to ask if a given paper would fit as a topic for a colloquium talk or not. Perhaps this is a very high bar for what should be considered general interest...</p>",
        "id": 231840750,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1616692497
    },
    {
        "content": "<p>Can anyone give examples (without identifying information, of course) of how you behave when refereeing for a general-interest journal?</p>",
        "id": 231841014,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616692590
    },
    {
        "content": "<p>I can't tell if this conversation keeps veering away from the original question, or if pinning down what constitutes general interest does answer the question <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 231841463,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1616692797
    },
    {
        "content": "<p>I think pinning down what \"general interest\" means, as an <em>intrinsic</em> property of a <em>paper</em>, does go a long way towards answering the question.  But it's tricky because that's different from saying what \"general interest\" means as a property of a <em>journal</em>, or as an \"extrinsic\" property of a paper (e.g. \"the sort of paper that gets published in a general interest journal\").</p>",
        "id": 231842333,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616693103
    },
    {
        "content": "<p>Joachim's suggestions are the closest to the sort of answer I was hoping for.  Ivan seems to be suggesting that he would interpret \"general interest\" as \"good / original / ambitious / unifying\", if I understand correctly.</p>",
        "id": 231842637,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616693212
    },
    {
        "content": "<p>It is also funny to compare what general interest means for different journals: of course it depends on the interests of the editorial board. For example, <em>Compositio</em> is very number-theory and algebraic-geometry focused, almost as if general interest means connected to these two areas.  And <em>Commun Pure Appl. Math.</em> seems to be highly slanted towards analysis. I find it quite refreshing and honest that the journal <em>Discrete Analysis</em> says something like 'we publish papers in areas close to the editors' interest' :-)</p>",
        "id": 231843431,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1616693513
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/231841463\">said</a>:</p>\n<blockquote>\n<p>I can't tell if this conversation keeps veering away from the original question, or if pinning down what constitutes general interest does answer the question <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>\n</blockquote>\n<p>If I'm refereeing for such a journal, I figure anything I'm interested in counts as \"general interest\".  I don't feel any obligation to abide by anyone else's concept of \"general interest\".   And if a paper is boring to me I won't referee it.</p>",
        "id": 231845385,
        "sender_full_name": "John Baez",
        "timestamp": 1616694249
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/231845385\">said</a>:</p>\n<blockquote>\n<p>If I'm refereeing for such a journal, I figure anything I'm interested in counts as \"general interest\".  I don't feel any obligation to abide by anyone else's concept of \"general interest\".   And if a paper is boring to me I won't referee it.</p>\n</blockquote>\n<p>So what do you say when the refereeing instructions specifically ask you to evaluate whether the paper is suitable for a general-interest journal?</p>",
        "id": 231850997,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1616696275
    },
    {
        "content": "<p>I don't know if I've gotten that request - but if I did, I would not feel any obligation to abide by anyone else's concept of \"general interest\".   I would probably go ahead and say a paper is of general interest if it's of interest to me, or I can imagine it being interesting to the mathematicians I like.</p>",
        "id": 231867641,
        "sender_full_name": "John Baez",
        "timestamp": 1616702693
    },
    {
        "content": "<p>Not all Tier A journals are general interest. J Diff Geom, and Geom &amp; Topol would be Tier A, even if lower down the tier.</p>",
        "id": 232083439,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616844202
    },
    {
        "content": "<p>But more to the point of the question,  if a paper is very well-written, keeping in mind the non-expert reader, then that's what I would look for, and note in a referee report. </p>\n<p>This probably rules out some papers submitted to Advances, but somehow they keep getting accepted.</p>",
        "id": 232083743,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616844513
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/232083439\">said</a>:</p>\n<blockquote>\n<p>Not all Tier A journals are general interest. J Diff Geom, and Geom &amp; Topol would be Tier A, even if lower down the tier.</p>\n</blockquote>\n<p>I partially disagree with this statement. While it is formally correct, as a fact what happens is that when a \"specialized journal\" ends up in Tier A, then its content automatically is considered \"of general interest\" by the community, and many of its most technical papers will end up in generalist journals. There are several evidences of this in the history of publishing.</p>",
        "id": 232083837,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1616844629
    },
    {
        "content": "<p>Speaking of political moves, one perhaps small elephant in the room is that some people want nothing to do with Elsevier, which rules out submitting to Advances, and hence the only high-tier generalist journal that seems to accept category theory.</p>",
        "id": 232083859,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616844651
    },
    {
        "content": "<p>Calling JDG \"generalist\" is either a joke, or using a different definition. It is so exclusive it won't even accept all kinds of differential geometry, only the style that Yau likes.</p>",
        "id": 232083939,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616844748
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/232083939\">said</a>:</p>\n<blockquote>\n<p>Calling JDG \"generalist\" is either a joke, or using a different definition. It is so exclusive it won't even accept all kinds of differential geometry, only the style that Yau likes.</p>\n</blockquote>\n<p>I did not say that it is a generalist journal, I said that the papers matching the same keywords of that journal will be considered of general interest by the community.</p>",
        "id": 232083994,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1616844829
    },
    {
        "content": "<p>Oh ok. I take generalist to mean that, at least in principle, or on paper, it would accept articles from any area.</p>",
        "id": 232084072,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616844879
    },
    {
        "content": "<p>Since the very beginning I have made a very clear distinction between our perception of what \"general interest\" should mean (which is by definition a political issue) and what it actually means in 2021, given the data we have. I am not even claiming that we should bend to this tradition (this is why in my first message I discuss political statements), but we should acknowledge it (especially in order to change it).</p>\n<p>On a side note, I would not consider Advances on the same level of the Top 7. It is not \"Tier A\", it is something like B+, for an undefined notion of B <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> . (This means that having a paper on that Top 7 is a much better tenure material/ERC grant material then Advances). (I also understand that this might seem like a very greedy point of view, but again, I try to describe what I see, not what I like. We do live in such times...).</p>",
        "id": 232084212,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1616845081
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/232083859\">said</a>:</p>\n<blockquote>\n<p>Speaking of political moves, one perhaps small elephant in the room is that some people want nothing to do with Elsevier, which rules out submitting to Advances, and hence the only high-tier generalist journal that seems to accept category theory.</p>\n</blockquote>\n<p>Here I am! I try to avoid Elsevier and Springer as much as I possibly can. Sometimes there isn't much one can do tho.</p>",
        "id": 232084694,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1616845613
    },
    {
        "content": "<p>Do you mean because of co-authors?</p>",
        "id": 232119577,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616880540
    },
    {
        "content": "<p>oh, and me too. I've never published in or reviewed for the big E.</p>",
        "id": 232119687,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616880660
    },
    {
        "content": "<p>Sometimes it's coauthors, sometimes (rarely) it can be that you really come up with something really good, and unfortunately many top tier conferences still publish with them. I guess being able to choose becomes increasingly easier as you go forward with the academic career. But if you need to build up reputation to get tenure track, avoiding Elsevier can make things considerably harder.</p>",
        "id": 232125484,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1616887313
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/refereeing.20for.20.22general.20interest.22.20journals/near/232125484\">said</a>:</p>\n<blockquote>\n<p>...if you need to build up reputation ..., avoiding Elsevier can make things considerably harder.</p>\n</blockquote>\n<p>Yes, yes it does.</p>",
        "id": 232147411,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1616914084
    }
]