[
    {
        "content": "<p>Recently, I've finally started to get the hang of the basic facts of category theory, and so I've been trying to think in more exploratory directions (IE, with exotic completions, the properties of the limit closure of representables in a presheaf category, trying to realize concrete categories as limits in Cat, etc.) However, now that my questions are less about asking for information that can be readily found in some well-known work, I'm finding it more difficult to make my queries well-posed. I often have a clear idea of what I want in my head, but when I write it out it often sounds vague and handwavy, even when I try to add specifying details later.</p>",
        "id": 532049439,
        "sender_full_name": "John Onstead",
        "timestamp": 1753961760
    },
    {
        "content": "<p>So I was wondering if there was any general advice about what I should check to make sure I am asking a good question (whether here on this server, on MSE/MO, or anywhere really). How might I be able to practice this? What kind of supplementary material should I include with a question (IE, a rationale for why this might be a compelling idea, work that I've done already towards answering the question, etc.) <br>\n(And is it even worth going into these exploratory directions in the first place as a non-mathematician?)</p>",
        "id": 532049662,
        "sender_full_name": "John Onstead",
        "timestamp": 1753961820
    },
    {
        "content": "<p>short answer, one never learns. A good strategy if your don't want to just trial and error, is to submit a draft question to someone who is not new to the topic (so, knows CT), but completely new to that specific question asking for feedback: \"do you understand what I'm asking?\" \"How can I make it clearer?\"<br>\nAfter some time enduring this exercise, it comes more natural to you how to address your peers. You \"learn how to ask\"</p>",
        "id": 532053267,
        "sender_full_name": "fosco",
        "timestamp": 1753962986
    },
    {
        "content": "<p>In my personal experience, I took me a long time to understand that some questions I asked on MSE/MO went unnoticed because they seem very random -even when I tried my best to give context, sometimes the context just isn't there: in this sense I am closer in spirit to number theorists: some questions, you ask them because they are scaffolding to a general theory that has a very clearly rooted origin in physical world. But other questions, you ask them just because you can, and the answer is (sometimes) surprisingly deep.</p>",
        "id": 532054775,
        "sender_full_name": "fosco",
        "timestamp": 1753963377
    },
    {
        "content": "<p>People in our community that are closer to this aesthetics are Schanuel (\"what is the length of a potato?\" and \"what is a negative set?\") or Paré ( <a href=\"http://www.tac.mta.ca/tac/volumes/36/6/36-06.pdf\">http://www.tac.mta.ca/tac/volumes/36/6/36-06.pdf</a> ): <br>\n<a href=\"/user_uploads/21317/hcJGPXKIVjjyJJHxfqbFy1Pg/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/hcJGPXKIVjjyJJHxfqbFy1Pg/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1264x166\" src=\"/user_uploads/thumbnail/21317/hcJGPXKIVjjyJJHxfqbFy1Pg/image.png/840x560.webp\"></a></div>",
        "id": 532055065,
        "sender_full_name": "fosco",
        "timestamp": 1753963470
    },
    {
        "content": "<p>I find that mathematicians don't respond very well to open-ended questions.    In some forums they forbid such questions, while in others they enjoy them... but they often don't give me answers that I find useful.   </p>\n<p>Thus, I find it incredibly useful to develop my thinking on a question to the point where I can ask a precise yes-or-no question that produces <strong>a single bit of very useful information.</strong></p>\n<p>For example: <a href=\"https://mathoverflow.net/questions/487823/is-there-a-non-simply-connected-topological-ring\">is there a non-simply-connected topological ring</a>?   (Answer: yes, and there are machines for building topological rings with various interesting topological properties.)</p>\n<p>Or:  <a href=\"https://mathoverflow.net/questions/377545/which-finite-abelian-groups-arent-homotopy-groups-of-spheres\">Which finite abelian groups aren't homotopy groups of spheres</a>?   (Answer: nobody has a fucking clue.)</p>",
        "id": 532056373,
        "sender_full_name": "John Baez",
        "timestamp": 1753963748
    },
    {
        "content": "<p>(This was just an example of a problem I faced growing old; not implying you are doing the same. Just a way to say: it feels so, so strange to me that in order to ask a mathematical question one needs a motivation! The question is its own motivation... Or to put it better: almost every theory has been, at some embryonal stage of its development, an exercise in style; derubricate it to a pointless question just because it doesn't serve any purpose mutilates a big chunk of the artistic/creative side of mathematics. A quote attributed to David Van Dantzig <a href=\"https://en.wikipedia.org/wiki/David_van_Dantzig\">https://en.wikipedia.org/wiki/David_van_Dantzig</a> sounds more or less like this: \"A mathematician is like a mad tailor: they craft \"all possible clothes\" in the hope of making something that is actually suitable to wear.\")</p>",
        "id": 532056676,
        "sender_full_name": "fosco",
        "timestamp": 1753963822
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> yes, I also see this duality: presented with an open-ended question, some mathematicians say \"hah, interesting toy to tinker with! Lemme see...\" and others are like \"Huh, <em>why the hell</em> would you want to know?\"</p>",
        "id": 532057073,
        "sender_full_name": "fosco",
        "timestamp": 1753963916
    },
    {
        "content": "<p>Never understood what generates this dichotomy. Probably some different posture on the ontology of mathematical objects (for the latter group, it's natural to feel that good mathematical questions are motivated by physical intuition -while the former group is content with the intricate wordplay)</p>",
        "id": 532057382,
        "sender_full_name": "fosco",
        "timestamp": 1753963996
    },
    {
        "content": "<p>I think the dichotomy is simply whether the answerer finds that the question strikes a chord with them, or not.   We're all interested in different things.</p>",
        "id": 532058209,
        "sender_full_name": "John Baez",
        "timestamp": 1753964223
    },
    {
        "content": "<p>Trying to engage with categorical ideas and this community has helped me appreciate how undefined a lot of my questions were and even how undefined a lot of ideas are.</p>\n<p>For example, I learned about Mac Lane's \"Form and Function in mathematics\" here - in it he really underscores, as just one example of ambiguity, how many ways you can formalize the same \"idea\" mathematically. Physical extant as a number vs as an axiomatically defined synthetic concept, are the tips of two very large icebergs.</p>\n<p>I don't think I really appreciated how deeply formal precision helps one be specific about what they mean. I used to think strong mathematicians were precise because \"they were smart\" or \"formally skilled\" or whatever, but now I understand much more deeply they truly didn't know what I was trying to ask.</p>\n<p>Growing through this has been somewhat disconcerting, because I've always held my intuitions to be a big part of how I think about applied mathematics. </p>\n<p>If I see a box rotate, to me, my mind is resolving what I see. So when I later close my eyes and try to think about this, really I'm resolving my experience into my theory. Somehow I see intuition as a key engine that makes <em>applied</em> mathematics in particular go.</p>\n<p>But a \"Box rotating\" is <em>profoundly</em> vague.</p>\n<p>I think metaphors with software are surprisingly helpful, it can be jarring how differently various applications and libraries will resolve both\"box\" and \"rotation\" into code. And consequently asking questions in software generally requires even more specificity than in math. </p>\n<p>I have many ideas and intuitions that I know must be meaningful to software somehow, but at the end of the day, if it isn't code, programmers are going to be confused by attempts to communicate these ideas unless their motivations are extremely similar to mine.</p>\n<p>I'm growing to learn math is similar. Of course you can't just throw a ton of formal noise at the wall and expect something to stick, just like you can't ask strangers perpetually to find bugs in your code with no context. So \"be more formal\" by itself doesn't resolve your question.</p>\n<p>I think asking a question that both others can answer and resolves what you were trying to understand is extremely challenging.</p>\n<p>It also gets harder as you get better because you leave contexts where teachers have a lot of experience with the sort of questions people ask.</p>",
        "id": 532080513,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1753969922
    },
    {
        "content": "<p>(After writing all that, I noted to myself being brave enough to ask \"dumb questions\" in the style of \"what did you mean by freely generated there?\" Is useful.</p>\n<p>Asking questions about very specific technical motions I didn't quite understand is often easy and very helpful.)</p>",
        "id": 532090806,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1753972314
    },
    {
        "content": "<p>For what it’s worth, I thought you did pretty well resolving your recent question into something like “when is a mono-reflection some kind of free completion”? If it hasn’t gotten much engagement it’s probably because it seems hard and one needs somewhere to catch a handhold.</p>",
        "id": 532130156,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753982625
    },
    {
        "content": "<p>Somewhat related, <span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> made a very relevant list of <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Programmers.20helping.20mathematicians/near/489384117\">helpful tips</a> for communicating with mathematicians.</p>",
        "id": 532150054,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1753989216
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532053267\">said</a>:</p>\n<blockquote>\n<p>A good strategy if you don't want to just trial and error, is to submit a draft question to someone who is not new to the topic (so, knows CT), but completely new to that specific question asking for feedback: \"do you understand what I'm asking?\" \"How can I make it clearer?\"<br>\nAfter some time enduring this exercise, it comes more natural to you how to address your peers. You \"learn how to ask\"</p>\n</blockquote>\n<p>Thanks, I'll definitely give that a try! Would you happen to have open DMs, perhaps in the future when I need to clarify a question I can ask for feedback? Or would you know of someone who can help with this?</p>",
        "id": 532155316,
        "sender_full_name": "John Onstead",
        "timestamp": 1753991174
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532056373\">said</a>:</p>\n<blockquote>\n<p>Thus, I find it incredibly useful to develop my thinking on a question to the point where I can ask a precise yes-or-no question that produces <strong>a single bit of very useful information.</strong> It's like a tiny precious jewel.</p>\n<p>Of course the usefulness is not really in the yes-or-no answer, but in the proof and other surrounding information. But nothing concentrates mathematicians' attention like a yes-or-no question.</p>\n</blockquote>\n<p>Thanks! I've also found asking true/false questions to be helpful and enlightening. It certainly ensures the question is precise, and so I'll try to incorporate more of these kinds of question.</p>",
        "id": 532155525,
        "sender_full_name": "John Onstead",
        "timestamp": 1753991252
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277352\">Alex Kreitzberg</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532080513\">said</a>:</p>\n<blockquote>\n<p>So \"be more formal\" by itself doesn't resolve your question.</p>\n<p>I think asking a question that both others can answer and resolves what you were trying to understand is extremely challenging.</p>\n<p>It also gets harder as you get better because you leave contexts where teachers have a lot of experience with the sort of questions people ask.</p>\n</blockquote>\n<p>Thanks for your answer! I've also realized this too. But if I have a question and the answer isn't currently known (at least to those I ask), I'm not quite sure what to do after. I don't usually have the skills to answer it myself, unfortunately. Something for me to think about!</p>",
        "id": 532156102,
        "sender_full_name": "John Onstead",
        "timestamp": 1753991460
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532130156\">said</a>:</p>\n<blockquote>\n<p>For what it’s worth, I thought you did pretty well resolving your recent question into something like “when is a mono-reflection some kind of free completion”? If it hasn’t gotten much engagement it’s probably because it seems hard and one needs somewhere to catch a handhold.</p>\n</blockquote>\n<p>Thanks, sometimes it's hard to tell if a lack of engagement means the question wasn't good, or if because of this lack of a handhold. Maybe there's ways of generating this handhold, perhaps using the \"yes/no\" question basis covered above. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"619003\">Peva Blanchard</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532150054\">said</a>:</p>\n<blockquote>\n<p>Somewhat related, @David Egolf made a very relevant list of <a href=\"#narrow/channel/241990-community.3A-discussion/topic/Programmers.20helping.20mathematicians/near/489384117\">helpful tips</a> for communicating with mathematicians.</p>\n</blockquote>\n<p>Thanks, I'll check that out!</p>",
        "id": 532156779,
        "sender_full_name": "John Onstead",
        "timestamp": 1753991708
    },
    {
        "content": "<p>fwiw, I think it's normal to not know answers to questions you're pretty sure matter. I've been stuck on stuff I'd consider basic that, I retrospectively realized, a question I asked ten years ago was attempting to get a handle on.</p>\n<p>I think that's even one of my motivations for developing my skills. To be able to answer my harder questions.</p>\n<p>Actually sometimes you don't want an answer too soon. When I was in high school/middle school I wondered and asked whether \"if, while, var\" were \"all you needed\" in programming languages, to which folks dutifully replied \"Yup! That's Turing completeness!\" </p>\n<p>This is true in an important sense. But, I think that answer stopped me from organically looking into programming language theory/logic.</p>",
        "id": 532163246,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1753994057
    },
    {
        "content": "<p>A similar class of story from closer to math that always frustrates me is when people know a bit of mathematics but not too much squash kids’ questions about infinite numbers, repeating decimals, and such by acting as if the fact that “the numbers” are the Dedekind reals is some foundational fact about the universe that it’s foolish to question rather than a very contingent technical choice made just a bit before living memory and only held close to universally for a few decades. Getting “answers” too fast can be harmful!</p>",
        "id": 532166765,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753995520
    },
    {
        "content": "<p>I kinda do think the Dedekind reals are some kind of foundational fact about the universe, but I'll set that aside for now. I think it is very good to question these things, because it's good to see why they are good definitions. But I also think these are not really the right questions to be asking. They are based off a much more arbitrary choice of notation that we use to represent numbers. The questions would largely evaporate if they started from the point of view \"What do we want 'numbers' for?\" instead of \"What happens if we tweak this property of decimal representations?\".</p>",
        "id": 532271453,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1754042433
    },
    {
        "content": "<p>Which questions are \"not the right questions to be asking\"?  Do you mean kids' questions about decimal expansions?   If so, I think we have to remember that what counts as the \"right questions\" depends on what the questioner knows.  The right questions for someone with very little knowledge will sound wrong to someone who knows more.  So it's good to respond by giving the answer <em>and</em> giving some information that helps the questioner ask more sophisticated questions - e.g., ponting out mistaken or naive presuppositions.</p>",
        "id": 532280072,
        "sender_full_name": "John Baez",
        "timestamp": 1754045604
    },
    {
        "content": "<p>One class of questions I can think of that might be \"not the right questions to ask\" are ones that <em>don't typecheck</em> in a certain sense. Something like \"what colour is the number 7?\". I've had some experiences with explaining maths to people who end up asking a question akin to that - a recent example that comes to mind is \"does an unordered set satisfy the supremum property?\". So I needed to try and explain that the answer was more \"the question doesn't make sense to ask\" rather than \"no\".</p>\n<p>Other than that, I tend to be broadly quite forgiving with regards to students asking questions; often I take it as an opportunity to try and improve my own pedagogy! I've understood so many concepts better just by taking an otherwise \"silly question\" more seriously.</p>",
        "id": 532280654,
        "sender_full_name": "Ruby Khondaker (she/her)",
        "timestamp": 1754045837
    },
    {
        "content": "<p>Btw, I just read a fun paper about decimal expansions for hyperreal numbers.  These expansions can go on a lot longer than for ordinary real numbers, so we get versions of 0.9999... that don't equal 1, where the 9s stop after an infinite number of decimal places.</p>",
        "id": 532280882,
        "sender_full_name": "John Baez",
        "timestamp": 1754045937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"934428\">Ruby Khondaker (she/her)</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532280654\">said</a>:</p>\n<blockquote>\n<p>\"what colour is the number 7?\".</p>\n</blockquote>\n<p>is more than ill-typed.. It’s synesthetical <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 532293739,
        "sender_full_name": "Vincent R.B. Blazy",
        "timestamp": 1754050461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"934428\">Ruby Khondaker (she/her)</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532280654\">said</a>:</p>\n<blockquote>\n<p>One class of questions I can think of that might be \"not the right questions to ask\" are ones that <em>don't typecheck</em> in a certain sense. Something like \"what colour is the number 7?\". </p>\n</blockquote>\n<p>I claim that if someone wants to know something like this, this is the right question for them to ask.   The onus is on the answerer to explain the concepts needed to ask better questions.    For example, most people don't even understand the concept of \"type checking\".</p>\n<p>If someone asks \"what colour is the number 7?\", they are probably coming from a very interesting mental world that deserves to be understood.   Like a former synaesthete who has lost that ability and has forgotten the colors of numbers, who also doesn't know that synaesthesia is rare, with details varying from person to person.   If you simply tell them \"that's not a good question\", you're really missing the point.</p>",
        "id": 532295404,
        "sender_full_name": "John Baez",
        "timestamp": 1754051086
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532295404\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"934428\">Ruby Khondaker (she/her)</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532280654\">said</a>:</p>\n<blockquote>\n<p>One class of questions I can think of that might be \"not the right questions to ask\" are ones that <em>don't typecheck</em> in a certain sense. Something like \"what colour is the number 7?\". </p>\n</blockquote>\n<p>I claim that if someone wants to know something like this, this is the right question for them to ask.   The onus is on the answerer to explain the concepts needed to ask better questions.    For example, most people don't even understand the concept of \"type checking\".</p>\n<p>If someone asks \"what colour is the number 7?\", they are probably coming from a very interesting mental world that deserves to be understood.   Like a former synaesthete who has lost that ability and has forgotten the colors of numbers, who also doesn't know that synaesthesia is rare, with details varying from person to person.   If you simply tell them \"that's not a good question\", you're really missing the point.</p>\n</blockquote>\n<p>Yes so even in the example I mentioned, I didn't just dismiss the question as a \"wrong question\", I launched into an informal explanation of what it <em>means</em> for something to \"type-check\", and why we might say such a question doesn't type-check.</p>",
        "id": 532304875,
        "sender_full_name": "Ruby Khondaker (she/her)",
        "timestamp": 1754054181
    },
    {
        "content": "<p>Seven is yellow... That's the only possible answer!</p>",
        "id": 532329190,
        "sender_full_name": "fosco",
        "timestamp": 1754061975
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"934428\">Ruby Khondaker (she/her)</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532304875\">said</a>:</p>\n<blockquote>\n<p>Yes so even in the example I mentioned, I didn't just dismiss the question as a \"wrong question\", I launched into an informal explanation of what it <em>means</em> for something to \"type-check\", and why we might say such a question doesn't type-check.</p>\n</blockquote>\n<p>Good!   If someone can learn what it means for things to have a \"type\", and for some statements not to \"type check\", that's a huge step forward.  </p>\n<p>(Of course it's subtle, because there are lots of different type systems, and a statement that doesn't type check in one can type check in another... so it can be hard to apply this idea to everyday language, which is not \"regimented\".  But never mind - one step at a time!)</p>",
        "id": 532340019,
        "sender_full_name": "John Baez",
        "timestamp": 1754065763
    },
    {
        "content": "<p>they say one person's type-error (bad state) is another person's free real estate (maybe the bad state can be put to work or have meaning somehow)</p>",
        "id": 532357939,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1754072673
    },
    {
        "content": "<p>Again, thanks to everyone for their help and advice above. I wanted to apply what I learned here, and I found the perfect situation for that. I've recently been reviewing Garner and Mike Shulman's paper \"<a href=\"https://arxiv.org/abs/1301.3191\">Enriched categories as a free cocompletion</a>\", inspired by my investigation of \"exotic completions\" (as enriched categories aren't the sort of thing you usually think of as being given as a completion). I'm surprised I haven't come across this paper before, but I think it's probably because I confused it for some reason with \"Exact completions and small sheaves\" which I have gone through many times before.</p>",
        "id": 532894936,
        "sender_full_name": "John Onstead",
        "timestamp": 1754393220
    },
    {
        "content": "<p>In any case, as I was reading the paper I got a question that I wanted to ask about it. I've applied what I learned above here to try and make it precise, and I'll post it in the \"Exotic completions\" topic (since it's on topic and I don't want to create too many different topics) shortly. If you have any suggestions for further improvement or general comments put them here! Thanks again.</p>",
        "id": 532895099,
        "sender_full_name": "John Onstead",
        "timestamp": 1754393280
    },
    {
        "content": "<p>Excellent yes-or-no question.  Telling Mike the approach in his paper is \"very unwieldy\" was a bit cheeky, but it <em>will</em> guarantee a reply.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 532897943,
        "sender_full_name": "John Baez",
        "timestamp": 1754394306
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/channel/233322-practice.3A-communication/topic/Requirements.20for.20a.20well-posed.20question/near/532897943\">said</a>:</p>\n<blockquote>\n<p>Excellent yes-or-no question. Telling Mike the approach in his paper is \"very unwieldy\" was a bit cheeky, but it <em>will</em> guarantee a reply.</p>\n</blockquote>\n<p>Thanks! I didn't intend for it to be cheeky, but I'm glad I was able to make the question well-posed overall!</p>",
        "id": 532981792,
        "sender_full_name": "John Onstead",
        "timestamp": 1754423957
    }
]