[
    {
        "content": "<p><a href=\"/user_uploads/21317/C5PU18b8JRxOYizpwntJCZBP/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/C5PU18b8JRxOYizpwntJCZBP/image.png\" title=\"image.png\"><img data-original-dimensions=\"1433x442\" src=\"/user_uploads/thumbnail/21317/C5PU18b8JRxOYizpwntJCZBP/image.png/840x560.webp\"></a></div><p>I'm going to show a first step that I made in visualising sheaves using interactive web pages containing JavaScript and SVG (Scalable Vector Graphics). My motivation for this is that I follow Seymour Papert, the inventor of Logo, in that I \"build knowledge most effectively when [...] actively engaged in constructing things in the world.\" The quote is from <a href=\"https://news.mit.edu/2016/seymour-papert-pioneer-of-constructionist-learning-dies-0801\">https://news.mit.edu/2016/seymour-papert-pioneer-of-constructionist-learning-dies-0801</a> . So I want a tool that lets me play with sheaves as though they were bricks or musical notes or electronic circuit components. I don't know what that tool would look like: finding out is itself play. (Actually, another motivation is that I'm an artist, and depicting categorical ideas is relaxing  in the same way that, say, drawing Russian Constructivist art is. The systems can be so elegant. And sheaves might actually be useful for categorical aesthetics.)</p>\n<p>How does it work? I start with the notion that a sheaf is a kind of functor on the poset of open sets of a space. So in the left half of an image, I draw two open sets, regarded as objects in a category. The picture doesn't define the space that the open sets are from, but for the moment, let's assume it's ℝ with the familiar topology.</p>\n<p>The right half draws two objects of the category that's the functor's target. The concept that I want to illustrate is:</p>\n<blockquote>\n<p>A pre-sheaf F of Abelian groups on a topological space X is an assignment of an Abelian group F(U) to each open set U in X; and for every pair of open sets V⊂U in X, a group homomorphism (called the restriction homomorphism) ρUV:F(U)→F(V).</p>\n</blockquote>\n<p>There's more to pre-sheaves and sheaves than this, but I need to start somewhere. I've let the group on U be the group of continuous functions from U to ℝ. This is standard, and easy to work with, because I can use arithmetic and X/Y plots to show how its elements combine. I want to do that, and do it in enough detail to make it clear that this is a group. In future visualisations, I'll want to show the group homomorphisms at work too.</p>\n<p>Each element of F(U) is a continuous function from U to ℝ. I show two example open sets U and V, so I need two groups for F(U) and F(V). I can't show all of the infinite number of elements, but I can show representative examples. Psychological research into mental models suggests that at least three is a good number of examples. I'll use five: one of those is a bit special because it's the group identity, and another adds variety.</p>\n<p>So I've given F(U) five representative elements, and F(V) likewise. The restriction mapping is clearly demonstrated by the paired sine and parabola graphs, and by the X-axis scales.</p>\n<p>So this is what I have:</p>\n<p><a href=\"/user_uploads/21317/HjPKAZUmCDRb0JEq308Yzy1L/j3oxmzuu7m9e1.png\">j3oxmzuu7m9e1.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/HjPKAZUmCDRb0JEq308Yzy1L/j3oxmzuu7m9e1.png\" title=\"j3oxmzuu7m9e1.png\"><img data-original-dimensions=\"1377x475\" src=\"/user_uploads/thumbnail/21317/HjPKAZUmCDRb0JEq308Yzy1L/j3oxmzuu7m9e1.png/840x560.webp\"></a></div><p>Groups ought to feel dynamic, and with a computer, we can animate them rather than just writing down a combination table. So let's do that. I introduce a combination sign, visible above, which is a + in a circle, coloured so it is vividly different from the group elements, arrows, and open sets. (I also styled the open sets, stippling the edges as is sometimes seen in topological diagrams.)</p>\n<p>So how do we use the combination sign? I made the group elements — the graph thumbnails — draggable. That is, you can pull them along by placing the mouse over them, left-clicking, moving the mouse while the button is down, and releasing it.</p>\n<p>Dragging the combination sign over two elements and clicking generates their combination. This is just the pointwise sum of the elements. As explained above, these are the continuous functions from the open set to ℝ.</p>\n<p>Since combination is commutative, the relative positions of the elements under the sign don't matter. Once the new element has been generated, it can be combined too. Here's combination working:</p>\n<p><a href=\"/user_uploads/21317/Buzuipm8E-N_-K0ldaXB7qsu/n6kwmt2z7m9e1.png\">n6kwmt2z7m9e1.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Buzuipm8E-N_-K0ldaXB7qsu/n6kwmt2z7m9e1.png\" title=\"n6kwmt2z7m9e1.png\"><img data-original-dimensions=\"1269x300\" src=\"/user_uploads/thumbnail/21317/Buzuipm8E-N_-K0ldaXB7qsu/n6kwmt2z7m9e1.png/840x560.webp\"></a></div><p>In case it's not clear, these are before and after screenshots. The third thumbnail in the top row plays no part in the combination. It just happened to be there. Anyway, combination can be repeated as many times as desired, including with elements generated by previous combinations.</p>\n<p>There is a slight confusion of metaphors here. The original five elements represent a view into their group. In such a view, each element can appear only once. However, that metaphor breaks as soon as a combination generates an element that was already depicted, because now the picture plane represents a workspace such as a piece of scrap paper, in which one can write any symbol anywhere. It's unlikely to lead to confusion here, but such clashes need watching for.</p>\n<p>This is my first attempt at such a visualisation, and there's a lot I've not said. For example, about the homomorphism between the two groups C(V,ℝ) and C(U,ℝ). However, I have emphasised the nature of the restriction mapping, by lining up corresponding thumbnails so it's easy to compare their scales and the shapes of their functions.</p>\n<p>Maths, computing: graphic design is also important. The functor arrow is thicker than the morphism arrows. The inclusion arrow clearly points the other way from the restriction arrow, emphasising contravariance. The open-set circles are stippled round the edges, imitating one style of shading seen in some maths books. The circles are horizontally aligned with the elements of the groups they map to. There's a lot of white space, and the diagram is, I hope, easy to follow.</p>",
        "id": 491443069,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1735680090
    },
    {
        "content": "<p>&gt; </p>",
        "id": 491443222,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1735680240
    },
    {
        "content": "<p>I was just thinking of you the other day -- there were contributions of yours to the n-Category Cafe way back in the day, describing your interactive web pages to illustrate limits and colimits. Glad to see your name again!</p>",
        "id": 491443844,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1735680837
    },
    {
        "content": "<p>Thanks for the thought! I'm not sure now, but I might have contributed a comment to your blog too.</p>",
        "id": 491444149,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1735681095
    },
    {
        "content": "<p>Do you have links to interactive category theory examples you've made?</p>",
        "id": 491454885,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1735691186
    },
    {
        "content": "<p>The interactive web page that Todd mentioned is at <a href=\"http://www.j-paine.org/cgi-bin/webcats/webcats.php\">http://www.j-paine.org/cgi-bin/webcats/webcats.php</a> . Unfortunately, when I tried it before writing this, I found it didn't work. It's on a commercial web server that I pay for, and I've gone over filestore quota and don't have the money for more. The space holds the Prolog and GraphViz binaries that run it, plus scripts and the images sent to the user. I'll see what I can do, but I may not be able to afford to bring this demo back to life. That said, the link above will be enough to show what it would have done. I kept one of the diagrams it generated, at <a href=\"http://www.j-paine.org/hello/animated_products_diagram.gif\">http://www.j-paine.org/hello/animated_products_diagram.gif</a> .</p>\n<div class=\"message_inline_image\"><a href=\"http://www.j-paine.org/hello/animated_products_diagram.gif\"><img src=\"https://uploads.zulipusercontent.net/a585fffa23c6390012b65da7968360191a92cf2f/687474703a2f2f7777772e6a2d7061696e652e6f72672f68656c6c6f2f616e696d617465645f70726f64756374735f6469616772616d2e676966\"></a></div><p>The interactive web page that I posted about last night is different, because all the work is done in JavaScript inside the page, rather than by external code on a web server. It's at <a href=\"http://www.j-paine.org/lds/sheaves1/all.html\">http://www.j-paine.org/lds/sheaves1/all.html</a> . Run it with one of the big-name web browsers such as Firefox or Chrome if you can, preferably not on a phone, because that's more likely to execute the code properly. You can see my code if you ask the browser to show page source. Most of it does the drawing. A more sophisticated version probably would hive off some work to Prolog again: for example, when deriving the formulæ for the sum of the functions represented by the little thumbnail plots.</p>",
        "id": 491469379,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1735706589
    },
    {
        "content": "<p>Awesome</p>",
        "id": 491691157,
        "sender_full_name": "Julius Hamilton",
        "timestamp": 1735868282
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/cnB848GCI7o-xs_fqKS0uEAz/aw_shucks.png\">aw_shucks.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/cnB848GCI7o-xs_fqKS0uEAz/aw_shucks.png\" title=\"aw_shucks.png\"><img data-original-dimensions=\"238x246\" src=\"/user_uploads/thumbnail/21317/cnB848GCI7o-xs_fqKS0uEAz/aw_shucks.png/840x560.webp\"></a></div><p>I've got a few others on the go. One is about natural transformations. In the framework below, clicking on a morphism in the left-hand category lights up the corresponding naturality square in the right. The arrowheads are missing, probably a bug in my code, but you can see the principle. That's only a start, because I need to decide what kinds of object the two categories should have. But it will be an important part of whatever I design.</p>\n<p><a href=\"/user_uploads/21317/fYRO-5MqET15KV_u8s1xZsoP/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/fYRO-5MqET15KV_u8s1xZsoP/image.png\" title=\"image.png\"><img data-original-dimensions=\"1509x504\" src=\"/user_uploads/thumbnail/21317/fYRO-5MqET15KV_u8s1xZsoP/image.png/840x560.webp\"></a></div><p>I'd like to use visualisations like this to teach categorical concepts to Humanities students. As someone remarked in another thread here — I can't find it again — category theory involves a lot of language-building, perhaps much more so than in other branches of mathematics. Some of that language could be very useful in, for instance, talking about translation of natural languages. Imagine if, instead of messing around with prompt engineering, we had a formal language with which we could specify to ChatGPT how to translate an English document into a French one, or how it should squeeze a business report down to its essentials. For the former, natural transformations and variants thereof might be very useful. (I've also experimented with them for describing how artistic styles relate to one another, and what emotions an artist intends their audience to feel.)</p>\n<p>For the latter, I'm thinking of things like kernels. Not kernels of e.g. group homomorphisms though, but kernels of semiotic morphisms.</p>\n<p>We don't really have good tools for building these visualisations yet.</p>",
        "id": 491747093,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1735905679
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/vXvznX5DxKbwaslvRbjOCubM/cartoon2.png\">cartoon2.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/vXvznX5DxKbwaslvRbjOCubM/cartoon2.png\" title=\"cartoon2.png\"><img data-original-dimensions=\"2026x769\" src=\"/user_uploads/thumbnail/21317/vXvznX5DxKbwaslvRbjOCubM/cartoon2.png/840x560.webp\"></a></div><p>I just put up a new one which uses Boolean algebras rather than groups. At <a href=\"http://www.j-paine.org/lds/sheaves1/all_bl.html\">http://www.j-paine.org/lds/sheaves1/all_bl.html</a> .</p>",
        "id": 491999686,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1736112218
    },
    {
        "content": "<p>I'm trying to finish a post on how category theory might help understand accordion's interfaces, I basically just need to post it. I'm trying hard to be as concrete and grounded as possible, so that I'm hopefully able to make headway proving stuff.</p>\n<p>That said, I relate to a lot of your dreams for the subject, I wanted to say that out loud. I also have some interest in interactive explanations.</p>\n<p>You might like this lecture series by Leonard Bernstein: <a href=\"https://youtube.com/playlist?list=PL6DY3I6m2_i8B3Wb3rxPNxXEPavny4QdD&amp;si=crgXSmjpGgP3VNdV\">https://youtube.com/playlist?list=PL6DY3I6m2_i8B3Wb3rxPNxXEPavny4QdD&amp;si=crgXSmjpGgP3VNdV</a></p>\n<p>Trigger warning: there's a moment of bad sexism. I think it's in the third lecture.</p>\n<p>But I mention the series because the premise is to seriously interrogate an analogy between language and music. Eventually diagrams play a role in organizing the analogy. I really want to understand these diagrams that pop up when people try to make analogies between very different subjects.</p>",
        "id": 492001541,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1736113935
    },
    {
        "content": "<p>Hi Alex,<br>\n<a href=\"/user_uploads/21317/T_Jbb8ZLRinfEtvpazdbmpy3/image.png\">image.png</a><br>\n<a href=\"/user_uploads/21317/n9AX7T_TLR3xNUMciumwkE3O/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/T_Jbb8ZLRinfEtvpazdbmpy3/image.png\" title=\"image.png\"><img data-original-dimensions=\"1920x1080\" src=\"/user_uploads/thumbnail/21317/T_Jbb8ZLRinfEtvpazdbmpy3/image.png/840x560.webp\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/21317/n9AX7T_TLR3xNUMciumwkE3O/image.png\" title=\"image.png\"><img data-original-dimensions=\"1920x1080\" src=\"/user_uploads/thumbnail/21317/n9AX7T_TLR3xNUMciumwkE3O/image.png/840x560.webp\"></a></div><p>I got part of the demonstrator working again. It was a horrible job, since I was dealing with an incompatible new web server, an incompatible new version of SWI-Prolog, and (from the scale of my diagrams) what looks like an incompatible version of GraphViz. Plus file quota problems. But if you go to <a href=\"http://www.j-paine.org/cgi-bin/webcats/webcats.php\">http://www.j-paine.org/cgi-bin/webcats/webcats.php</a> , at least initial objects and terminal objects work, and products, equalisers and coproducts work some of the time. I suspect pushouts, pullbacks, coequalisers, limits and colimits have hit a change in SWI-Prolog, possibly related to how it represents strings. </p>\n<p>(In early Prologs, strings were lists of characters: lists in the Lisp sense. Later Prologs optimise them into something more densely packed and with fewer pointers. Unfortunately, some notation changed around then, including ` , which was usable as an operator, but is now a quote. I had the bad luck to be using it as an operator.)</p>\n<p>I'll reply to your comments about analogy later, but I was doing this today.</p>",
        "id": 492838242,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1736464735
    },
    {
        "content": "<p>Oh you're fine, the visualizations are a better use of your time and look fun.</p>",
        "id": 492858138,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1736474387
    },
    {
        "content": "<p>Bruno Gavranović posted the following quote, by an unknown person on Reddit, in \"The Narratives Category Theorists Tell Themselves\", <a href=\"https://golem.ph.utexas.edu/category/2019/09/the_narratives_category_theori.html#c056475\">https://golem.ph.utexas.edu/category/2019/09/the_narratives_category_theori.html#c056475</a> :</p>\n<blockquote>\n<p>I barely even understand what they’re supposed to represent. So much of pure math is like that. You look at the definition of like a topological space or something and you think “what the fuck is this and who the fuck cares?” but then suddenly as you learn more and dig deeper suddenly you find an order there, a structure that is both alien and familiar. It’s bizarre beyond anything you’ve ever encountered before, yet so, so beautiful. Math is the art that stands apart from art itself, that is not only beautiful but the progenitor of all beauty. It is the structure behind structure itself, an eternal landscape that existed before we ever did, and will continue to exist after we all cease to be. Math is the ultimate, incontrovertible study of Truth itself: cold, strange, infinitely subtle, infinitely deep. And thinking about it while high is really, really fucking fun.</p>\n</blockquote>\n<p>That's why the visualisations are fun. They're art that's made about the art that stands apart from art itself. By the way, read the previous sentence aloud, giving syllables their full value where appropriate. It scans really nicely.</p>",
        "id": 492864290,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1736477425
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/_nmumoJWzrAUMZhWDd6VHn3o/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/_nmumoJWzrAUMZhWDd6VHn3o/image.png\" title=\"image.png\"><img data-original-dimensions=\"1498x1902\" src=\"/user_uploads/thumbnail/21317/_nmumoJWzrAUMZhWDd6VHn3o/image.png/840x560.webp\"></a></div>",
        "id": 492947907,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1736514853
    },
    {
        "content": "<p>The title of this thread makes it sound like you're trying to explain sheaves using a metaphor involving interactive webpages where following a hyperlink corresponds to restriction of a section along a subset inclusion. <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 492959036,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1736518435
    },
    {
        "content": "<p>You're joking, but there could be something in that for describing the spread of fake news and malicious attitudes. Imagine standing (*) in one of the circles on my diagram that represents an open set. From this circle, there's an arrow to another circle. The arrow represents restriction, and is labelled with a tweet: say a tweet by Nigel Farage or whoever your favourite anti-EU and anti-immigration rabble-rouser is. That's restriction in a metaphorical sense, the restriction of one's ideology to whatever the shadowy money people behind the <em>Daily Mail</em> and <em>Daily Express</em> would have you believe. But can it be formalised as restriction in a sheavy sense and used to model the spread of such attitudes?</p>\n<p><a href=\"/user_uploads/21317/hNg_8anRLY7KqJLBhCOmFFde/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/hNg_8anRLY7KqJLBhCOmFFde/image.png\" title=\"image.png\"><img data-original-dimensions=\"488x432\" src=\"/user_uploads/thumbnail/21317/hNg_8anRLY7KqJLBhCOmFFde/image.png/840x560.webp\"></a></div><p>If so, what would the open sets represent? Imagine that we've got categories <em>C</em> and <em>D</em>. On the left is <em>C</em>, its objects being the open sets <em>U</em> of a topological space <em>S</em> and its arrows being inclusions. The sheaf or presheaf functor <em>F</em> maps it to <em>D</em>. What's in <em>D</em>? </p>\n<p>Perhaps the <em>U</em> might represent universes of discourse. That is, each open set delimits things that can be said when \"in\" it from things that can't. Maybe by containing signatures, i.e. the names of (e.g.) predicates and constant symbols: see below.</p>\n<p>Then the functor <em>F</em> maps each <em>U</em> to the set of concepts that can be expressed with the building materials in <em>U</em>, i.e. with the predicates and constants it names. \"Concept\" may not be quite the right word. I'm thinking of clusters of emotionally-weighted propositions, e.g. a pair like (logical translation of \"they're coming to take our jobs\", emotion equivalent to \"I fervently believe this and I detest the people it describes\"). Call them EWBCs, for \"emotionally-weighted belief cluster\".</p>\n<p>I'm not sure where to go next, though it might be that the Farage tweet now becomes an endofunctor on <em>D</em>. It probably maps many EWBCs to more hateful and more extreme versions of themselves.</p>\n<p>If so, then we could have many endofunctors, and classify them according to their effects on the dynamics of how the EWBCs spread out. Of particular interest would be functors and functor sequences that generate EWBCs living in a very big universe of discourse, and that are closed against attack. Closed in the sense of self-sealing logic and circular reasoning, that is, such as:</p>\n<blockquote>\n<ul>\n<li>Argument: \"Brexit is good because it restores sovereignty.\"</li>\n<li>Question: \"Why is sovereignty good?\"</li>\n<li>Response: \"Because it means we can make our own decisions, like Brexit.\"</li>\n</ul>\n</blockquote>\n<p>(*) Rather than the God's-eye view advocated by typical category theorists, I'm humble. I imagine myself smaller than an object, idling amongst the morphisms. Above, below and all around me, I see more morphisms, sweeping through the air like highways in a 1939 City of Tomorrow ( <a href=\"https://novum.substack.com/p/when-america-received-message-from-the-future\">https://novum.substack.com/p/when-america-received-message-from-the-future</a> ). It's like being a tourist on foot instead of in a car. I can stand on an object at the end of an isomorphism, watch morphisms fan out to neighbouring objects, and then in the distance see analogous morphisms fan out from another object to <em>its</em> neighbours. Wow! What a view! The relations pair up, even if the objects themselves are different.</p>",
        "id": 493126822,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1736628849
    },
    {
        "content": "<p>There's another at <a href=\"http://www.j-paine.org/lds/sheaves1/se_cschem_fi.html\">http://www.j-paine.org/lds/sheaves1/se_cschem_fi.html</a> .</p>\n<p><a href=\"/user_uploads/21317/jI4yp4v-1q6iHRL92BkCLRgM/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/jI4yp4v-1q6iHRL92BkCLRgM/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"320x266\" src=\"/user_uploads/thumbnail/21317/jI4yp4v-1q6iHRL92BkCLRgM/image.png/840x560.webp\"></a></div>",
        "id": 494522978,
        "sender_full_name": "Jocelyn Ireson-Paine",
        "timestamp": 1737209738
    }
]