[
    {
        "content": "<p>I made a half dozen youtube videos about category theory in grad school and posted them on youtube. It was stuff about string diagrams, monoidal categories, simplicial sets, Kan extensions. <br>\nYoutube appears to have annihilated my channel<br>\n<a href=\"https://www.youtube.com/@patricknicodemus6526\">https://www.youtube.com/@patricknicodemus6526</a><br>\nand I don't know how or why. All the videos are gone.<br>\nAnybody know a reliable place to upload videos that won't just delete hours worth of my hard work</p>",
        "id": 454490645,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1722096784
    },
    {
        "content": "<p>How awful. I don't know how responsive YouTube administrators would be, but maybe they're only temporarily removed? </p>\n<p>I'd be curious to have a look!</p>",
        "id": 454491192,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1722096987
    },
    {
        "content": "<p>Yeah I'll start by contacting youtube administrators, I guess.</p>",
        "id": 454492013,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1722097220
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/B1R0uL8kvD7eDzC-P0ZvJzXn/image.png\">image.png</a><br>\nit still appears on Google but the link is dead.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/B1R0uL8kvD7eDzC-P0ZvJzXn/image.png\" title=\"image.png\"><img data-original-dimensions=\"1401x537\" src=\"/user_uploads/thumbnail/21317/B1R0uL8kvD7eDzC-P0ZvJzXn/image.png/840x560.webp\"></a></div>",
        "id": 454494006,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1722097958
    },
    {
        "content": "<p>In August 2023 Google announced a policy of deleting accounts after 2 years of inactivity. <br>\nI usually don't log into my \"professional\" youtube channel other than to add a video, if I comment something on a video it's under my personal account. If they warned me about deleting it, it may have gone to my grad school email which I no longer have access to.</p>\n<blockquote>\n<p>Therefore, we are updating the <a href=\"https://notifications.google.com/g/p/ANiao5ot_u__ryOdxBp1IBGz6w4Grr3FubuEA01l4KhIUwtkkSIlv2kZtLxmHnnG5i3ENHqOQGrNB6DOUu0snVhZ6lhdC01kgzfgBfdqH_iYcMgc5AiIfI_xS5Nf1yztzZDH3wF8igIL0U99dFMV_RI5IDh5aIUJrtYULyWmV3iKpcSDUZ7eImE3fDPh6BMTJ0Drjx_TKX78FUGWsGG494om7n9lYMd4fjTX6F2SObcRnK1pUW1YdQcC\">inactivity period</a> for a Google Account to two years across all our products and services. This change starts rolling out today and will apply to any Google Account that’s been inactive, meaning it has not been signed into or used within a two-year period. An inactive account and any content in it will be eligible for deletion from December 1, 2023.<br>\n<strong>What this means for you:</strong></p>\n</blockquote>\n<ul>\n<li>These changes do not impact you unless you have been inactive in your Google Account for two years or have not used your account to sign in to any Google service for over two years.</li>\n<li>While the changes go into effect today, the earliest we would enforce any account deletion would be December 2023.</li>\n<li>If your account is considered inactive, we will send several reminder emails to both you and your recovery emails (if any have been provided) before we take any action or delete any account content. These reminder emails will go out at least 8 months before any action is taken on your account.</li>\n<li>After a Google Account is deleted, the Gmail address for the deleted account cannot be used again when creating a new Google Account.</li>\n</ul>",
        "id": 454494253,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1722098189
    },
    {
        "content": "<p>Previously Google seems to have claimed that they wouldn't delete YouTube accounts due to inactivity as part of this policy: <a href=\"https://9to5google.com/2023/05/16/google-account-delete/\">[1]</a>, <a href=\"https://x.com/YouTubeLiaison/status/1658829489466384387\">[2]</a>. Does this indicate a change of policy? If they are going to delete inactive channels, then tons of videos are in danger and I'm sure many people would like to know about this.</p>",
        "id": 454908658,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1722276315
    },
    {
        "content": "<p>I found this channel which is just hundreds of twelve hour videos of the digits of pi being fed into a Gameboy controller to see if the random signal will eventually beat Pokemon. That's 12 GB per video. So, YouTube is willing to host like, terabytes and terabytes of literal white noise, but they'll indiscriminately delete lecture videos.<br>\n<a href=\"https://www.youtube.com/@winningsequence/videos\">https://www.youtube.com/@winningsequence/videos</a></p>",
        "id": 472061968,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1727023986
    }
]