[
    {
        "content": "<p>hallo!</p>",
        "id": 286545198,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1655501381
    },
    {
        "content": "<p>Let me repost some things from our private conversation... we've decided it's better to talk publicly.</p>",
        "id": 286545794,
        "sender_full_name": "John Baez",
        "timestamp": 1655501770
    },
    {
        "content": "<p>I thought of a possibly fun experiment.   Randomly generated detailed balanced Petri nets with rates.   I don't actually know how to do this, but \"detailed balance\" is prerequisite for being physically realistic.  Definition here:</p>\n<ul>\n<li><a href=\"https://arxiv.org/abs/1001.0947\">How far is complex balancing from detailed balancing?</a></li>\n</ul>\n<p>Then, run these as closed Petri nets and let them approach equilibrium.     (Or maybe just generate arbitrary Petri nets with rates, run them, and pick those that seem to approach equilibrium!)</p>",
        "id": 286545796,
        "sender_full_name": "John Baez",
        "timestamp": 1655501774
    },
    {
        "content": "<p>Then, treat them as open Petri nets by taking some species as inputs and some as outputs.   Start with initial conditions where the concentrations of all species lie at the equilibrium values (which we've computed).   Then, move the input and output concentrations further and further from equilibrium, and see if oscillatory or chaotic behavior kicks in.   (\"Wiggles\".)</p>",
        "id": 286545812,
        "sender_full_name": "John Baez",
        "timestamp": 1655501792
    },
    {
        "content": "<p>The idea would be to see if Prigogine's ideas are <em>generically</em> true, or only true for special open Petri nets.</p>",
        "id": 286545830,
        "sender_full_name": "John Baez",
        "timestamp": 1655501809
    },
    {
        "content": "<p>In terms of programming, one first step is to implement, preferably on AlgebraicPetri, the ability to do the dynamics of <em>open</em> Petri nets - the one discussed by Blake and me, where concentrations of certain \"input\" and \"output\" species are held fixed.</p>",
        "id": 286545913,
        "sender_full_name": "John Baez",
        "timestamp": 1655501883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276589\">@Sophie Libkind</span> said it would take her ten minutes, or something like that.</p>",
        "id": 286545964,
        "sender_full_name": "John Baez",
        "timestamp": 1655501901
    },
    {
        "content": "<p>Once we've got this set up and we're able to \"run\" an open Petri net with rates, I would like to try some simple experiments where I take an open detailed balanced Petri net and run it with various concentrations of the input and output species, to see if oscillatory or chaotic behavior kicks in when we go far from equilibrium.</p>",
        "id": 286546193,
        "sender_full_name": "John Baez",
        "timestamp": 1655502064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  I loved Prigogine's <strong>From Being to Becoming</strong>. Could you amplify on which of Prigogine's ideas you are interested in?</p>",
        "id": 286632750,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1655532575
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> I think John was thinking of Prigogine's following observation.</p>\n<p>Scenario A.  imagine a lump of metal, insulated from the world.  <br>\nScenario B.  imagine a bar of metal, insulated from the world except for its two ends.  The left end is hooked up to a constant-temp cold sink; the right end, to a constant-temp heat source.</p>\n<p>A's lump reaches a boring steady state: constant temperature and no internal heat flow.<br>\nB's bar reaches a boring steady state: constant gradient of temperature and heat flow thru time.</p>\n<p>Experiments in thermodynamics and theory in statistical mechanics establish that A is a good mental model for systems closed off from the world: such systems almost always converge to boring steady states.</p>\n<p>Is B likewise a good mental model for systems that are nearly closed save for contacts with static reservoirs (reservoirs that are out of equilibrium from each other)?  <strong>No!</strong>  B's convergence to a boring steady state is misleadingly simple. An idealized steam engine is another example of a system that mediates between a constant-temp hot place (coal furnace) and a constant-temp cold place (the outside air) while displaying perpetual non-steady-state behavior.  This is Prigogine's observation that I think John had in mind.  Prigogine made a life's study out of analogues in chemistry, especially with \"(inverse) temperature\" replaced by \"chemical potential\".</p>",
        "id": 286662717,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1655574682
    },
    {
        "content": "<p>The ideas of Prigogine that I'm interested in are nicely explained here:</p>\n<ul>\n<li>Prigogine and Kondepudi, <em>Modern Thermodynamics: From Heat Engines to Dissipative Structures</em>, <a href=\"/user_uploads/21317/z53ObmpqUzB-EY8RVKUhAq2p/ch19.pdf\">Chapter 19</a>.</li>\n</ul>\n<p>In equations 19.3-19.5 they give an example of a chemical reaction network which approaches a unique equilibrium state when treated as a closed system, but does not when treated as an open system (where 2 chemicals are pumped in and one is removed).    </p>\n<p>The book actually has many examples of this.</p>",
        "id": 286675703,
        "sender_full_name": "John Baez",
        "timestamp": 1655593906
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"386469\">@Wilmer Leal</span> <span class=\"user-mention\" data-user-id=\"302073\">@Kris Brown</span> Earlier (in group DM), John said:<br>\n<code>We should probably talk here a bit about what we're going to talk about on Wednesday, since there are too many possible subjects.  ... We might try to imagine the \"minimal exciting project\" - the easiest thing we could do that would yield an interesting result.</code><br>\nWhat are your thoughts on what to discuss on Wednesday?</p>",
        "id": 286751671,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1655702819
    },
    {
        "content": "<p>It looks like our choice of topics to work on has not narrowed down, but rather broadened out, even given the \"minimal exciting project\" constraint.</p>",
        "id": 286829486,
        "sender_full_name": "John Baez",
        "timestamp": 1655751535
    },
    {
        "content": "<p>So, since we didn't converge on something yet - and Wilmer and Kris haven't said much yet - we should try as hard as we can <em>now</em>.  But I expect we'll still be floundering around by Wednesday.</p>",
        "id": 286829682,
        "sender_full_name": "John Baez",
        "timestamp": 1655751657
    }
]