[
    {
        "content": "<p>This is for people who want to talk about category theory in chemistry... especially John Baez's students at the American Mathematical Society <a href=\"http://iz3.me/xQBb6zJit6K1\">mathematical research community on applied category theory</a>, but also anyone else.</p>",
        "id": 279937773,
        "sender_full_name": "John Baez",
        "timestamp": 1650736412
    },
    {
        "content": "<p>Howdy! My name is Jordy Lopez Garcia, and I am a PhD student at Texas A&amp;M :). I will take part in the AMS MRC on Applied Category Theory in Chemistry. Nice to meet you =)</p>",
        "id": 279960471,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650772642
    },
    {
        "content": "<p>Hi!  You're the first one here!</p>",
        "id": 279960484,
        "sender_full_name": "John Baez",
        "timestamp": 1650772676
    },
    {
        "content": "<p>So you're working with Kate Ponto on 2-traces.  Was she at the University of Chicago back when she was working with Mike Shulman on 2-traces?  I first met him when he was a grad student with Peter May there, and I think he was interested in these ideas back then.</p>",
        "id": 279960735,
        "sender_full_name": "John Baez",
        "timestamp": 1650773019
    },
    {
        "content": "<p>I see now that Kate has recently written about <a href=\"https://arxiv.org/abs/2203.04351\">Riemann-Roch theorems in monoidal 2-categories</a>.  This looks really interesting because I've been trying to understand the Riemann-Roch theorem, preferably in a somewhat abstract way.</p>",
        "id": 279960802,
        "sender_full_name": "John Baez",
        "timestamp": 1650773107
    },
    {
        "content": "<p>Oh, sorry that is someone else <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> . I work with Frank Sottile, and am an assistant to Anne Shiu for the upcoming MSRI UP program using chemical reaction networks  <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> . However, I did take a tensor categories class with Eric Rowell :).</p>",
        "id": 279960863,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650773204
    },
    {
        "content": "<p>Aargh! I was just looking at Jordan Sawdy's file.  It's really good that I made that mistake, though, because it gave me a possibly big clue in solving a mystery I've been struggling with.</p>",
        "id": 279960998,
        "sender_full_name": "John Baez",
        "timestamp": 1650773520
    },
    {
        "content": "<p>Glad it helped <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 279961045,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650773573
    },
    {
        "content": "<p>I know a bit of Anne Shiu's work on chemical reaction networks, particularly an older paper she helped write about <a href=\"https://arxiv.org/abs/0708.3431\">toric dynamcal systems</a>.  She invited me to a workshop once that I couldn't attend.</p>",
        "id": 279961056,
        "sender_full_name": "John Baez",
        "timestamp": 1650773624
    },
    {
        "content": "<p>Ahh I see! Yeah she is great <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>, maybe in the future you all will meet :)!!</p>",
        "id": 279961110,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650773716
    },
    {
        "content": "<p>So I remember now that in your file you said... well, I'll just quote it: \" I am taking the seminar course Mathematical Biology under Prof. Anne Shiu. In such course, we explore topics such as infectious-disease modeling, biochemical reaction networks and neural codes; additionally, each participant will write an expository or research paper about a math bio topic and give it as a presentation at the end of the semester.\"</p>",
        "id": 279961124,
        "sender_full_name": "John Baez",
        "timestamp": 1650773757
    },
    {
        "content": "<p>So are you doing that now?</p>",
        "id": 279961165,
        "sender_full_name": "John Baez",
        "timestamp": 1650773782
    },
    {
        "content": "<p>Knowing some stuff about chemical reaction networks will be great, and it's even better if you did a bit of infectious disease modeling, because as I mentioned in my email there's an interesting overlap in these topics that a bunch of us are exploring now.</p>",
        "id": 279961251,
        "sender_full_name": "John Baez",
        "timestamp": 1650773982
    },
    {
        "content": "<p>Yeah! And actually, as exposition I am learning your paper with Blake Pollard :)!  We have surveyed a couple of books such as Murray's Mathematical Biology book, and Sturmfels' and Patcher's Algebraic Statistics  for Computational Biology. I think we're getting to infectious disease modeling soon :D</p>",
        "id": 279961468,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650774427
    },
    {
        "content": "<p>Oh yes we went through chemical reaction networks already <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 279961521,
        "sender_full_name": "Jordy Lopez Garcia",
        "timestamp": 1650774525
    },
    {
        "content": "<p>Great!</p>",
        "id": 279961711,
        "sender_full_name": "John Baez",
        "timestamp": 1650774916
    },
    {
        "content": "<p>Hi, I'm Ben (a postdoc at TU Eindhoven) nice to meet you all! <br>\nI had a read through the paper on open reaction networks and I thought it was great (also the category of Semi Algerbaic relations was new to me and I thought it was a really neat way of doing 'black boxing'!) <br>\nI'm about to supervise a student now, so I can't write much, but I just thought I'd say hi for now and mention that I'll join you in the zoom call tomorrow; have a great day!</p>",
        "id": 280041004,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1650876935
    },
    {
        "content": "<p>Hi! I'm Pablo Ocal, a postdoc at UCLA, nice to meet y'all! I'll also be a part of the chemistry group at this year's MRC on Applied Category Theory, I'm very much looking forward to it!</p>",
        "id": 280110688,
        "sender_full_name": "Pablo S. Ocal",
        "timestamp": 1650911723
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"481356\">@Benjamin Merlin Bumpus</span> and <span class=\"user-mention\" data-user-id=\"496769\">@Pablo S. Ocal</span>!</p>",
        "id": 280112198,
        "sender_full_name": "John Baez",
        "timestamp": 1650912494
    },
    {
        "content": "<p>Hello everyone. I hope to join you tomorrow for the zoom meeting.</p>",
        "id": 280112413,
        "sender_full_name": "Amit Kumar",
        "timestamp": 1650912618
    },
    {
        "content": "<p>So Benjamin - from your application it sounds like you might be interested in studying \"nice\" ways to chop up a graph into pieces?  Is that at all close?   You say you've worked on \"treewidth\", but unfortunately I don't know what that is.</p>",
        "id": 280112508,
        "sender_full_name": "John Baez",
        "timestamp": 1650912671
    },
    {
        "content": "<p>And Pablo - it sounds like you're working on fusion categories!    I used to work on TQFT so I still have some memories of these.  And indeed they inspired my current approach to chemistry: we'll be using (symmetric) monoidal categories where the morphisms are drawn as diagrams, like this:</p>\n<p><a href=\"/user_uploads/21317/QBGWKA2xZzUCXCGlH-MadJMi/petri_net_example_open.png\">an open Petri net</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/QBGWKA2xZzUCXCGlH-MadJMi/petri_net_example_open.png\" title=\"an open Petri net\"><img src=\"/user_uploads/21317/QBGWKA2xZzUCXCGlH-MadJMi/petri_net_example_open.png\"></a></div>",
        "id": 280113883,
        "sender_full_name": "John Baez",
        "timestamp": 1650913293
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"496763\">@Amit Kumar</span>!   I see you're working on \"pre-foams\", which sound like something inspired by Khovanov homology.  I have no idea how those ideas interact with Legendrian surfaces, and I don't know what the SYZ conjecture is.  Maybe sometime you can tell me.</p>",
        "id": 280114133,
        "sender_full_name": "John Baez",
        "timestamp": 1650913427
    },
    {
        "content": "<p>My student Aaron Lauda - actually an <em>undergraduate</em> here at U. C. Riverside who got a masters in physics while working with me on categorification - wound up getting a postdoc with Khovanov and doing a lot of stuff with him.  But that's my main point of contact with Khovanov homology and the like.   Once upon a time I was really interested in such ideas.  Indeed the <a href=\"https://math.ucr.edu/home/baez/week1.html\">very first issue of my column This Week's Finds</a> was about invariants of knotted surfaces in <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mi mathvariant=\"double-struck\">R</mi><mn>4</mn></msup></mrow><annotation encoding=\"application/x-tex\">\\mathbb{R}^4</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141em;\"></span><span class=\"mord\"><span class=\"mord mathbb\">R</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">4</span></span></span></span></span></span></span></span></span></span></span>.  But by the time people got around to actually understanding much about such invariants, I had gotten pulled into other things.</p>",
        "id": 280115356,
        "sender_full_name": "John Baez",
        "timestamp": 1650914026
    },
    {
        "content": "<p>Hi all, I'm Evan. I'm a research scientist at Topos Institute, where I do a mix of math and programming related to applied category theory. Looking forward to meeting you all!</p>",
        "id": 280123258,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1650917962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Yes, that's right! I very much enjoy the graphical calculus of monoidal categories, I find it an incredible tool, and it was one of the reasons why I got interested in categorical applications to chemistry. I'm vaguely familiar with Petri nets and their applications to describe reactions and biochemical coupling. In fact, one of the questions that I would like to dig a bit into is whether Petri nets are useful/have been used to model redox reactions.</p>",
        "id": 280123376,
        "sender_full_name": "Pablo S. Ocal",
        "timestamp": 1650918018
    },
    {
        "content": "<p>I don't know enough about redox reactions!</p>\n<p>Petri nets and \"reaction networks\" (more commonly used by chemists) are mathematically interchangeable, and my <a href=\"http://math.ucr.edu/home/baez/RxNet.pdf\">paper with Blake</a> briefly explains how.   For technical reasons Petri nets are better for being the morphisms of a category.   But if redox reactions can be described by chemical reaction networks (and I bet they can), they can also be described by Petri nets.</p>",
        "id": 280124097,
        "sender_full_name": "John Baez",
        "timestamp": 1650918430
    },
    {
        "content": "<p>Why do you like redox reactions in particular?</p>",
        "id": 280124150,
        "sender_full_name": "John Baez",
        "timestamp": 1650918460
    },
    {
        "content": "<p>Because they show up everywhere! During my undergraduate I used to like playing with physical systems, and almost every experiment had some redox reaction going on in the background (the one that I remember the most was dealing with an old car battery, we had to explain empirically how it worked but it had a leak and our measurements never matched our predictions). Also, redox is necessary for both cellular respiration and photosynthesis, and I've always liked that phrase \"the mitochondria is the powerhouse of the cell\".</p>",
        "id": 280125783,
        "sender_full_name": "Pablo S. Ocal",
        "timestamp": 1650919251
    },
    {
        "content": "<p>I'm sure it has plenty more embodiments that I ignore. It just seems a really important type of reaction that would be fun to look at.</p>",
        "id": 280125915,
        "sender_full_name": "Pablo S. Ocal",
        "timestamp": 1650919309
    },
    {
        "content": "<p>Okay, that makes sense.  Being a mathematician, I now want to figure out a <em>mathematical</em> description of what counts as a redox reaction.   And I immediately see something interesting: people think of them as <a href=\"https://en.wikipedia.org/wiki/Redox#Examples_of_redox_reactions\">composed of two separate \"half-reactions\", the oxidation and the reduction reaction</a>.   I should start by making sure I understand what \"composed of\" means here, since I'm supposed to know a lot about \"composing\" Petri nets.</p>",
        "id": 280138998,
        "sender_full_name": "John Baez",
        "timestamp": 1650926460
    },
    {
        "content": "<p>Hi, I'm Kris - although I'm currently working as a postdoc to apply category theory towards scientific software, my PhD was in computational chemistry (modeling metal surfaces catalyzing things like water splitting / ammonia synthesis / CO2 reduction) and we often needed to solve  for steady states of chemical reaction networks, so this is an exciting project!</p>",
        "id": 280145477,
        "sender_full_name": "Kris Brown",
        "timestamp": 1650930993
    },
    {
        "content": "<p>Hi, Kris!   Great to see you!   We certainly can use people who actually know chemistry.  It seems you are the only one whose CV involves chemistry.</p>",
        "id": 280147378,
        "sender_full_name": "John Baez",
        "timestamp": 1650932615
    },
    {
        "content": "<p>I hope to see all of you, and other people too, on Zoom tomorrow at noon Pacific Daylight Time:</p>\n<p><a href=\"https://ucr.zoom.us/j/7727771354\">https://ucr.zoom.us/j/7727771354</a></p>",
        "id": 280147476,
        "sender_full_name": "John Baez",
        "timestamp": 1650932704
    },
    {
        "content": "<p>Since it could be hard to get everyone together at the same time, I'm planning to have a number of these meetings.  We can get to know each other, and I can explain some ideas, and we can brainstorm a bit.</p>",
        "id": 280147584,
        "sender_full_name": "John Baez",
        "timestamp": 1650932795
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/322714-practice.3A-chemistry/topic/welcome!/near/280112508\">said</a>:</p>\n<blockquote>\n<p>So Benjamin - from your application it sounds like you might be interested in studying \"nice\" ways to chop up a graph into pieces?  Is that at all close?   You say you've worked on \"treewidth\", but unfortunately I don't know what that is.</p>\n</blockquote>\n<p>Hi John. Yes that's a good way of thinking of it. The idea is that you want to find a sequence of 'nested' cuts in a graph which chop the graph into pieces is a 'best possible way'. </p>\n<p>Maybe a good way of getting a feel for tree-width is to just mention some applications -- se below. </p>\n<p>For structural applications, tree decompositions give us a way of `chopping graphs up' which is very useful for proving things about graph minors, connectivity and a huge host of other things; for example see Wagner's conjecture (now a theorem).</p>\n<p>For algorithmic applications, one uses tree decompositions to solve problems recursively: the idea is that you brute-force a solution to your problem (often an NP-hard one) on the little pieces of your decomposition  and then you find a good way of joining solutions up over all the pieces to get a solution on the whole. Roughly, if the biggest 'piece' in your decomposition is of size k, then you often get running times of the form f(k) |G|    (f is allowed to be anything computable). The cool thing is that, for fixed k, this is a <em>linear time</em> algorithm (even if the problem you started with is NP-hard).  </p>\n<p>Anyway, I could go on all day about this, so maybe I'll stop here for now :)</p>\n<p>(also - and this goes for everyone -- feel free to just call me Ben <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span>  )</p>",
        "id": 280178872,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1650963143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"496769\">Pablo S. Ocal</span> <a href=\"#narrow/stream/322714-practice.3A-chemistry/topic/welcome!/near/280123376\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> Yes, that's right! I very much enjoy the graphical calculus of monoidal categories, I find it an incredible tool, and it was one of the reasons why I got interested in categorical applications to chemistry. I'm vaguely familiar with Petri nets and their applications to describe reactions and biochemical coupling. In fact, one of the questions that I would like to dig a bit into is whether Petri nets are useful/have been used to model redox reactions.</p>\n</blockquote>\n<p>Redox reactions sound cool indeed. In a past life, I understood them a little, but i've now forgotten most of it. Why do you expect these reactions to look (as networks, I mean) fundamentally different from other kinds of reactions? So far as my very rusty memory serves me, can't redox reactions be arbitrarily complicated; for example -- and I might be horribly wrong here --  isn't photosynthesis a redox? <br>\n... looks like I have to go dust my old chemistry books off :)</p>\n<p>Having said this, though, maybe I see the point already: reactions like photosynthesis might be precisely the kind of reaction that we might want to study since photosynthesis <em>needs</em> to be modelled as an open system (since you need light as a reactant?)</p>",
        "id": 280180050,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1650963776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Yes sir. That connection is new and everyone gets fascinated (including Mikhail himself). You would love to hear that.</p>",
        "id": 280237044,
        "sender_full_name": "Amit Kumar",
        "timestamp": 1650991466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <br>\nYou mentioned 'stock-flow diagrams' as a notion which subsumes petri nets; is there a simple description of how the two differ (or do you have paper recommendations  on this topic?)</p>",
        "id": 280264735,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1651003436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"481356\">@Benjamin Merlin Bumpus</span> - I'm writing a paper on stock-flow diagrams with <span class=\"user-mention\" data-user-id=\"276589\">@Sophie Libkind</span>, <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span>, <span class=\"user-mention\" data-user-id=\"318832\">@Nathaniel Osgood</span> and @*<em>Xiaoyan Li</em>, which needs to be finished before May 9th to submit to the conference ACT2022.  This will give a mathematical intro to stock-flow diagrams... so if you can wait for 2 weeks I'll show you that.   </p>\n<p>For now you could try <a href=\"https://www.youtube.com/watch?v=7ghWWbL-VvY\">this video</a>.   It's a bit slow for me; stock and flow diagrams make a somewhat formal appearance at 36:00, and maybe you could start there.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"7ghWWbL-VvY\" href=\"https://www.youtube.com/watch?v=7ghWWbL-VvY\"><img src=\"https://uploads.zulipusercontent.net/85c291fa756d9200d910d4c006b4efed51655316/68747470733a2f2f692e7974696d672e636f6d2f76692f3767685757624c2d5676592f64656661756c742e6a7067\"></a></div>",
        "id": 280272385,
        "sender_full_name": "John Baez",
        "timestamp": 1651007214
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> - Thanks for the info! I look forward to reading the paper when it's ready :)</p>",
        "id": 280317196,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1651047349
    },
    {
        "content": "<p>so I don't get it, \"let's keep it this way\" how? Am I allowed to have my stream \"practice: computing dialectica\" or not? If yes, I will move/delete my welcoming message.</p>",
        "id": 280379008,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651078614
    },
    {
        "content": "<p>I think he meant yes, you should have a stream \"practice: computing dialectica\".    That's the only way your group can have lots of different conversations (\"topics\") in that stream, and find them rather easily.</p>",
        "id": 280388545,
        "sender_full_name": "John Baez",
        "timestamp": 1651082682
    },
    {
        "content": "<p>At least this is my opinion... and I'm a moderator too!</p>",
        "id": 280388567,
        "sender_full_name": "John Baez",
        "timestamp": 1651082699
    },
    {
        "content": "<p>Hello! I'm Sophie and I'm the TA for this group. </p>\n<p>Some facts about me: I'm a 4th year PhD student at Stanford and I work on what I slogan as <em>How continuous dynamical systems compute?</em> I am also a research affiliate at Topos Institute through which I have gotten to know John and a few other folks in this group. At Topos I have been working on a package called AlgebraicDynamics which implements operad algebras for dynamical systems and also applying it to different fields. John linked to many parts of this work in his welcome email and in the thread above.  At Topos I've also been thinking about responsive cohesion in dynamical systems. </p>\n<p>Another practical fact about me: In new spaces, I'm often a little quiet at first. I really love to hang out (as people and as people doing math) and sometimes it takes a little time for me to warm up!</p>\n<p>Really looking forward to the MRC week and everything around it!</p>",
        "id": 280394888,
        "sender_full_name": "Sophie Libkind",
        "timestamp": 1651085649
    },
    {
        "content": "<p>Hi, Sophie!  We have about 10 people come to the first meeting, and we basically went through a list of things we might do (which you've seen in your email earlier) and went around saying a bit about ourselves and what we are interested in doing for this MRC.   We have a lot of good people.</p>",
        "id": 280401320,
        "sender_full_name": "John Baez",
        "timestamp": 1651088626
    },
    {
        "content": "<p>I will try to have a meeting each week, to help us focus on a few projects before we actually meet at the end of May.</p>",
        "id": 280401450,
        "sender_full_name": "John Baez",
        "timestamp": 1651088693
    },
    {
        "content": "<p>That's great! I'm looking forward to the next meeting!</p>",
        "id": 280510555,
        "sender_full_name": "Sophie Libkind",
        "timestamp": 1651159442
    },
    {
        "content": "<p>Hi all, I'm Brandon and I'm a postdoc at Topos Institute. I'm interested in lots of different aspects of category theory, and recently I've been focusing on how some ideas from not-too-higher category theory can help model systems in the real world. I've always been curious about how category theory relates to chemistry and I'm really excited to work with yall on it. I really regret that I couldn't make it to the first meeting but I'm looking forward to the next one!</p>",
        "id": 280539402,
        "sender_full_name": "Brandon Shapiro",
        "timestamp": 1651171894
    },
    {
        "content": "<p>Hey there, Brandon!   I'm hoping that next Tuesday at the same time, noon Pacific Daylight Time, will work for a bunch of people.  In fact I'll send out an email now.</p>",
        "id": 280539810,
        "sender_full_name": "John Baez",
        "timestamp": 1651172085
    },
    {
        "content": "<p>Great, works for me!</p>",
        "id": 280540106,
        "sender_full_name": "Brandon Shapiro",
        "timestamp": 1651172239
    },
    {
        "content": "<p>Hallo!  I'm Sam; I do statistical learning theory at MIT but have maintained an interest in category theory since undergrad.  I've been looking for to expand the sorts of things I think about along new, intellectually stimulating lines, especially after covid isolation, and my mathematician friend Karl suggested I join this community!  Excited to think about reaction networks with y'all <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 280577313,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1651196729
    },
    {
        "content": "<p>Hi!    (More later, it's almost dinner time.)</p>",
        "id": 280581238,
        "sender_full_name": "John Baez",
        "timestamp": 1651201710
    },
    {
        "content": "<p>I'm wondering: what are some of the more concrete questions you network experts have in mind for study?  <br>\nE.g.:<br>\n-- are there sentences of the form: \"There is a monoidal functor F from ABC to XYZ and we define it like...\" that would be nice to show for known ABC, XYZ?<br>\n-- or perhaps: what are some major kinds of networks chemists or physicists care about that are not yet subsumed by --- or enjoy structure not yet modeled within --- the categories mentioned in the three \"background\" slide presentations from John's Apr 23 email? <br>\n-- A key sort of graph that occurs in my field is that of directed and undirected probabilistic graphical models.  I wonder how to think about these from a functorial/networks point of view?  Here, there are subtle-but-codifiable composition rules dealing with how random variables with various conditional-independence constraints can end up talking to each other.  A simple example: consider 3 events: (A) my friend hasn't replied to my texts; (B) they have flu-like symptoms; (C) the've stopped liking me.  (B) and (C) both \"cause\" or imply (A), in the sense that the joint probability distribution is supported on the set cut out by those logical implications.  We model (B) and (C) as statistically independent.  Yet if we condition on (A), an observation of (B) lessens the probability of (C) --- this is  \"explaining away\".  So here, even though in the causal graph B --&gt; A &lt;-- C, when we condition on the (A), B and C intuitively start \"talking to\" each other.   <br>\n-- I'm especially interested network viewpoints on global architectures in deep learning.  In deep learning, we often implicitly characterize a concept-to-be-learned by specifying how it should behave in composition with other concepts, then doing gradient descent.  I like to say that we build our tools by using them.  This relative viewpoint is how I understand many global architectural themes: autoencoders, cycle consistency losses, attention layers, siamese networks, contrastive losses.  A key example is self-supervised representation learning, wherein we learn to represent data by attempting to predict some of its “parts” or “aspects” from others.  Might these sorts of topics fall within the scope of our networks mrc?</p>",
        "id": 280581960,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1651202617
    },
    {
        "content": "<p>I listed a pile of specific questions in our first meeting.   Let me list them again here.</p>",
        "id": 280586309,
        "sender_full_name": "John Baez",
        "timestamp": 1651207737
    },
    {
        "content": "<p>Actually I'll do it in a comment called \"problems to work on\".</p>",
        "id": 280586320,
        "sender_full_name": "John Baez",
        "timestamp": 1651207764
    },
    {
        "content": "<p>Hi everyone, I'm Wilmer. I met several of you at our last meeting and I look forward to meeting the rest of you at our meeting today!</p>\n<p>I am a doctoral student in computer science at the University of Leipzig and the Max Planck Institute for Mathematics in the Sciences in Germany.</p>\n<p>I do research in mathematics and programming applied to chemical reactions networks. I have been mainly investigating geometric aspects of networks but recently (with Elena di Lavore &amp; Valeria de Paiva) started to explore categorical constructions of Petri nets. I hope to discover with you may more flavors of compositionality in chemistry.</p>",
        "id": 281037257,
        "sender_full_name": "Wilmer Leal",
        "timestamp": 1651594397
    },
    {
        "content": "<p>I can't find the paper.</p>",
        "id": 284052985,
        "sender_full_name": "Amit Kumar",
        "timestamp": 1653594837
    },
    {
        "content": "<p>It's in <a href=\"#narrow/stream/322714-practice.3A-chemistry/topic/problems.20to.20work.20on\">this thread</a>.</p>",
        "id": 284053429,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1653595056
    },
    {
        "content": "<p>Some time back I was listening a lecture on behavioral science from a Stanford biologist (don 't remember his name) who, referring to the book Chaos by John Gleick, mentioned that how this principal of decomposing things in small simpler parts to study a complex problem often fails in Biology. I wanted to draw attention towards this regarding today's discussion. I believe Dr Baez and other people should have better idea about this. My apology, but this lecture came to my mind when we started discussing about decomposing big chemical networks.</p>",
        "id": 284058620,
        "sender_full_name": "Amit Kumar",
        "timestamp": 1653597760
    },
    {
        "content": "<p>I think that's a true fact, Amit: when we try to understand the chemical reaction network of a cell, for example, we want to decompose it into smaller reaction networks that \"perform different functions\" - but this may be more about how we understand things than about what the cell is \"really doing\".</p>",
        "id": 284059031,
        "sender_full_name": "John Baez",
        "timestamp": 1653597960
    },
    {
        "content": "<p>Very often, the more we study a system in biology, the more complexity we find.</p>",
        "id": 284059103,
        "sender_full_name": "John Baez",
        "timestamp": 1653597992
    }
]