[
    {
        "content": "<ol>\n<li>The first proposition in the Poly book, page 13, states:</li>\n</ol>\n<p>Proposition1.20. Poly has all products and coproducts and is completely distributive. Poly also has exponential objects, making it a bicartesian closed category. It therefore supports the simply typed lambda calculus.</p>\n<p>Can you state a corresponding proposition for the dialectica categories and prove it with the material already at your disposal?</p>",
        "id": 284362506,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1653914662
    },
    {
        "content": "<p>my answer would be<br>\nProposition1: LDial has all products and coproducts and is completely distributive. LDial also has exponential objects, making it a symmetric monoidal closed category. It therefore supports the simply typed linear lambda calculus.<br>\nProposition2: Dial has all products and  weak coproducts and is completely distributive. Dial also has exponential objects, making it a symmetric monoidal closed category. It therefore supports the simply typed linear lambda calculus.</p>",
        "id": 284539901,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654032733
    },
    {
        "content": "<ol start=\"2\">\n<li>The second proposition in the Poly book, page 14, states:<br>\nProposition1.21. Beyond the cocartesian and cartesian monoidal structures (0,+)and (1, ×), the category Poly has two additional monoidal structures, denoted (y, ⊗) and (y, ◦), which are together duoidal. Moreover ⊗ is a closed monoidal structure that distributes over coproducts, while ◦ is a left coclosed monoidal structure that preserves connected limits.</li>\n</ol>\n<p>What is the dialectica corresponding proposition?</p>\n<ol start=\"3\">\n<li>Similar kind of question for:<br>\nProposition 1.26. The forgetful functor 𝑈 : Comon(Poly) → Poly has a right adjoint<br>\ncalled the cofree comonoid construction. It is lax monoidal with respect to ⊗.</li>\n</ol>",
        "id": 284551056,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654040690
    },
    {
        "content": "<p>Answering puzzle 2:<br>\nProposition3. Beyond the cocartesian and cartesian monoidal structures (0,+) and (1, ×), the category LDial has two additional monoidal structures, denoted (I, ⊗) and (I, cross-product), which are together duoidal. Moreover ⊗ is a closed monoidal structure that distributes over coproducts.<br>\n(I don't know about connected limits)</p>",
        "id": 284777524,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654190798
    },
    {
        "content": "<p>puzzle 4. the proposition corresponding to</p>\n<blockquote>\n<p>Proposition 1.25. The category Comon(Poly) has finite coproducts and products, and<br>\ncoproducts in Comon(Poly) agree with those in Cat.</p>\n</blockquote>",
        "id": 284781662,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654192785
    },
    {
        "content": "<p>answering puzzle 3: <br>\nProposition 4. The forgetful functor 𝑈 : Comon_\\otimes(Dial) → Dial has a right adjoint<br>\ncalled the cofree comonoid construction. It is monoidal with respect to ⊗.<br>\n(this is the main theorem of chapter 2 of the thesis)</p>",
        "id": 284825433,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654219949
    },
    {
        "content": "<p>extra puzzle: the Dialectica  construction has a logical interpretation in terms of Godel's Dialectica interpretation, which provides a proof of consistency of arithmetic,  a modified form of Hilbert's program. Can we find a logical interpretation of the polynomial construction?</p>",
        "id": 284830674,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654225339
    },
    {
        "content": "<p>puzzle 5: What's the corresponding Dialectica proposition to<br>\nProposition 1.28. For any polynomial 𝑝, the category Sys(𝑝) \\cong [T𝑝 , Set]<br>\nof dynamical systems on 𝑝 forms a topos</p>",
        "id": 284889682,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654268167
    },
    {
        "content": "<p>Answering puzzle 4: <br>\nProposition 5. The category Comon(LDial) has finite coproducts and products.</p>",
        "id": 284890212,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654268410
    },
    {
        "content": "<p>Writing the answers to the puzzles with the corresponding details would be a nice paper, as the area is very scattered and with very different  notations. this could be one output of the whole Dialectica Team, what do you think? </p>\n<p>it's not extremely exciting, as it is systematization of what's known--so a bit like covering one of the edges of Bruno's proposed cube. </p>\n<p>but it will be useful for people writing their  own subgroups papers and it will make easier the lives of people trying to get into the area</p>",
        "id": 284891242,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654268865
    },
    {
        "content": "<p>Puzzle 5 is a little hard to answer, as in page 285 of the Poly book, theorem 7.53 we're told that the proof is based in \"Beck’s monadicity theorem via a straightforward generalization of an argument given by Paré in [Par69, pp. 138-9], as pointed out by Porst in [Por19, Fact 3.1].\"  This seems on the face of it very generic and maybe we can have<br>\nProposition 6. For any A in Dial, the category Sys(A) \\cong [T_A , Set]<br>\nbut I am not sure.</p>",
        "id": 285444485,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654717899
    }
]