[
    {
        "content": "<p>A category is to a finite limits theory (aka, an <a href=\"https://ncatlab.org/nlab/show/essentially+algebraic+theory\">essentially algebraic theory</a>) as a 2-category is to... what?</p>\n<p>I want to be able to say \"essentially algebraic 2-theory,\" but if I say that, I should know what it actually means.</p>\n<p>Here's a more specific question, which might be better posed: if the theory of a category is a finite limits theory, then the theory of a pseudo-category is... what kind of theory?</p>",
        "id": 282865910,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1652919036
    },
    {
        "content": "<p>pseudo-category?</p>",
        "id": 282931587,
        "sender_full_name": "fosco",
        "timestamp": 1652968408
    },
    {
        "content": "<p>A <a href=\"https://arxiv.org/abs/math/0604549\">pseudo-category</a> is like a category except that associativity and unitality hold only up to invertible 2-cells. You can consider pseudo-category objects in any 2-category with 2-pullbacks. The most important example seems to be pseudo-categories in Cat, which are <a href=\"https://ncatlab.org/nlab/show/double+category#pseudo_double_categories\">pseudo double categories</a>.</p>",
        "id": 282967831,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1652982856
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275965\">Evan Patterson</span> <a href=\"#narrow/stream/233104-theory.3A-logic/topic/2-dimensional.20essentially.20algebraic.20theories/near/282865910\">said</a>:</p>\n<blockquote>\n<p>A category is to a finite limits theory (aka, an <a href=\"https://ncatlab.org/nlab/show/essentially+algebraic+theory\">essentially algebraic theory</a>) as a 2-category is to... what?</p>\n<p>I want to be able to say \"essentially algebraic 2-theory,\" but if I say that, I should know what it actually means.</p>\n<p>Here's a more specific question, which might be better posed: if the theory of a category is a finite limits theory, then the theory of a pseudo-category is... what kind of theory?</p>\n</blockquote>\n<p>The answer to both questions should be something like \"essentially algebraic 2-theory\" or \"2-limit sketch\", but as far as I'm aware, no such notion has been defined in the literature yet. I suspect, as with algebraic 2-theories, that one could modify the definition of essentially algebraic theory to have rewrites between terms rather than just equalities, but there would be many details (and theorems one would expect to hold) to check. The definition of 2-limit sketch is also subtle, not least because there are many kinds of 2-categorical limit one could consider (though I imagine in your case strict 2-limits would be appropriate).</p>",
        "id": 282970388,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1652984013
    },
    {
        "content": "<p>Thanks Nathanael. Yes, I think for my purposes strict 2-limits are enough. I'm a bit surprised nobody has worked through this in the literature, since it's the natural setting for higher categorical structures that people use a lot, such as (non-strict) monoidal categories, (pseudo) double categories, and monoidal double categories. I suppose one could forget about the syntactical aspects and define an \"essentially algebraic 2-theory\" to be a strict 2-category with finite strict 2-limits.</p>",
        "id": 282974432,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1652985938
    },
    {
        "content": "<p>There is Kelly's \"Structures defined by finite limits in the enriched context\".</p>",
        "id": 282975727,
        "sender_full_name": "Reid Barton",
        "timestamp": 1652986501
    },
    {
        "content": "<p>Thanks, that looks promising!</p>",
        "id": 282976378,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1652986780
    },
    {
        "content": "<p>Kelly's work, applied to Cat-enrichment, would give entirely strict notions.  But as usual in 2-category theory, one can probably access the weak notions using the strict ones, perhaps more conveniently than by using the weak notions throughout.  There appears to be a start on this in section 9 of Bourke's <a href=\"https://arxiv.org/abs/2003.06375\">Accessible aspects of 2-category theory</a>, which promises \"a followup paper on two-dimensional limit theories\".</p>\n<p>There's also been older work on <em>algebraic</em> 2-theories, e.g. Fiore's <a href=\"https://arxiv.org/abs/math/0408298\">Pseudo Limits, Biadjoints, and Pseudo Algebras</a>.  I feel like sometime in the past I heard someone give a talk about essentially algebraic 2-theories and locally presentable 2-categories, but can't remember who or when.</p>",
        "id": 282980317,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1652988647
    },
    {
        "content": "<p>Thanks for that elaboration, Mike. If I understand correctly, the Cat-enriched notion of finite limits theory can give the right objects (models) but only the strict morphisms, whereas Bourke's more refined notion also gives the right morphisms, which are the pseudo morphisms.</p>\n<p>As prior work, Bourke mentions Lack and Power's work on <a href=\"https://ncatlab.org/nlab/show/2-Lawvere+theory\">Lawvere 2-theories</a>.</p>",
        "id": 283000659,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1652999578
    },
    {
        "content": "<p>Yes, I think that's right.</p>",
        "id": 283022721,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1653020467
    },
    {
        "content": "<p>My paper with Osmond \"Bi-accessible and bipresentable 2-categories\" is very relevant to the discussion.</p>",
        "id": 283025297,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1653023816
    }
]