[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> i think you might want to check out these papers</p>\n<p><a href=\"https://arxiv.org/abs/1502.04770\" title=\"https://arxiv.org/abs/1502.04770\">a linear/producer/consumer model for classical linear logic</a> <a href=\"https://repository.upenn.edu/cis_reports/991/\" title=\"https://repository.upenn.edu/cis_reports/991/\">(technical report)</a></p>\n<p>lpc generalizes the linear-nonlinear adjoint presentation of multiplicative intuitionistic (and classical) linear logic by splitting the persistent mode into an intuitionistic producer (for !) and a cointuitionistic consumer (for ?), which allows them to be interpreted by more dual pairs of categories than a category and its own dual</p>\n<p><a href=\"https://arxiv.org/abs/1805.07518\" title=\"https://arxiv.org/abs/1805.07518\">linear logic for constructive mathematics</a></p>\n<p>classical linear (actually affine) logic has an involutive de morgan duality which trades the roles of proof and refutation. in intuitionism many concepts are bifurcated into two de morgan duals, like equality and apartness.</p>\n<p>a chu construction (Chu(H,0) where H is a heyting algebra) lets you interpret intuitionistic connectives into additives that bundle these dual definitions together (constructive proof and refutation), and classical connectives into multiplicatives that admit constructive proofs by contradiction (you can only use an assumption once, instead of several times with different values and not specifying which one is the witness)</p>\n<p>nelson logic is modeled by Chu(H, 1), and instead of being affine and requiring the underlying half-propositions p+ and p- = 0, it is mix</p>",
        "id": 197041611,
        "sender_full_name": "Pastel Raschke",
        "timestamp": 1589099123
    },
    {
        "content": "<p>Thanks for the pointers to help me get out of the very interesting rabbit hole I am in :-)<br>\nThat should help me slowly get back from making sure my basics of (co)Topoi are solid, to Abramski's Game Semantics for Linear Logic, and from there to <a href=\"https://twitter.com/bblfish/status/1229503709803143173\" title=\"https://twitter.com/bblfish/status/1229503709803143173\">session types</a> to analyze protocols on the web. <br>\n(I guess  the linearity comes in simply because games require the players to take turns, which is a linear phenomenon, and that is what knits the topoi and complement topoi together.)</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/bblfish/status/1229503709803143173\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1004326761608417281/HjxjS9BX_normal.jpg\"></a><p>I just found this very interesting talk relating Game Semantics and Session Types, as two ways to analyse protocols\n<a href=\"https://t.co/q8u1kbDQgl\" title=\"https://t.co/q8u1kbDQgl\">https://dl.acm.org/doi/abs/10.1145/3290340</a>\n<a href=\"https://t.co/c5BG8Dguik\" title=\"https://t.co/c5BG8Dguik\">https://www.youtube.com/watch?v=px38U3jsOLQ</a></p><span>- The 🐟‍‍ BabelFish (@bblfish)</span></div></div>",
        "id": 197042001,
        "sender_full_name": "Henry Story",
        "timestamp": 1589099568
    },
    {
        "content": "<p>mellies and mimram have done work on asynchronous games (innocence without alternation) which i have not yet read, and mellies has also done work on template games which is related to scheduling and synchronization</p>\n<p>i'm not sure how that gels with synchronous pi-calculus being more expressive than asynchronous pi-calculus. also, wen kokke has been working on hypersequent classical processes which reconciles the proof-process correspondence between classical linear logic and session-typed pi-calculus with delayed actions (non-blocking i/o)</p>",
        "id": 197044053,
        "sender_full_name": "Pastel Raschke",
        "timestamp": 1589102569
    },
    {
        "content": "<p>ah, that paper cites asynchronous games. also note concurrency is related to directed spaces and directed homotopy, which hopefully will result in some sort of directed homotopy type theory as an internal language of omega-topoi, whatever those are (currently higher topoi are mere (∞,1)-topoi)</p>",
        "id": 197044792,
        "sender_full_name": "Pastel Raschke",
        "timestamp": 1589103303
    }
]