[
    {
        "content": "<p>There are lots of papers on formalizing category theory in ZFC or NBG set theory, or ZFC+ some number of universes.<br>\nThere are also lots of papers on formalizing category theory in Coq, Lean or other dependent type theories.</p>\n<p>I am interested in what has been done theoretically regarding the possibility of carrying out the development of category theory in HOL, perhaps + extra axioms. HOL is a weaker logic than the calculus of constructions and dependent types are very natural for encoding category theory, so this is arguably an uphill battle, but I think the question is still interesting because automation in HOL leads automation in dependent type theory by a considerable margin at the moment. Reasoning in category theory is often very simple (equational reasoning is often all that is necessary for proving a diagram commutes) and so one would like to be able to take advantage of automation.</p>",
        "id": 324485106,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675023431
    },
    {
        "content": "<p>There are papers in the Isabelle/HOL archive of formal proofs. i have been reading the papers by Eugene Stark. it is very interesting but honestly his conception of a \"category of sets\" is utterly foreign to me, I am very taken aback. I am wondering if there has been much other theoretical work on this topic</p>",
        "id": 324485249,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675023519
    },
    {
        "content": "<p>Which paper has the unexpected definition of the category of sets?  The \"Types\" mailing list is probably a good place to ask this question.  <a href=\"https://lists.seas.upenn.edu/mailman/listinfo/types-list\">https://lists.seas.upenn.edu/mailman/listinfo/types-list</a></p>",
        "id": 324513964,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1675046158
    },
    {
        "content": "<p>Maybe not exactly what you are asking for, but this describes a development of some category theory in Isabelle/HOL: <a href=\"https://link.springer.com/chapter/10.1007/3-540-44755-5_11\">https://link.springer.com/chapter/10.1007/3-540-44755-5_11</a></p>",
        "id": 324788392,
        "sender_full_name": "Max New",
        "timestamp": 1675117199
    },
    {
        "content": "<p>Now I'm curious about what an utterly foreign concept of \"a category of sets\" could look like!</p>",
        "id": 324799419,
        "sender_full_name": "John Baez",
        "timestamp": 1675121945
    },
    {
        "content": "<p><a href=\"https://www.isa-afp.org/browser_info/current/AFP/Category3/outline.pdf\">https://www.isa-afp.org/browser_info/current/AFP/Category3/outline.pdf</a><br>\nChapters 9 and 10<br>\nFor any category S, the set of all terminal objects  in S are thought of as \"elements\", I do not know if these behave like urelements or if they can have nontrivial internal structure.<br>\nFix a distinguished terminal object 1.<br>\nThen we define, for each object X, a map from Hom(1, X) into the set of terminal objects of S, which sends each map a : 1 -&gt; X to the \"element\" that it picks out. The idea is for a nice enough \"category of sets\" S, every object can be uniquely recovered from its underlying \"set of elements\" - the set of terminal objects under this correspondence</p>",
        "id": 324810231,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675127686
    },
    {
        "content": "<p>That's a pretty nifty definition of a category of sets.  Using Hom(1, X) in Set to pick out the elements of X is not unusual, so it looks promising just at a glance.  Would it be too much to expect that if T is a terminal object in S, the map from Hom(1, T) to the terminal objects of S would pick out T?  I don't suppose this is necessary, but it probably could be done for convenience.  Ah.  Looks like this is addressed on pp. 62–63 on the pdf you linked, with roughly the conclusion I expected:</p>\n<blockquote>\n<p>The locale assumption <em>stable-img</em> forces t ∈ set t in case t is a terminal object. This is very convenient, as it results in the characterization of terminal objects as identities t for which set t = {t}. However, it is not absolutely necessary to have this.</p>\n</blockquote>\n<p>My first thought on how to make this definition appear more foreign (besides turning it into computer code, but given what stream this conversation is in, maybe that's me) is to take S to be a category with a unique terminal object (not just unique up to isomorphism), like <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mrow><mi mathvariant=\"normal\">S</mi><mi mathvariant=\"normal\">e</mi><mi mathvariant=\"normal\">t</mi></mrow><mrow><mi mathvariant=\"normal\">o</mi><mi mathvariant=\"normal\">p</mi></mrow></msup></mrow><annotation encoding=\"application/x-tex\">\\mathrm{Set}^{\\mathrm{op}}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7376em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathrm\">Set</span></span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.7376em;\"><span style=\"top:-3.1362em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathrm mtight\">op</span></span></span></span></span></span></span></span></span></span></span></span></span>.  Glossing along as best I can on the linked pdf, it seems like that would be the context for a set theory where there is only one element and thus only one non-empty set.  This situation also gets a mention (on p. 75) in the pdf as \"the case of a degenerate universe with only a single element.\"</p>\n<p>The pdf at least indirectly mentions another \"perverse\" sort of situation that can happen that I didn't think of:</p>\n<blockquote>\n<p>We call a set category <em>replete</em> if there is an object corresponding to every subset of the universe.</p>\n</blockquote>\n<p>So a set category that is not replete would have sets that don't have objects of S to represent them.</p>",
        "id": 324831328,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1675143493
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/233104-theory.3A-logic/topic/Formalizing.20category.20theory.20in.20HOL/near/324831328\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>We call a set category <em>replete</em> if there is an object corresponding to every subset of the universe.</p>\n</blockquote>\n<p>So a set category that is not replete would have sets that don't have objects of S to represent them.</p>\n</blockquote>\n<p>For my intuition, this seems to be the less perverse case, if we think of the collection of all terminal objects as forming the elements of which all sets are composed, then it seems reasonable that many collections may be \"proper classes\", i.e. not small sets. If the objects represent small sets then I would think not all collections can be represented as objects.</p>\n<p>So for a replete category presumably it does not have an internal notion of powerset /power-object in general, else what would represent the power-object of the object containing all terminal objects?</p>\n<p>Of course not all constructions of set theory are necessary to do basic elementwise reasoning, so this is fine.</p>",
        "id": 325056150,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675217399
    },
    {
        "content": "<p>He constructs these categories of sets in an ad-hoc local way, corresponding to the problem that needs to be solved. So given two categories C and D and functors F : C -&gt; D and G : D-&gt; C he constructs a category of sets in some sense generated by |C| \\coprod |D| so that he can formulate what it means for F and G to be adjoint. I have not read this portion yet so I don't know how he does this freely generating a category of sets from a given set.</p>",
        "id": 325056528,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675217701
    },
    {
        "content": "<p>When I said it was foreign I mostly meant the extensionality principle of interpreting one object as directly representing a collection of other objects,  it's not a categorical definition imo. Also fine but feels strange.</p>",
        "id": 325056859,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675217964
    }
]