[
    {
        "content": "<p>Do we have a framework which gives a definition of what is a categorical doctrine / a logic and is able to explain what it means for such a system to have cut elimination (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>≈</mo></mrow><annotation encoding=\"application/x-tex\">\\approx</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4831em;\"></span><span class=\"mrel\">≈</span></span></span></span> to  have a coherence theorem?)? Examples of categorical doctrines / logics should include: monoidal categories = multiplicative linear logic without duality and exchange (in this case the coherence theorem is the one of MacLane), symmetric monoidal categories = multiplicative linear logic without duality (again coherence by MacLane), cartesian categories, cartesian closed categories = intuitionnistic logic, *-autonomous categories = multiplicative linear logic ...</p>",
        "id": 309044617,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1668103017
    },
    {
        "content": "<p>The old idea of a doctrine as a pseudomonad on Cat is able to handle some of your examples - like monoidal, symmetric monoidal categories and cartesian categories - but not all of them, because it can't handle categories with contravariant operations, like cartesian <em>closed</em> categories or *-autonomous categories.</p>",
        "id": 309046450,
        "sender_full_name": "John Baez",
        "timestamp": 1668103509
    },
    {
        "content": "<p>There are various ways to tackle this problem, but probably <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> could explain them better than me.</p>",
        "id": 309046738,
        "sender_full_name": "John Baez",
        "timestamp": 1668103573
    },
    {
        "content": "<p>And what about cut elimination or coherence theorem?</p>",
        "id": 309047072,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1668103674
    },
    {
        "content": "<p>No, we do not have it. For some of us, this is a research program, which is the reason why I won't discuss it in a forum.</p>",
        "id": 309048665,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1668104152
    },
    {
        "content": "<p>Are there some issues with what you did in your paper <a href=\"https://arxiv.org/abs/2111.09438\">Context, Judgement, Deduction</a>? You can indicate me another communication support if necessary <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 309060457,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1668107953
    },
    {
        "content": "<p>I have given a bit of thought to what it would mean for an abstract notion of doctrine/theory to have cut-elimination.  It's a bit tricky because it generally involves working with presentations rather than fully semantically incarnated theories like monads.  Probably the most suggestive results along these lines that have been worked out completely are those like my paper with Licata and Riley on <a href=\"http://dlicata.web.wesleyan.edu/pubs/lsr17multi/lsr17multi-ex.pdf\">modal and substructural logics</a>, which says essentially that any doctrine that can be described by a cartesian 2-multicategory admits a syntax with cut-elimination.</p>",
        "id": 309254654,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1668197331
    },
    {
        "content": "<p>I like the syntactic approach. It's the kind of things I was looking for. I'll clearly take a look at this.</p>",
        "id": 309260316,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1668200674
    }
]