[
    {
        "content": "<p>I am going to continue the discussion of Inquiry Driven Systems at this location as being mainly an application of logic to scientific inquiry and not necessarily limited to education.</p>",
        "id": 247272342,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1627338645
    },
    {
        "content": "<p>Cf: <a href=\"https://inquiryintoinquiry.com/2021/07/26/inquiry-driven-systems-discussion-9/\">Inquiry Driven Systems &bull; Discussion 9</a></p>\n<p>Re: <a href=\"https://groups.io/g/lawsofform/topic/inquiry_driven_systems/84227997\">Laws of Form</a> &bull; <a href=\"https://groups.io/g/lawsofform/message/513\">Leon Conrad</a></p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428457\">Leon Conrad</span> <br>\nAs someone who has worked on, teaches, and uses the CoI [Calculus of Indications] to make classical syllogistic logic much easier to practice and more visually intuitive than any of the visualisations we have to date, I would be very interested in finding out more about your work in applying GSB's work to logical tables, particularly if it does a similar thing.</p>\n</blockquote>\n<p>Gauging the gap between entry-level formal systems like propositional calculi and calculi qualified to handle quantified predicates, functions, combinators, etc. is one of my oldest research pursuits and still very much a work in progress.&nbsp; When I point people to the live edges of my understanding, the places where I break off in my searches, I usually end up numbering those episodes of risk-taking under the heading of “Failures to Communicate” — but it doesn't stop me from trying.&nbsp; So I'll take a chance and post a few links along those lines in a little while but it may avert a measure of misunderstanding if I mention the main forces setting me on my present path.</p>\n<p>I had already been studying Peirce's <em>Collected Papers</em> from my first couple of years in college, especially fascinated by his approach to logic, his amphecks, his logical graphs, both entitative and existential, his overall visual and visionary way of doing mathematics.&nbsp;  And then a friend pointed me to the entry for Spencer Brown's <em>Laws of Form</em> in the first <em>Whole Earth Catalog</em> and I sent off for a copy right away.&nbsp; My computer courses and self-directed programming play rounded out the triple of primary impacts on the way I would understand and develop logical graphs from that point on.</p>\n<p><em>To be continued …</em></p>",
        "id": 247273143,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1627339224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> I'll copy our last few exchanges about modal logic and related matters here all the better to discuss them in a more general context. &mdash; Jon</p>\n<p>Cf: <a href=\"https://inquiryintoinquiry.com/2021/07/25/inquiry-driven-systems-discussion-6/\">Inquiry Driven Systems &bull; Discussion 6</a></p>\n<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/teaching.20children/near/246941350\">said</a>:</p>\n<blockquote>\n<p>If one were to think about maths and children's education one would need to look at the needs of other subjects too. It should be easy for people here to work out how cats ties in with physics and biology - having a maths of  open systems could help a lot there. But one would also want to help maths tie in with the humanities.  In France children sometime after 13 or so read Voltaire's Candide published 1759, where Voltaire makes fun of Leibniz' idea that we live in the best possible world, by having Candide go around the world and witness all the suffering known at the time. It would be good if the maths department then also gave some introduction to fragments of contemporary modal logic, so that the children could see that the \"best possible world\" idea is abandoned by contemporary modal logics.</p>\n</blockquote>\n<p>I've never found much use for modal logic in mathematics proper since mathematics is all about possible existence, in the sense of what is not inconsistent with a given set of premisses.&nbsp; Of course, one can entertain modal logic as an endeavor to construct mathematical models of natural language intuitions about possibility, contingency, necessity, etc. but that is an application of mathematics to an empirical domain.</p>\n<p>As far as best possibilities go we certainly do a lot of work on optimization in math and its applications to the special sciences and engineering.&nbsp; For instance, a lot of physics begins with skiers on snowy slopes and their contemplation of gradients.&nbsp; That very sort of thinking by Leibniz led to his personal discovery of differential calculus.</p>\n<ul>\n<li><a href=\"https://inquiryintoinquiry.com/2013/04/01/the-present-is-big-with-the-future/\">Leibniz &bull; The Present Is Big With The Future</a></li>\n</ul>",
        "id": 247873528,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1627846573
    },
    {
        "content": "<p>@Henry Story Copied from <a href=\"#narrow/stream/233322-practice.3A-communication/topic/teaching.20children\">teaching children</a> &mdash; Jon</p>\n<p>Cf: <a href=\"https://inquiryintoinquiry.com/2021/07/26/inquiry-driven-systems-discussion-7/\">Inquiry Driven Systems &bull; Discussion 7</a></p>\n<p><span class=\"user-mention\" data-user-id=\"281126\">@Henry Story</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/teaching.20children/near/246973853\">said</a>:</p>\n<blockquote>\n<p>Dear <span class=\"user-mention silent\" data-user-id=\"306979\">Jon Awbrey</span> ,</p>\n<p>I place Logic within Mathematics and modal logic is a field of Logic, and so of mathematics. <br>\nYou will find that modal logics comes up a lot working with machines, programs and all state based systems. This thesis is defended in <a href=\"https://academic.oup.com/comjnl/article-abstract/54/1/31/336864\">Modal Logics are Coalgebraic</a> and many other papers over the past 20 years. There is also a view of modal logics as arising out of geometric morphisms between infinite topoi - which I hope to one day understand. See the Book \"Modal HoTT\" by David Corefield for an introduction.</p>\n<p>Of course if you narrow your definitions of mathematics so that these issues don't come up, then you can define that reality away. But I think it is better teaching children to be open to a larger view of mathematics that allows them to see the relation of it to what they study in Language (grammar) or Literature and fiction, as in David Lewis' article <a href=\"https://andrewmbailey.com/dkl/\">Truth in Fiction</a>. <br>\nRegards,<br>\nHenry, The Babelfish</p>\n</blockquote>\n<p>Just by way of personal orientation, I tend to follow Peirce and assorted classical sources in viewing logic as a normative science whereas mathematics is a hypothetical descriptive science.&nbsp; That gives a picture of their relationship like the one I drew in the following post.</p>\n<ul>\n<li>\n<p><a href=\"https://inquiryintoinquiry.com/2012/05/31/definition-and-determination-4/\">Definition and Determination &bull; 4</a></p>\n</li>\n<li>\n<p><a href=\"https://inquiryintoinquiry.files.wordpress.com/2014/08/peirce-syllabus.jpg\">Peirce &bull; &ldquo;Normative science rests largely on phenomenology and on mathematics;\nmetaphysics on phenomenology and on normative science.&rdquo;</a></p>\n<div class=\"message_inline_image\"><a href=\"https://inquiryintoinquiry.files.wordpress.com/2014/08/peirce-syllabus.jpg\" title=\"Peirce &bull; &ldquo;Normative science rests largely on phenomenology and on mathematics;\nmetaphysics on phenomenology and on normative science.&rdquo;\"><img src=\"https://uploads.zulipusercontent.net/d5b09c3908e97be6dc1638207b88e2c19b53005e/68747470733a2f2f696e7175697279696e746f696e71756972792e66696c65732e776f726470726573732e636f6d2f323031342f30382f7065697263652d73796c6c616275732e6a7067\"></a></div></li>\n</ul>\n<p>The way I see it, then, logic is more an application of mathematics than a subfield of it.</p>",
        "id": 247873753,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1627846848
    }
]