[
    {
        "content": "<p>From: JS Lemay &lt;<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>&gt;</p>\n<hr>\n<p>From: Antonio Rieser &lt;<a href=\"mailto:antonio.rieser@cimat.mx\">antonio.rieser@cimat.mx</a>&gt;<br>\nSent: Tuesday, October 31, 2023 2:28:15 PM (UTC+10:00) Canberra, Melbourne, Sydney<br>\nTo: Categories mailing list &lt;<a href=\"mailto:categories@mq.edu.au\">categories@mq.edu.au</a>&gt;<br>\nSubject: Announcing the (virtual) 9th Mexican Workshop on Applied Geometry and Topology</p>\n<p>Dear Colleagues,</p>\n<p>We are pleased to announce the 9th Mexican Workshop on Applied Geometry and Topology, which will take place virtually on <a href=\"http://gather.town\">gather.town</a> on the mornings (Mexico City time) of November 10, 13-15, 2023. This year, our main topic is discrete and combinatorial homotopy theory, featuring a minicourse on Discrete Homotopy Theory by Chris Kapulkin from the University of Western Ontario and several related research talks, as well as research talks and poster presentations from other areas of applied geometry and topology.</p>\n<p>Registration to participate without a poster presentation is open until November 8th at the website <a href=\"https://9mwgeometrytopology.eventos.cimat.mx/home_9atd&lt;https://protect-au.mimecast.com/s/P_EaCANpnDC0Om38uGZbOn?domain=9mwgeometrytopology.eventos.cimat.mx\">https://9mwgeometrytopology.eventos.cimat.mx/home_9atd&lt;https://protect-au.mimecast.com/s/P_EaCANpnDC0Om38uGZbOn?domain=9mwgeometrytopology.eventos.cimat.mx</a>&gt;.</p>\n<p>To apply to present a poster, please register at the above website by November 6th and plan to submit your poster (by email to tda@cimat.mx&lt;mailto:<a href=\"mailto:tda@cimat.mx\">tda@cimat.mx</a>&gt;) by November 8th. The poster session will be on November 10th after the mini-course lecture. All submissions from any area of applied geometry and topology are welcome!</p>\n<p>We look forward to seeing you there!</p>\n<p>Yours truly,</p>\n<p>Antonio Rieser<br>\nJesús Rodríguez<br>\n==================================<br>\nCentro de Investigación en Matemáticas<br>\nJalisco S/N<br>\nColonia Valenciana<br>\nCP 36023 Guanajuato, GTO<br>\nMéxico</p>\n<hr>\n<p>La información y sus documentos adjuntos son susceptibles de estar clasificados en términos de la Ley General de Protección de Datos Personales en Posesión de Sujetos Obligados (LGPDPPSO). Si usted ha recibido este mensaje por error, por favor notifique al remitente respondiendo al correo, y elimine el mensaje original, así como sus documentos adjuntos como una medida de seguridad de carácter administrativo.</p>\n<p>This email and its attachments are confidential and may be privileged or protected by law. If you have received it in error, please notify us immediately, delete the email message, do not copy it, disclose its contents or use it for any purpose.</p>\n<hr>",
        "id": 399419899,
        "sender_full_name": "Email Gateway",
        "timestamp": 1698723004
    }
]