[
    {
        "content": "<p>Of course, I fully agree with all the praise showered on Bob, but I thought I would add some details on his role in TAC.</p>\n<p>Some time, probably around 1990, Bob sent me an email asking my opinion about an online free journal on category theory.  His model was Herb Wilf's online combinatorics journal.  I wrote back and opined that it was probably too soon.  The papers would have to use TeX which most mathematicians were not using, although many were learning.  There were no browsers and the papers would have to be distributed via ftp and there were doubtless other reasons for thinking it too soon.  But I also felt that the time was coming.</p>\n<p>In 1994, we separately decided that the time had come.  I cannot remember whether Bob wrote me or I wrote Bob (or even our simultaneous emails crossed in the ether) but we were in complete agreement.  Bob then did almost everything needed to get it going.  He made the arrangements with Mt. Allison to host the journal on their server, he set up the original editorial board (with some outside input, to be sure), wrote the instructions for authors, etc.  My only contribution was to write tac.sty and then tac.cls.  There was no question that all papers would be in LaTeX, first in Lamport's original version and later in 2e.</p>\n<p>But the really important thing he did was getting all papers in shape for the journal.  All the copy editing, all the error correction. For the first five or six, he did this for every paper published.  And believe me, in the early days there were a lot of errors to correct.  Eventually after I retired in 2000, I volunteered to be TeX editor for the journal.  At first, most papers required a lot of work.  I can only imagine how bad it was in 1995 when the first papers appeared.  Gradually, over the years, we all became much more skilled at using LaTeX (now always version 2e) and now the job of TeX editor almost doesn't exist, although what little there is is now ably handled by Gavin Seal.</p>\n<p>Anyway, Bob put in an enormous effort to build TAC to what it is today and he deserves every plaudit he is getting and moreso.</p>\n<p>Michael</p>\n<p>You're receiving this message because you're a member of the Categories mailing list group from Macquarie University. To take part in this conversation, reply all to this message.</p>\n<p>View group files&lt;<a href=\"https://outlook.office365.com/owa/categories@mq.edu.au/groupsubscription.ashx?source=EscalatedMessage&amp;action=files&amp;GuestId=7d1df94c-5953-42b8-9208-4e4b5067c2dc\">https://outlook.office365.com/owa/categories@mq.edu.au/groupsubscription.ashx?source=EscalatedMessage&amp;action=files&amp;GuestId=7d1df94c-5953-42b8-9208-4e4b5067c2dc</a>&gt;   |   Leave group&lt;<a href=\"https://outlook.office365.com/owa/categories@mq.edu.au/groupsubscription.ashx?source=EscalatedMessage&amp;action=leave&amp;GuestId=7d1df94c-5953-42b8-9208-4e4b5067c2dc\">https://outlook.office365.com/owa/categories@mq.edu.au/groupsubscription.ashx?source=EscalatedMessage&amp;action=leave&amp;GuestId=7d1df94c-5953-42b8-9208-4e4b5067c2dc</a>&gt;   |   Learn more about Microsoft 365 Groups&lt;<a href=\"https://aka.ms/o365g\">https://aka.ms/o365g</a>&gt;</p>",
        "id": 400190193,
        "sender_full_name": "Email Gateway",
        "timestamp": 1699037858
    }
]