[
    {
        "content": "<p>From: JS Lemay &lt;<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>&gt;</p>\n<hr>\n<p>From: Julien Ross &lt;<a href=\"mailto:Neil.JR.Ross@Dal.Ca\">Neil.JR.Ross@Dal.Ca</a>&gt;<br>\nSent: Thursday, October 26, 2023 6:30 AM<br>\nTo: Categories mailing list &lt;<a href=\"mailto:categories@mq.edu.au\">categories@mq.edu.au</a>&gt;<br>\nCc: Neil.JR.Ross &lt;<a href=\"mailto:Neil.JR.Ross@Dal.Ca\">Neil.JR.Ross@Dal.Ca</a>&gt;; Peter Selinger &lt;<a href=\"mailto:Peter.Selinger@Dal.Ca\">Peter.Selinger@Dal.Ca</a>&gt;<br>\nSubject: Postdoc in quantum computation at Dalhousie</p>\n<p>Dear colleagues,</p>\n<p>We are looking for one or more postdoctoral researchers in quantum computation to join the Department of Mathematics and Statistics at Dalhousie University.</p>\n<p>Our department has expertise in quantum programming languages and the theory of quantum circuits, with an emphasis on the use of mathematical techniques coming from algebra, logic, number theory, and category theory. Familiarity with one or more of these areas would be an asset.</p>\n<p>Each position is for 2 years. The salary is CAD $60,000 per year plus benefits.</p>\n<p>Applicants are encouraged to apply as soon as possible. Applications will be considered on a rolling deadline until all positions are filled. An application package should consist of a cover letter, a curriculum vitae (including a complete list of publications), a research statement, and two letters of recommendations.</p>\n<p>Application packages and any inquiries about the positions should be sent to <a href=\"mailto:neil.jr.ross@dal.ca\">neil.jr.ross@dal.ca</a> and <a href=\"mailto:peter.selinger@dal.ca\">peter.selinger@dal.ca</a>.</p>\n<p>Dalhousie University is committed to fostering a collegial culture grounded in diversity and inclusiveness. The university encourages applications from Aboriginal people, persons with a disability, racially visible persons, women, persons of minority sexual orientations and gender identities, and all candidates who would contribute to the diversity of our community.</p>\n<p>Best,<br>\nJulien</p>",
        "id": 398549342,
        "sender_full_name": "Email Gateway",
        "timestamp": 1698262440
    }
]