[
    {
        "content": "<p>This topic is for discussion of ways to make psychology more rigorous through the better identification of psychological structures and their properties, with an emphasis on directly addressing the qualitative nature of psychological phenomena.</p>",
        "id": 203508082,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594388798
    },
    {
        "content": "<p>What would be examples of \"qualitative nature of psychological phenomena\"?</p>",
        "id": 203596395,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1594473603
    },
    {
        "content": "<p>One example is the fact that something like “happiness” doesn’t really have a quantity (and can’t because of a lack of appropriate metrics and measures) and that even if we were to know that two people were at their “maximum” happiness, we are still limited in what we can say when trying to compare them to one another.</p>",
        "id": 203597299,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594475211
    },
    {
        "content": "<p>Regarding \"happiness,\" you may care to check out Sam Harris about \"well-being\" and the \"moral landscape.\" He is a neuroscientist as well as a prolific public intellectual, and a very good writer.</p>\n<p>Regarding \"psychological structures and their properties,\" there is a large literature on phenomenology, emergence, the mind-body problem, and that sort of thing. As an initial step towards \"making psychology more rigorous,\"  there is my book \"Microlects of Mental Models.\" The basic idea is that minds are structures that include sub-structures called \"mental models\" (on which there is a large body of literature, with quite a range of definitions), BUT there is no way to know anything about anybody's mental model of anything - the only way to know anything about a mental model is via its physical expression in behavior. A basic principle is that all behavior in the everyday world (a constraint which is meant to exclude wack jobs) conforms to \"rough patterns.\" Formal description of a rough pattern is called a \"microlect.\" So, there are verbal microlects (that is what linguistics is about), there are diagrammatic microlects (e.g., category theory), and there are behavioral microlects (e.g., dance, sports). And, of course, there are formal microlects (mathematics in general). A microlect is the specialized behavior for physically expressing a mental model. As in linguistics, there is a basic distinction between behaviors  (\"parole\") and the (scientific) description of behavior (\"langue\"). For example, there are basketball games, and there are the rules of basketball. Actual basketball games are supposed to follow the rules, sure, but they also have behaviors not specifically included in the rules, that are consistent with the rules, but are among rough patterns of play, for example, the pick-and-roll.</p>\n<p>Regarding \"psychological phenomena,\" my mental model of mind countenances the basic distinction between \"conscious thought\" and the operations of brain that come before it. Conscious thought is the covert expression (yet still physical behavior of brain) of a mental model.</p>",
        "id": 203602098,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1594482729
    },
    {
        "content": "<p>Thank you, Ellis, for these suggestions. Does your microlect theory capture the dynamics of the mind in any significant way? For instance, could it describe the evolution of a thought process of some prototypical human going about some portion of her day?</p>",
        "id": 203706475,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594642147
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319212\">@xavier (mathematical artist)</span> No capture of mind dynamics. That would be the holy grail. The main point is that (a) \"evolution of a thought process\" is forever inaccessible, and (b)  behavior is accessible, and there do exist less or more formal microlects for expressing, say, daily activity. For example, see K. L. Pike, \" Language in relation to a unified theory of the structure of human behavior.\" For my part, I have used some diagrammatic conventions for describing structure of mind in terms of expression by microlects. Nothing \"in any significant way.\"</p>",
        "id": 203722309,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1594650886
    },
    {
        "content": "<p>Can someone point me to a mathematical/categorical treatment (if any) of social/group psychology, more specifically in the direction of hidden profile paradigm.  Also, if  anyone has any ideas or suggestions regarding what would be the best direction to think in.</p>",
        "id": 203803842,
        "sender_full_name": "Nivedita",
        "timestamp": 1594709884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319149\">@Nivedita</span> , the hidden profile sounds a lot like techniques used in consilience, in sensor fusion, and even in super-resolution photography where partial information is used to construct \"truth\". From an information theoretic standpoint, these mentioned paradigms are the same thing.</p>",
        "id": 203859204,
        "sender_full_name": "xavier (mathematical artist)",
        "timestamp": 1594746224
    }
]