[
    {
        "content": "<p>Hello, Does anyone have a copy that they can share of the following paper?</p>\n<p>F. Borceux, A propos d'un théorème de Barr,  Séminaire de mathématique (nouvelle série) Rapport 28 - Mai 1983, Institute de Mathematique Pure et Appliqee, Univ. Cath. de Louvain.</p>\n<p>Thank you.</p>",
        "id": 436871067,
        "sender_full_name": "Nicola Gambino",
        "timestamp": 1714738323
    },
    {
        "content": "<p>I wanted to challenge myself to find this, and it appears to be published in volume 97, issue 2 of \"Annales de la Société scientifique de Bruxelles. Série I: Sciences mathématiques, astronomiques et physiques\" which appears to be archived in the national library of Australia.</p>\n<p><a href=\"https://catalogue.nla.gov.au/catalog/678354\">https://catalogue.nla.gov.au/catalog/678354</a></p>\n<p>Probably not the easiest way to get a hold of it.</p>",
        "id": 436874761,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1714739821
    },
    {
        "content": "<p>I think it would be worth contacting Francis Borceux directly to see whether he still has a copy. (If so, I would also be interested in seeing the paper!)</p>",
        "id": 436931869,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1714758833
    },
    {
        "content": "<p>Interlibrary loan?</p>",
        "id": 436940624,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1714762171
    },
    {
        "content": "<p>It may even be possible have the librarian scan it if they aren't busy.  Once I was curious about some non mathematical fact, and a museum curator transcribed 2 pages of a 200 year old instruction booklet because I asked nicely.</p>",
        "id": 436945197,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1714764097
    },
    {
        "content": "<p>In my experience, nowadays most interlibrary loan is delivered electronically.  Presumably this involves someone scanning it if it wasn't already done.</p>",
        "id": 436945651,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1714764270
    },
    {
        "content": "<p>I mean, ILL of papers.  When I request an entire book, usually I get to borrow a physical copy.</p>",
        "id": 436945726,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1714764300
    },
    {
        "content": "<p>Thanks, folks. I asked my library to find the article, as suggested by <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> . In the Elephant, Peter Johnstone writes that the Borceux's proof is similar to the he uses to prove classical completeness for regular logic, so this will do for now.</p>",
        "id": 436950327,
        "sender_full_name": "Nicola Gambino",
        "timestamp": 1714766223
    }
]