[
    {
        "content": "<p>This is such an absolutely fun article:</p>\n<ul>\n<li><a href=\"https://arxiv.org/abs/1609.01421\">Struggles with the Continuum</a></li>\n</ul>\n<p>I'm still less than halfway through it, but already want to start this topic. Would love to discuss it <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>\n<p>What would you add to the list? What struggles have you had with the continuum? <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 402923389,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700348957
    },
    {
        "content": "<p>Glad you're enjoying it!  One struggle I left out is a more detailed study of the inverse cube force law:</p>\n<ul>\n<li><a href=\"https://math.ucr.edu/home/baez/inverse_cube.html\">The inverse cube force law</a>.</li>\n</ul>\n<p>The inverse cube force law, first studied by Newton, has remarkable properties.   It's important because the \"fictitious force\" created by a rotating coordinate system, the \"centrifugal force\", is an outwards-pointing inverse cube force.</p>\n<p>But the <em>attractive</em> version of an inverse cube force law has strange properties.  Classically, it can make a particle spiral to its doom in a finite amount of time.  Quantum-mechanically it's even weirder: it forces us to disambiguate the Hamiltonian by saying what happens when the particle hits the origin, and there are infinitely many ways to do it.</p>\n<p>I'd love to know the details, but it gets gnarly.</p>",
        "id": 402986214,
        "sender_full_name": "John Baez",
        "timestamp": 1700384342
    },
    {
        "content": "<p>I don't remember exactly when I started questioning the continuum model. Around 1993-94, I took two semesters of Sakurai that gave me an introduction to QFT and QED. Renormalization was definitely a big contributor. It all just seemed like things would work out so much better if there were some finite length. Thinking about general relativity and black holes was also a major contributor. There were a couple other things maybe less obvious.</p>\n<p>One less obvious example for me was \"<a href=\"https://en.wikipedia.org/wiki/Zitterbewegung\">Zitterbewegung</a>\". Zitterbewegung seemed to indicate that all particles, including massive ones, always have an instantaneous speed equal to the speed of light. The difference is that particles with mass \"turn\" and massless particles don't, so the average speed of a massive particle is always less than the speed of light.</p>\n<p>I interpretted this as particles interacting with the quantum vacuum. An electron is sitting in the quantum vacuum of electron-positron \"soup\". Similar to black hole radiation, when an electron-positron pair appears near the original electron, the electron may annihilate the positron from the pair leaving a new electron in its place. Depending on the momentum of the pair, the new electron can take off any any direction relative to the original electron. So, the new electron is actually \"different\" (but indistinguishable) from the original electron and goes of in some new direction, but the speed is always the speed of light.</p>\n<p>This is all mind boggling to think about and (other than the speed of light thing) I think uncontroversial. It means as we sit here, every particle in every atom of every cell of our body is continuously being annihiliated and \"reborn\" on the order of Planck time <span aria-label=\"exploding head\" class=\"emoji emoji-1f92f\" role=\"img\" title=\"exploding head\">:exploding_head:</span> </p>\n<p>The quantum vacuum is one of the most mind boggling things one can ever ponder in my opinion.</p>\n<p>(continued...)</p>",
        "id": 403044733,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700421464
    },
    {
        "content": "<p>A nice follow up article would be \"Hints of the Discrete\" <span aria-label=\"cowboy\" class=\"emoji emoji-1f920\" role=\"img\" title=\"cowboy\">:cowboy:</span></p>",
        "id": 403053283,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700428903
    },
    {
        "content": "<p>If I wrote that one, I'd spend a lot of time making clear that for many of the problems I listed, making spacetime discrete doesn't make the problem go away: it just changes the nature of the problem.  E.g. getting special and especially general relativity to work well with a shortest length scale (or more precisely, shortest <a href=\"https://en.wikipedia.org/wiki/Spacetime#Spacetime_interval\">interval</a>) is a big problem, and presumably different approaches would affect the nature of black holes in different ways.</p>",
        "id": 403143222,
        "sender_full_name": "John Baez",
        "timestamp": 1700477397
    },
    {
        "content": "<p>But here's why I enjoyed writing \"Struggles with the continuum\": there's nothing at all speculative about it, it's just a discussion of well-known math problems!   It appeared in a volume on new mathematics for spacetime, and the editors kept pressing me to talk about how various new approaches might <em>solve</em> the problems I was discussing.  But I really didn't want to do that.  First, with a bunch of speculations dumped on top, it wouldn't take long for my essay to become outdated and probably look a bit stupid.  Second, I am not very enthusiastic about the various new approaches.  So I thought it was much more useful to clearly state the <em>problems</em>.</p>",
        "id": 403146229,
        "sender_full_name": "John Baez",
        "timestamp": 1700478403
    },
    {
        "content": "<p>Agree. The article is perfect as it is and full of great objective info <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span> <span aria-label=\"raised hands\" class=\"emoji emoji-1f64c\" role=\"img\" title=\"raised hands\">:raised_hands:</span> </p>\n<p>It may be politically difficult, but I'd love to hear why you don't like some of the current alternatives. Just seeing reasons listed out objectively would be super valuable and help guide a lot of research.</p>\n<p>On the specific point of \"minimal length\", I don't think a finitary model necessarily requires a minimal length. It can't really for the reasons you suggest. Rather, I would expect some kind of uncertainty principle, e.g. the smaller an edge, the larger its \"dual\" should be. Something like that to save the day.</p>\n<p>One specific thing I'd love to get your thoughts on is this concept of \"sprinkling\" in causal set theory. As I understand, when the poset is random with a specific sprinkling, it can maintain Lorentz invariance. I always found the idea of relativistic randomness appealing.</p>\n<p>Here is a snippet from a randomly selected <a href=\"https://www.imperial.ac.uk/media/imperial-college/research-centres-and-groups/theoretical-physics/msc/dissertations/2021/Ansh-Bhatnagar-Dissertation.pdf\">Google result</a>:</p>\n<p><a href=\"/user_uploads/21317/P2LzzKeTeQu8hEf6Zih1f0dS/Screenshot-2023-11-20-at-5.23.00PM.png\">Screenshot-2023-11-20-at-5.23.00PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/P2LzzKeTeQu8hEf6Zih1f0dS/Screenshot-2023-11-20-at-5.23.00PM.png\" title=\"Screenshot-2023-11-20-at-5.23.00PM.png\"><img src=\"/user_uploads/21317/P2LzzKeTeQu8hEf6Zih1f0dS/Screenshot-2023-11-20-at-5.23.00PM.png\"></a></div><p>If I were (as if that were in question) to continue trying to relate discrete geometry to CST, these sprinkling would be important. Do you have reservations about the concept?</p>",
        "id": 403278641,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700530117
    },
    {
        "content": "<blockquote>\n<p>It may be politically difficult, but I'd love to hear why you don't like some of the current alternatives. Just seeing reasons listed out objectively would be super valuable and help guide a lot of research.</p>\n</blockquote>\n<p>I've thought about it too hard for too long to be able to write a little post here summarizing my problems with all the approaches to discrete spacetime that I know.  When I quit quantum gravity I decided not to look back.   I think the only reasonable thing people could do now would be set up a kind of wiki where all sorts of approaches were dispassionately described and the results about them - guessed, heuristically established or proved - listed.   It would be an enormous project, and most physicists are too emotionally attached to their own theories to do a good job of it: it would devolve into a propaganda contest.</p>",
        "id": 403325890,
        "sender_full_name": "John Baez",
        "timestamp": 1700554739
    },
    {
        "content": "<p>If it could be done right, though, it could save future researchers from roaming around the same maze over and over.</p>",
        "id": 403326014,
        "sender_full_name": "John Baez",
        "timestamp": 1700554797
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 403329656,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700556234
    },
    {
        "content": "<p>By the way, to <em>really</em> delete a comment you can move your mouse over to the right of your comment, click on the 3 gray dots that appear, and click 'delete message'.  Otherwise you leave behind a comment saying (deleted), which reminds me of [expletive deleted].</p>",
        "id": 403372334,
        "sender_full_name": "John Baez",
        "timestamp": 1700570308
    },
    {
        "content": "<p>Sorry. I posted to the wrong topic on accident. Will properly delete <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 403449418,
        "sender_full_name": "Eric Forgy",
        "timestamp": 1700595202
    }
]