[
    {
        "content": "<p>I recently came across this paper by L. Kauffman: <a href=\"https://www.mdpi.com/2079-3197/11/12/247\">https://www.mdpi.com/2079-3197/11/12/247</a>. It investigates a theory suggesting that living systems are characterized by processes that enable them to create and maintain their own structure and organization. The basic idea appears to be that a living system’s capacity to be self-producing, self-maintaining, and self-reproducing is possible because the system is self-referential in nature.</p>\n<p>The definition of an <em>eigenform</em> resembles what a non-mathematician might have in mind when introduced to the notion of a terminal coalgebra or a coinductive type. I refer to a terminal coalgebra, rather than an initial algebra, because we know —thanks to Tom Leinster, in what is, in my view, <a href=\"https://www.sciencedirect.com/science/article/pii/S0001870810003713\">one of the best papers on applied category theory</a>— that fractals are self-similar precisely because they are terminal coalgebras.</p>\n<p>The notion of a <em>reflexive domain</em>, a domain in which every element is also a transformation of that domain, is what a non-mathematician might imagine when thinking about a <a href=\"https://ncatlab.org/nlab/show/reflexive%20object\">[[reflexive object]]</a>.</p>\n<p>The paper is somewhat weird as it sounds very naive to a mathematician, or at least to me, and it appears to draw without substantial acknowledgment on a large body of existing literature (no category theory appears; Leinster, Scott, and many others do not appear in the references; yet some concepts like reflexive domain are even named in the same way!).<br>\nHowever, that is not the main reason I am raising it here. Rather, I would like to understand more precisely, and in a way that is aligned with the current state of the art, what the paper actually accomplishes, and possibly how to improve upon it by expressing in more categorical language its results.</p>\n<p>In order to do that, I have to know what's the state of the art about this: so my question for you: who among us is working on something similar/related? Or even unrelated, but with a similar vibe, in the coalgebra community. I could try to work my way upstream in the references of the paper, like I usually do, but in this case it feels more efficient to ask the community.</p>",
        "id": 573996127,
        "sender_full_name": "fosco",
        "timestamp": 1771178255
    },
    {
        "content": "<p>While we didn't tackle the question of self-reference, in the 2019 Adjoint School I was a part of the group which studied autopoiesis from a categorical angle, specifically the question of parts vs whole. </p>\n<p>The resulting blog post is something that fits the criteria of \"category theory\" and \"autopoiesis\" and might be what you're after, if only as a reference to more literature on the topic: <a href=\"https://golem.ph.utexas.edu/category/2019/06/behavioral_mereology.html\">https://golem.ph.utexas.edu/category/2019/06/behavioral_mereology.html</a></p>",
        "id": 574072653,
        "sender_full_name": "Bruno Gavranović",
        "timestamp": 1771235904
    },
    {
        "content": "<p>I can't quite tell the scope of what you're asking for, Fosco. Would you include something like </p>\n<ul>\n<li>Tomasz Korbak, <a href=\"https://journals.sagepub.com/doi/10.1177/10597123211066155\">Self-organisation, (M, R)–systems and enactive cognitive science</a></li>\n</ul>\n<p>which is downstream of Rosen's category-theoretic treatment of life?</p>",
        "id": 574072771,
        "sender_full_name": "David Corfield",
        "timestamp": 1771235943
    },
    {
        "content": "<p>I'm also doing stuff somewhat tangentially related. I've been interested in autopoiesis for a long time and I also do coalgebra flavoured stuff, but it's not easy to put them together in a way that feels satisfying to me. Virgo, Biehl, Baltieri, Capucci, <a href=\"https://arxiv.org/abs/2508.06326v2\">A \"good regulator theorem\" for embodied agents</a> is the closest I've got so far, that's written down at least, but its relation to autopoiesis is a bit indirect and it's not really related to the paper you posted.</p>",
        "id": 574082251,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1771239165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302507\">David Corfield</span> <a href=\"#narrow/channel/232160-learning.3A-reading-.26-references/topic/Autopoiesis.2C.20eigenforms.2C.20and.20terminal.20coalgebras/near/574072771\">said</a>:</p>\n<blockquote>\n<p>I can't quite tell the scope of what you're asking for, Fosco. Would you include something like </p>\n<ul>\n<li>Tomasz Korbak, <a href=\"https://journals.sagepub.com/doi/10.1177/10597123211066155\">Self-organisation, (M, R)–systems and enactive cognitive science</a></li>\n</ul>\n<p>which is downstream of Rosen's category-theoretic treatment of life?</p>\n</blockquote>\n<p>Reading Rosen is precisely how I ended up finding that paper</p>",
        "id": 574086398,
        "sender_full_name": "fosco",
        "timestamp": 1771240540
    },
    {
        "content": "<p>I understand there isn't a specific question in my opening post.. I guess I don't have one but the vague: has anyone tried to make this chain of intuition, that self-similar shapes, life-like shapes, coinductive shapes, etc. all come together if you know enough category theory?</p>",
        "id": 574086577,
        "sender_full_name": "fosco",
        "timestamp": 1771240605
    },
    {
        "content": "<p>Toby Smithe's research interests go from <a href=\"https://tsmithe.net/research.html#dynamics\">coalgebra</a> to <a href=\"https://tsmithe.net/research.html#life\">life</a>.</p>",
        "id": 574125599,
        "sender_full_name": "David Corfield",
        "timestamp": 1771253167
    }
]