[
    {
        "content": "<p>I am searching for a good CT Exercises book equipped with solutions.</p>",
        "id": 493442356,
        "sender_full_name": "Uroš Nedić",
        "timestamp": 1736800311
    },
    {
        "content": "<ul>\n<li>Ralph Sarkis's <a href=\"https://ralphs16.github.io/src/CatLectures/DraftBook.pdf\">book</a> \"My First Category Theory Textbook\" has some solutions in the back.</li>\n<li>Roman's book \"An Introduction to the Language of Category Theory\" appears to have solutions to odd exercises in the back.</li>\n<li>Jendrik Stelzner has typed up solutions to some exercises in Riehl's <a href=\"https://emilyriehl.github.io/files/context.pdf\">book</a> \"Category Theory in Context\" <a href=\"https://cionx.gitlab.io/solutions-category-theory-in-context-riehl/solutions-category-theory-in-context.pdf\">here</a>.</li>\n</ul>",
        "id": 493444491,
        "sender_full_name": "David Egolf",
        "timestamp": 1736800968
    },
    {
        "content": "<p>I usually progress on my book and add solutions when I am teaching the course, but this will sadly not happen in the near future. If there is any exercise that you like with no solution yet, I will type it up.</p>",
        "id": 493445784,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1736801372
    },
    {
        "content": "<p>.<br>\nHi Uroš,  </p>\n<p>For an elementary introduction to Category Theory with nice examples in the context of Computer Science, you may want to look at \"Category Theory for Computing Science, Third Edition\" by Michael Barr and Charles Well.  It contains solutions to all the exercises.    </p>\n<p>Another nice introduction with examples from Computer Science and Logic is Awodey's book \"Category Theory, Second Edition.\"  It does not have all but many solutions to the exercises.  </p>\n<p>Yet, another accessible and superbly written introduction to Category Theory is \"Basic Category Theory\" by Tom Leinster.  The book does not contain solutions to the exercises, but you may find those <a href=\"https://positron0802.wordpress.com/wp-content/uploads/2021/01/category-leinster.pdf\">here</a>.</p>\n<p>Enjoy!  </p>\n<p>Francisco<br>\n.</p>",
        "id": 495397948,
        "sender_full_name": "Francisco Rios",
        "timestamp": 1737591844
    }
]