[
    {
        "content": "<p>Hello all, </p>\n<p>I was having a look through n-lab and found a post advertising a reading group for category theory in statistics from 2020 (<a href=\"https://golem.ph.utexas.edu/category/2020/06/statistics_for_category_theori.html\">https://golem.ph.utexas.edu/category/2020/06/statistics_for_category_theori.html</a>) along with a great shortlist of papers. Does this group or one like it still exist? It'd be great to have some more reading recommendations particularly around categories applied to statistics (I'm particularly interested in dempster schafer theory at the moment) and stuff on the edge between categories, probability and topology (like information geometry or locale probability). </p>\n<p>Cheers! - Will</p>",
        "id": 547381237,
        "sender_full_name": "Will Jump",
        "timestamp": 1761603930
    },
    {
        "content": "<p>Hello. I don't think that group exists anymore. <br>\nFor people applying category theory to statistics, I'm aware of Rob Cornish (Markov categories and neural networks) and Pedro Terán (possibility theory using categories). <br>\nSome theoretical results can be found in the work of Fritz et al., e.g. <a href=\"https://arxiv.org/abs/2207.05740\">here</a>, <a href=\"https://arxiv.org/abs/2401.14669\">here</a>, <a href=\"https://arxiv.org/abs/1908.07021\">the last three sections here</a>, and <a href=\"https://arxiv.org/abs/2010.07416\">here</a>.<br>\nFor papers, you might have seen this <a href=\"https://ncatlab.org/nlab/show/category-theoretic+approaches+to+probability+theory#statistics\">list on the nLab</a>.</p>\n<p>Information geometry and its links with category theory are still quite new subjects. Myself, I've worked a little bit on both, see for example <a href=\"https://arxiv.org/abs/2212.11719\">this paper</a> and <a href=\"https://youtu.be/mUPJEt3FeiU\">this talk</a>. <br>\nThere is also the work of Hong Van Le et al., see for example <a href=\"https://arxiv.org/abs/2505.03862\">here</a> and follow the references in there. </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"mUPJEt3FeiU\" href=\"https://youtu.be/mUPJEt3FeiU\"><img src=\"https://uploads.zulipusercontent.net/5060564f8b3b805cce3bc45006eb33105f071ce5/68747470733a2f2f692e7974696d672e636f6d2f76692f6d55504a457433466569552f6d7164656661756c742e6a7067\"></a></div><p>For locales, it's usually some form of measure theory rather than probability, as for example in <a href=\"https://arxiv.org/abs/2510.08826\">this recent preprint</a>.<br>\nNot quite about locales, but similar in 'point-free' spirit, there are also algebraic and order-theoretic approaches to probability and measure theory, for example in the work of Fritz, Lorenzin, Moss and others - start <a href=\"https://ncatlab.org/nlab/show/Loomis-Sikorski+duality\">here</a> and <a href=\"https://ncatlab.org/nlab/show/measurable+Gelfand+duality\">here</a>. </p>\n<p>(There are for sure a lot of other people, papers, etc. - This is what I can think of right now, someone might want to add some.)</p>",
        "id": 547448118,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1761644789
    },
    {
        "content": "<p>By the way, while that group is not active, there is a <a href=\"#narrow/channel/253118-theory.3A-categorical-probability\">channel on this Zulip</a> specifically for categorical probability and statistics, make sure you subscribe to it!</p>",
        "id": 547448806,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1761644991
    },
    {
        "content": "<p>Thanks Paolo, I'm now on the channel!</p>",
        "id": 547560353,
        "sender_full_name": "Will Jump",
        "timestamp": 1761674968
    }
]