[
    {
        "content": "<p>I've been trying to think about profunctors recently and have found the notion of a framed bicategory very helpful when doing so. Also, <span class=\"user-mention\" data-user-id=\"424412\">@Patrick Nicodemus</span> has been talking to me a lot about his ideas on formal category theory and about double categories. And it seems like some competency with formal category theory is necessary to understand the foundations of infinity category theory. A lot of the definitions in HTT (eg of correspondences/profunctors) are a direct translation of the 1-categorical notions, when framed in a suitable way; the book also makes extensive use of simplicially enriched categories. Riehl &amp; Verity's book on infinity cosmoi is (to my impression) about formal infinity category theory and it (1) uses enriched category theory heavily as well as (2) uses defintions from ordinary category theory (eg \"adjunction\") internal to a 2-category (eg Ho(QCat)) and (3) has multiple sections devoted to virtual equipments. So I have plenty of reason to want to learn formal category theory, but I'm not really sure where to start. There are a ton of competing notions for a suitable context in which formal category theory could be done, and it's hard to put together the \"big picture\" in my head. Is there a textbook, monograph, or other sort of more structured work than the nlab which develops formal category theory from a modern point of view, explains the (dis)advantages of various systems for doing so, and is somewhat self contained? I'm guessing the answer is no, but I'd also appreciate just a list of useful references to look at. I guess my issue is that it's hard to know where the start with this stuff and where to stop, or what's important in a first pass, or so on.</p>",
        "id": 396190584,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1697074252
    },
    {
        "content": "<p>What does \"formal\" mean here?  Are you looking for formal systems for reasoning about categorical constructions, such as the co-end calculus? <a href=\"https://arxiv.org/pdf/1501.02503.pdf\">https://arxiv.org/pdf/1501.02503.pdf</a></p>",
        "id": 396209639,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1697083464
    },
    {
        "content": "<p>I think it's about proving the kind of stuff you can prove about categories in a generic 2-category resembling <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"bold\">C</mi><mi mathvariant=\"bold\">a</mi><mi mathvariant=\"bold\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbf{Cat}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6861em;\"></span><span class=\"mord\"><span class=\"mord mathbf\">Cat</span></span></span></span></span> as described <a href=\"https://ncatlab.org/nlab/show/formal+category+theory#:~:text=The%20idea%20of%20formal%20category,is%20the%20archetypical%202%2Dtopos.\">on the nlab</a> or in this paper <a href=\"https://arxiv.org/abs/2210.08663\">A Formal Logic for Formal Category Theory</a></p>",
        "id": 396211048,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1697084251
    },
    {
        "content": "<blockquote>\n<p>Is there a textbook, monograph, or other sort of more structured work than the nlab which develops formal category theory from a modern point of view, explains the (dis)advantages of various systems for doing so, and is somewhat self contained?</p>\n</blockquote>\n<p>Unfortunately not yet. There are three main approaches:</p>\n<ul>\n<li>Yoneda structures (cf. Street–Walters' <a href=\"https://www.sciencedirect.com/science/article/pii/0021869378901606\">Yoneda structures on 2-categories</a>).</li>\n<li>Proarrow equipments/fibrant double categories/virtual equipments (cf. Wood's <a href=\"http://www.numdam.org/item/CTGDC_1982__23_3_279_0/\">Abstract pro arrows I</a> and <a href=\"http://www.numdam.org/item/CTGDC_1985__26_2_135_0/\">Proarrows II</a>; Shulman's <a href=\"https://arxiv.org/abs/0706.1286\">Framed bicategories and monoidal fibrations</a>;  Cruttwell–Shulman's <a href=\"https://arxiv.org/abs/0907.2460\">A unified framework for generalized multicategories</a>; Koudenburg's <a href=\"https://arxiv.org/abs/2205.04890\">Formal category theory in augmented virtual double categories</a>)</li>\n<li>Lax-idempotent pseudomonads (cf. Bunge–Funke's <a href=\"https://www.sciencedirect.com/science/article/pii/S002240499800108X\">On a bicomma object condition for KZ-doctrines</a>)</li>\n</ul>\n<p>Most recent approaches to formal category theory take the second approach (although the precise formalism varies). The relationship between the approaches, for the most part, is not laid out clearly in the literature, but a basic intuition is:</p>\n<ul>\n<li>Yoneda structures are based on formalising the presheaf construction.</li>\n<li>Proarrow equipments and related structures are based on formalising distributors/profunctors.</li>\n<li>Lax-idempotent pseudomonads are based on formalising the free cocompletion construction.</li>\n</ul>\n<p>In nice settings, e.g. enriched category theory for a well-behaved base of enrichment (e.g. satisfying Kelly's assumptions in <a href=\"http://www.tac.mta.ca/tac/reprints/articles/10/tr10abs.html\">Basic Concepts of Enriched Category Theory</a>), all three approaches are viable. However, with weaker assumptions, not every approach is viable. For instance, when the base of enrichment is not well-behaved, one no longer has a presheaf construction or free cocompletion, and so Yoneda structures and lax-idempotent pseudomonads are not applicable. Without enough coequalisers in the base, distributors do not compose, and so proarrow equipments and fibrant double categories are not applicable.</p>\n<p>The most general settings are those of virtual equipments and augmented virtual equipments. It is possible to formalise presheaves in this setting (as in the work of Koudenburg), thus recovering Yoneda structures; as well as free cocompletions (not yet in the literature), and so these approaches subsume the others. Technically, augmented virtual equipments generalise virtual equipments, but it is not clear to me that there are examples captured by the former that cannot be captured by the latter by making appropriate modifications. If you are interested in learning about formal category theory in the context of higher category theory (e.g. Riehl–Verity), then it is probably most helpful to start by reading about virtual equipments (starting with Cruttwell–Shulman). However, there is still a lot of formal category theory that has not yet been carried out in this generality, so the other papers are also helpful in understanding the kinds of phenomena that may be understood using formal category theory.</p>",
        "id": 396231398,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1697095952
    },
    {
        "content": "<p>What a nice overview!</p>",
        "id": 396236084,
        "sender_full_name": "John Baez",
        "timestamp": 1697097940
    },
    {
        "content": "<ul>\n<li>Avoid reading Wood's original papers, and instead focus on (virtual) double categories / equipments, as Nathanael suggested. Riehl-Verity build a lot on this framework in their \"calculus of bimodules,\" so I believe you come from there.</li>\n<li>The best references to learn Yoneda structures are Street-Walters' original paper, coupled with Weber's \"Yoneda structures from 2-toposes\"; most importantly, compare the two approaches to understand what is \"good\" in a good Yoneda structure à la Weber. The existence of a good Yoneda structure on V-Cat is deeply tied to this story (<a href=\"https://arxiv.org/abs/1804.03829\">https://arxiv.org/abs/1804.03829</a>), but the second paper, 10 years younger than Weber's, doesn't reference it.</li>\n<li>Most Yoneda structures are of a specifically well-behaved kind, meaning that the presheaf construction has additional nice properties (for example, having an adjoint or interacting well with a duality involution on top of the ambient 2-category – this second condition entails the first because the adjoint to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi><mo>↦</mo><mi>P</mi><mi>X</mi></mrow><annotation encoding=\"application/x-tex\">X\\mapsto PX</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6943em;vertical-align:-0.011em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">↦</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">PX</span></span></span></span> is <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi><mo>↦</mo><mi>P</mi><mo stretchy=\"false\">(</mo><msup><mi>X</mi><mrow><mi>o</mi><mi>p</mi></mrow></msup><msup><mo stretchy=\"false\">)</mo><mrow><mi>o</mi><mi>p</mi></mrow></msup></mrow><annotation encoding=\"application/x-tex\">X\\mapsto P(X^{op})^{op}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6943em;vertical-align:-0.011em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">↦</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span><span class=\"mopen\">(</span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.6644em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\">o</span><span class=\"mord mathnormal mtight\">p</span></span></span></span></span></span></span></span></span><span class=\"mclose\"><span class=\"mclose\">)</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.6644em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\">o</span><span class=\"mord mathnormal mtight\">p</span></span></span></span></span></span></span></span></span></span></span></span>; these are important and natural examples. I'm afraid there is no specific reference for this phenomenon, apart from this preprint with Ivan Di Liberti (<a href=\"https://arxiv.org/pdf/1901.01594.pdf\">https://arxiv.org/pdf/1901.01594.pdf</a>) and a set of private notes I received from Davide Bernardini. (Two points: first, there are a number of subtle and less subtle mistakes in my paper with Ivan – we were young and didn't really grasp the whole picture of this story – but the intuition that taking the Kleisli bicategory of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>P</mi></mrow><annotation encoding=\"application/x-tex\">P</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span></span></span></span> gives an equipment is correct – more or less directly, everybody knew it; second, Bernardini was immensely kind sharing his scribbles and giving me the task of reorganizing them into a coherent set of notes. That is the best approximation of a survey of the theory of Yoneda structures that we have today, although unpublished. In January 2020, I was in the process of typesetting them properly, expanding them, and correcting mistakes. Then the publish-or-perish and the pandemic hit...)</li>\n<li>\n<p>The French school of category theory, embodied by René Guitart, is scattered with remarks about formal category theory. If you understand mathematical French, I <em>warmly</em> recommend you to read the following papers:</p>\n<ul>\n<li><em>Qu'est-ce que la logique dans une catégorie?</em> (<a href=\"http://www.numdam.org/article/CTGDC_1982__23_2_115_0.pdf\">http://www.numdam.org/article/CTGDC_1982__23_2_115_0.pdf</a>)</li>\n<li><em>Monades involutives complémentées</em> (<a href=\"http://www.numdam.org/article/CTGDC_1975__16_1_17_0.pdf\">http://www.numdam.org/article/CTGDC_1975__16_1_17_0.pdf</a>)</li>\n<li><em>Relations et carrés exacts</em>, and <em>Carrés déductifs</em>; (<a href=\"https://web.archive.org/web/20211018142728/http://rene.guitart.pagesperso-orange.fr/textespublications/rg42.pdf\">https://web.archive.org/web/20211018142728/http://rene.guitart.pagesperso-orange.fr/textespublications/rg42.pdf</a>) and (<a href=\"https://web.archive.org/web/20231001204222/http://rene.guitart.pagesperso-orange.fr/textespublications/rg48.pdf\">https://web.archive.org/web/20231001204222/http://rene.guitart.pagesperso-orange.fr/textespublications/rg48.pdf</a>)</li>\n</ul>\n</li>\n</ul>",
        "id": 396238664,
        "sender_full_name": "fosco",
        "timestamp": 1697098871
    },
    {
        "content": "<p>Thanks so much <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> and <span class=\"user-mention\" data-user-id=\"282822\">@fosco</span>! I didn't realize the (augmented, virtual) proarrow equipment approach subsumed the KZ-monad approach. Nathanael, you say this isn't written up in the literature yet, is the case for non-virtual equipments written down somewhere?</p>",
        "id": 396334769,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1697131877
    },
    {
        "content": "<p>Also I should really try to get comfortable with mathematical French... There have been several papers I wanted to look at but got scared off by the prospect of translating while reading</p>",
        "id": 396334946,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1697131936
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"556202\">Brendan Murphy</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Formal.20Category.20Theory/near/396334769\">said</a>:</p>\n<blockquote>\n<p>Thanks so much <span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> and <span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span>! I didn't realize the (augmented, virtual) proarrow equipment subsumed the KZ-monad approach. Nathanael, you say this isn't written up in the literature yet, is the case for non-virtual equipments written down somewhere?</p>\n</blockquote>\n<p>One can deduce this in a roundabout way: first, Walker shows in <a href=\"https://arxiv.org/abs/1703.08693\">Yoneda structures and KZ doctrines</a> that every lax-idempotent pseudomonad induces a Yoneda structure. Then, every Yoneda structure induces an augmented virtual equipment (cf. Theorem 4.24 of Koudenburg's <a href=\"https://arxiv.org/abs/2205.04890\">Formal category theory in augmented virtual double categories</a>). This is related to the preprint of <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> and <span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> that Fosco mentioned. However, one has to check for oneself that the formal notions in the language of lax-idempotent pseudomonads then correspond to the corresponding formal notions in the language of equipments: this hasn't been written out in the literature, but is perhaps a nice exercise to gain some intuition regarding the relation between the concepts.</p>",
        "id": 396336534,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1697132539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"556202\">@Brendan Murphy</span> Mathematical French is generally only about 3% as hard as actual French, in my experience. It's worth taking a course on reading French for graduate students if you have the opportunity, but it's really not necessary. Serre is a particularly friendly place to start.</p>",
        "id": 396341933,
        "sender_full_name": "Kevin Arlin",
        "timestamp": 1697134727
    },
    {
        "content": "<p>Yeah, I'm sure it's mostly psychological. I took a year of French in undergrad anyway</p>",
        "id": 396342745,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1697135063
    },
    {
        "content": "<p>I have translated into English two of Guitart papers actually. They are hosted at Jon Sterling's \"Mathematical translations\" web page. Very easy to find them if you Google. I am posting from my smartphone now, but I can add a link tomorrow morning!</p>",
        "id": 396366484,
        "sender_full_name": "fosco",
        "timestamp": 1697145756
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Formal.20Category.20Theory/near/396366484\">said</a>:</p>\n<blockquote>\n<p>They are hosted at Jon Sterling's \"Mathematical translations\" web page. Very easy to find them if you Google.</p>\n</blockquote>\n<p>It looks like the page (<a href=\"https://www.jonmsterling.com/math-translations/\">https://www.jonmsterling.com/math-translations/</a>) linked from <a href=\"https://github.com/jonsterling/math-translations\">the GitHub repo</a> is dead now. I'm guessing due to Jon transitioning his website to use the tool he's been developing.</p>\n<p>I wonder is there a plan to port it to Forester or to host it somewhere else.. it seems like a cool project</p>",
        "id": 396377045,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1697150983
    },
    {
        "content": "<p>Ah you can still access the rendered site through the GitHub url: <a href=\"http://jonsterling.github.io/math-translations\">http://jonsterling.github.io/math-translations</a></p>",
        "id": 396377597,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1697151336
    },
    {
        "content": "<p>For papers that are not yet entirely translated, I'd guess there are sufficiently many french-speaking people here for using the place as a virtual translation hotline. I don't want to speak for all of us, but you can at least try me.</p>",
        "id": 396433645,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1697178710
    },
    {
        "content": "<p>On the topic of translation, I would note that even the free tier of chatGPT can (I think) do a decent job at translating mathematics. (Although it's probably important to have a way to double check its translation, as I'm sure it makes mistakes!)</p>\n<p>For example, I'm currently looking at an introduction to abstract homotopy theory written in Brazilian Portugese. I can sort of guess at parts of what's being said (as I speak some Spanish), but not enough to follow what's going on. However, just directly selecting and copy-pasting from a PDF into chatGPT is yielding a translation that seems to make sense (at least so far!). It even does a good job at noticing when diagrams are present (they copy-paste terribly) and ignores them. In addition, it can also typset symbols using latex.</p>\n<p>As an example...<br>\nhere is a screenshot of an original paragraph:<br>\n<a href=\"/user_uploads/21317/Ch5Dr_nu98kSdlFrnWT5Y0N4/image.png\">original text</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Ch5Dr_nu98kSdlFrnWT5Y0N4/image.png\" title=\"original text\"><img src=\"/user_uploads/21317/Ch5Dr_nu98kSdlFrnWT5Y0N4/image.png\"></a></div><p>here is what I copy-paste to chatGPT:<br>\n\"• se um ponto z ∈ X está na intersecção Bx ∩ By entre vizinhanças<br>\nbásicas de x e de y, então este possui uma vizinhança Bz ∈ τ (z)<br>\nali inteiramente contida. Isto significa, em particular, que qualquer<br>\nponto x ∈ X admite vizinhanças arbitrariamente pequenas: para<br>\nquaisquer Bx, B′<br>\nx ∈ τ (x) existe uma vizinhança menor B′′<br>\nx ∈ τ (x)<br>\ncontida em Bx ∩ B′<br>\nx.\"<br>\n(notice how the formatting above is not great)</p>\n<p>And here is what the free tier of chatGPT outputs:<br>\n<a href=\"/user_uploads/21317/55xYdFpSv_OuK6D6s7PtV7hH/image.png\">translation</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/55xYdFpSv_OuK6D6s7PtV7hH/image.png\" title=\"translation\"><img src=\"/user_uploads/21317/55xYdFpSv_OuK6D6s7PtV7hH/image.png\"></a></div>",
        "id": 396578272,
        "sender_full_name": "David Egolf",
        "timestamp": 1697235728
    },
    {
        "content": "<p>I think these LLM's have been very successful with translation, scoring very high on several metrics. It is one of their strong points.<br>\nHowever, I certainly don't know how to judge the translation quality of a language I cannot read and do not speak. So it is difficult to say on what grounds we are assessing its quality or fitness here. I personally choose not to do this for this reason.<br>\nPerhaps for math it does not matter because it is on the reader to check the correctness of the proof.<br>\nBut mathematical communication is still primarily trust based in my experience. If a paper tells me a theorem is true, I will believe them and cite the paper.</p>",
        "id": 396583251,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1697240049
    }
]