[
    {
        "content": "<p>On page 58 of \"Accessible Categories: The Foundations of Categorical Model Theory\", by M. Makkai and R. Paré, it is mentioned that there is a characterisation of the class of sketches S whose categories are models Mod(S) are exactly the categories of models of complete theories (in the sense of Model Theory), with elementary embeddings as morphisms. This is followed by a reference to \"[M]', which however does not seem to be in the book's references. Does anyone know where this could be found?</p>",
        "id": 433923852,
        "sender_full_name": "Nicola Gambino",
        "timestamp": 1713419423
    },
    {
        "content": "<p>I guess this must be some paper of Makkai, but I could not tell which one. In LPAC this is attributed to Rosicky's PhD thesis, see the discussion at page 239. In private conversations with Rosicky, he always this result to be his, and large portions of this theory to be developed under the name of modelable categories by Lair.</p>",
        "id": 434022683,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1713438754
    },
    {
        "content": "<p>Do you know what the characterization is, though, Ivan?</p>",
        "id": 434204368,
        "sender_full_name": "Kevin Carlson (Arlin)",
        "timestamp": 1713459934
    },
    {
        "content": "<p>I looked on page 239 of \"Locally presentable and accessible categories\", but I do not see any (direct) mention of complete theories.</p>",
        "id": 434528837,
        "sender_full_name": "Nicola Gambino",
        "timestamp": 1713642348
    },
    {
        "content": "<p>I am sorry, I misread the question and I concentrated on the part about \"elementary embeddings\" more than about \"complete theories\".  Don't you think that must be some kind of typo, or imprecise phrasing, though? I can hardly imagine a full characterization of sketches corresponding to complete theories.</p>",
        "id": 435273093,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1713993012
    },
    {
        "content": "<p><a href=\"https://mathoverflow.net/questions/144583/sketches-for-categories-of-models-of-complete-theories\">This</a> MO answer comes to the same conclusion.</p>",
        "id": 435273473,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1713993182
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"360410\">Nicola Gambino</span> <a href=\"#narrow/stream/232160-learning.3A-reading-.26-references/topic/Reference.20on.20sketches/near/433923852\">said</a>:</p>\n<blockquote>\n<p>On page 58 of \"Accessible Categories: The Foundations of Categorical Model Theory\", by M. Makkai and R. Paré, it is mentioned that there is a characterisation of the class of sketches S whose categories are models Mod(S) are exactly the categories of models of complete theories (in the sense of Model Theory), with elementary embeddings as morphisms. This is followed by a reference to \"[M]', which however does not seem to be in the book's references. Does anyone know where this could be found?</p>\n</blockquote>\n<p>for makkai, the whole point of categorical model theory was to replace the abstract concept of completeness, as a flight through empty space from models to theories, by concrete representation theorems. his first claim at a characterization of completeness was the stone duality for first order logic. it is i think in advances in math, maybe in the late 80s. he turned to sketches as a more communicable language for that idea. the completeness theorem for generalized sketches was the subject of his seminar in the mid-90s. it was a sustained elaboration of barr's representation construction in the framework of sketches. i am sure that he wrote it all up, but i am not sure that it got accepted by either of the communities. the sketches community was just an ongoing argument whether this proof from the early 80s was the same as that proof from the late 80s, and whether it was stolen or independent. and the model theoretic community was... well, some people seemed genuinely religious and saying that there was a category was always a sacrilege. so i can imagine that makkai just kept his manuscript in his desk. there was a genuine objection that he was proving completeness by deriving syntax from semantics. i only have my own seminar notes which i am not sure i completely understood even at the time.<br>\nbut the upshot seems to be that the model theoretic formalization of the notion of completeness was already a hack (the word used at the time would have been \"theology\") and that categorical model theory should provide provably universal concepts, falsifiable through functorial semantics, when adjunctions do not yield dualities.<br>\nsorry if this does not help much, but that is how much i remember.</p>",
        "id": 435291383,
        "sender_full_name": "dusko",
        "timestamp": 1714004055
    },
    {
        "content": "<p>Thank you, Ivan and Dusko for your replies.</p>\n<p><span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span>  I would say that the MathOverflow rather focuses on the same aspect (i.e. elementary embeddings instead of completeness) rather than comes to same conclusion. </p>\n<p><span class=\"user-mention\" data-user-id=\"294557\">@dusko</span> Makkai has a series of papers on \"Generalized sketches as a framework for completeness theorems\", so I will look there as well.</p>\n<p>By the way, there is a 1982 paper by Lascar in the Journal of Symbolic Logic entitled \"On the category of models of a complete theory\". At the time, Lascar was at MGill and Makkai is acknowledged in the Introduction.</p>",
        "id": 435339871,
        "sender_full_name": "Nicola Gambino",
        "timestamp": 1714034218
    },
    {
        "content": "<p>I'm sorry, how exactly is the model-theoretic notion of completeness a 'hack'?</p>",
        "id": 440230063,
        "sender_full_name": "James E Hanson",
        "timestamp": 1716429433
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/232160-learning.3A-reading-.26-references/topic/Reference.20on.20sketches/near/435291383\">said</a>:</p>\n<blockquote>\n<p>but the upshot seems to be that the model theoretic formalization of the notion of completeness was already a hack</p>\n</blockquote>\n<p>Could you please elaborate on this comment?</p>",
        "id": 440243571,
        "sender_full_name": "James E Hanson",
        "timestamp": 1716436640
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"645679\">@James E Hanson</span> you can use \"@\" to ping people, in this case <span class=\"user-mention\" data-user-id=\"294557\">@dusko</span> .</p>",
        "id": 440305733,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1716465001
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/232160-learning.3A-reading-.26-references/topic/Reference.20on.20sketches/near/440305733\">said</a>:</p>\n<blockquote>\n<p>[...] you can use \"@\" to ping people</p>\n</blockquote>\n<p>I thought that  when you quote and reply (like James Henson did), it automatically pings the person you are quoting.  For example, you should be pinged by this message.  Did it work?</p>",
        "id": 440319053,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1716469633
    },
    {
        "content": "<p>Yes, that's correct.</p>",
        "id": 440328688,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1716472542
    },
    {
        "content": "<p>I don't think so. By default, the mention that opens the reply is a non-pinging one, which you can achieve by putting an underscore \"_\" after the \"@\". So this message won't result in a notification <span class=\"user-mention silent\" data-user-id=\"276839\">Damiano Mazza</span> and <span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span>. Conversely, if you want someone to get notified when you reply to them, you can just delete the \"_\" in the automatically generated quotation context.</p>",
        "id": 440332918,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1716473697
    },
    {
        "content": "<p>Interesting, I'm sure I've been pinged in the past by replies, but perhaps that's just because people manually removed the underscore (or perhaps it did not always prefix with an underscore). Thanks for the clarification!</p>",
        "id": 440340632,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1716475957
    }
]