[
    {
        "content": "<p>Stream created by <span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span>.</p>",
        "id": 192997329,
        "sender_full_name": "Notification Bot",
        "timestamp": 1586151550
    },
    {
        "content": "<p>Topics: groups who are studying a work together. May branch off and form streams.</p>",
        "id": 193080579,
        "sender_full_name": "Christian Williams",
        "timestamp": 1586196955
    },
    {
        "content": "<p>Hey guys, if anybody is interested, I host two Sunday 2pm reading groups on an alternating weekly basis. We've started meeting on Zoom now so it's accessible to everybody.</p>\n<p>In the first one, we're working through Steve Roman's An Introduction to the Language of Category Theory. It's for people who want to fill holes in their basic Category Theory knowledge. We're just starting in on Chapter 2 so it's still possible to catch up easily.</p>\n<p>In the second group, we're reading Coecke and Kissinger's Picturing Quantum Processes. We've been working through Kissinger's problem sets from when he taught a class based on the book. We're just starting on assignment 2 so it's still accessible to newcomers as well.</p>\n<p>If you're interested, I post the events on <a href=\"http://www.meetup.com/category_theory/\" title=\"http://www.meetup.com/category_theory/\">www.meetup.com/category_theory/</a></p>",
        "id": 195308786,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1587859354
    },
    {
        "content": "<p>I announced this over on the <a href=\"https://forum.azimuthproject.org/discussion/2504/basic-category-theory-reading-group\" title=\"https://forum.azimuthproject.org/discussion/2504/basic-category-theory-reading-group\">Azimuth Forum</a> and then I noticed the group was based in New York... so you may already know David Tanzer, who is currently  taking the lead on the Azimuth Forum.</p>",
        "id": 195311627,
        "sender_full_name": "John Baez",
        "timestamp": 1587865214
    },
    {
        "content": "<p>Just posted a link to Azimuth on the meetup group.</p>\n<p>I actually don't think I know <span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span>. The CT reading group was a result of attending Emily Pillmore's Homotopy Type Theory reading group about a year ago. There were a bunch of us who were like \"this is way over our current level but Conceptual Mathematics sounds managable...\" So maybe we've been in different circles.</p>\n<p>I'm always glad to meet new people though!</p>",
        "id": 195334770,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1587907619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> thanks for the introduction and <span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span> good to meet you!   The reading group sounds great.  I just put in a pitch on the Azimuth Forum for the biweekly review of Steven Roman's introductory textbook, plus I added an outline of the topics and exercises assigned for the May 3 meetup.   See you there!</p>",
        "id": 195365276,
        "sender_full_name": "David Tanzer",
        "timestamp": 1587953852
    },
    {
        "content": "<blockquote>\n<p>... <span class=\"user-mention silent\" data-user-id=\"285161\">Oliver Shetler</span> good to meet you! The reading group sounds great. </p>\n</blockquote>\n<p>Good to meet you too!</p>",
        "id": 195365807,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1587954411
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"276143\">@David Tanzer</span>!  Funny meeting you heere!   I thought you might already be in this <a href=\"https://www.meetup.com/category_theory/\" title=\"https://www.meetup.com/category_theory/\">NYC Category Theory</a> reading group.  I guess not!   I hope you can make contact with them, if there's anything in common.</p>",
        "id": 195369681,
        "sender_full_name": "John Baez",
        "timestamp": 1587959910
    },
    {
        "content": "<p>Anyone have tips / ingredients for a successful reading group discussion?</p>",
        "id": 195956751,
        "sender_full_name": "Jake Gillberg",
        "timestamp": 1588336745
    },
    {
        "content": "<p>Encourage some of the people who are committed to attending to prepare and then present small pieces of the text, as they understand it; similarly distribute exercises. That way there should always be someone prepared to give <em>some</em> explanation to those who have questions or difficulties, and it won't always be the same person (reading groups which turn into lectures tend not to remain well-attended).<br>\nGood moderation also helps a lot: if you're one of the people organising, you're in a better position to ask the \"stupid questions\" that not everyone has the courage to ask. Be prepared to ask these even if you already know the answers, since everyone benefits from reviewing more basic (but still relevant) material. On the flip side, you can also take charge to prevent the discussion from getting side-tracked in a tangent that not enough of the attendees are interested in/can follow.</p>",
        "id": 195960373,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1588339533
    },
    {
        "content": "<p>(caveat that my experience is with in-person groups; sensing whether or when the input is needed is likely to be much harder via the medium of the internet...)</p>",
        "id": 195960490,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1588339600
    },
    {
        "content": "<p>Together with Noemie Combe (MPI Leipzig), I am organizing a weekly <strong>reading group on operads</strong> . We are, to some extent, following the book by Loday/Vallette. Anyone interested in participating (on any level of expertise), please contact me!</p>",
        "id": 197959964,
        "sender_full_name": "Joscha Diehl",
        "timestamp": 1589819279
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> changed the <a href=\"/help/stream-permissions\">access permissions</a> for this stream from <strong>Public</strong> to <strong>Web-public</strong>.</p>",
        "id": 397854311,
        "sender_full_name": "Notification Bot",
        "timestamp": 1697898732
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> changed the description for this stream.</p>\n<ul>\n<li><strong>Old description:</strong></li>\n</ul>\n<blockquote>\n<p>Topics: groups who are studying a work together. May branch off and form streams.</p>\n</blockquote>\n<ul>\n<li><strong>New description:</strong></li>\n</ul>\n<blockquote>\n<p>If you are looking for references, want to start a reading group, or are running a reading group, post here.</p>\n</blockquote>",
        "id": 399477521,
        "sender_full_name": "Notification Bot",
        "timestamp": 1698750458
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> renamed stream <strong>learning: reading groups</strong> to <strong>learning: reading &amp; references</strong>.</p>",
        "id": 399477523,
        "sender_full_name": "Notification Bot",
        "timestamp": 1698750458
    }
]