[
    {
        "content": "<p>Does anybody have a copy of the handwritten notes for I Aitchison's \"String diagrams for non-abelian cocycle conditions\"? It's quite widely cited but I can't find a scan or even summary of the notes anywhere. I'm hoping that this isn't another source lost to folklore...</p>",
        "id": 554082391,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1762433895
    },
    {
        "content": "<p>This might be a good thing for the CT mailing list if it doesn't show up here.</p>",
        "id": 554177674,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1762458668
    },
    {
        "content": "<p>Did you try this?</p>\n<ul>\n<li>Iain R. Aitchison, <a href=\"https://arxiv.org/abs/1008.1714\">The geometry of oriented cubes</a>.</li>\n</ul>\n<p>The abstract says:</p>\n<blockquote>\n<p>This reports on the fundamental objects revealed by Ross Street, which he called 'orientals'. Street's work was in part inspired by Robert's attempts to use N-category ideas to construct nets of C*-algebras in Minkowski space for applications to relativistic quantum field theory: Roberts' additional challenge was that 'no amount of staring at the low dimensional cocycle conditions would reveal the pattern for higher dimensions'. This report takes up this challenge, presenting a natural inductive construction of explicit cubical cocyle conditions, and gives three ways in which the simplicial ones can be derived from these. (<strong>A dual string-diagram version of this work, giving rise to a Pascal's triangle of diagrams for cocycle conditions, has been described elsewhere by Street</strong>). A consequence of this work is that the Yang-Baxter equation, the 'pentagon of pentagons', and higher simplex equations, are in essence different manifestations of the same underlying abstract structure. There has been recent interest in higher-categories, by computer scientists investigating concurrency theory, as well as by physicists, among others. <strong>The dual 'string' version of this paper makes clear the relationship with higher-dimensional simplex equations in physics. Much work in this area has been done since these notes were written: no attempt has been made to update the original report. However, all diagrams have been redrawn by computer, replacing all original hand-drawn pictures.</strong></p>\n</blockquote>",
        "id": 554204119,
        "sender_full_name": "John Baez",
        "timestamp": 1762469895
    },
    {
        "content": "<p>Street's paper is <a href=\"http://science.mq.edu.au/~street/48.pdf\">here</a> and it cites \"Iain Aitchison: String diagrams for non-abeIian cocycle conditions, handwritten notes, talk presented at Louvain-la-Neuve, Belgium, 1987\".  I bet Street still has these notes.</p>",
        "id": 554204698,
        "sender_full_name": "John Baez",
        "timestamp": 1762470198
    },
    {
        "content": "<p>Maybe. He's had to move office more than once in the past decade (building chess by the university) and also more seriously retired.</p>",
        "id": 554205687,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762470695
    },
    {
        "content": "<p>I knew he was retired but not about the repeated moves.   </p>\n<p>Anyway, Tim should definitely ask on the category theory mailing list.  It's a shell of its former self, but many old-timers still read it - the sort of people who are much more likely to have Aitchison's notes than us youngsters here.</p>",
        "id": 554258381,
        "sender_full_name": "John Baez",
        "timestamp": 1762502285
    },
    {
        "content": "<p>I am the beneficiary of one such move, as I inherited a bunch of books!</p>",
        "id": 554305765,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1762516950
    },
    {
        "content": "<p>I asked Ross about these notes today, which he had shown to me in his office some time in 2013–2014. He said that he had made a scan of them years ago which he might still have as a PDF file. Stay tuned.</p>",
        "id": 555066968,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1762939155
    },
    {
        "content": "<p>amazing, thank you so much!</p>",
        "id": 555138312,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1762958851
    }
]