[
    {
        "content": "<p>My study of degeneracies and their effects has led me to the canonical Grothendieck topology.  Particularly, categories \"with enough nice degeneracies\" such as the simplex category appear to probably be the same as categories for which the indiscrete/trivial Grothendieck topology is identical to the canonical topology.</p>\n<p>Aside from the Elephant for general reference on the canonical topology and its properties, I wonder if anyone has some good references on</p>\n<ul>\n<li>the canonical topology and its properties</li>\n<li>characterizing when the canonical topology on a category yields a presheaf topos</li>\n<li>properties of categories for which the indiscrete topology is identical to the canonical topology, i.e. the canonical topology is generated by identity sieves.</li>\n</ul>",
        "id": 412837322,
        "sender_full_name": "James Deikun",
        "timestamp": 1705258081
    },
    {
        "content": "<p>The canonical topology consists of \"stably universally epimorphic sieves\". That is, the sieves generated by those colimit cones which are stable under pullback (or more precisely resurrection along morphisms, since pullbacks needn't exist). So for the canonical topology to coincide with the trivial one, you need every (stable) colikit cone to contain a split epi.</p>",
        "id": 412837903,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1705258695
    },
    {
        "content": "<p>Yeah, one thing I was thinking might be an equivalent property is that every colimit that exists in the category is absolute.</p>",
        "id": 412838081,
        "sender_full_name": "James Deikun",
        "timestamp": 1705258879
    },
    {
        "content": "<p>There is something to that effect on the nLab page for <a href=\"https://ncatlab.org/nlab/show/absolute%20colimit\">[[absolute colimit]]</a> , I've just seen.</p>",
        "id": 412839695,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1705260417
    },
    {
        "content": "<p>I am also curious about canonical Grothendieck topologies! For instance, by my understanding a \"site\" is a (small) category equipped with a covering. Therefore, I think there should be a category Site along with a forgetful functor U: Site -&gt; Cat that sends a site to its underlying small category. Reasonably one would expect this forgetful functor to have adjoints, which would be \"free functors\". One of these may be the indiscrete/trivial topology functor Triv: Cat -&gt; Site which gives a small category the trivial Grothendieck topology. Then there could be another adjoint functor Can: Cat -&gt; Site that sends a category to its canonical topology. It would be analogous to how V: Top -&gt; Set has two adjoints: the right adjoint which gives the trivial topology and the left adjoint which gives the discrete topology on a set. If there's both Triv and Can functors, then maybe there's a way to find out for which categories they \"agree\" (maybe sort of like an equalizer does in Set with functions)?</p>",
        "id": 412856006,
        "sender_full_name": "John Onstead",
        "timestamp": 1705275635
    },
    {
        "content": "<p>A morphism of sites is generally required to not only preserving covering families but to be <a href=\"https://ncatlab.org/nlab/show/flat%20functors\">[[flat functors]]</a>.  And the most general notion of flatness refers to the topologies, so if those are the morphisms in Site I don't think you'd get adjoints.  But if you impose a stronger condition like \"representable flatness\" (or even require your sites to have finite limits and your functors to preserve them), then you'd have a forgetful functor to a category of categories and flat functors (or finitely complete categories and finitely continuous functors), and I would expect that that does have left and right adjoints.  The left adjoint should be the trivial (minimal) topology, but I would expect the right adjoint in general to be the <em>maximal</em> topology, where <em>all</em> families are covering.</p>",
        "id": 412867991,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705281609
    },
    {
        "content": "<p>To get the right adjoint to be the canonical topology, the obvious thing would be to restrict the sites in your category Site to be <em>sub</em>canonical, but I don't think that would work because an arbitrary (flat or finitely-continuous) functor still might not preserve universally-effective-epimorphic families, so even if its domain is a subcanonical site it might not be a morphism of sites to the canonical topology on its codomain.</p>",
        "id": 412868219,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705281731
    },
    {
        "content": "<p>(Where does the terminology \"indiscrete\" for the trivial topology come from?  If anything I would have been inclined to call it \"discrete\", for this reason among others -- discrete topologies are generally <em>left</em> adjoints to forgetful functors.)</p>",
        "id": 412868303,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705281788
    },
    {
        "content": "<p>I think it has to do with the fact that coverings including sparser sieves are considered finer.  Thus the trivial topology is the coarsest, and the one where anything covers is finest.  I agree that this is counterintuitive.</p>",
        "id": 412868613,
        "sender_full_name": "James Deikun",
        "timestamp": 1705281996
    },
    {
        "content": "<p>Who uses that terminology?</p>",
        "id": 412869441,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705282465
    },
    {
        "content": "<p>I suppose once the mistake was made to call this thing a \"topology on a category\", all sorts of other terminological abominations were bound to follow...</p>",
        "id": 412869554,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705282538
    },
    {
        "content": "<p>I've seen it in <a href=\"https://math.stackexchange.com/questions/1633230/a-grothendieck-topology-on-delta\">https://math.stackexchange.com/questions/1633230/a-grothendieck-topology-on-delta</a> and <a href=\"https://en.wikipedia.org/wiki/Grothendieck_topology#cite_note-1\">https://en.wikipedia.org/wiki/Grothendieck_topology#cite_note-1</a> just today, the latter of which claims to trace the convention to SGA IV.</p>",
        "id": 412869843,
        "sender_full_name": "James Deikun",
        "timestamp": 1705282690
    },
    {
        "content": "<p>Figures.</p>",
        "id": 412870083,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1705282823
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306459\">@Joshua Wrigley</span> has done some work on adjunctions between classes of sites, which involves partially cocompleting sites which don't have enough colimits.</p>",
        "id": 412953356,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1705323958
    }
]