[
    {
        "content": "<p>Special Issue on Quantum Physics and Logic (QPL 2024 and QPL 2025)<br>\nSubmission deadline: 14 February 2026</p>\n<p>Guest editors:</p>\n<ul>\n<li>\n<p>Alejandro Díaz-Caro (Inria, LORIA, CNRS, Université de Lorraine &amp; Universidad Nacional de Quilmes, France)<br>\nQuantum computing, lambda calculus, categorical semantics, logic in computer science</p>\n</li>\n<li>\n<p>Simon Perdrix (Inria, LORIA, CNRS, Université de Lorraine, France)<br>\nQuantum computing, categorical quantum mechanics, causality, contextuality, graphical approaches to quantum computing</p>\n</li>\n<li>\n<p>Benoît Valiron (LMF, CentraleSupélec, Inria, Université Paris-Saclay, France)<br>\nQuantum programming languages, type theory, semantics</p>\n</li>\n</ul>\n<p>Special issue information:</p>\n<p>We invite submissions for a Special Issue of <em>Journal of Logical and Algebraic Methods in Programming (JLAMP)</em> dedicated to post-proceedings of the 21st and 22nd editions of the International Conference on Quantum Physics and Logic (QPL 2024 and QPL 2025). Submissions are welcome both from extended versions of papers presented at these conferences and from external contributions within the same thematic scope.</p>\n<p>The Special Issue focuses on recent advances at the intersection of quantum computing, logic, and programming languages. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>Algebraic and categorical structures in quantum computation and quantum physics</li>\n<li>Formal languages, type systems, and semantic methods for quantum programming</li>\n<li>Logical frameworks and verification techniques for quantum algorithms and systems</li>\n<li>Compositional approaches and process calculi for quantum protocols</li>\n<li>Diagrammatic and graphical languages, such as the ZX-calculus</li>\n<li>Applications of quantum and quantum-inspired techniques to causality, linguistics, and logic<br>\nThis Special Issue aims to contribute to the development of the logical and algebraic foundations of quantum computation.</li>\n</ul>\n<p>Manuscript submission information:</p>\n<p>Submissions should follow JLAMP’s guidelines for authors, available at: Guide for Authors<br>\n<a href=\"https://www.sciencedirect.com/journal/journal-of-logical-and-algebraic-methods-in-programming/publish/guide-for-authors\">https://www.sciencedirect.com/journal/journal-of-logical-and-algebraic-methods-in-programming/publish/guide-for-authors</a></p>\n<p>Manuscripts must be submitted via the JLAMP Editorial System (EM): Submission<br>\n<a href=\"https://www.editorialmanager.com/jlamp/default.aspx\">https://www.editorialmanager.com/jlamp/default.aspx</a></p>\n<p>During submission, please select “VSI: QPL 2024 and QPL 2025” as the article type.</p>\n<p>Important Dates:</p>\n<p>Submission open date: June 1, 2025<br>\nManuscript submission deadline: February 14, 2026</p>\n<p>Accepted papers will be published online individually as soon as they are ready, without waiting for the deadline or the completion of the full special issue.</p>\n<p>We look forward to receiving your contributions!</p>",
        "id": 516767280,
        "sender_full_name": "Alejandro Díaz-Caro",
        "timestamp": 1746652559
    },
    {
        "content": "<p>Extended deadline: April 12th.</p>\n<p>Please note that we do not wait for the deadline to begin the review process; your paper will be sent for review as soon as it is received and published individually upon acceptance. This extension is intended solely to provide more time for submissions and will not cause any delays for the publications.</p>",
        "id": 573468909,
        "sender_full_name": "Alejandro Díaz-Caro",
        "timestamp": 1770887612
    }
]