[
    {
        "content": "<p>Dear colleagues, </p>\n<p>I am pleased to announce a new conference series focused on the interactions of categorical abstractions and algorithms. The conference will run from the 12th to the 16th of August and it will be held at the University of Florida (Gainesville, FL). Abstract submission is now open and you can find details of the conference <a href=\"https://gataslab.org/amma\">here</a>. I look forward to seeing many of you there!</p>\n<hr>\n<p>The Abstract Methods in Multivariate Algorithmics (AMMA) is an international workshop bringing together two mathematical communities: (1) researchers in parameterized (multivariate) complexity theory and (2) researchers in applied topology and category theory. The two communities share many core goals such as understanding compositional systems and compositional algorithms and the systematic confinement of emergent complexity (such as combinatorial explosion). The workshop will consist of a blend of invited and contributed talks as well as tutorials on parameterized complexity and applied category theory aiming to bridge the mathematical and linguistic gap between the two communities.</p>\n<p>The topics may include but are not limited to:</p>\n<ul>\n<li>\n<p>Sheaves and dynamic programming</p>\n</li>\n<li>\n<p>Well-quasi-ordering and encountered-instance algorithmic frameworks beyond worst-case analysis</p>\n</li>\n<li>\n<p>Universal obstructions in graph structural width metrics and a general theory of such metrics</p>\n</li>\n<li>\n<p>Abstract approaches to second-order Myhill-Nerode congruences and beyond</p>\n</li>\n<li>\n<p>Diagram-completion paradigms in parameterized complexity such as solution diversity,</p>\n</li>\n<li>\n<p>Transfer learning and dynamic input</p>\n</li>\n<li>\n<p>General theories of purposeful kernelization</p>\n</li>\n<li>\n<p>Parameterizing on quantization</p>\n</li>\n<li>\n<p>Inductive gradients in parameterized algorithms</p>\n</li>\n<li>\n<p>Problem-specific well quasi-ordering and functorial approaches to parameterized complexity classification</p>\n</li>\n<li>\n<p>Abstract views of input normal forms such as graphs as lineal topologies</p>\n</li>\n<li>\n<p>Abstract models of computation appropriate to truly linear FPT (O(n) + f(k)) algorithmics</p>\n</li>\n<li>\n<p>Abstract models of graphs arising from data points plus metric knobs, and their natural decompositions.</p>\n</li>\n</ul>",
        "id": 435627819,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714151463
    },
    {
        "content": "<p>Hey, not to be critical, but as somebody who comes from the categorical side and is interested in approaching the complexity side -- and I don't think it's a huge number of us -- I find very little that is familiar or recognisable to me in that list of topics. <br>\nPerhaps there's a different community of applied category theorists that I'm unaware of (in the US?), and to whom this does speak, but my immediate reaction is that if you want to bridge a \"linguistic gap\", you are not throwing hooks in equal measure towards the two sides.</p>",
        "id": 435724201,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1714201743
    },
    {
        "content": "<p>For example, because a lot of category theory is done in European computer science departments that are \"Theory B\"-leaning, it is very likely that applied category theorists that are interested in complexity theory are more familiar with logical and semantic approaches such as implicit computational complexity — I am aware that this is perceived as Eurotrash by many in America, but in my opinion it would be a natural place where to look for a point of contact; but then again maybe I don't have a good picture of what other subcommunities exist</p>",
        "id": 435726132,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1714202565
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276363\">Amar Hadzihasanovic</span> <a href=\"#narrow/stream/229141-community.3A-events/topic/Abstract.20Methods.20in.20Multivariate.20Algorithmics.20.28AMMA.202024.29/near/435724201\">said</a>:</p>\n<blockquote>\n<p>as somebody who comes from the categorical side and is interested in approaching the complexity side -- and I don't think it's a huge number of us -- I find very little that is familiar or recognisable to me in that list of topics. </p>\n</blockquote>\n<p>I second that!</p>",
        "id": 435761909,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1714228265
    },
    {
        "content": "<p>Yes the list of topics seems to contain extremely specific subjects and lots of technical keywords, I wish I understood what they mean!  I am very interested in connexions between categories and complexity, but I am only vaguely familiar with parametrized complexity, I suppose that's why I'm lost...</p>",
        "id": 435770902,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1714235048
    },
    {
        "content": "<p>Adding to <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span>'s comment, the kind of applied category theorists that I have in mind when I think of complexity are, for example, those attending the <a href=\"https://www.cst.cam.ac.uk/conference/structure-meets-power-2024\">Structure Meets Power</a> workshop series.  My impression is that AMMA is quite orthogonal, but it wouldn't be a bad idea to make the two communities interact!</p>",
        "id": 435771504,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1714235631
    },
    {
        "content": "<p>Hi Amar, Morgan and Damiano. Thanks for the comments. I guess you're hitting the nail on the head: at the moment there is little work being done at the intersection of parameterized complexity theory (PCT) and category theory, but many in the PCT community feel like the time is ripe for an algebraic organisation of the field.  </p>\n<p><span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span> as you point out, most interactions of CT with computer science are more leaning towards theory B. This conference is trying to change that. My hope is that AMMA will provide a space for these two communities to speak to each other. Our plan is to have two \"tutorial\" sessions: one for PCT and one for ACT so that we can start bridging the linguistic divide. The topics we listed are merely examples of concepts that the PCT community would really like more theory for, so, if you don't recognise them, that's great: hopefully you'll join us for the conference and help us figure out how to categorify them! <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>\n<p><span class=\"user-mention\" data-user-id=\"276839\">@Damiano Mazza</span> I agree with your assessment that AMMA shares similarities with structure meets power. Although they have different flavors (AMMA is not so tightly tied to model theory, for instance), it would be good to have much more cross-pollination between the communities.</p>",
        "id": 436112506,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714415263
    },
    {
        "content": "<p>I guess a concrete question is how people from the ACT side should decide what kind of talks to contribute, given that there's little ACT work so far close to the topics you're interested in!</p>",
        "id": 436112783,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1714415356
    },
    {
        "content": "<p>That's a great question. I think that people in ACT can contribute in two ways: </p>\n<ol>\n<li>presenting applications of category theory that have an algorihmic slant (ATC in machine learning comes to mind, or indeed topics that align more with methods typically seen in structure meets power...) or </li>\n<li>contributing tutorial talks aimed at explaining techniques in category theory that one might deem useful for algorithmics. </li>\n</ol>\n<p>From the perspective of people in the PCT community: it's hard to formulate questions to category theorists if they aren't aware of the kinds of things that category theory can already do. </p>\n<p>As an example, together with my collaborators, I have recently been studying <a href=\"https://arxiv.org/abs/2402.00206\">time-varying data</a> and <a href=\"https://arxiv.org/abs/2302.05575\">dynamic programming algorithms</a> using category-theoretic (and sheaf-theoretic) tools. This has been very well received in the parameterized complexity community where many people have started asking about what sorts of things category theory can do for them. </p>\n<p>If you have any ideas or suggestions about topics that you think would be of interest to people in complexity theory, please get in touch. Also feel free to ask any more questions! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 436114859,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714416084
    },
    {
        "content": "<p>Yeah, your work is very naturally the best example of overlap so far. Thanks for the fleshing-out!</p>",
        "id": 436115469,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1714416289
    },
    {
        "content": "<p>No problem at all! <br>\nI'm really excited about building bridges between these communities. The aim is to create a space where we can all come together and share concepts and start a dialogue about compositionality and how to make sense of it in ways that are simultaneously categorically elegant and computationally useful. <span aria-label=\"partying face\" class=\"emoji emoji-1f973\" role=\"img\" title=\"partying face\">:partying_face:</span></p>",
        "id": 436116662,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714416712
    },
    {
        "content": "<p>In database theory, combined complexity is useless because all problems are exponential.  So theorists study \"data complexity\" - how runtime scales when queries are parameters and data size varies, and query complexity - how runtime scales when data is a parameter and query size varies.  This works <em>extremely</em> well because in practice, queries tend to be <em>very</em> small and data tends to be <em>very</em> large.  If I understand AMMA correctly, it is pursuing a similar strategy but for additional things besides queries and databases (pro -functors and pre-sheaves, if you will).  So I'm wondering/hoping if results of the form \"categorical abstraction X is exactly AMMA abstraction Y\" are welcome?</p>",
        "id": 436127202,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1714420374
    },
    {
        "content": "<p>Hi Ryan, yes this sort of work would definitely be welcome!</p>",
        "id": 436128402,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714420800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"481356\">@Benjamin Merlin Bumpus (he/him)</span> Just to clarify, I completely sympathise with your goals and I think it's a shame that there isn't much contact between CT and “Theory A”-complexity -- I did not mean to suggest at all that the aim of the conference should be modified. <br>\nRather, like others have pointed out, I was left confused as to what ACtheorists were expected to contribute; and, at the same time, if contributions from ACtheorists are expected, I thought it would be natural to try to \"fish\" them out of those who have already been interested in complexity theory, <em>even if</em> it was from a “Theory B”-perspective.</p>",
        "id": 436224698,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1714467237
    },
    {
        "content": "<p>For example, I think that a nod to something very general like “Functorial approaches to quantitative bounds” or something like that would have reassured me that this was not necessarily “for somebody else” :D</p>",
        "id": 436225019,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1714467362
    },
    {
        "content": "<p>Hi Amar, thanks for the message! That’s a good suggestion, I’ll see that it’s added to the website! <br>\nI hope to see you in Florida <span aria-label=\"hibiscus\" class=\"emoji emoji-1f33a\" role=\"img\" title=\"hibiscus\">:hibiscus:</span> for AMMA!</p>",
        "id": 436550735,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1714587822
    },
    {
        "content": "<p>Dear all, I’m very glad to announce that I’ve been offered a permanent position at U São Paulo (USP). However, the start date appears to be much earlier than anticipated and it means that I will not be able to be in the US during the proposed AMMA dates. Since I’m the lead organizer, we’ve decided to postpone the conference to 2025 (more information will follow in due course). Apologies for the inconvenience. Please contact me directly by email if you’ve already started making travel arrangements. Thank you for your understanding. </p>\n<p>I look forward to hosting AMMA in São Paulo in 2025; I hope many of you will be able to join me there!</p>",
        "id": 442415596,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1717465786
    },
    {
        "content": "<p>Wow, congrats Ben!</p>",
        "id": 442453953,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1717483911
    },
    {
        "content": "<p>That's great!</p>",
        "id": 442469598,
        "sender_full_name": "John Baez",
        "timestamp": 1717489015
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 442530902,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1717507972
    }
]