[
    {
        "content": "<p>I heard recently that it was going to be held in Oxford. Was this just bad intel?</p>",
        "id": 403783894,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1700744241
    },
    {
        "content": "<p>I made a stupid mistake, now fixed.  I meant ACT2025!</p>",
        "id": 403789211,
        "sender_full_name": "John Baez",
        "timestamp": 1700746160
    },
    {
        "content": "<p>ACT2024 will indeed be held in Oxford - the local organizer is Sam Staton.</p>",
        "id": 403789585,
        "sender_full_name": "John Baez",
        "timestamp": 1700746297
    },
    {
        "content": "<p>The plan seems to have solidified: James Fairbanks will hold ACT2025 and the adjoint school at the University of Florida May 19 - May 30, 2025, with the adjoint school being the first week and the conference the second week.</p>",
        "id": 441953165,
        "sender_full_name": "John Baez",
        "timestamp": 1717270617
    },
    {
        "content": "<p>Great news! Also, that's... even earlier than this year! Are we going to anticipate ACT one month each year? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 442165001,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1717397720
    },
    {
        "content": "<p>It follows the lunar calendar</p>",
        "id": 442184451,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1717403331
    },
    {
        "content": "<p>The reason may be that Florida becomes too hot by June.</p>",
        "id": 442184632,
        "sender_full_name": "John Baez",
        "timestamp": 1717403382
    },
    {
        "content": "<p>Fair enough! I hope it's not going to be a problem with teaching, that's finals week in Strathclyde</p>",
        "id": 442295372,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1717430261
    },
    {
        "content": "<p>If it's a problem for a large number of people, the time to say it is right now - or ideally one week ago.</p>",
        "id": 442302844,
        "sender_full_name": "John Baez",
        "timestamp": 1717431572
    },
    {
        "content": "<p>We/you might want to ask for feedback on the dates at the community session at the conference then</p>",
        "id": 442559427,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1717515350
    },
    {
        "content": "<p>It does seem kind of bad to keep shifting the time of year without any real chance for community input, though it may well be the case that the algorithm was \"pick the one option that somebody is willing to host.\"</p>",
        "id": 442625881,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1717534898
    },
    {
        "content": "<p>I told the rest of the steering board about these date issues, and that got people to discuss some other problems with the chosen dates.</p>\n<p>To get ACT to take place at the same time each year, we may need enough people have senior positions doing ACT that more than one person volunteers each year to host the conference.  We aren't there yet!   But I encourage you all to consider hosting the conference in 2026.</p>",
        "id": 442725905,
        "sender_full_name": "John Baez",
        "timestamp": 1717576400
    },
    {
        "content": "<p>With ACT 2025, when do calls for proposals usually open up out of curiosity?</p>",
        "id": 469126795,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1725981388
    },
    {
        "content": "<p>Proposals for what, exactly?</p>",
        "id": 469129255,
        "sender_full_name": "John Baez",
        "timestamp": 1725981987
    },
    {
        "content": "<p>Oh I misspoke, <a href=\"https://oxford24.github.io/act_cfp.html\">call for papers</a> (like from 2024)</p>",
        "id": 469150943,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1725986504
    },
    {
        "content": "<p>We're thinking a first CfP could come early in December.</p>",
        "id": 469156131,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1725987654
    },
    {
        "content": "<p>What's the order of magnitude of ACT attendance? 10s? 100s?</p>",
        "id": 469180198,
        "sender_full_name": "Mike Stay",
        "timestamp": 1725993543
    },
    {
        "content": "<p>Usually between 100-200 people.</p>",
        "id": 469181950,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1725993921
    },
    {
        "content": "<p>Ah! Thank you so much <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span> !</p>",
        "id": 469192485,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1725996625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275927\">@James Fairbanks</span> Could someone please confirm the dates for the conference? I remember hearing at the ACT conference this year that they had changed.</p>",
        "id": 472636743,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1727251481
    },
    {
        "content": "<p>Is this earlier report still true?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-community.3A-events/topic/ACT.202025/near/441953165\">said</a>:</p>\n<blockquote>\n<p>The plan seems to have solidified: James Fairbanks will hold ACT2025 and the adjoint school at the University of Florida May 19 - May 30, 2025, with the adjoint school being the first week and the conference the second week.</p>\n</blockquote>",
        "id": 472752149,
        "sender_full_name": "John Baez",
        "timestamp": 1727288493
    },
    {
        "content": "<p>We shifted a week to accommodate the big lens meeting in Japan. </p>\n<p>Adjoint School May 26-30<br>\nACT conference June 2 - 6</p>",
        "id": 472752913,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1727288767
    },
    {
        "content": "<p>Great!  Someone should put up a rudimentary webpage announcing this now.  I'll announce it all over the place.</p>",
        "id": 472758669,
        "sender_full_name": "John Baez",
        "timestamp": 1727291230
    },
    {
        "content": "<p>Hey folks, the ACT2025 conference organizers are making a choice between a $100 registration fee that includes lunch, and a $50 fee where you have to go get your own lunch.  Thoughts?</p>",
        "id": 481374332,
        "sender_full_name": "John Baez",
        "timestamp": 1731094069
    },
    {
        "content": "<p>So that's five lunches for fifty bucks and no need to think about where to go and everybody's having lunch more or less together? That seems probably worth it to me, as long as the lunch menus aren't too grim.</p>",
        "id": 481377882,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731095648
    },
    {
        "content": "<p>BTW, those numbers aren't final do not budget based on them.</p>",
        "id": 481386296,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1731099921
    },
    {
        "content": "<p>Okay.    They're tentative numbers.</p>",
        "id": 481414139,
        "sender_full_name": "John Baez",
        "timestamp": 1731115987
    },
    {
        "content": "<p>I agree with Kevin that it may be a good deal even, or especially, for the poorest of grad students.  \"There is no such thing as a free lunch\".</p>",
        "id": 481414248,
        "sender_full_name": "John Baez",
        "timestamp": 1731116050
    },
    {
        "content": "<p>Right, it's not like anybody who's actually coming out is likely to carry a ramen back to their hotel room for lunch.</p>",
        "id": 481414700,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731116386
    },
    {
        "content": "<p>I don't really know that for sure - that's why I was asking.  I've had students who were too poor to afford to go to conferences because the reimbursement came after the conference, which is not good enough if you don't have enough savings.  So I can easily imagine students who'd rather save $50 and eat ramen.  But I don't know.</p>",
        "id": 481415345,
        "sender_full_name": "John Baez",
        "timestamp": 1731116830
    },
    {
        "content": "<p>I guess I think that if you can swing the travel (waiting for reimbursement is definitely a problem for a lot of students) $50 isn't likely to be determinative on the margin, and for students at least that should be getting reimbursed as well.</p>",
        "id": 481498496,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731189788
    },
    {
        "content": "<p>But, yeah, the maximally inclusive thing would be to figure out how to poll all the young people who might come if finances work out and figure out what might flip their decision. Seems like a hard dataset to gather though.</p>",
        "id": 481498537,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731189836
    },
    {
        "content": "<blockquote>\n<p>I guess I think that if you can swing the travel (waiting for reimbursement is definitely a problem for a lot of students) $50 isn't likely to be determinative on the margin, and for students at least that should be getting reimbursed as well.</p>\n</blockquote>\n<p>Sounds reasonable.</p>\n<p>There's not time to poll people.   I was hoping some more people here would speak up by Sunday, when we have to make the decision.   If not, we'll just decide based on what we know now.  And that's okay.</p>",
        "id": 481506274,
        "sender_full_name": "John Baez",
        "timestamp": 1731196532
    },
    {
        "content": "<p>I think it is a great idea to have lunch included for the days of the conference. Not only for the reimbursement issue, but because it helps building a sense of community. I was at a conference where this was implemented and I had the best lunch time chats ever! <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 481513792,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731203553
    },
    {
        "content": "<p>Hi if you can do it for $10 that seems very good value. Some reasons we didn't do it in Oxford: </p>\n<ul>\n<li>there wasn't enough indoor space for people to eat it, without renting a separate lunch venue;</li>\n<li>what we could get in Oxford for that price would get very tedious by five days;</li>\n<li>there was plenty of good food nearby, cheaper and nicer than the delivery options.</li>\n</ul>",
        "id": 481569464,
        "sender_full_name": "Sam Staton",
        "timestamp": 1731251182
    },
    {
        "content": "<p>About reimbursement. Certainly some people had no way of getting reimbursed at all (including students, faculty, unemployed, employed in industry but attending for fun...). Several people complained that there was a registration fee at all, and/or asked for it to be waived for them. Some people didn't want to pay the full fee since they didn't want to stay the full time. Some people came without registering at all. Maybe this is less of an issue in Florida since they already have to find more money for transport. I think means-tested funding is too complicated, but I think it's worth having a plan ready to deal with these issues.</p>",
        "id": 481569627,
        "sender_full_name": "Sam Staton",
        "timestamp": 1731251304
    },
    {
        "content": "<p>Thanks for this wisdom.  I think we need a better mechanism to get lessons learned by the conference organizers (like you) to the steering board (like me) and then to the next year's conference organizers.  </p>\n<p>By the way, the extra price required for the registration to cover lunches is estimated at $50, not $10.</p>",
        "id": 481577310,
        "sender_full_name": "John Baez",
        "timestamp": 1731256711
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"705200\">@Federica Pasqualone</span> ! I think the more time we spend together at conferences like these, the better. For me, spending as much time with as many people as possible is a big draw to conferences just in general. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> </p>\n<p>P.S. I also just don't know nor have much time to find places to eat in Gainesville too <span aria-label=\"see no evil\" class=\"emoji emoji-1f648\" role=\"img\" title=\"see no evil\">:see_no_evil:</span></p>",
        "id": 481579211,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1731258213
    },
    {
        "content": "<p>A log file for ACT ... <span aria-label=\"light bulb\" class=\"emoji emoji-1f4a1\" role=\"img\" title=\"light bulb\">:light_bulb:</span></p>",
        "id": 481580450,
        "sender_full_name": "Federica Pasqualone",
        "timestamp": 1731259144
    },
    {
        "content": "<blockquote>\n<p>P.S. I also just don't know nor have much time to find places to eat in Gainesville too.</p>\n</blockquote>\n<p>The University of Florida has 60,000 students so if it's like a typical large US university there will be lots of places on campus for students (and applied category theorists) to buy lunch.</p>",
        "id": 481580578,
        "sender_full_name": "John Baez",
        "timestamp": 1731259232
    },
    {
        "content": "<p>However, I'm not hearing anyone say they'd rather get their own lunch and save $50, so I'll recommend the higher registration fee that includes lunch.    There are certainly lots of benefits to be able to keep talking to people at a conference and have lunch simply <em>appear</em>, rather than having to go get it.</p>",
        "id": 481580805,
        "sender_full_name": "John Baez",
        "timestamp": 1731259393
    },
    {
        "content": "<p>I'm not going to be at this conference, but one thing to be aware of that I don't think I saw mentioned is folks with dietary restrictions.</p>",
        "id": 481581460,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1731259937
    },
    {
        "content": "<p>We will keep going down the logistics to make that happen. Numbers aren’t final but I’ll compare to a typical lunch at the on campus dining and make sure we can be comparable. There are other factors in registration costs like coffee breaks, EasyChair fees, and copy supplies so the final numbers will also depend on the number of expected attendees and those costs. </p>\n<p>The biggest unknown factor at this point is the space to eat which has to be chosen in coordination with the available lecture spaces. </p>\n<p>Thanks for pointing that out Mike. We will be sure to have an accommodation plan. There is a fairly vibrant vegetarian and vegan community here so most places have good options for restrictions.</p>",
        "id": 481581607,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1731260084
    },
    {
        "content": "<p>We can even make a poll...</p>",
        "id": 481723918,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1731332250
    },
    {
        "content": "<p>/poll Would you rather<br>\npay 100$ with lunch included<br>\npay 50$, no lunch</p>",
        "id": 481723951,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1731332261
    },
    {
        "content": "<p>I'm glad so far everyone is voting for what I already recommended to the rest of the steering committee.  <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>   I'd been told to give input by today.</p>",
        "id": 481769255,
        "sender_full_name": "John Baez",
        "timestamp": 1731344717
    },
    {
        "content": "<p>I think this completely depends on the venue.  Some places (like Oxford) have lots of affordable lunch options.  Other universities are placed in the middle of nowhere with subsidized canteens for registered students with the only other options being expensive restaurants.</p>",
        "id": 481783540,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1731349706
    },
    {
        "content": "<p>Right now I'm talking about the University of Florida in Gainesville.   This has <a href=\"https://dineoncampus.com/UF\">lots of places where non-students can eat or buy food on campus</a>.  It's a holiday today, so 32 of these places are closed, but about 11 are still open, not counting several Starbucks.</p>",
        "id": 481801999,
        "sender_full_name": "John Baez",
        "timestamp": 1731356211
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> <a href=\"#narrow/channel/229141-community.3A-events/topic/ACT.202025/near/481783540\">said</a>:</p>\n<blockquote>\n<p>I think this completely depends on the venue.  Some places (like Oxford) have lots of affordable lunch options.  Other universities are placed in the middle of nowhere with subsidized canteens for registered students with the only other options being expensive restaurants.</p>\n</blockquote>\n<p>I think subsidized canteens, whether for registered students or not, mostly don't occur in the US anyway. Whether nearby restaurants are \"expensive\" depends on what you mean by \"expensive\", to be sure.</p>",
        "id": 481802049,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731356232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"609515\">@Kevin Carlson</span> I was thinking of some universities in France built in the suburbs where the canteen is like 3 euros and then every other restaurant is 15 euros.  I guess \"expensive\" in this case is relative to what price the organizers could get. But depending on the venue, the options vary widely.  For example, QPL this year at UBA in Argentina was between an airport and a massive motorway, so it made complete sense for the organizers to hire caterers, because it was so far away from everything.</p>",
        "id": 481802818,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1731356531
    },
    {
        "content": "<p>Yes, I've seen those canteens in France and Germany, they're great if you can get access.</p>",
        "id": 481802956,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1731356597
    },
    {
        "content": "<p>The organizers have received the committee's preference that we include food in the registration via David Spivak. I want to reiterate that these numbers are not final and that we will target comparable prices to eating at the on-campus food service. We will also have a method for supporting attendees with dietary restrictions as best we can with the resources we have.</p>",
        "id": 481960348,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1731421225
    },
    {
        "content": "<p>The <a href=\"https://gataslab.org/act2025\">Eighth International Conference on Applied Category Theory</a> (<a href=\"https://easychair.org/cfp/ACT2025\">https://easychair.org/cfp/ACT2025</a>) will take place at the University of Florida on June 2-6, 2025. The conference will be preceded by the Adjoint School on May 26-30, 2025. This conference follows previous events at Oxford (2024, 2019), University of Maryland (2023), Strathclyde (2022), Cambridge (2021), MIT (2020), and Leiden (2019).</p>\n<p>Applied category theory is important to a growing community of researchers who study computer science, logic, engineering, physics, biology, chemistry, social science, systems, linguistics and other subjects using category-theoretic tools. The background and experience of our members is as varied as the systems being studied. The goal of the Applied Category Theory conference series is to bring researchers together, strengthen the applied category theory community, disseminate the latest results, and facilitate further development of the field.</p>\n<p>SUBMISSION</p>\n<p>Important dates</p>\n<p>All deadlines are AoE (Anywhere on Earth).</p>\n<ul>\n<li>\n<p>February 26: title and brief abstract submission</p>\n</li>\n<li>\n<p>March 3: paper submission</p>\n</li>\n<li>\n<p>April 7: notification of authors</p>\n</li>\n<li>\n<p>May 19: Pre-proceedings ready versions</p>\n</li>\n<li>\n<p>June 2-6: conference</p>\n</li>\n</ul>\n<p>Submissions</p>\n<p>The submission URL is: <a href=\"https://easychair.org/conferences/?conf=act2025\">https://easychair.org/conferences/?conf=act2025</a> </p>\n<p>We accept submissions in English of original research papers, talks about work accepted/submitted/published elsewhere, and demonstrations of relevant software. Accepted original research papers will be published in a proceedings volume. The conference will include an industry showcase event and community meeting. We particularly encourage people from underrepresented groups to submit their work and the organizers are committed to non-discrimination, equity, and inclusion.</p>\n<ul>\n<li>\n<p>Conference Papers should present original, high-quality work in the style of a computer science conference paper (up to 12 pages, not counting the bibliography; more detailed parts of proofs may be included in an appendix for the convenience of the reviewers). Such submissions should not be an abridged version of an existing journal article although pre-submission arXiv preprints are permitted. These submissions will be adjudicated for both a talk and publication in the conference proceedings.</p>\n</li>\n<li>\n<p>Talk proposals not to be published in the proceedings, e.g. about work accepted/submitted/published elsewhere, should be submitted as abstracts, one or two pages long. Authors are encouraged to include links to any full versions of their papers, preprints or manuscripts. The purpose of the abstract is to provide a basis for determining the topics and quality of the anticipated presentation.</p>\n</li>\n<li>\n<p>Software demonstration proposals should also be submitted as abstracts, one or two pages. The purpose of the abstract is to provide the program committee with enough information to assess the content of the demonstration.</p>\n</li>\n</ul>\n<p>The selected conference papers will be published in a volume of Proceedings. Authors are advised to use EPTCS style; files are available at <a href=\"https://style.eptcs.org/\">https://style.eptcs.org/</a> <a href=\"https://style.eptcs.org/\">style.eptcs.org</a>.</p>\n<p>Reviewing will be single-blind, and we are not making public the reviews, reviewer names, the discussions nor the list of under-review submissions. This is the same as previous instances of ACT.</p>\n<p>In order to give our reviewers enough time to bid on submissions, we ask for a title and brief abstract of your submission by February 26. The full two-page pdf extended abstract submissions and up to 12 page proceedings submissions are both due by the submissions deadline of March 3 11:59pm AoE (Anywhere on Earth).</p>\n<p>Please contact the Programme Committee Chairs for more information: Amar Hadzihasanovic (<a href=\"mailto:amar@ioc.ee\">amar.hadzihasanovic@taltech.ee</a>) and JS Lemay (<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>).</p>\n<p>Programme Committee</p>\n<p>See conference website for full list: <a href=\"https://gataslab.org/act2025/act2025cfp\">https://gataslab.org/act2025/act2025cfp</a></p>",
        "id": 485512240,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1733085082
    },
    {
        "content": "<h2><a href=\"https://gataslab.org/act2025/act2025cfp\">Second Call for papers</a></h2>\n<p>The <a href=\"https://gataslab.org/act2025/act2025\">Eighth International Conference on Applied Category Theory</a> (<a href=\"https://easychair.org/cfp/ACT2025\">https://easychair.org/cfp/ACT2025</a>) will take place at the University of Florida on June 2-6, 2025. The conference will be preceded by the Adjoint School on May 26-30, 2025. This conference follows previous events at Oxford (2024, 2019), University of Maryland (2023), Strathclyde (2022), Cambridge (2021), MIT (2020), and Leiden (2019).</p>\n<p>Applied category theory is important to a growing community of researchers who study computer science, logic, engineering, physics, biology, chemistry, social science, systems, linguistics and other subjects using category-theoretic tools. The background and experience of our members is as varied as the systems being studied. The goal of the Applied Category Theory conference series is to bring researchers together, strengthen the applied category theory community, disseminate the latest results, and facilitate further development of the field.</p>\n<h2>SUBMISSION</h2>\n<h3>Important dates</h3>\n<p>All deadlines are AoE (Anywhere on Earth).</p>\n<ul>\n<li>\n<p>February 26: title and brief abstract submission</p>\n</li>\n<li>\n<p>March 3: paper submission</p>\n</li>\n<li>\n<p>April 7: notification of authors</p>\n</li>\n<li>\n<p>May 19: Pre-proceedings ready versions</p>\n</li>\n<li>\n<p>June 2-6: conference</p>\n</li>\n</ul>\n<h3>Submissions</h3>\n<p>The submission URL is: <a href=\"https://easychair.org/conferences/?conf=act2025\">https://easychair.org/conferences/?conf=act2025</a> </p>\n<p>We accept submissions in English of original research papers, talks about work accepted/submitted/published elsewhere, and demonstrations of relevant software. Accepted original research papers will be published in a proceedings volume. The conference will include an industry showcase event and community meeting. We particularly encourage people from underrepresented groups to submit their work and the organizers are committed to non-discrimination, equity, and inclusion.</p>\n<ul>\n<li>\n<p>Conference Papers should present original, high-quality work in the style of a computer science conference paper (up to 12 pages, not counting the bibliography; more detailed parts of proofs may be included in an appendix for the convenience of the reviewers). Such submissions should not be an abridged version of an existing journal article although pre-submission arXiv preprints are permitted. These submissions will be adjudicated for both a talk and publication in the conference proceedings.</p>\n</li>\n<li>\n<p>Talk proposals not to be published in the proceedings, e.g. about work accepted/submitted/published elsewhere, should be submitted as abstracts, one or two pages long. Authors are encouraged to include links to any full versions of their papers, preprints or manuscripts. The purpose of the abstract is to provide a basis for determining the topics and quality of the anticipated presentation.</p>\n</li>\n<li>\n<p>Software demonstration proposals should also be submitted as abstracts, one or two pages. The purpose of the abstract is to provide the program committee with enough information to assess the content of the demonstration.</p>\n</li>\n</ul>\n<p>The selected conference papers will be published in a volume of proceedings, to be published in Electronic Proceedings in Theoretical Computer Science (EPTCS). Authors are required to use EPTCS style for their submissions; files are available at <a href=\"https://style.eptcs.org/\">style.eptcs.org</a>.</p>\n<p>Reviewing will be single-blind, and we are not making public the reviews, reviewer names, the discussions nor the list of under-review submissions. This is the same as previous instances of ACT.</p>\n<p>In order to give our reviewers enough time to bid on submissions, we ask for a title and brief abstract of your submission by February 26 11:59pm AoE (Anywhere on Earth). The full two-page pdf extended abstract submissions and up to 12 page proceedings submissions are both due by the submissions deadline of March 3 11:59pm AoE (Anywhere on Earth).</p>\n<p>Please contact the Programme Committee Chairs for more information: Amar Hadzihasanovic (<a href=\"mailto:amar@ioc.ee\">amar.hadzihasanovic@taltech.ee</a>) and JS Lemay (<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>).</p>\n<h2>Programme Committee</h2>\n<ul>\n<li>\n<p>Amar Hadzihasanovic (PC Chair), Tallinn University of Technology</p>\n</li>\n<li>\n<p>JS Lemay (PC Chair), Macquarie University</p>\n</li>\n<li>\n<p>Benedikt Ahrens, Delft University of Technology</p>\n</li>\n<li>\n<p>Robert Booth, University of Edinburgh</p>\n</li>\n<li>\n<p>Cameron Calk, LIS</p>\n</li>\n<li>\n<p>Cole Comfort, Université de Lorraine</p>\n</li>\n<li>\n<p>Valeria de Paiva, Topos Institute </p>\n</li>\n<li>\n<p>Elena Di Lavore, University of Pisa</p>\n</li>\n<li>\n<p>Martin Frankland, University of Regina</p>\n</li>\n<li>\n<p>Jonas Frey, LIPN</p>\n</li>\n<li>\n<p>Tobias Fritz, University of Innsbruck </p>\n</li>\n<li>\n<p>Zeinab Galal, University of Bologna </p>\n</li>\n<li>\n<p>Léonard Guetta, Utrecht University</p>\n</li>\n<li>\n<p>Robin Kaarsgaard, University of Southern Denmark</p>\n</li>\n<li>\n<p>Martti Karvonen, UCL</p>\n</li>\n<li>\n<p>Shin-Ya Katsumata, Kyoto Sangyo University</p>\n</li>\n<li>\n<p>Alex Kavvos, University of Bristol</p>\n</li>\n<li>\n<p>Kohei Kishida, University of Illinois Urbana-Champagne</p>\n</li>\n<li>\n<p>Gabriele Lobbia, Università di Bologna</p>\n</li>\n<li>\n<p>Fosco Loregian, Tallinn University of Technology</p>\n</li>\n<li>\n<p>Giulio Manzonetto, IRIF</p>\n</li>\n<li>\n<p>Dan Marsden, University of Nottingham</p>\n</li>\n<li>\n<p>Adrian Miranda, University of Manchester</p>\n</li>\n<li>\n<p>Koko Muroya, NII</p>\n</li>\n<li>\n<p>Nina Otter, Université Paris-Saclay</p>\n</li>\n<li>\n<p>Hugo Paquet, INRIA Paris</p>\n</li>\n<li>\n<p>John Power, Macquarie University</p>\n</li>\n<li>\n<p>Dorette Pronk, Dalhousie University</p>\n</li>\n<li>\n<p>Callum Reader, University of Sheffield </p>\n</li>\n<li>\n<p>Martina Rovelli, University of Massachusetts Amherst</p>\n</li>\n<li>\n<p>Mehrnoosh Sadrzadeh, UCL</p>\n</li>\n<li>\n<p>Peter Selinger, Dalhousie University</p>\n</li>\n<li>\n<p>David Sprunger, University of Indiana</p>\n</li>\n<li>\n<p>Alexis Toumi, PlantingSpace</p>\n</li>\n<li>\n<p>Todd Trimble, Western Connecticut State University</p>\n</li>\n<li>\n<p>Sean Tull, Quantinuum</p>\n</li>\n<li>\n<p>Paul Wilson, Hellas.AI </p>\n</li>\n<li>\n<p>Dusko Pavlovic, University of Hawaii</p>\n</li>\n<li>\n<p>Ruben Van Belle, University of Oxford</p>\n</li>\n<li>\n<p>Priyaa Varshinee Srinivasan, Tallinn University of Technology</p>\n</li>\n</ul>",
        "id": 494682321,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1737323031
    },
    {
        "content": "<p>Hi all, I wanted to draw people's attention to and make a few requests on a matter with regards to the location of ACT 2025.</p>\n<p>The University of Florida is a dangerous location to hold a research week / conference for LGBTQ+ members of the applied category theory community, particularly the trans members, including (but importantly not limited to) me. Specifically, under Florida law, I cannot use a restroom at the University of Florida that matches my gender presentation because of the anti-trans restroom bill that went into effect in July 2023. Even entering the state risks arrest because of Florida's ID laws around gender implemented not long after. With much of the US federal government sharing a similar agenda and with Florida's legislative session ending in early May, this situation may get even worse by the time of the conference.</p>\n<p>Please note that I am not taking a political stance here—this is not a matter of political parties, this is a matter of personal safety and dignity on a highly politic<em>ized</em> issue. Also note that this is not a criticism of James' generous work to host ACT 2025 or of the other organizers' work to plan the conference—I recognize the institutional challenges in finding a suitable location to host the conference. Lastly, I know it would've been better to have mentioned this issue much earlier during the planning stages; it is unfortunate that this doesn't seem to have been a topic considered at the time, and for myself I wasn't sufficiently involved in the ACT community to have the topic on my radar prior to joining the Adjoint School for 2025.</p>\n<p>I am not alone in my assessment in the danger traveling to Florida presents. After the election, the journalist Erin Reed published this map: <a href=\"https://www.erininthemorning.com/p/post-election-2024-anti-trans-risk\">https://www.erininthemorning.com/p/post-election-2024-anti-trans-risk</a> with \"Do not travel\" warnings for Florida and Texas. Already in 2023, the Human Rights Campaign declared a national state of emergency in response to Florida's hateful legislature (<a href=\"https://www.hrc.org/campaigns/national-state-of-emergency-for-lgbtq-americans\">https://www.hrc.org/campaigns/national-state-of-emergency-for-lgbtq-americans</a>). The situation has worsened since then. I recognize that there is no public record of arrests taking place, but many anecdotes have come forward about vigilantes watching public restrooms and blocking, harassing, and assaulting trans people attempting to enter since the laws have passed (<a href=\"https://www.thedailybeast.com/floridas-anti-trans-bathroom-law-spurs-harrowing-vigilante-attacks/\">https://www.thedailybeast.com/floridas-anti-trans-bathroom-law-spurs-harrowing-vigilante-attacks/</a>). I also recognize that in response to the law, the University of Florida and broader Florida community have advocated for more gender neutral restrooms (<a href=\"https://sg.ufl.edu/wp-content/uploads/2024/02/SSB-2024-1132-Resolution-Calling-on-the-University-of-Florida-Administration-to-Provide-Enhanced-Gender-Neutral-Bathroom-Access-on-Campus-Grounds-for-Transgender-and-Gen.pdf\">https://sg.ufl.edu/wp-content/uploads/2024/02/SSB-2024-1132-Resolution-Calling-on-the-University-of-Florida-Administration-to-Provide-Enhanced-Gender-Neutral-Bathroom-Access-on-Campus-Grounds-for-Transgender-and-Gen.pdf</a>) and provided legal support to fight these restroom bills (<a href=\"https://www.southernlegal.org/news/trans-and-non-binary-activists-challenge-florida-bathroom-ban-as-unconstitutional-prior-to-national-marchnbsp\">https://www.southernlegal.org/news/trans-and-non-binary-activists-challenge-florida-bathroom-ban-as-unconstitutional-prior-to-national-marchnbsp</a>). This work highlights the reality of a dangerous environment for trans individuals navigating gendered restrooms in Florida. </p>\n<p>I'm not calling for the research week or conference to be relocated or else boycotted (because I don't expect this request could be answered, not because it wouldn't be beneficial). Rather, I and others request:<br>\na) An official statement from the organizers recognizing that holding the conference/research week at UF is unfortunate and a threat to valued members of the applied category theory community because of Florida's repressive anti-trans laws (Edit: It was just brought to my attention that a statement on the website already exists—I suppose this request may be more relevant for the Adjoint School specifically, with whom I also shared this message separately),<br>\nb) As many talks, resources, etc. as possible be made available online so that the conference/research week may be appreciated virtually (my impression is that this is likely already the case),<br>\nc) Clear instructions, shared on the event webpage prior to the research week, on where gender-neutral restrooms may be found for in-person attendees.</p>\n<p>To emphasize: These requests are the bare minimum, especially when compared, for instance, to the successful efforts to relocate JMM 1995 to protect members of the LGBTQ+ community (<a href=\"https://www.ams.org/journals/notices/201906/rnoti-p875.pdf\">https://www.ams.org/journals/notices/201906/rnoti-p875.pdf</a>). I trust that your commitment to the safety of our research community will help you see the necessity of the few basic requests I am making.</p>\n<p>Thank you for reading and considering my requests,<br>\nAndrea Abeje-Stine<br>\n5th year Math PhD Candidate - UC Riverside<br>\nStudent of the Adjoint School 2025</p>",
        "id": 498408008,
        "sender_full_name": "Andrea S",
        "timestamp": 1738954871
    },
    {
        "content": "<p>I have found an official page from the library that describes inclusive spaces in general. I will add a link to the website</p>\n<p><a href=\"https://uflib.ufl.edu/using-the-libraries/inclusive-spaces/\">https://uflib.ufl.edu/using-the-libraries/inclusive-spaces/</a></p>",
        "id": 498411148,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1738956047
    },
    {
        "content": "<p>I committed it directly to the main branch. Should be live in &lt;10min.</p>",
        "id": 498411494,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1738956182
    },
    {
        "content": "<p>I really appreciate the quick action and for y'all doing what you can to make the environment as welcoming as possible!</p>",
        "id": 498411718,
        "sender_full_name": "Andrea S",
        "timestamp": 1738956278
    },
    {
        "content": "<p>You're welcome (in both senses of the words)</p>",
        "id": 498411846,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1738956339
    },
    {
        "content": "<p>We're working on making these resources more visible on the website going forward. In the mean time, the campus map also has filters for many landmarks including ADA routes, bus stops, and single-occupant restrooms here: <a href=\"https://campusmap.ufl.edu/#/\">https://campusmap.ufl.edu/#/</a><br>\nYou just have  to select your desired locations using the filter in the top left corner.</p>",
        "id": 498848327,
        "sender_full_name": "Kierstin Riels",
        "timestamp": 1739216781
    },
    {
        "content": "<p>Hi everyone! Regarding the call for papers, is it a requirement that one has a degree in math (undergrad? master's? PhD??) to submit something?</p>",
        "id": 499248177,
        "sender_full_name": "JR Learnstomath",
        "timestamp": 1739370548
    },
    {
        "content": "<p>Whatever answer the organisers give, it would be a good idea to get someone with more experience to read what you've written before you submit it somewhere. Reviewers for conferences don't have a lot of time, so you're more likely to get useful feedback rather than disappointing/painful criticism if you work that way.</p>",
        "id": 499255308,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1739372392
    },
    {
        "content": "<p>There is no degree requirement. But Morgan is correct that feedback by someone who has presented at similar academic conferences in the past will be very helpful in preparing the paper</p>",
        "id": 499257997,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1739373026
    },
    {
        "content": "<p>Thanks, this is sensible and helpful!</p>",
        "id": 499407850,
        "sender_full_name": "JR Learnstomath",
        "timestamp": 1739435698
    },
    {
        "content": "<h2><a href=\"https://gataslab.org/act2025/act2025cfp\">Final Call for papers</a></h2>\n<p>The <a href=\"https://gataslab.org/act2025/act2025\">Eighth International Conference on Applied Category Theory</a> (<a href=\"https://easychair.org/cfp/ACT2025\">https://easychair.org/cfp/ACT2025</a>) will take place at the University of Florida on June 2-6, 2025. The conference will be preceded by the Adjoint School on May 26-30, 2025. This conference follows previous events at Oxford (2024, 2019), University of Maryland (2023), Strathclyde (2022), Cambridge (2021), MIT (2020), and Leiden (2019).</p>\n<p>Applied category theory is important to a growing community of researchers who study computer science, logic, engineering, physics, biology, chemistry, social science, systems, linguistics and other subjects using category-theoretic tools. The background and experience of our members is as varied as the systems being studied. The goal of the Applied Category Theory conference series is to bring researchers together, strengthen the applied category theory community, disseminate the latest results, and facilitate further development of the field.</p>\n<h2>SUBMISSION</h2>\n<h3>Important dates</h3>\n<p>All deadlines are AoE (Anywhere on Earth).</p>\n<ul>\n<li>\n<p>February 26: title and brief abstract submission</p>\n</li>\n<li>\n<p>March 3: paper submission</p>\n</li>\n<li>\n<p>April 7: notification of authors</p>\n</li>\n<li>\n<p>May 19: Pre-proceedings ready versions</p>\n</li>\n<li>\n<p>June 2-6: conference</p>\n</li>\n</ul>\n<h3>Submissions</h3>\n<p>The submission URL is: <a href=\"https://easychair.org/conferences/?conf=act2025\">https://easychair.org/conferences/?conf=act2025</a> </p>\n<p>We accept submissions in English of original research papers, talks about work accepted/submitted/published elsewhere, and demonstrations of relevant software. Accepted original research papers will be published in a proceedings volume. The conference will include an industry showcase event and community meeting. We particularly encourage people from underrepresented groups to submit their work and the organizers are committed to non-discrimination, equity, and inclusion.</p>\n<ul>\n<li>\n<p>Conference Papers should present original, high-quality work in the style of a computer science conference paper (up to 12 pages, not counting the bibliography; more detailed parts of proofs may be included in an appendix for the convenience of the reviewers). Such submissions should not be an abridged version of an existing journal article although pre-submission arXiv preprints are permitted. These submissions will be adjudicated for both a talk and publication in the conference proceedings.</p>\n</li>\n<li>\n<p>Talk proposals not to be published in the proceedings, e.g. about work accepted/submitted/published elsewhere, should be submitted as abstracts, one or two pages long. Authors are encouraged to include links to any full versions of their papers, preprints or manuscripts. The purpose of the abstract is to provide a basis for determining the topics and quality of the anticipated presentation.</p>\n</li>\n<li>\n<p>Software demonstration proposals should also be submitted as abstracts, one or two pages. The purpose of the abstract is to provide the program committee with enough information to assess the content of the demonstration.</p>\n</li>\n</ul>\n<p>The selected conference papers will be published in a volume of proceedings, to be published in Electronic Proceedings in Theoretical Computer Science (EPTCS). Authors are required to use EPTCS style for their submissions; files are available at <a href=\"https://style.eptcs.org/\">style.eptcs.org</a>.</p>\n<p>Reviewing will be single-blind, and we are not making public the reviews, reviewer names, the discussions nor the list of under-review submissions. This is the same as previous instances of ACT.</p>\n<p>In order to give our reviewers enough time to bid on submissions, we ask for a title and brief abstract of your submission by February 26 11:59pm AoE (Anywhere on Earth). The full two-page pdf extended abstract submissions and up to 12 page proceedings submissions are both due by the submissions deadline of March 3 11:59pm AoE (Anywhere on Earth).</p>\n<p>Due to technological constraints, only the keynote addresses, and the community meeting will be accessible via Zoom. Recordings of presentations will be made available after the conference on a best-effort basis. For exceptional circumstances in which a presenter cannot attend in person, submissions may be published in conference proceedings alone, and/or a recorded presentation may be made available after the conference. If circumstances outside your control prohibit you from presenting your work in person, please contact conference organizers.</p>\n<p>Please contact the Programme Committee Chairs for more information: Amar Hadzihasanovic (<a href=\"mailto:amar@ioc.ee\">amar.hadzihasanovic@taltech.ee</a>) and JS Lemay (<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>).</p>",
        "id": 499576689,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1739478278
    },
    {
        "content": "<p>I’m concerned about the decision not to prioritize ensuring all the ACT 2025 talks are live-streamed and recorded. It’s certainly been a point of pride for me how incredibly accessible the ACT conference has been historically—I believe ever since 2020 every ACT talk has been live-streamed to make remote participation fully possible.</p>\n<p>So it’s rather disheartening to see that this will not be the case this year—particularly in light of the very urgent concerns about travel to Florida for LGBTQ+ folks pointed out so eloquently by <span class=\"user-mention\" data-user-id=\"870248\">@Andrea S</span> above, as well as the difficulties and dangers faced by BIPOC and non-Americans traveling to the US in general and Florida in particular given the current climate. It seems to me that this will reduce possible participation in the conference dramatically for a wide section of our community.  </p>\n<p>I suppose I have little to offer in terms of solutions for this year beyond this hand-wringing, aside from the perhaps naive suggestion that registration fees might be put toward increasing remote accessibility rather than toward lunch. I entirely appreciate the difficulties and often thankless labor in coordinating something like this, but I would appreciate some explanation for how this lack of streaming capability came about and suggestions for what could be done to address this in the future. And there’s certainly still time before this conference to perhaps explore some creative options for remote participation. Thank you!</p>",
        "id": 500778291,
        "sender_full_name": "Nelson Niu",
        "timestamp": 1740016667
    },
    {
        "content": "<p>It’s pretty easy to set up zoom streaming and give a link to all registrants. We managed this in 2023 utilizing cameras built in to the room. Some people know how to combine this with YouTube live streaming, which has also been done before. I’m not sure what prevents organizers from allowing speakers to present virtually. I’ve organized a small number of events and never heard of a strict reason to do so.</p>",
        "id": 500780102,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1740017822
    },
    {
        "content": "<p>Unfortunately, due to the timing of the conference and a registrar policy about when they will release classrooms to uses other than classes, we could not receive a classroom assignment until the start of the summer semester. Waiting for classrooms would lead to a substantial risk that we would have no venue meeting our needs available. This outcome would lead to a cancellation of the conference after travel was booked. I determined that this risk was unacceptable and pursued a resolution. </p>\n<p>I attempted to resolve the registrar issue through the office of the Dean of Engineering, and we found a nonclassroom venue. However, this means that our venue cannot fully support hybrid instruction, which would be sufficient to enable synchronous remote participation. </p>\n<p>I would urge that the conference be planned 2 years in advance by an overlapping committee serving staggered 2 year terms for improved continuity of institutional knowledge.</p>",
        "id": 500783455,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1740020014
    },
    {
        "content": "<p>We are now attempting to do the last.</p>",
        "id": 500783942,
        "sender_full_name": "John Baez",
        "timestamp": 1740020317
    },
    {
        "content": "<p>Apologies to belabor the issue, but is the nonclassroom venue one where it would be impossible to set up cameras for livestreaming? Barring equipment or budgeting constraints around that, I imagine many speakers will want to present their work via a slide deck on, for example, a laptop; are there projectors that allow for that? In which case, even the partial experience of being able to listen to the speaker and see the slides in a Zoom room (which the speaker could host) is significantly better than being entirely unable to see the talk. I understand that the venue may be unable to fully support hybrid instruction, but would the nonclassroom venue make even partial hybrid viewing impossible?</p>",
        "id": 500786187,
        "sender_full_name": "Andrea S",
        "timestamp": 1740021784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275927\">@James Fairbanks</span> - Everyone on the ACT steering board who has expressed an opinion agrees that streaming the ACT talks is important, and one has said that \"given the current political situation, we need more streaming, not less\".     There are a lot of people who want to view those talks, yet are unable or unwilling to travel to the US.</p>\n<p>So is the problem that the room has no video camera built in?  Can we get someone with a video camera to stream the proceedings?</p>",
        "id": 500944155,
        "sender_full_name": "John Baez",
        "timestamp": 1740075971
    },
    {
        "content": "<p>Thank you John and the rest of the steering board for the prompt response!</p>",
        "id": 500964207,
        "sender_full_name": "Nelson Niu",
        "timestamp": 1740083533
    },
    {
        "content": "<p>Yeah, high quality streaming takes a tonne of resources and a tonne of work (I know this very well from experience), but shitty better-than-nothing streaming takes a $20 webcam (and also a tonne of work)</p>",
        "id": 501074360,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1740134451
    },
    {
        "content": "<p>I think the work is mainly just assigning one grad student (per room) to be responsible for nothing but turning it on and off, at least if you’re only going through Zoom.</p>",
        "id": 501158847,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1740160961
    },
    {
        "content": "<p>So, is what <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> is talking about the same as what <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> calls \"shitty better-than-nothing streaming\"?</p>\n<p>One thing about the shitty better-than-nothing approach is that it is, still, better than nothing.</p>",
        "id": 501185424,
        "sender_full_name": "John Baez",
        "timestamp": 1740171319
    },
    {
        "content": "<p>I'm advocating for shitty better-than-nothing streaming, absolutely.</p>",
        "id": 501185491,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1740171359
    },
    {
        "content": "<p>If the slides are being share-screened, it basically doesn't matter how good the cameras are. If we were a more chalk-talk community, it would matter more, but we mostly only do slide talks.</p>",
        "id": 501185847,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1740171506
    },
    {
        "content": "<p>Mics are another relevant issue.</p>",
        "id": 501185918,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1740171540
    },
    {
        "content": "<p>Yes, getting voice and a video of the slides is pretty good.</p>",
        "id": 501187659,
        "sender_full_name": "John Baez",
        "timestamp": 1740172254
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/channel/229141-community.3A-events/topic/ACT.202025/near/501158847\">said</a>:</p>\n<blockquote>\n<p>I think the work is mainly just assigning one grad student (per room) to be responsible for nothing but turning it on and off, at least if you’re only going through Zoom.</p>\n</blockquote>\n<p>It's also useful to have somebody (else) devoted to monitoring any online chat and the Zoom call or however it is done. This doesn't need to be much, but it can help pick up questions from remote participants, connection issues or silly problems like muted microphones much earlier.</p>",
        "id": 501408766,
        "sender_full_name": "Dan Marsden",
        "timestamp": 1740343415
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277105\">@JS PL (he/him)</span> (I'm guessing you're JS Lemay?) and <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span>, there's the preliminary deadline for title+abstract due tomorrow, but EasyChair's only submission link asks for the paper in the submission page as well, with a required PDF submission. Am I missing a different submission venue for title+abstract? If not, shall I just attach a blank PDF for the first stage?</p>",
        "id": 501738242,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740471802
    },
    {
        "content": "<p>The fact that the PDF attachment was made mandatory was accidental, sorry; it should be non-mandatory now (let me know if not)</p>",
        "id": 501739000,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1740472062
    },
    {
        "content": "<p>Perfect, thanks! Glad to know I’m the first to look at the submission page <span aria-label=\"smiling face\" class=\"emoji emoji-263a\" role=\"img\" title=\"smiling face\">:smiling_face:</span></p>",
        "id": 501739151,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740472102
    },
    {
        "content": "<p>The list of accepted talks is now on website: <a href=\"https://gataslab.org/act2025/act2025\">https://gataslab.org/act2025/act2025</a></p>",
        "id": 512976090,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1744955179
    },
    {
        "content": "<p>Registration is open. Deadline is May 19</p>",
        "id": 512976108,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1744955200
    },
    {
        "content": "<p>Was there any update on the streaming? We gave a handful of low-quality solutions, but I guess it's not clear if we're going to do any of them.</p>",
        "id": 513742279,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1745363368
    },
    {
        "content": "<p>No update at this time.</p>",
        "id": 513743509,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1745364087
    },
    {
        "content": "<p>ACT 2025 Call for Participation</p>\n<p>The 8th International Applied Category Theory Conference will be at the University of Florida, Gainesville, Florida, USA from June 2-6 2025. </p>\n<p>Conference Website with list of talks and registration fees: </p>\n<p><a href=\"https://gataslab.org/act2025/act2025\">https://gataslab.org/act2025/act2025</a></p>\n<p>Registration Link: </p>\n<p><a href=\"https://web.cvent.com/event/90221e5e-4fc5-4827-a025-cb57c5f22ba0/register\">https://web.cvent.com/event/90221e5e-4fc5-4827-a025-cb57c5f22ba0/register</a></p>\n<p>Registration Deadline: May 19 </p>\n<p>Lunch and coffee will be provided for attendees. </p>\n<p>Travel and registration assistance will be available to students depending on final registration numbers and funds available. Please follow this link for assistance applications:</p>\n<p><a href=\"https://forms.gle/MWDdBqNdFM9EewXv7\">https://forms.gle/MWDdBqNdFM9EewXv7</a></p>\n<p>For questions, please email: <a href=\"mailto:act2025@easychair.org\">act2025@easychair.org</a></p>",
        "id": 514740993,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1745825811
    },
    {
        "content": "<p>Hello!</p>\n<p>This year I am not on the scientific committee for ACT or otherwise involved in the organisation. However, at the suggestion of a member of the organising committee, I would like to propose an <em>unofficial</em> community and labour meeting, to be held entirely online in place of a morning session: this will fill a blank slot in the programme on Tuesday, June 3, at 10:45 local time (15:45 BST, 16:45 CEST).</p>\n<p>The goal of this session is to allow us to discuss ways for the community to organise and respond to the usual and unusual problems that we are facing. Suggested topics include:</p>\n<ul>\n<li>Problems specifically faced by scientists in the US under the current administration, and actions that are possible in support of scientists there. This includes problems faced by people who were unable to attend ACT.</li>\n<li>The continuing trend of funding cuts and orthogonal regression in Europe and the UK and the impact this is having on academic infrastructure, including the viability of the national and EU narrative that scientists should emigrate to Europe from the US.</li>\n<li>The much greater devastation to society, including science, in the Middle East.</li>\n<li>Places which are not represented within the community and reasons for the limited interactions (here I mean both the apparently limited interactions with some pockets of category theorists and the apparent absence of some nationalities from the discipline altogether).</li>\n</ul>\n<p>Of course, several of these topics may not be safe to discuss publicly for some participants. This is another reason that the meeting is not affiliated with ACT.</p>\n<p>Those who have been arranging this meeting behind the scenes, of whom I am the face, would prefer for the outcome of the discussion to be actionable decisions. These may take the form of:</p>\n<ul>\n<li>requests for the steering committee about what standards should be met for the organisation of future ACT editions.</li>\n<li>designing an open letter that individuals in the community can sign to present a public position.</li>\n<li>distributing details of charities and causes in need of direct financial support, reliable information sources and communication channels.</li>\n<li>the creation of working groups that can take the initiative in further actions that may need to be taken (this one is optimistic on my part, but I include it because in my experience initiative is the hardest thing to keep producing).</li>\n</ul>\n<p>I have volunteered to chair the meeting, as well as to take minutes, which will be anonymised.</p>\n<p><strong>To help organise this and plan the discussion, I am asking for volunteers who would be prepared to speak for a few minutes on a topic they feel should be discussed,</strong> who could also act as moderators for that section of the discussion. You can do so anonymously if you wish. (We don't have any special tools to hand to facilitate that, but if you judge it prudent to keep your camera off, use a pseudonym or disguise your voice for your own safety, it will not be a problem.)</p>",
        "id": 520599230,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748331286
    },
    {
        "content": "<p>Thank you (and anyone behind this). I'm happy to moderate a discussion if needed (but I'll be entirely remote this year).</p>",
        "id": 520605891,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1748333511
    },
    {
        "content": "<p>I'm interested in attending---will you circulate a Zoom/Jitsi link?</p>",
        "id": 520606636,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1748333757
    },
    {
        "content": "<p>Yes. I do not have access to a professional Zoom account; if anyone is able to volunteer the video platform (and will be available to manage it during the session) that would be a big help.</p>",
        "id": 520613224,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748335673
    },
    {
        "content": "<p>I can do that, if needed.</p>",
        "id": 520614558,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1748336068
    },
    {
        "content": "<p>Hi folks. The unofficial meeting I advertised above will happen in a little over 24h. Here is the proposed agenda. I hope to see many of you there (you do not have to be registered to ACT to attend!)<br>\nWe will distribute the Zoom meeting link here at least 1h before the meeting starts.<br>\n<a href=\"/user_uploads/21317/9pMKsZKw_ZL2_wrCJeVjcpJD/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/9pMKsZKw_ZL2_wrCJeVjcpJD/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"652x1071\" src=\"/user_uploads/thumbnail/21317/9pMKsZKw_ZL2_wrCJeVjcpJD/image.png/840x560.webp\"></a></div>",
        "id": 521758607,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748873771
    },
    {
        "content": "<p>For maximum clarity, the time of the meeting is <time datetime=\"2025-06-03T14:45:00Z\">2025-06-03T15:45:00+01:00</time>.</p>",
        "id": 521759408,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1748873972
    },
    {
        "content": "<p>Here are the details for the Zoom room. See you in ~1h 25mins!</p>\n<p>Topic: Community Meeting<br>\nTime: Jun 3, 2025 03:45 PM London</p>\n<p><a href=\"https://cs-ox-ac-uk.zoom.us/j/91518207842?pwd=EbDevIfTTLkcdwYiyTnhGOUqq7BCF5.1\">https://cs-ox-ac-uk.zoom.us/j/91518207842?pwd=EbDevIfTTLkcdwYiyTnhGOUqq7BCF5.1</a></p>\n<p>Meeting ID: 915 1820 7842<br>\nPasscode: 827091</p>",
        "id": 522121968,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748956814
    },
    {
        "content": "<p>About to start <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 522144161,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748961843
    },
    {
        "content": "<p>Thanks to everyone who attended. Can anyone who was there tell us roughly how many people were in the room?</p>",
        "id": 522162449,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748966261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/channel/229141-community.3A-events/topic/ACT.202025/near/522162449\">said</a>:</p>\n<blockquote>\n<p>Thanks to everyone who attended. Can anyone who was there tell us roughly how many people were in the room?</p>\n</blockquote>\n<p>roughly between 15-20 I believe. but my setup was a bit last minute</p>",
        "id": 522175692,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1748970206
    },
    {
        "content": "<p>In lieu of full-conference group outing Wednesday morning, we are recommending a variety of nearby activities to suit differing tastes for all attendees. </p>\n<ul>\n<li>The UF Harn Museum of Art opens at 10 am, has free admission to all visitors, and is conveniently located on campus. <a href=\"https://harn.ufl.edu/visit/\">https://harn.ufl.edu/visit/</a> </li>\n<li>Just behind the Harn is the Natural Area Teaching Lab (NATL), which has some beautiful nature trails open to the public. <a href=\"https://natl.ifas.ufl.edu/visit-natl/\">https://natl.ifas.ufl.edu/visit-natl/</a> </li>\n<li>Sweetwater Wetlands Park opens at 7 am daily and is either $2 per person or $5 a car. This park has paved trails and is a great way to see wildlife.  <a href=\"https://www.gainesvillefl.gov/Parks/Sweetwater-Wetlands-Park\">https://www.gainesvillefl.gov/Parks/Sweetwater-Wetlands-Park</a></li>\n<li>Dorrette Pronk (<a href=\"mailto:pronk@mathstat.dal.ca\">pronk@mathstat.dal.ca</a>) is leading a kyaking trip in Silver Springs, FL departing the conference venue at 7:30 AM Wednesday. Please email today by 6pm to join. Include in the email if you have a vehicle and can drive people to attend.</li>\n<li>The conference building will also be open starting at 9 am if you would like to collaborate with conference goers on campus. </li>\n</ul>\n<p>There are many more options if none of these strike you, just ask!</p>",
        "id": 522195164,
        "sender_full_name": "Kierstin Riels",
        "timestamp": 1748976842
    },
    {
        "content": "<p>Hello everyone, the ACT community meeting is Thursday evening Florida time. Slides and minutes will be available afterwards. A general comment submission form will also be availible afterwards. </p>\n<p>However If you have any comments or questions that you would like to be addressed during the meeting, please message them to me before 4:00PM Thursday Florida time.</p>",
        "id": 522211597,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1748983264
    },
    {
        "content": "<p>Final call for questions for today's conference community meeting. (thank you those that have sent questions in already)</p>",
        "id": 522586134,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749128400
    },
    {
        "content": "<p>Hi folks, I am thinking about going out dancing tonight in Gainesville -- heard there is salsa and bachata happening! Would anyone be interested in going with me?</p>",
        "id": 522628383,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1749140100
    },
    {
        "content": "<p>Hello everyone, here the slides from today's community meeting, it includes the PC report and the Adjoint School report: <br>\n<a href=\"/user_uploads/21317/46KViDbH078JcIZ8thCEy3Yn/ACT-2025-Community-Meeting-Slides.pdf\">ACT 2025 Community Meeting, Slides.pdf</a></p>",
        "id": 522689077,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749171845
    },
    {
        "content": "<p>Here is also the minutes from today's meeting: <br>\n<a href=\"/user_uploads/21317/1d1eO92hfDQ84jFaxek9oSxI/ACT-2025-Community-Meeting-Minutes.pdf\">ACT 2025 Community Meeting, Minutes.pdf</a></p>",
        "id": 522689320,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749172048
    },
    {
        "content": "<p>Here is also an annonymous feedback form about ACT2025 or ACT beyond (open until June 16):<br>\n<a href=\"https://forms.gle/HtHcALmrJQyFnSRT6\">https://forms.gle/HtHcALmrJQyFnSRT6</a></p>",
        "id": 522689344,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749172085
    },
    {
        "content": "<p>Thanks for sharing! Some unsolicited thoughts on my end:</p>\n<ol>\n<li>Re the imbalance in proceedings vs talk submission, I believe page limit can be a serious factor here. For a diagram-heavy subject like ours 12 pages (!) is really limiting. Not saying this is the case for everyone (I happen to work on a lot of 2 and 3 dimensional stuff) but raising the limit to something in the range 15-20 may help. Also, having a higher standard for submissions might make the venue more attractive. The market is there (as noted, CT25 is packed &amp; lots of ACT appears in CS conferences). Finally, the number of submissions correlates pretty well with the move of the conference earlier in the year. I'm outside of university cycles but maybe that's a non-trivial factor too.</li>\n<li>Something that might be considered is having separate tracks for theoretical and applied category theory, to solve the Balto problem (ie worrying a submission might not be applied enough or not theoretical enough)</li>\n<li>If hosting in the US has been deemed a significant factor impacting attendance &amp; submission, perhaps the location of ACT27 should be reconsidered. I'd love to visit Gioele at MIT and truly appreciate his offer (I know it's not an easy task!) but I don't expect the situation there to get any better in the next two years. A possibility is to make it <em>extremely</em> remote-first to accommodate people who can't travel (like, basically most non-USans). </li>\n<li>Speaking of the last point, has the idea of offsetting the cost of remote-readiness with a small remote registration fee be addressed? It seems only fair IMO.</li>\n</ol>",
        "id": 522719958,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1749194717
    },
    {
        "content": "<p>A message was moved from this topic to <a class=\"stream-topic\" data-stream-id=\"241990\" href=\"/#narrow/channel/241990-community.3A-discussion/topic/ACT.20post-community.20action.20meeting/with/522162449\">#community: discussion &gt; ACT post-community action meeting</a> by <span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span>.</p>",
        "id": 522734230,
        "sender_full_name": "Notification Bot",
        "timestamp": 1749200309
    },
    {
        "content": "<p>Conference photo along with the campus tour photo. </p>\n<p><a href=\"/user_uploads/21317/vVUC296663ZYXxq7Dh83lfI4/A080DBC0-6341-4C03-BF5A-1B08D66600E6.jpg\">A080DBC0-6341-4C03-BF5A-1B08D66600E6.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/vVUC296663ZYXxq7Dh83lfI4/A080DBC0-6341-4C03-BF5A-1B08D66600E6.jpg\" title=\"A080DBC0-6341-4C03-BF5A-1B08D66600E6.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"5712x4284\" src=\"/user_uploads/thumbnail/21317/vVUC296663ZYXxq7Dh83lfI4/A080DBC0-6341-4C03-BF5A-1B08D66600E6.jpg/840x560.webp\"></a></div><p><a href=\"/user_uploads/21317/bTELRtUwZ3F3o9W5n2s4Kb46/734FC778-A9FC-46FC-9AF6-B779E2FDC775.jpg\">734FC778-A9FC-46FC-9AF6-B779E2FDC775.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/bTELRtUwZ3F3o9W5n2s4Kb46/734FC778-A9FC-46FC-9AF6-B779E2FDC775.jpg\" title=\"734FC778-A9FC-46FC-9AF6-B779E2FDC775.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"5712x4284\" src=\"/user_uploads/thumbnail/21317/bTELRtUwZ3F3o9W5n2s4Kb46/734FC778-A9FC-46FC-9AF6-B779E2FDC775.jpg/840x560.webp\"></a></div>",
        "id": 522752822,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1749207439
    },
    {
        "content": "<p>It was a really cool campus tour: thanks <span class=\"user-mention\" data-user-id=\"275927\">@James Fairbanks</span> !</p>",
        "id": 522761878,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749211121
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277105\">JS PL (he/him)</span> <a href=\"#narrow/channel/229141-community.3A-events/topic/ACT.202025/near/522689344\">said</a>:</p>\n<blockquote>\n<p>Here is also an annonymous feedback form about ACT2025 or ACT beyond (open until June 16):<br>\n<a href=\"https://forms.gle/HtHcALmrJQyFnSRT6\">https://forms.gle/HtHcALmrJQyFnSRT6</a></p>\n</blockquote>\n<p>Thank you to all of you who have filled out the feedback form. Final reminder for those who still want too! (open until June 16)</p>",
        "id": 523726869,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1749724566
    }
]