[
    {
        "content": "<p>5th Annual International Conference on Applied Category Theory (ACT2022)<br>\nJuly 18–22, 2022<br>\n<a href=\"https://msp.cis.strath.ac.uk/act2022/\">https://msp.cis.strath.ac.uk/act2022/</a></p>\n<p>The Fifth International Conference on Applied Category Theory will take place at the University of Strathclyde from 18 to 22 July 2022, preceded by the Adjoint School 2022 from 11 to 15 July. This conference follows previous events at Cambridge (UK), Cambridge (MA), Oxford and Leiden.</p>\n<p>Applied category theory is important to a growing community of researchers who study computer science, logic, engineering, physics, biology, chemistry, social science, linguistics and other subjects using category-theoretic tools.  The background and experience of our members is as varied as the systems being studied. The goal of the Applied Category Theory conference series is to bring researchers together, strengthen the applied category theory community, disseminate the latest results, and facilitate further development of the field.</p>\n<p>SUBMISSIONS</p>\n<p>We accept submissions in English of original research papers, talks about work accepted/submitted/published elsewhere, and demonstrations of relevant software. Accepted original research papers will be published in a proceedings volume. The keynote addresses will be chosen from the accepted papers. The conference will include an industry showcase event and community meeting. We particularly encourage people from underrepresented groups to submit their work and the organizers are committed to non-discrimination, equity, and inclusion.</p>\n<p>Submission formats:</p>\n<p>Extended Abstracts should be submitted describing the contribution and providing a basis for determining the topics and quality of the anticipated presentation (1-2 pages). These submissions will be adjudicated for inclusion as a talk at the conference. Such work should include references to any longer papers, preprints, or manuscripts providing additional details.<br>\nConference Papers should present original, high-quality work in the style of a computer science conference paper (up to 14 pages, not counting the bibliography; detailed proofs may be included in an appendix for the convenience of the reviewers). Such submissions should not be an abridged version of an existing journal article (see item 1) although pre-submission Arxiv preprints are permitted. These submissions will be adjudicated for both a talk and publication in the conference proceedings. <br>\nSoftware Demonstrations should be submitted in the format of an Extended Abstract (1-2 pages) giving the program committee enough information to assess the content of the demonstration. We are particularly interested in software that makes category theory research easier, or uses category theoretic ideas to improve software in other domains.</p>\n<p>Extended abstracts and conference papers should be prepared with LaTeX. For conference papers please use the EPTCS style files available at &lt;<a href=\"http://style.eptcs.org\">http://style.eptcs.org</a>&gt;. The submission link is <a href=\"https://easychair.org/conferences/?conf=act2022\">https://easychair.org/conferences/?conf=act2022</a>.</p>\n<p>IMPORTANT DATES</p>\n<p>The following dates are all in 2022, and Anywhere On Earth.</p>\n<p>- Submission Deadline: Monday 9 May<br>\n   - Author Notification: Tuesday 7 June<br>\n   - Camera-ready version due: Tuesday 28 June<br>\n   - Adjoint School: Monday 11 to Friday 15 July<br>\n   - Main Conference: Monday 18 to Friday 22 July</p>\n<p>CONFERENCE FORMAT</p>\n<p>We hope to run the conference as a hybrid event with talks recorded or streamed for remote participation. However, due to the state of the pandemic, the possibility of<br>\nin-person attendance is not yet confirmed. Please be mindful of changing conditions when booking travel or hotel accommodations.</p>\n<p>FINANCIAL SUPPORT</p>\n<p>Limited financial support will be available. Please contact the organisers for more information.</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Jade Master, University of Strathclyde (Co-chair)<br>\nMartha Lewis, University of Bristol (Co-chair)</p>\n<p>The full program committee will be announced soon.</p>\n<p>ORGANISING COMMITTEE</p>\n<p>Jules Hedges, University of Strathclyde<br>\nJade Master, University of Strathclyde <br>\nFredrik Nordvall Forsberg, University of Strathclyde<br>\nJames Fairbanks, University of Florida</p>\n<p>STEERING COMMITTEE</p>\n<p>John Baez, University of California, Riverside<br>\nBob Coecke, Cambridge Quantum<br>\nDorette Pronk, Dalhousie University<br>\nDavid Spivak, Topos Institute</p>",
        "id": 273207635,
        "sender_full_name": "Jade Master",
        "timestamp": 1645782262
    },
    {
        "content": "<p>I'll draw attention to the one major change from previous years, which is the new submission track for tool demos. It's the same submission format as an extended abstract, but officially separated in order to be a giant signal to reviewers that they shouldn't try to review it like a paper. So it should be easier than in previous years to get in practical work that's hard or annoying to fit into the format of a research paper</p>",
        "id": 273212266,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1645785223
    }
]