[
    {
        "content": "<p>Here's an announcement from the ACT Steering Committee:</p>\n<p>The current plan is for <span class=\"user-mention\" data-user-id=\"769706\">@Gioele Zardini</span> to run the conference Applied Category Theory 2027 in Cambridge, Massachusetts: Gioele is at MIT.  There's a chance this may not happen, only because of the inherent unpredictability of life, so don't buy your tickets just yet - but this is the plan.  We thank Gioele very much for volunteering to do this.</p>",
        "id": 501190504,
        "sender_full_name": "John Baez",
        "timestamp": 1740173601
    },
    {
        "content": "<p>This is great news! I’m looking forward to it! The move to a 2 year planning cycle is a good choice for organizers and attendees.</p>",
        "id": 501207129,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1740183088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"769706\">@Gioele Zardini</span> has agreed to live stream ACT 2027.</p>",
        "id": 502148163,
        "sender_full_name": "John Baez",
        "timestamp": 1740605525
    },
    {
        "content": "<p>2027?</p>",
        "id": 502152465,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740607320
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229141-community.3A-events/topic/ACT.202027/near/502152465\">said</a>:</p>\n<blockquote>\n<p>2027?</p>\n</blockquote>\n<p>Yes -- but it was agreed to stream ACT 2026 in Tallin as well.</p>",
        "id": 502152931,
        "sender_full_name": "Gioele Zardini",
        "timestamp": 1740607495
    },
    {
        "content": "<p>Sorry, a cut-and-paste typo, which I have now fixed.  Btw, when I make dumb typos, you can just DM me and I'll fix them.  Otherwise we get a certain amount of permanent confusion in the stream.</p>",
        "id": 502168463,
        "sender_full_name": "John Baez",
        "timestamp": 1740614656
    },
    {
        "content": "<p>Right, thanks; you've done that for me before and I assumed it was more to protect my fragile pride, I see the point about clarifying the public record.</p>",
        "id": 502174278,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1740617948
    },
    {
        "content": "<p>I personally will not submit anything to conferences in the United States of America because I don't want to stimulate the the economy of a country which actively threatens the economic stability and sovereignty of my own.  Moreover, I do not want to attend a conference where my Chinese, Indian, and Iranian colleagues (among many others) will likely be unable to obtain visas, effectively excluding them.</p>\n<p>I suspect that other people are also avoiding participating in conferences organized in the USA, and perhaps this should be taken into consideration in the future, if not only to maintain the attendance which we have seen in previous years.</p>",
        "id": 502742785,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1740833099
    },
    {
        "content": "<p>Over on <a href=\"https://www.math.columbia.edu/~woit/wordpress/?p=14386\">Peter Woit's blog</a> there's a discussion of ICM 2026, the International Conference on Mathematics, which is a big deal math conference, scheduled to be held in Philadelphia.  Often the head of the nation opens this conference!     Woit is wondering whether it should be moved.  ICM 2022 was scheduled to be held in St. Petersburg, and was cancelled when Russia invaded Ukraine.</p>\n<p>Woit asks what is happening to other international conferences scheduled to be held in the US.</p>",
        "id": 502774067,
        "sender_full_name": "John Baez",
        "timestamp": 1740854134
    },
    {
        "content": "<p>There are abstract ethical problems with hosting conferences in countries like US, Russia and Israel. However, regardless of ones personal political beliefs regarding such countries, I think that it is much less controversial to observe that hosting conferences in such countries is inherently exclusionary, and will likely have the effect of lowering conference attendance.</p>\n<p>For each of these countries, there are a large number of people for whom entering the country is very difficult, if not impossible.  For example, very few people from Muslim majority countries can enter Israel (because of the policies of the state of Israel and the policies of their own governments).  Similarly, it is very difficult for people from the rest of Europe to enter Russia.  Similarly, the majority of the world, including most of the Muslim world, most of Africa, most of Asia are not usually granted visas for the United States in a timely manner, meaning they can not attend conferences in the USA without years of notice.  Therefore, in my opinion, hosting international conferences in such countries is inherently exclusionary, on top of the other moral qualms that are raised for all three of the examples I mentioned.</p>\n<p>At least having the option for speakers to be able to give talks online would slightly temper this exclusionary effect.  I remember at QPL in Orange California, basically all speakers from non western countries were not granted visas, and had to give online talks.  In academia, westerners already have a huge advantage, so organizing a conference in one country in the world which only grants visas to westerners in a timely fashion is just further confounding the western hegemony on academia.  I can't speak for other western countries, but I have never heard of an academic having problems obtaining a visa to talk at conferences in Canada, for example.</p>",
        "id": 502847781,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1740912942
    },
    {
        "content": "<p>Disclaimer: I'm not speaking for the ACT Steering Committee</p>\n<p>This is a very valid point, and on my end, I think I'd be able to support remote talks for the ACT'27 at MIT. I'd be happy to discuss this and other topics well in advance, to make sure that everyone is able to enjoy the conference and feel comfortable.</p>",
        "id": 502881136,
        "sender_full_name": "Gioele Zardini",
        "timestamp": 1740936140
    },
    {
        "content": "<p>I can't speak for everyone on the Steering Committee, but I think it's great that you can support remote talks at ACT2027, and I can't imagine anyone objecting.   Thanks!</p>",
        "id": 502887107,
        "sender_full_name": "John Baez",
        "timestamp": 1740940241
    },
    {
        "content": "<p>Complementarily, I could also try to put together some funding to host people who can't afford travel, in case they want to travel.</p>",
        "id": 502887397,
        "sender_full_name": "Gioele Zardini",
        "timestamp": 1740940452
    }
]