[
    {
        "content": "<p>Are you interested in using category-theoretic methods to tackle problems outside of pure mathematics?  Then you might like the <a href=\"https://adjointschool.com/\">Adjoint School</a>.  You'll work online on a research project with a mentor and a team of other students for several months.  Then you'll get together for several days at the end of May 2025 at the University of Florida in Gainesville, Florida.  This meeting happens right before the big annual conference on applied category theory, <a href=\"https://golem.ph.utexas.edu/category/2024/09/act_2025_and_the_adjoint_schoo.html\">ACT2025</a>.</p>\n<p>You can <a href=\"http://www.adjointschool.com/apply.html\">apply here</a> starting November 1st, 2024.  The deadline to apply is December 1st.</p>\n<p>For more details, including the list of mentors and their research projects, read on.</p>",
        "id": 479806113,
        "sender_full_name": "John Baez",
        "timestamp": 1730351228
    },
    {
        "content": "<h2>Important dates</h2>\n<ul>\n<li>Application opens: November 1, 2024</li>\n<li>Application deadline: December 1, 2024</li>\n<li>School runs: January-May, 2025</li>\n<li>Research week dates: May 26-30, 2025</li>\n</ul>\n<h2>Research projects</h2>\n<p>Here are the research project and mentors.  For the reading materials, visit the <a href=\"https://adjointschool.com/2025.html\">Adjoint School website</a>.</p>",
        "id": 479806257,
        "sender_full_name": "John Baez",
        "timestamp": 1730351352
    },
    {
        "content": "<h2>Rig Groupoids for Quantum Computation</h2>\n<p><strong>Mentor:</strong> Robin Kaarsgaard Sales</p>\n<blockquote>\n<p>Semirings are algebraic structures comprised of two unital and associative operations --- thought of as addition and multiplication --- extended with a distributive law stating that multiplication must distribute over addition. Their categorifications are rig categories, also known as bimonoidal categories. These categories not only allow composition in sequence but also in parallel in two different ways, with canonical morphisms for distributing (and factoring) one parallel composition over the other in a coherent way.</p>\n</blockquote>\n<blockquote>\n<p>The category of finite sets with bijections between them is, in aformal sense, the simplest possible rig category. It is also a groupoid in that the action of every morphism can be undone by an inverse. This category has been studied widely as a setting for classical reversible computation, i.e., computations where each computation step can be undone.</p>\n</blockquote>\n<blockquote>\n<p>A quirky feature of quantum computation (without measurement) is that it is also reversible.  Even more, quantum computation also takes place in a rig groupoid, namely that of finite dimensional Hilbert spaces and unitaries. Unlike finite sets and bijections, this rig groupoid contains morphisms and equations that are not found universally in rig groupoids --- but what are they, and what do they look like? In this project, we will explore the boundary between classical and quantum computation through the lens of category theory. We will do so by studying the extensions to the theory of classical reversible computation (given by the rig groupoid of finite sets and bijections) necessary to reproduce theories of quantum computation (given by rig groupoids of unitaries).</p>\n</blockquote>\n<h2>Homotopy of Graphs</h2>\n<p><strong>Mentor:</strong> Laura Scull</p>\n<blockquote>\n<p>Graphs are discrete structures made of vertices connected by edges, making examples easily accessible. We take a categorical approach to these, and work in the category of graphs and graph homomorphisms between them. Even though many standard graph theory ideas can be phrased in these terms, this area remains relatively undeveloped.</p>\n</blockquote>\n<blockquote>\n<p>This project will consider discrete homotopy theory, where we define the notion of homotopy between graph morphisms by adapting definitions from topological spaces. In particular, we will look at the theory of &times;-homotopy as developed by Dochtermann and Chih-Scull. The resulting theory has some but not all of the formal properties of classical homotopy of spaces, and diverges in some interesting ways.</p>\n</blockquote>\n<blockquote>\n<p>Our project will start with learning about the basic category of graphs and graph homomorphisms, and understanding categorical concepts such as limits, colimits and expnentials in this world. This offers an opportunity to play with concrete examples of abstract universal properties. We will then consider the following question: do homotopy limits and colimits exist for graphs? If so, what do they look like? This specific question will be our entry into the larger inquiries around what sort of structure is present in homotopy of graphs, and how it compares to the classical homotopy theory of topological spaces. We will develop this theme further in directions that most interest our group.</p>\n</blockquote>",
        "id": 479806380,
        "sender_full_name": "John Baez",
        "timestamp": 1730351443
    },
    {
        "content": "<h2>Compositional Generalization in Reinforcement Learning</h2>\n<p><strong>Mentor:</strong> Georgios Bakirtzis</p>\n<blockquote>\n<p>Reinforcement learning is a form of semi-supervised learning. In reinforcement learning we have an environment, an agent that acts on this environment through actions, and a reward signal.  It is the reward signal that makes reinforcement learning a powerful technique in the control of autonomous systems, but it is also the sparcity of this reward structure that engenders issues. Compositional methods decompose reinforcement learning to parts that are tractable. Categories provide a nice framework to think about compositional reinforcement learning.</p>\n</blockquote>\n<blockquote>\n<p>An important open problem in reinforcement learning is /compositional generalization.<br>\nThis project will tackle the problem of compositional generalization in reinforcement learning in a category-theoretic computational framework in Julia.  Expected outcomes are of this project are category theory derived algorithms and concrete experiments.  Participants will be expected to be strong computationally, but not necessarily have experience in reinforcement learning.</p>\n</blockquote>\n<p>&lt;h3&gt; Categorical Metric Structures for Numerical Analysis &lt;/h3&gt;</p>\n<p><strong>Mentor:</strong> Justin Hsu</p>\n<blockquote>\n<p>Numerical analysis studies computations that use finite approximations to continuous data, e.g., finite precision floating point numbers instead of the reals. A core challenge is to bound the amount of error incurred. Recent work develops several type systems to reason about roundoff error, supported by semantics in categories of metric spaces. This project will focus on categorical structures uncovered by these works, seeking to understand and generalize them.</p>\n</blockquote>\n<blockquote>\n<p>More specifically, the first strand of work will investigate the neighborhood monad, a novel graded monad in the category of (pseudo)metric spaces. This monad supports the forward rounding error analysis in the NumFuzz type system. There are several known extensions incorporating particular computational effects (e.g., failure, non-determinism, randomization) but a more general picture is currently lacking.</p>\n</blockquote>\n<blockquote>\n<p>The second strand of work will investigate backwards error lenses, a lens-like structure on metric spaces that supports the backward error analysis in the Bean type system. The construction resembles concepts from the lens literature, but a precise connection is not known. Connecting these lenses to known constructions could enable backwards error analysis for more complex programs.</p>\n</blockquote>\n<h2>Organizers</h2>\n<p>The organizers of Adjoint School 2025 are Elena Dimitriadis Bermejo, Ari Rosenfield, Innocent Obi, and Drew McNeely. The steering committee consists of David Jaz Myers, Daniel Cicala, Elena di Lavore, and Brendan Fong.</p>",
        "id": 479806486,
        "sender_full_name": "John Baez",
        "timestamp": 1730351533
    }
]