[
    {
        "content": "<p>Dear all,</p>\n<p>We're pleased to announce that applications for Adjoint School 2026 are currently open! Adjoint School is a great opportunity for anyone interested in seeing what applied category theory is all about, and collaborate with other researchers on some exciting topics such as quantum computation, Markov processes, and partiality! </p>\n<p>Applications are open until <em>December 14th</em>, you can find the application form <a href=\"https://adjointschool.com/2026.html\">here</a></p>\n<hr>\n<p><strong>Overview of the school</strong></p>\n<p>As a student of the Adjoint School, you will be in groups of 4-5 people led by a mentor and a few TAs. You can look at each of the four research project descriptions and the mentors <a href=\"https://adjointschool.com/2026.html\">here</a>. The focus of the school is to give students an environment to explore the proposed project topic, develop research skills, and network with other researchers in the applied category theory community. </p>\n<p>The school is divided into two sections: </p>\n<ol>\n<li>An online learning seminar period from <em>February - June 2026</em></li>\n<li>An in-person research week from <em>29 June to 6 July, 2026</em> in Talinn, Estonia. The following week will be the <a href=\"https://actconf2026.github.io/index.html\">ACT2026</a> conference.</li>\n</ol>\n<p>During the online seminar period, students read and discuss two assigned papers with their groups, and give presentations to the rest of the school. Up through the in-person research week, students will finalize their research as a blog-post on the n-Category Cafe and give a presentation at the ACT conference. During the in-person research week, students will meet regularly with their groups to further develop their research, practice presentations, and take some time to enjoy the sights in Talinn!</p>\n<hr>\n<p><strong>Who should apply?</strong></p>\n<p>If you're interested in learning about the many applications of category theoretic methods in other disciplines beyond pure math, please apply! We will consider applications from strong undergraduate, masters, PhDs, post-docs, or people outside of academia in a relevant discipline. We recommend some familiarity with basic category theory, but students will be in an interdisciplinary environment with people from computer science, math, engineering, physics, and other applied fields.</p>\n<hr>\n<p>Feel free to message <span class=\"user-mention\" data-user-id=\"870073\">@Aven Dauz</span>  or <span class=\"user-mention\" data-user-id=\"636946\">@Diana Kessler</span> if you have any questions!</p>",
        "id": 561867083,
        "sender_full_name": "Aven Dauz",
        "timestamp": 1764851934
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"870073\">@Aven Dauz</span>: is there a reason this hasn't been announced on the Categories Mailing list yet? I would expect most of the people interested in attending would be subscribed to the mailing list, but only a small proportion of people are on Zulip.</p>",
        "id": 562674173,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1765284210
    },
    {
        "content": "<p>And there aren't many days left until the deadline.</p>",
        "id": 562674241,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1765284233
    },
    {
        "content": "<p>My guess is that Aven and Diana don't read the category theory mailing list.  If so, I could post the ad there, or they join here:</p>\n<p><a href=\"https://ncatlab.org/nlab/show/categories+mailing+list\">https://ncatlab.org/nlab/show/categories+mailing+list</a></p>\n<p>It's possible more would-be students are here on this Zulip than read the category theory mailing list.   Even if so, many advisors of possible students are on the category theory mailing list.</p>",
        "id": 562916030,
        "sender_full_name": "John Baez",
        "timestamp": 1765360979
    },
    {
        "content": "<p>Dear all, </p>\n<p>We are writing to announce that the deadline to apply to Adjoint School has been extended to <strong>December 21st, 2025</strong>. We will update the website with the final project shortly and applicants can also edit their responses up until December 21st. </p>\n<p>We have also inquired about advertising the school on the Categories Mailing List.</p>\n<p>Thanks!</p>",
        "id": 563209280,
        "sender_full_name": "Aven Dauz",
        "timestamp": 1765465319
    },
    {
        "content": "<p>You can just join the categories mailing list and post an ad.   Ads for conferences and schools are the main thing on that list these days.  In the old days there were more discussions.  You can see examples of ads on the categories list <a href=\"#narrow/channel/410322-community.3A-mailing-list-mirror\">here</a>, since posts there also appear here.</p>",
        "id": 563210979,
        "sender_full_name": "John Baez",
        "timestamp": 1765465708
    },
    {
        "content": "<p>Yes, I would recommend just sending the content of your Zulip announcement to the email address associated with the categories mailing list.</p>",
        "id": 563231029,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1765470059
    },
    {
        "content": "<p>Thank you John and Nathanael, we got the announcement on the mailing list and definitely getting some positive results for reaching a wider audience, we appreciate the help!</p>",
        "id": 563835563,
        "sender_full_name": "Aven Dauz",
        "timestamp": 1765808339
    },
    {
        "content": "<p>It worked: the announcement for the Adjoint School is now on this Zulip <a href=\"#narrow/channel/410322-community.3A-mailing-list-mirror/topic/Adjoint.20School.202026/near/563297972\">here</a>.</p>",
        "id": 563846789,
        "sender_full_name": "John Baez",
        "timestamp": 1765810846
    }
]