[
    {
        "content": "<p>Dear all,</p>\n<p>Please see below the call for applications for an upcoming workshop I'm organizing with Nina Otter as an initiative of the <a href=\"https://www.demos-institute.org/\">DeMoS institute</a>: Algebra, Categories and Logic in Computing. </p>\n<p>This is a bilingual Farsi-English workshop, and is open to any researcher working in the field. In particular, participants do not need to be fluent in both languages to attend.</p>\n<p>Participants get funding covering their travel costs.</p>\n<p>Please don't hesitate to get in touch with questions (though I very infrequently open Zulip, so drop me an email if I'm being slow).</p>\n<hr>\n<p><strong>Algebra, Categories and Logic in Computing</strong></p>\n<p>Algebra, category theory and logic have traditionally played an important role in our understanding of computing. Recently, there has been a surge in new ways of understanding how these disciplines can help in tackling  challenges in the theory and applications of computing. Examples are: combining machine learning and proof-theoretic approaches to natural language; reasoning about multi-agent systems; developing programming languages and compositional models; and specifying and analyzing systems and protocols.</p>\n<p>The aim of this workshop is to bring together both leading and upcoming researchers who use such approaches, with the goal of promoting collaborations across the different disciplines.</p>\n<p>This workshop is the first event in a program aimed at offering Farsi-speaking mathematicians — as well as any mathematician interested in building cross-cultural connections — opportunities to build a network and receive mentoring from leading Farsi-speaking mathematicians. The workshop will be held in a bilingual Farsi-English setting, and participants do not need to be fluent in both languages to attend.</p>\n<p><strong>Invited speakers / mentors</strong>: <a href=\"https://homepages.cwi.nl/~farhad/\">Farhad Arbab</a> (Centrum Wiskunde &amp; Informatica, Amsterdam), <a href=\"https://www.uu.nl/staff/mmdastani\">Mehdi Dastani</a> (Utrecht University) and <a href=\"https://msadrzadeh.com/\">Mehrnoosh Sadrzadeh</a> (University College London).</p>\n<p><strong>Funding</strong>: expenses will be paid for everyone: bed and board is included, as well as travel expenses for an average of 300 euros per person.</p>\n<p><strong>Deadline for applications</strong>: 25 April 2023</p>\n<p><strong>Location</strong>: St Erme, France</p>\n<p><strong>Dates</strong>: 20-21 June 2023, with arrival on the 19th and departure on the 22nd.</p>\n<p>For more information see <a href=\"https://www.demos-institute.org/aclic\">https://www.demos-institute.org/aclic</a></p>",
        "id": 348795768,
        "sender_full_name": "Nima Motamed",
        "timestamp": 1681321325
    }
]