[
    {
        "content": "<p>The Australian Category Seminar has gone virtual but I don't see them showing any signs of opening it up to the public.  Am I wrong?  I get notices of these seminars, like this one just now:</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>  </mtext></mrow><annotation encoding=\"application/x-tex\">\\;</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0em;vertical-align:0em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span></span></span></p>\n<blockquote>\n<p>The Australian Category Seminar continues online on Wednesday 8 April. <br>\nThere will be just one talk this week, at 4 pm (talk details below). </p>\n<p>I will be emailing current members of the Centre of Australian Category Theory with practical information about the seminar itself, and Wednesday’s virtual seminar lunch and drinks.</p>\n<p>Wednesday 8 April, 4pm </p>\n<p>Speaker: Richard Garner</p>\n<p><strong>Title:</strong> Tensor products of models and comodels in computer science</p>\n<p><strong>Abstract:</strong> Models and comodels of algebraic theories, and the tensor product of a model with a comodel, were first studied by Freyd in 1966. This has subsequently become part of a rich strand of enquiry in categorical universal algebra (Bergman--Hausknecht, Tall--Wraith, Joyal, ...) -- while its meaning for computer science was examined by Plotkin and Power in 2008. This talk, a warm-up for some original material to come, will explain the general idea, and the applications in computer science.</p>\n</blockquote>\n<p>Are there any Australians here, who could make this seminar, or at least videos of talks, available to a larger audience?</p>",
        "id": 193125315,
        "sender_full_name": "John Baez",
        "timestamp": 1586226057
    },
    {
        "content": "<p>You're not wrong. <a href=\"https://en.wikipedia.org/wiki/William_Buckley_(convict)#You've_got_Buckley's_Chance\" title=\"https://en.wikipedia.org/wiki/William_Buckley_(convict)#You've_got_Buckley's_Chance\">You've got Buckley's chance</a> of the seminar (or audio or video recordings thereof) being made open to a wider audience.</p>",
        "id": 193127306,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1586228791
    },
    {
        "content": "<p>Your best option is, as it was before, to email the speaker or a member for a set of notes.</p>",
        "id": 193127333,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1586228858
    },
    {
        "content": "<p>Why is there resistance to recordings being made available?  Do the Australians want to maintain their competitive advantage?</p>",
        "id": 193130712,
        "sender_full_name": "John Baez",
        "timestamp": 1586233819
    },
    {
        "content": "<p>This was not my decision to make, so I can't say what the reasons were for making it.</p>",
        "id": 193140950,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1586235841
    },
    {
        "content": "<p>But I think it is generally agreed that the peculiar nature of the seminar (which will be familiar to some) is incompatible with it being recorded.</p>",
        "id": 193141746,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1586236776
    },
    {
        "content": "<p>For instance, the seminar is more informal and private than your average seminar. The vast majority of talks are by CoACT members, and the majority of those are on work in progress, and so are not necessarily yet fit for public consumption.</p>",
        "id": 193141842,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1586236913
    },
    {
        "content": "<p>Too bad... that's just why it's so interesting and valuable.</p>",
        "id": 193141896,
        "sender_full_name": "John Baez",
        "timestamp": 1586236962
    },
    {
        "content": "<p>It sounds like a lot of fun!</p>",
        "id": 193146987,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1586242982
    },
    {
        "content": "<p>More talks at the Australian Category Theory seminar:</p>\n<blockquote>\n<p>The Australian Category Seminar will meet again online on Wednesday 1 July. Please note that we will begin slightly later than usual, at 2:15 pm.</p>\n<p>As usual, I will be emailing current members of the Centre of Australian Category Theory with practical information about the seminar itself, and Wednesday’s virtual seminar lunch and drinks.</p>\n<p>The two talks will be as follows:</p>\n<hr>\n<p>-&gt; 2:15 pm</p>\n<p>Speaker: Sophie Raynor</p>\n<p>Title: A distributive law for modular operads</p>\n<p>Abstract: The combinatorics of modular operads are governed by undirected graphs of arbitrary genus, and are therefore significantly more complex than those of ordinary operads. I’ll discuss a very general notion of modular operad - essentially the compact symmetric multicategories of Joyal and Kock - for which the combination of the contraction operation with a unital operadic composition presents particular challenges for constructing a suitable nerve.</p>\n<p>In this talk, I’ll break down the issues and sketch a construction of a composite monad for modular operads. The decomposition enables us to apply Weber’s nerve machinery to obtain a fully faithful nerve. Perhaps more importantly, the combinatorics of modular operads - and especially the tricky bits - are made fully explicit. This provides a roadmap for generalising results to this setting, and for further generalising the setting itself, and I’ll indicate some of these new directions.</p>\n<hr>\n<p>-&gt; 4pm (approx.)</p>\n<p>Speaker: Ross Street</p>\n<p>Title: The monoidal centre for group-graded categories<br>\n(Joint work with Branko Nikolić)</p>\n<p>Abstract:<br>\nLet G be a group and k be a commutative ring. <br>\nOur aim is to ameliorate the G-graded categorical structures <br>\nconsidered by Turaev and Virelizier by fitting them into the monoidal bicategory context. <br>\nWe explain how these structures are monoidales in the monoidal centre <br>\nof the monoidal bicategory of k-linear categories on which G acts.<br>\nThis provides a useful example of a higher version of Davydov's full centre of an algebra.</p>\n</blockquote>",
        "id": 202385109,
        "sender_full_name": "John Baez",
        "timestamp": 1593478277
    },
    {
        "content": "<p>Tomorrow in the Australian Category Seminar I'll be speaking about a new proof of Lurie's Straightening Theorem. As discussed above, the talk won't be recorded (and the meeting is closed to non-members), but my slides are available at my website, for the curious: <a href=\"https://acmbl.github.io/straight_slides.pdf\">https://acmbl.github.io/straight_slides.pdf</a></p>",
        "id": 205204296,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1595920857
    },
    {
        "content": "<p>More at the Australian Category Seminar:</p>\n<ul>\n<li><strong>Speaker:</strong> Emily Riehl</li>\n<li><strong>Title:</strong> A formal language for model-independent (∞,1)-category theory</li>\n</ul>\n<blockquote>\n<p><strong>Abstract:</strong> The model independence of (∞,1)-category theory has never been in doubt, but it was unclear whether the model-independence of (∞,1)-category could be proven systematically, or whether \"experts\" would have to be relied on to provide ad hoc translations between models. Compounding this issue is the inevitable subtlety in understanding which statements about (∞,1)-categories are model-independent. For instance, the completeness axiom for Segal spaces has no clear analogue in the other models. </p>\n</blockquote>\n<blockquote>\n<p>In past work, we have shown that a large part of the theory of (∞,1)-categories can be developed formally in the virtual equipment of modules, and moreover that the virtual equipments associated to the common models of (∞,1)-categories are all \"biequivalent\" in a suitable sense. In this talk we adapt Makkai's First Order Logic with Dependent Sorts to define a formal language for writing statements about (∞,1)-categories, and prove that the validity of every formula written in that language is invariant under change of model.</p>\n</blockquote>\n<blockquote>\n<p>This is joint work with Dominic Verity.</p>\n</blockquote>",
        "id": 219906079,
        "sender_full_name": "John Baez",
        "timestamp": 1607982156
    },
    {
        "content": "<p>It's great that they're using First Order Logic with Dependent Sorts.  Makkai earlier used that to work on the opetopic approach to n-categories, getting a formalism where equality was completely eliminated.</p>",
        "id": 219906169,
        "sender_full_name": "John Baez",
        "timestamp": 1607982223
    },
    {
        "content": "<p>And another talk, also on Wednesday the 16th of December:</p>\n<ul>\n<li><strong>Speaker:</strong> Alexander Campbell</li>\n<li><strong>Title:</strong> How nice is the category of condensed sets?</li>\n</ul>\n<blockquote>\n<p><strong>Abstract:</strong> The new theory of \"condensed mathematics\" being developed by Clausen and Scholze promises to make analytic geometry amenable to the powerful techniques of modern algebraic geometry. The basic objects of this theory are the \"condensed sets\", which may be defined as the small sheaves on the large site of compact Hausdorff spaces with the coherent topology. (These are nearly the same as the pyknotic sets of Barwick and Haine, up to issues of size.)</p>\n</blockquote>\n<blockquote>\n<p>In this talk we shall study several categorical properties of the category of condensed sets (which properties are surely known to the experts). We shall prove that this category is a locally small, well-powered, locally cartesian closed infinitary-pretopos, that it is neither a Grothendieck topos nor an elementary topos -- since it lacks both a small generator (indeed, it is not even total) and a subobject classifier - but that it does have a large generator of finitely presentable projectives, and hence is algebraically exact. We shall also discuss the relationship of Spanier's quasi-topological spaces to condensed sets.</p>\n</blockquote>",
        "id": 219906338,
        "sender_full_name": "John Baez",
        "timestamp": 1607982303
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Australian.20Category.20Seminar/near/219906169\">said</a>:</p>\n<blockquote>\n<p>It's great that they're using First Order Logic with Dependent Sorts.  Makkai earlier used that to work on the opetopic approach to n-categories, getting a formalism where equality was completely eliminated.</p>\n</blockquote>\n<p>Emily's abstract reminds me of a very interesting HoTTEST talk of Simon Henry on <a href=\"https://www.youtube.com/watch?v=7_X0qbSXlfk\">The language of a model category</a>, which was also inspired by FOLDS.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"7_X0qbSXlfk\" href=\"https://www.youtube.com/watch?v=7_X0qbSXlfk\"><img src=\"https://i.ytimg.com/vi/7_X0qbSXlfk/default.jpg\"></a></div>",
        "id": 219923558,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1607992585
    },
    {
        "content": "<p>Both these abstracts sounds very interesting, but... where can I watch the talks/read the notes? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 219954123,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1608024774
    },
    {
        "content": "<p><span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> He didn't ask if there's a video!</p>",
        "id": 219962908,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1608030035
    },
    {
        "content": "<p>It would be pretty impressive if he managed to watch the talks without a video</p>",
        "id": 219969564,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1608034334
    },
    {
        "content": "<blockquote>\n<p>Neuralink</p>\n</blockquote>",
        "id": 219992209,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1608045142
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Australian.20Category.20Seminar/near/219954123\">said</a>:</p>\n<blockquote>\n<p>Both these abstracts sounds very interesting, but... where can I watch the talks/read the notes? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>\n</blockquote>\n<p>At  Macquarie University.</p>",
        "id": 220046771,
        "sender_full_name": "John Baez",
        "timestamp": 1608068525
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277459\">@Alexander Campbell</span> said that he couldn't find his notes for this talk, and had to work from memory!</p>",
        "id": 220196540,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1608167892
    },
    {
        "content": "<p>More talks at the Australian Category Seminar on February 17th 2021:</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>  </mtext></mrow><annotation encoding=\"application/x-tex\">\\; </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0em;vertical-align:0em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span></span></span></p>\n<ul>\n<li>\n<p><strong>Speaker:</strong> Yuki Maehara</p>\n</li>\n<li>\n<p><strong>Title:</strong> Orientals as free weak ω-categories</p>\n</li>\n</ul>\n<p><strong>Abstract:</strong> The orientals were introduced by Street as the free strict ω-categories on simplices. The main result of this work is that they are also the free <em>weak</em> ω-categories on the same generating data. More precisely, the complicial nerve of the n-th oriental is a fibrant replacement of Delta[n] in Verity's model structure.</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>  </mtext></mrow><annotation encoding=\"application/x-tex\"> \\; </annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0em;vertical-align:0em;\"></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span></span></span></p>\n<ul>\n<li>\n<p><strong>Speaker:</strong> Bryce Clarke</p>\n</li>\n<li>\n<p><strong>Title:</strong> What's so nice about the category of lenses? </p>\n</li>\n</ul>\n<p><strong>Abstract:</strong> It has been 10 years since the category Lens, of categories and (delta) lenses, was introduced by Diskin, Xiong, and Czarnecki. Throughout this time, lenses have continued to be of interest to both computer scientists and category theorists alike, and much progress has been made in understanding their properties. However there are many aspects of the category Lens which remain unknown. For instance, understanding pullbacks in Lens has been important for developing a theory of symmetric lenses, yet very little is known about when they exist. </p>\n<p>In this talk, I will discuss recent progress made towards understanding the category Lens, including the construction of certain classes of limits and colimits, monoidal structures, and factorisations systems. The talk is based on results originating from the Applied Category Theory 2020 Adjoint School, and is joint work with Michael Johnson, Emma Chollet, Maurine Songa, Vincent Wang, and Gioele Zardini.</p>",
        "id": 226316676,
        "sender_full_name": "John Baez",
        "timestamp": 1613325197
    }
]