[
    {
        "content": "<p>~~~ Bohemian Logical &amp; Philosophical Café ~~~</p>\n<p>Speaker: Michael Shulman<br>\nTitle: The derivator of setoids.</p>\n<p>May 4 at 16.00 Prague time (GMT+2)</p>\n<p>The zoom link is on the page:<br>\n<a href=\"https://bohemianlpc.github.io\">https://bohemianlpc.github.io</a></p>\n<p>Abstract:<br>\nCan homotopy theory be developed in constructive mathematics, or even in ZF set theory without the axiom of choice? Recent work inspired by homotopy type theory has yielded two constructive homotopy theories (simplicial sets and equivariant cubical sets) that are classically equivalent to that of spaces, but it is unknown if they are constructively equivalent to each other. If they are not, then which one is correct? Or are they both correct, or both incorrect? What do these questions even mean?<br>\nI will propose one criterion for the correctness of a constructive homotopy theory of spaces: as a derivator, it should be the free cocompletion of a point. (A derivator is an enhancement of the homotopy category that remains 1-categorical, but can still express universal properties of this sort.) Then I will give some evidence that any such homotopy theory must have the curious property that its 1-truncation contains, not only sets, but also setoids. Specifically, the ex/lex completion of the category of sets defines a derivator that satisfies a relative version of the aforementioned universal property; thus it should be a localization of any derivator satisfying the absolute condition. This suggests that either setoids are an unavoidable aspect of constructive homotopy theory, or the criterion needs to be modified.</p>",
        "id": 236609783,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1619663250
    },
    {
        "content": "<p>I have corrected the time of this talk to 16.00 in Prague (GMT +2).</p>",
        "id": 236843786,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1619793343
    },
    {
        "content": "<p>Is there a discussion thread for this talk? I can't seem to find it.</p>",
        "id": 237396904,
        "sender_full_name": "Ian Coley",
        "timestamp": 1620162023
    },
    {
        "content": "<p>Not on Zulip, but you're welcome to start one! (Or discuss here directly.)</p>",
        "id": 237397327,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1620162108
    },
    {
        "content": "<p>Soon as I finish watching the recording! I'm very impressed it went up on the same day.</p>",
        "id": 237397638,
        "sender_full_name": "Ian Coley",
        "timestamp": 1620162163
    }
]