[
    {
        "content": "<p>Topos Institute is excited to announce a book club for \"The Joy of Abstraction\", by Eugenia Cheng. This book is an introduction to category theory for anyone who wants to get into the formality of the subject but does not necessarily have the mathematical background to read a standard textbook. Part 1 starts gently, so that readers can build up to the formality of rigorous mathematics even if they haven't encountered it before. Part 2 gets into formal rigorous category theory, including limits and colimits, duality, functors, natural transformations, and the Yoneda lemma.</p>\n<p>For more information about the book and a sample video of Dr Cheng, see here <a href=\"https://youtu.be/96t4dFSm0Xk\">https://youtu.be/96t4dFSm0Xk</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"96t4dFSm0Xk\" href=\"https://youtu.be/96t4dFSm0Xk\"><img src=\"https://uploads.zulipusercontent.net/00b5666a129f46476a11ecc2d415dfd2eaa9ac0b/68747470733a2f2f692e7974696d672e636f6d2f76692f393674346446536d30586b2f64656661756c742e6a7067\"></a></div><p>Dr Cheng would like to give people an opportunity to ask questions and get help with understanding the book. The book club will be hosted by the Topos Institute and will be run asynchronously. We will go at an approximate rate of one chapter per week and invite any readers to submit questions for each chapter according to a published schedule. We will then collate the questions and Dr Cheng will make a video each week addressing the questions for that chapter. You will remain anonymous when asking the questions so please don't hesitate to ask questions that might feel \"stupid\". We welcome any question that comes from you wanting to understand something more.</p>\n<p>Each video will be posted at <a href=\"https://topos.site/joa-bookclub/\">https://topos.site/joa-bookclub/</a> during the week following the deadline for questions. If you are ahead of schedule you are welcome to submit questions in advance, but they will only be addressed in the video for that chapter.</p>\n<p>To submit questions, please fill in this google form: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSd3OZ6MAlPb-MqKhMy-bvA7SqazlAKw4W-VxiBT-SdMyvx5nQ/viewform\">https://docs.google.com/forms/d/e/1FAIpQLSd3OZ6MAlPb-MqKhMy-bvA7SqazlAKw4W-VxiBT-SdMyvx5nQ/viewform</a>. Include a page reference for your question, if relevant, so that we can address the questions in order in the video.</p>\n<p>This book club is open to everyone everywhere. Please spread the word!</p>\n<p>Note that the schedule may change as we go along, but the deadlines for each chapter will only become later, never earlier.</p>",
        "id": 326705629,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1675899062
    },
    {
        "content": "<p>Great!  I'll help spread the word.</p>",
        "id": 326713384,
        "sender_full_name": "John Baez",
        "timestamp": 1675903876
    },
    {
        "content": "<p>I just got my hands on this book! I look forward to asking many stupid questions....</p>",
        "id": 326714047,
        "sender_full_name": "Benjamin Lyons",
        "timestamp": 1675904325
    }
]