[
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>                 Second call for participation\n\nDifferential λ-Calculus and Differential Linear Logic, 20 Years Later \n                          (DiλLL 2024)\n\n                Monday 13 -- Friday 17 May 2024\n                CIRM, Luminy, Marseille, France\n\n             Deadline for registration: *17 March 2024*\n                   (but please, register ASAP)\n\n             https://conferences.cirm-math.fr/2980.html\n</code></pre></div>\n\n<p>Announcement<br>\n============</p>\n<p>Twenty years after the publication of Ehrhard and Regnier’s first seminal paper<br>\non the subject [1], we are delighted to announce a conference on Differential<br>\nλ-calculus and Differential Linear Logic [2], nicknamed DiλLL 2024.</p>\n<p>[1] <a href=\"https://doi.org/10.1016/S0304-3975(03)00392-X\">https://doi.org/10.1016/S0304-3975(03)00392-X</a> <br>\n   [2] <a href=\"https://conferences.cirm-math.fr/2980.html\">https://conferences.cirm-math.fr/2980.html</a></p>\n<p>It will be held on 13--17 May 2024, at the CIRM in Luminy (Marseille, France), <br>\nthe campus where this fruitful line of work started twenty years ago.</p>\n<p>The programme will consist in a series of invited talks, a good proportion of<br>\nwhich will be tutorials, targeted at young researchers as well as<br>\nnon-specialists. It will also include surveys of the main advances obtained in<br>\nthe course of twenty years, as well as research talks on current topics.</p>\n<p>For young researchers, it will also be possible to display posters in the<br>\npremises of the conference during the whole week, in order to foster discussion<br>\naround your work.</p>\n<p>Registration<br>\n============</p>\n<p>Please register ASAP if you are interested in attending. The firm deadline<br>\nfor in person registration is <em>17 March 2024</em>, assuming the capacity of the <br>\nCIRM is not reached by then.</p>\n<p>Registration is done on the CIRM's website [3], which is also <br>\navailable on the conference page as \"STEP 1 - PRE-REGISTER - APPLY HERE\".</p>\n<div class=\"codehilite\"><pre><span></span><code>[3] https://www.cirm-math.fr/preRegistration/index.php?EX=login&amp;id_renc=2980\n</code></pre></div>\n\n<p>Note that if you do not know all the details of your participation yet, it is <br>\npossible to register now, and modify your registration until the deadline.</p>\n<p>If you have any questions regarding the event, feel free to email the<br>\norganizers:  <a href=\"mailto:dill2024-org@listes.math.cnrs.fr\">dill2024-org@listes.math.cnrs.fr</a> .</p>\n<p>Participation is free, and we plan to fund the accommodation of all<br>\nparticipants requiring it, as well as to provide a limited number of travel<br>\ngrants. See below.</p>\n<p>Funding<br>\n=======</p>\n<p>We plan to fund the accommodation of any participant, within the limits of<br>\nthe capacity of the CIRM and of our budget. If you have funding available, <br>\nallowing you to pay for your own accommodation, please let us know during<br>\nregistration: this will allow us to allocate more of our own funding to <br>\nother participants.</p>\n<p>The details of your accommodation will be managed by the CIRM.</p>\n<p>We also plan to offer a limited number of travel grants, mainly targeted at<br>\nyoung researchers (master or PhD students, postdocs): you can apply for such a<br>\ngrant in the registration form.</p>\n<p>A first round of travel grants has been attributed, but further requests<br>\ncan still be considered.</p>\n<p>Organizing Committee<br>\n====================</p>\n<p>Rémy Cerda (Aix-Marseille Université), <br>\nGiulio Guerrieri (University of Sussex), <br>\nFederico Olimpieri (Aix-Marseille Université), <br>\nChristine Tasson (Sorbonne Université), <br>\nLionel Vaux Auclair (Aix-Marseille Université).</p>",
        "id": 425882551,
        "sender_full_name": "Federico Olimpieri",
        "timestamp": 1710154391
    }
]