[
    {
        "content": "<ul>\n<li><strong>Title:</strong> Category Theory in Communication, Cryptography, and Security</li>\n<li><strong>Speaker:</strong> Peter Hines</li>\n<li><strong>Time:</strong> Friday October 23, 2020, 1-2pm, EDT</li>\n</ul>\n<blockquote>\n<p><strong>Abstract.</strong> This talk is intended as an introduction to some of the basics and fundamentals of category theory, with particular emphasis on why they might be of interest to researchers in communication, cryptography, and security (CCS). No previous knowledge of category theory is assumed, although some basic algebra (groups, monoids, homomorphisms, quotients, etc.) will be required at times.</p>\n<p>Despite its reputation as a highly abstract subject, best suited to the foundations of mathematics and logic, a more recent trend has been to see category theory – and categorical reasoning generally – as a very practical tool. It is now used in a wide range of fields, from its early adoption in computer science to more recent applications in quantum protocols, linguistics and natural language processing, and cognitive science.</p>\n<p>An important theme of these more recent applications is that category theory is an appropriate tool for studying the flow of information; it is entirely natural to consider whether this interpretation may be extended to CCS in a similar manner.</p>\n<p>We introduce the basic definitions of category theory, along with a common graphical tool for categorical reasoning (the ‘diagram-chasing’ central to much of category theory), and consider how this may be interpreted in the context of communication protocols. This leads to simple graphical techniques and tools for modeling and reasoning about information flow, and for dealing with scenarios where we have incomplete knowledge about which communications have or have not taken place.</p>\n<p>We then move on to considering some fundamental structures from the foundations of category theory (based on the theory of categorical coherence), and observe that these have at times made a highly unexpected appearance in CCS. We discuss the motivation and reasoning behind the use of such structures, and whether their identification as core category theory has any practical consequences. We also discuss - based on examples - whether this is simply coincidental or whether it is part of a more general pattern.</p>\n</blockquote>",
        "id": 214128908,
        "sender_full_name": "John Baez",
        "timestamp": 1603324274
    },
    {
        "content": "<p>To attend live by Zoom please email  </p>\n<p><a href=\"mailto:harley.eades@gmail.com\">harley.eades@gmail.com</a></p>\n<p>You can also watch it on YouTube live here:</p>\n<p><a href=\"https://youtu.be/Njw5Aad-gBQ\">https://youtu.be/Njw5Aad-gBQ</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Njw5Aad-gBQ\" href=\"https://youtu.be/Njw5Aad-gBQ\"><img src=\"https://i.ytimg.com/vi/Njw5Aad-gBQ/default.jpg\"></a></div>",
        "id": 214128993,
        "sender_full_name": "John Baez",
        "timestamp": 1603324336
    },
    {
        "content": "<p>For more information (but not much more) go here:</p>\n<p><a href=\"https://the-au-forml-lab.github.io/colloquium_talks/Hines.html\">https://the-au-forml-lab.github.io/colloquium_talks/Hines.html</a></p>",
        "id": 214129032,
        "sender_full_name": "John Baez",
        "timestamp": 1603324381
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Category.20theory.20for.20cryptography/near/214128908\">said</a>:</p>\n<blockquote>\n<p>category theory is an appropriate tool for studying the flow of information</p>\n</blockquote>\n<p>That's a good slogan</p>",
        "id": 214162124,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1603358630
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Category.20theory.20for.20cryptography/near/214162124\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Category.20theory.20for.20cryptography/near/214128908\">said</a>:</p>\n<blockquote>\n<p>category theory is an appropriate tool for studying the flow of information</p>\n</blockquote>\n<p>That's a good slogan</p>\n</blockquote>\n<p>That's the principle that has been guiding the entire categorical quantum mechanics development:<br>\n<a href=\"https://arxiv.org/abs/quant-ph/0506132\">https://arxiv.org/abs/quant-ph/0506132</a></p>",
        "id": 214165236,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1603360610
    },
    {
        "content": "<p>Just to be clear, I was just quoting the abstract of the talk.  But I would be happy to claim credit for the slogan: \"category theory is an appropriate tool for studying the flow of information\".</p>",
        "id": 214213338,
        "sender_full_name": "John Baez",
        "timestamp": 1603384614
    }
]