[
    {
        "content": "<p>You can listen to Steve Strogatz's interview of Eugenia Cheng, or read a transcript, here:</p>\n<ul>\n<li><a href=\"https://www.quantamagazine.org/is-there-math-beyond-the-equal-sign-20230322\">Is there math beyond the equal sign?</a>, <em>Quanta</em>, March 22, 2023.</li>\n</ul>",
        "id": 344115525,
        "sender_full_name": "John Baez",
        "timestamp": 1679611111
    },
    {
        "content": "<p>It's kind of an intro to category theory.</p>",
        "id": 344115653,
        "sender_full_name": "John Baez",
        "timestamp": 1679611170
    },
    {
        "content": "<p>A nice quote from Eugenia Cheng:</p>\n<blockquote>\n<p>Yes, I love abstraction because I enjoy it. And I think we don’t talk about that enough with math. There’s a big push to tell everyone how useful math is and how important it is because it’s going to help you solve problems in life. And I think that that’s doing math a little bit of a disservice. Yes, it is very useful. And yes, it does help me in various ways. But I also just love doing it. And that’s why I gave the title of my book, the title that I gave it, which is The Joy of Abstraction. It’s not the usefulness of abstraction — it’s the joy of abstraction. Because to me, it really is a joyful process. It’s like shining light on things. You know, I just went outside today, and the sun was shining so brightly, and that just gave me joy, not because I’m looking for something, and I can see it better. You know, if I dropped something on the street and I was looking for it, then it, yes, it would be helpful that the sun was shining. But it’s just nice, isn’t it, to be able to see things clearly. And that’s what I love about abstraction. What it feels like to me is that there’s kind of fog everywhere. And then when you perform an abstraction, you’re clearing away irrelevant details, as you say, and then you can see things more clearly. And that, to me is joyful.</p>\n</blockquote>",
        "id": 344122365,
        "sender_full_name": "John Baez",
        "timestamp": 1679614208
    }
]