[
    {
        "content": "<p>Members of this community with an interest in combinatorics may be interested in CLA (<a href=\"https://cla.tcs.uj.edu.pl/\">https://cla.tcs.uj.edu.pl/</a>), which is an annual interdisciplinary workshop around combinatorial and quantitative aspects of mathematical logic.  This year we are going fully virtual, with CLA 2020 being held online 12-13 October.  We are still accepting talk proposals, and applied category theory talks within the scope of the workshop would be most welcome.  (Note the submission deadline is pretty soon: Sep 7th anytime-on-earth.)  In any case, registration is free and all are welcome to participate.</p>",
        "id": 208995878,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1599151222
    },
    {
        "content": "<p>The full programme of the CLA workshop is now online (<a href=\"https://cla.tcs.uj.edu.pl/#program\">https://cla.tcs.uj.edu.pl/#program</a>), including 12 technical talks (see below) and an problem session, as well as a brief history of CLA by Pierre Lescanne and Marek Zaionc.  If you are interested in attending any of these, please register for the workshop this week.</p>\n<h2>Invited speakers</h2>\n<ul>\n<li>Mirai Ikebuchi (Massachusetts Institute of Technology), <em>Homological Methods in Rewriting</em></li>\n<li>Marc Noy (Universitat Politècnica de Catalunya), <em>Limiting probabilities of first order sentences in sparse random graphs</em></li>\n</ul>\n<h2>Contributed talks</h2>\n<ul>\n<li>Maciej Bendkowski, <em>A note on the asymptotic expressiveness of ZF and ZFC</em></li>\n<li>Olivier Bodini, Alexandros Singh and Noam Zeilberger, <em>Distribution of Parameters in Certain Fragments of the Linear and Planar λ-calculus</em></li>\n<li>Antoine Genitrini, <em>Reduced Ordered Binary Decision Diagrams as compacted tree-structures: Enumeration and Sampling</em></li>\n<li>Katarzyna Grygiel and Guan-Ru Yu, <em>In search of a bijection between β-normal 3-indecomposable planar lambda terms and β(0,1)-trees</em></li>\n<li>Michaël Moortgat, <em>The Tamari order for D3 and derivability in semi-associative Lambek-Grishin Calculus</em></li>\n<li>Martin Pépin, <em>Statistical Analysis of Non-Deterministic Fork-Join Processes</em></li>\n<li>Andrew Elvey Price, Wenjie Fang and Michael Wallner, <em>Compacted binary trees admit stretched exponentials</em></li>\n<li>Ryoma Sin'Ya, <em>A quantitative approach to the primitive words conjecture</em></li>\n<li>Richard Statman, <em>Algebraic and combinatorial structures intrinsic to functional programming</em></li>\n<li>Paul Tarau and Valeria de Paiva, <em>Training Neural Networks as Theorem Provers via the Curry-Howard Isomorphism</em></li>\n</ul>",
        "id": 212268693,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1601884735
    },
    {
        "content": "<p>I wonder what Ikebuchi has to say about homological methods in rewriting... is this connected to Craig Squier's result? Oh, <a href=\"https://drops.dagstuhl.de/opus/volltexte/2019/10531/pdf/LIPIcs-FSCD-2019-24.pdf\">I guess it is</a>.</p>",
        "id": 212318954,
        "sender_full_name": "John Baez",
        "timestamp": 1601913121
    },
    {
        "content": "<p>I also wonder what \"the asymptotic expressiveness of ZF and ZFC\" means.</p>",
        "id": 212319047,
        "sender_full_name": "John Baez",
        "timestamp": 1601913154
    },
    {
        "content": "<p>Thanks for noticing that <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>, I find Squier's results fascinating so I'd love to hear more about that line of work. <span class=\"user-mention\" data-user-id=\"295757\">@Noam Zeilberger</span>, will talks be recorded?</p>",
        "id": 212329417,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1601918029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> You can find abstracts for all the talks on the webpage, e.g., for <a href=\"https://cla.tcs.uj.edu.pl/pdfs/CLA_Bendkowski.pdf\">Bendkowski's talk</a> (\"asymptotic expressiveness\" is referring to relative asymptotic density of provable formulas among all formulas of a given size). <span class=\"user-mention\" data-user-id=\"276320\">@Antonin Delpeuch</span> Yes the talks will be recorded!  We plan to make them available sometime after the workshop.</p>",
        "id": 212344741,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1601925534
    },
    {
        "content": "<p>Thanks!  That abstract is really interesting, but I'm wondering if it contains typo or something.  He writes:</p>\n<blockquote>\n<p>Secondly, we show that it is not possible to refute the existence of μ(ZFC ) within ZFC itself. For that purpose we link the provable existence of μ(ZFC) with the provable consistency of ZFC. In light of Gödel’s second incompleteness theorem, the existence of μ(ZFC) becomes unprovable  within ZFC.</p>\n</blockquote>\n<p>First he talks about \"refuting the existence\", and then he switches to \"proving the existence\".</p>\n<p>(μ(ZFC ) is the limiting density of statements in the language of ZFC that are provable within ZFC.)</p>",
        "id": 212351894,
        "sender_full_name": "John Baez",
        "timestamp": 1601929475
    },
    {
        "content": "<p>I should probably read a paper by him to see if he's claiming the existence of  μ(ZFC) cannot be proved within ZFC, cannot be refuted within ZFC, or both.</p>",
        "id": 212351995,
        "sender_full_name": "John Baez",
        "timestamp": 1601929528
    },
    {
        "content": "<p>In the abstract he says \"Furthermore, we show that if ZFC consistent, it is not possible to refute the existence of the asymptotic density of ZFC theorems within ZFC itself.\"   So there it's about refuting, not proving.</p>",
        "id": 212352312,
        "sender_full_name": "John Baez",
        "timestamp": 1601929678
    },
    {
        "content": "<p>I don't see a paper by him that discusses this.  It's interesting stuff!</p>",
        "id": 212352379,
        "sender_full_name": "John Baez",
        "timestamp": 1601929695
    },
    {
        "content": "<p>I asked Benkowski about this, here is his response:</p>\n<blockquote>\n<p>Ohh.. that's an excellent catch! Please thank John Baez for me.<br>\nIndeed, that's an unfortunate mistake in the abstract. The revised abstract would be:</p>\n<p>\"We investigate the asymptotic densities of theorems provable in Zermelo-Fraenkel<br>\nset theory zf and its extension zfc including the axiom of choice. Assuming a canonical De<br>\nBruijn representation of formulae, we construct asymptotically large sets of sentences unprovable<br>\nwithin zf, yet provable in zfc. Furthermore, we link the asymptotic density of<br>\nzfc theorems with the provable consistency of zfc itself. Consequently, if zfc is consistent, it<br>\nis not possible to refute the existence of the asymptotic density of zfc theorems within zfc.<br>\nBoth these results address a recent question by Zaionc regarding the asymptotic equivalence of<br>\nzf and its extension zfc.\"</p>\n<p>The mistake comes from the fact that the \"link\" I mention, technically speaking, means<br>\nZFC |-  ZFC is consistent iff \\neg \\mu(1). In the revised abstract I now mention that<br>\nI link the asymptotic density of theorems of zfc with its consistency, without specifying<br>\nany more details of that link. I hope that clarifies things now.</p>\n</blockquote>",
        "id": 212394161,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1601970214
    },
    {
        "content": "<p>He also says, \"The paper's coming soon, I need to polish some rough edges, but I hope to publish it on arxiv this week.\"</p>",
        "id": 212394189,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1601970232
    },
    {
        "content": "<p>Ah, \"this week\", how many times I have erroneously claimed to reach that proximity to article publication...</p>",
        "id": 212397830,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1601972812
    },
    {
        "content": "<p>Great, I'm glad the abstract is clear now!  It looks interesting.</p>",
        "id": 212453378,
        "sender_full_name": "John Baez",
        "timestamp": 1602002132
    }
]