[
    {
        "content": "<p>I hope everyone who wants to learn about coalgebraic methods has heard about Helle Hvid Hansen and Clemens Kupke's course at the <a href=\"http://adjointschool.com/apply\">ACT2021 Adjoint School</a>.  You can apply for it before January 29th!</p>\n<p><strong>Topic: Extensions of coalgebraic dynamic logic</strong></p>\n<p><strong>Mentors:</strong> Helle Hvid Hansen and Clemens Kupke</p>\n<p><strong>Description:</strong> Coalgebra is a branch of category theory in which different types of state-based systems are studied in a uniform framework, parametric in an endofunctor <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mo>:</mo><mi>C</mi><mo>→</mo><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">F : C \\to C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span></span></span></span> that specifies the system type. Many of the systems that arise in computer science, including deterministic/nondeterministic/weighted/probabilistic automata, labelled transition systems, Markov chains, Kripke models and neighbourhood structures, can be modeled as F-coalgebras. Once we recognise that a class of systems are coalgebras, we obtain general coalgebraic notions of morphism, bisimulation, coinduction and observable behaviour.</p>\n<p>Modal logics are well-known formalisms for specifying properties of state-based systems, and one of the central contributions of coalgebra has been to show that modal logics for coalgebras can be developed in the general parametric setting, and many results can be proved at the abstract level of coalgebras. This area is called coalgebraic modal logic.</p>\n<p>In this project, we will focus on coalgebraic dynamic logic, a coalgebraic framework that encompasses Propositional Dynamic Logic (PDL) and Parikh's Game Logic. The aim is to extend coalgebraic dynamic logic to system types with probabilities. As a concrete starting point, we aim to give a coalgebraic account of stochastic game logic, and apply the coalgebraic framework to prove new expressiveness and completeness results.</p>\n<p>Participants in this project would ideally have some prior knowledge of modal logic and PDL, as well as some familiarity with monads.</p>\n<p><strong>Readings:</strong></p>\n<p>Parts of these:</p>\n<p>• <a href=\"https://www.sciencedirect.com/science/article/pii/S0304397500000566\">Universal coalgebra: a theory of systems</a>, Rutten.</p>\n<p>• <a href=\"https://www.sciencedirect.com/science/article/pii/S0304397511003215\">Coalgebraic semantics of modal logics: an overview</a>, Kupke and Pattinson.</p>\n<p>• <a href=\"https://hal.inria.fr/hal-01402072/document\">Strong completeness of iteration-free coalgebraic dynamic logics</a>, Hansen, Kupke, and Leale.</p>",
        "id": 221476734,
        "sender_full_name": "John Baez",
        "timestamp": 1609716073
    }
]