[
    {
        "content": "<p>Dear all, here is the announcement of the next Category Theory Meeting. </p>\n<p>The next International Category Theory Meeting will take place in Genoa and online, from Monday 30 August to Saturday 4 September 2021.</p>\n<p>The talks will be available online for all the participants, and, if the local conditions allow it, the event will be held on site at DIMA, UniGe (Department of Mathematics, University of Genoa), in via Dodecaneso 35, Genoa, Italy.</p>\n<p>One year ago the first announcement of Category Theory 2020 was distributed, but that conference could not take place, due to the pandemic worldwide.  So we decided to name the forthcoming conference \"CT20-&gt;21\" as it gathers the 2020 and 2021 editions.</p>\n<p>Contributions in all aspects of Category Theory are welcome and we especially encourage researchers to submit works on its applications as well as on its foundations.</p>\n<p>At the moment the website<br>\n<a href=\"https://sites.google.com/view/ct2021\">https://sites.google.com/view/ct2021</a><br>\ncontains only basic information, and will be updated as soon as details become available, especially monitoring the local conditions.</p>\n<p>Submission for abstracts of talks will open on 1 April, through EasyChair.  The deadline for submitting an abstract is 15 May.  We encourage prospective contributors to submit their abstract as soon as they can, because submissions will be handled continuously as they come.   Abstract acceptance will be communicated by 30 June at the latest.</p>\n<p>Registration will open on 20 April.  Detailed information on registration fees and options will be made available on the conference website in due time.</p>\n<p>CT20-&gt;21 SCIENTIFIC COMMITTEE</p>\n<p>Maria M. Clementino, Marcelo Fiore, Nicola Gambino, Steve Lack, Rory Lucyshyn-Wright, Sandra Mantovani, Matías Menni (chair), Christina Vasilakopoulou</p>\n<p>KEYNOTE SPEAKERS</p>\n<p>Mai Gehrke - LJAD, Université Côte d’Azur, Nice, France<br>\nMarino Gran - Université catholique de Louvain, Belgium<br>\nNick Gurski - Case Western Reserve University, Cleveland, USA<br>\nPeter Johnstone - University of Cambridge, UK<br>\nAngus Macintyre - Queen Mary, University of London, UK<br>\nWalter Tholen - York University, Toronto, Canada</p>\n<p>To request any specific information please write to<br>\n<a href=\"mailto:info.ct2021@gmail.com\">info.ct2021@gmail.com</a>.</p>\n<p>We look forward to seeing you in Genoa, either in person or in video!</p>\n<p>ORGANIZING COMMITTEE<br>\nSandra Mantovani, Giuseppe Metere, Eugenio Moggi, Andrea Montoli, Giuseppe Rosolini (chair)</p>",
        "id": 228551513,
        "sender_full_name": "Beppe Metere",
        "timestamp": 1614758618
    },
    {
        "content": "<p>Now I'll be daydreaming about being in late-summer Genova for the rest of the day...</p>",
        "id": 228559352,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1614762910
    },
    {
        "content": "<p>I hope I get to be there in person!</p>",
        "id": 228559912,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1614763198
    },
    {
        "content": "<p>The list of speakers and talks is now up: <a href=\"https://sites.google.com/view/ct2021/speakers?authuser=0\">https://sites.google.com/view/ct2021/speakers?authuser=0</a></p>",
        "id": 246427541,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1626682547
    },
    {
        "content": "<p>And now a (tentative) programme is up: <a href=\"https://sites.google.com/view/ct2021/programme?authuser=0\">https://sites.google.com/view/ct2021/programme?authuser=0</a></p>",
        "id": 250734648,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1629963168
    },
    {
        "content": "<p>Ah, cool. I checked it earlier today with no luck.</p>",
        "id": 250735246,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629963515
    },
    {
        "content": "<p>I just removed the \"tentative\" from the title... however some little changes are still possible</p>",
        "id": 251039352,
        "sender_full_name": "Beppe Metere",
        "timestamp": 1630138732
    },
    {
        "content": "<p>For whom it may concern: there's now an official stream for CT2021-related conversations, <a class=\"stream\" data-stream-id=\"298844\" href=\"/#narrow/stream/298844-conference.3A-CT20-.3E21\">#conference: CT20-&gt;21</a></p>",
        "id": 251140307,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1630251921
    }
]