[
    {
        "content": "<p>Nina Otter is starting an institute called the <a href=\"https://demos-institute.org/\">DeMoS Institute</a>, and they're going to be running a bootcamp on data visualization.   The idea of the institute:</p>\n<blockquote>\n<p>The institute carries out research on topics related to anti-democratic tendencies in our society, as well as on meta-scientific questions on how to make the scientific system more democratic. We believe that research must be done in the presence of those who bear their consequences. Therefore,  we perform our research while at the same time implementing directly practices that promote inclusivity, interdisciplinarity, and in active engagement with society at large.</p>\n</blockquote>\n<p>The idea of the bootcamp:</p>\n<blockquote>\n<p><em>Call for applications</em></p>\n<p>We are advertising the following bootcamp, which will take place<br>\nremotely on 22-25 June 2021.</p>\n<p>If you are interested in participating, please apply here:<br>\n<a href=\"https://forms.gle/CowQEnKxjXgf4pha8\">https://forms.gle/CowQEnKxjXgf4pha8</a></p>\n<p>FishEthoBase data visualisation bootcamp: This is a 4-day bootcamp,<br>\norganised by the DeMoS Institute (<a href=\"https://demos-institute.org/\">https://demos-institute.org/</a>), whose<br>\naim is to study ways to visualise scores and criteria from a fish<br>\nethology database. The database (<a href=\"http://fishethobase.net/\">http://fishethobase.net/</a>) is an<br>\ninitiative led by the non-profits fair-fish international<br>\n(<a href=\"http://www.fair-fish.net/what/\">http://www.fair-fish.net/what/</a>) and FishEthoGroup<br>\n(<a href=\"https://fishethogroup.net/\">https://fishethogroup.net/</a>). The database is publicly accessible, it<br>\nstores all currently available ethological knowledge on fish, with a<br>\nspecific focus on species farmed in aquacultures, with the goal of<br>\nimproving the welfare of fishes. The bootcamp will take place virtually<br>\non 22-25 June 2021, and will involve a maximum of eight students<br>\nselected through an open call during the first half of June. The<br>\nstudents will be guided by researchers in statistics and topological<br>\ndata analysis. During the first day of the bootcamp there will be talks<br>\ngiven by researchers from FishEthoBase, as well as from the mentors. The<br>\nnext three days will be devoted to focused work in groups, with each day<br>\nstarting and ending with short presentations given by students about the<br>\nprogress of their work; after the presentations there will also be time<br>\nfor feedback and discussions from FishEthoBase researchers, and the<br>\nmentors. Towards the end of August there will be a 2-hour follow-up<br>\nmeeting to discuss the implementation of the results from the bootcamp.</p>\n<p>Target audience: we encourage applications from advanced undergraduate,<br>\nmaster, and PhD students from a variety of backgrounds, including, but<br>\nnot limited to, computer science, mathematics, statistics, data<br>\nanalysis, computational biology, maritime sciences, and zoology. </p>\n<p>Inclusivity: we encourage especially students from underrepresented<br>\ngroups to apply to this bootcamp.</p>\n<p>Remuneration: The students who will be selected to participate in the<br>\nbootcamp will be remunerated with a salary of 1400 euros.</p>\n<p>When: 22-25 June 2021, approximately 11-18 CET each day </p>\n<p>Where: remotely, on Zoom</p>\n</blockquote>",
        "id": 242273653,
        "sender_full_name": "John Baez",
        "timestamp": 1623360436
    },
    {
        "content": "<p>Woa! Very nice that they pay the students as well.</p>",
        "id": 242273999,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623360642
    },
    {
        "content": "<p>That really sets an example.</p>",
        "id": 242274021,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1623360657
    },
    {
        "content": "<p>What does it mean to 'make the scientific system more democratic'? Professorships should be appointed by election? Paper acceptance should be decided by large consensus? I find this quite odd</p>",
        "id": 242911492,
        "sender_full_name": "Nick Hu",
        "timestamp": 1623863292
    },
    {
        "content": "<p>That's not what it means.  Talk to Nina Otter about it.</p>",
        "id": 242935365,
        "sender_full_name": "John Baez",
        "timestamp": 1623873888
    },
    {
        "content": "<p>when i last spoke to her, some of the main goals were very concrete: better representation for people from different backgrounds, helping people to overcome the hegemony of the english language for science, and other such v good things</p>",
        "id": 243197492,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1624042889
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/data.20visualization.20bootcamp/near/243197492\">said</a>:</p>\n<blockquote>\n<p>when i last spoke to her, some of the main goals were very concrete: better representation for people from different backgrounds, helping people to overcome the hegemony of the english language for science, and other such v good things</p>\n</blockquote>\n<p>I'm not sure how I feel about overcoming the hegemony of the English language: having a lingua franca is convenient, and realistically I'd expect that overcoming the hegemony would mean that I'd need to learn French,German, Chinese etc but it wouldn't help me do more science in my mother tongue. It seems like a project suited for other big powers rather than something that would help people coming from smaller languages. That said, of course there should be more popularization/teaching etc in all kinds of languages.  I'm happy to learn that I've misunderstood what this means though.</p>",
        "id": 243259869,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1624123525
    },
    {
        "content": "<p>yes, I think the goal is somewhat different to just \"everybody does maths in their own language\". instead, the problems that need to be solved are things like \"in order to even start in academia, students need to be able to speak pretty good English\", and so e.g. offering classes and learning resources for non-native English speakers could help to remedy the fact that so much of academia is reliant on access to good English education</p>",
        "id": 243260015,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1624123706
    },
    {
        "content": "<p>(note that I'm just speaking as myself here — I have zero affiliation to this institue, and am not claiming to speak for Nina at all)</p>",
        "id": 243260029,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1624123737
    }
]