[
    {
        "content": "<p>My friend Joshua Meyers, formerly a math student at U. C. Riverside, is trying to develop new scholarly institutions: alternatives to universities.  </p>\n<p>He's gotten money from Jaan Tallinn and the Survival and Flourishing Fund to run <a href=\"https://let-me-think.org/scholarshipworkshop.html\">Scholarship Workshop 2023</a> - a 2-month in-person incubator project.</p>\n<p>It'll happen this summer.    In a while you can apply to join.  There will be room for 20 people.   Read more about it at the link!</p>",
        "id": 326289669,
        "sender_full_name": "John Baez",
        "timestamp": 1675751057
    },
    {
        "content": "<p>Interesting... I followed a couple of links there and arrived at the <a href=\"https://let-me-think.org/index.html\">Let Me Think</a> homepage. I have several (somewhat critical) questions; <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> is here a good place to pose those?</p>",
        "id": 326313368,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675761486
    },
    {
        "content": "<p>I'd love a conversation about it here, I'm not sure he visits this place often enough to make that an efficient way to reach him.  We'll see!</p>",
        "id": 326443990,
        "sender_full_name": "John Baez",
        "timestamp": 1675799096
    },
    {
        "content": "<p>He suggests that people contact him <a href=\"https://let-me-think.org/aboutus.html#sendmessage\">here</a>.</p>",
        "id": 326444245,
        "sender_full_name": "John Baez",
        "timestamp": 1675799186
    },
    {
        "content": "<p>But I've asked him to talk to you here, <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>.</p>",
        "id": 326488141,
        "sender_full_name": "John Baez",
        "timestamp": 1675818332
    },
    {
        "content": "<p>I'll wait for now. If nothing happens here I will send a message via the link you gave.</p>",
        "id": 326577146,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675859840
    },
    {
        "content": "<p>Here I am! What's up?</p>",
        "id": 326584454,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675862029
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> This is very cool, I'd like to talk but I'll message you tomorrow when I'm not dying of teaching</p>",
        "id": 326593694,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1675864593
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>. My main question is about the \"Scholarly Loop\". While it is not such a constraint for mathematics, one typically finds that time spent studying something does not usually generate the resources required to create that thing. For instance, even if sitting on a bridge helped me to better understand how bridges are built, no amount of time there would generate the building materials required to build a bridge. So how do you intend to acquire the resources to actually build and run scholarly institutions?</p>\n<p>Further thoughts:</p>\n<ol>\n<li>you say that universities are not scholarly institutions because \"facilitating scholarly practices is just one purpose, on par with job training, holding space for children to become adults, making people \"cultured\", and transmission, growth, and maintenance of prestige.\" To me, this suggests that your proposed scholarly institutions will avoid doing these 'additional' things, but all of them seem to me to be interwoven with the motivation for pursuing scholarship in the first place, and you provide limited arguments for the pursuit of scholarship as an end in itself.</li>\n<li>The quote above is in conflict with other points made on the page: you mention teachers' and doctors' (mis)education affecting the public, but the scholarship of teachers and doctors is explicitly directed towards the end of job training!</li>\n<li>Under \"scholarly institutions must ensure that scholars' needs are met\", you list four items. To me, these are all things that a university is supposed to provide, although I understand your complaints that they fail in one or more of the categories. How <em>exactly</em> is a scholarly institution supposed to be different from a university?</li>\n<li>I find the fact that Neoliberalism is in your provisional list of subjects to study in the pursuit of building scholarly institutions somewhat concerning. Not wanting to presume too much, what is the relationship between neoliberalism and your project?</li>\n</ol>",
        "id": 326614126,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675869406
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>, thanks for the feedback!</p>\n<p>So for your main question, \"learning about how to build scholarly institutions\" includes learning about how to acquire the resources necessary to build scholarly institutions.  Of course, even this will not automatically generate the resources, but it will help you find them once you go about trying to build a scholarly institution.</p>\n<p>To your further thoughts:</p>\n<ol>\n<li>They won't avoid doing these 'additional' things, but they won't specifically aim to do these 'additional' things either.  I don't see how these things are interwoven with the motivation for pursuing scholarship in the first place.  I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</li>\n<li>Yeah that's a good point.  Not sure what to say right now, but I'll think about it.</li>\n<li>A university is not a scholarly institution because it is not expressly designed to facilitate scholarly practices, it has tons of other purposes at the same time.  A scholarly institution is.  (I know you think these purposes are inextricably interwoven, but I don't see how, see 1.)  So I don't think that universities are not meeting the needs of scholars because Oops, I think it's because it's simply not a priority for them --- in scholarly institutions it will be a priority.  The details of what scholarly institutions will look like exactly should be the result of scholarly work, they are not something I know at the moment (though I have provisional ideas).</li>\n<li>I hear people saying  that Neoliberalism is part of what led to the managerial takeover of universities (in the 80s or 90s, I think?)  That's why I think it might be important to study.</li>\n</ol>",
        "id": 326626805,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675872540
    },
    {
        "content": "<p>Just wanted to say that I appreciate that people are thinking about this!</p>",
        "id": 326630893,
        "sender_full_name": "David Egolf",
        "timestamp": 1675873627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>So for your main question, \"learning about how to build scholarly institutions\" includes learning about how to acquire the resources necessary to build scholarly institutions.  Of course, even this will not automatically generate the resources, but it will help you find them once you go about trying to build a scholarly institution.</p>\n</blockquote>\n<p>That's not really a sufficient answer. The \"Scholarly Loop\" graphic asserts that learning how to build SIs will directly enable more building of SIs, and your answer doesn't give a basis to this claim. At the moment it's like a proof by induction without a base case (that is, it's still very much falsifiable).</p>\n<blockquote>\n<p>They won't avoid doing these 'additional' things, but they won't specifically aim to do these 'additional' things either.  I don't see how these things are interwoven with the motivation for pursuing scholarship in the first place.</p>\n</blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession; note that this includes becoming a researcher in any field. Of the minority not accounted for by that, young people go to university to claim their independence and mature (I find the phrasing \"holding space for children to become adults\" in reference to this function of universities quite condescending), and a non-disjoint proportion go to expand the horizon of their knowledge, which is what I assume you mean by 'making people \"cultured\"'. Meanwhile, people choose their institution on the basis of the perceived quality of the education provided there, which is the \"prestige\" you mention. All of the scholarly practices you mention are inextricable from culture. What motivation for engaging in scholarship am I missing?</p>\n<blockquote>\n<p>I don't think that universities are not meeting the needs of scholars because Oops, I think it's because it's simply not a priority for them.</p>\n</blockquote>\n<p>I agree that there is a systematic disparity between the priorities of university administration and the expected priorities of a university; the failures of universities are not an accident. This doesn't change the fact that the ideals you're proposing for SIs are the things that students expect (and complain about not receiving) from their universities. Moreover, if your SIs are competing with universities for either participants/students or resources, then independence from the established university system won't protect you from having to prioritize the same flawed proxies for success that universities are, which ultimately points to the same problems arising.</p>\n<p>It's very well to say \"we won't have the flaws of universities\", but until you can explain how you will systematically resist the external pressures that created these flaws in the university system (many of them political), any advantage will be temporary. I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n<blockquote>\n<p>I hear people saying  that Neoliberalism is part of what led to the managerial takeover of universities (in the 80s or 90s, I think?)  That's why I think it might be important to study.</p>\n</blockquote>\n<p>I read that as saying \"the flaws of universities might be attributable in part to neoliberalism\", which is a relief (I agree; I was worried that you were proposing neoliberalism as a model for how to establish SIs, along the lines of claiming that the problems with universities stem from excessive regulation etc etc, which I would have objected to).</p>",
        "id": 326638663,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675875600
    },
    {
        "content": "<p>My other fear if you rely on private funding is that you are at risk of SIs becoming party to intellectual whitewashing (I was tempted to call this \"brainwashing\" because it's a funny pun, but this is kind of serious). At one extreme I am referring to a lack of scrutiny towards donors who might gain credibility or clout by association with your SIs, and at the other extreme you risk being the delivery method of an agenda not aligned with your intended ideals for SIs. Under the former I'm thinking of phenomena such as greenwashing of fossil fuel companies by their funding of environmental research or climate awareness public installations. Under the latter I'm thinking of institutions such as Prager U which ostensibly provide educational materials (certainly a component of \"scholarship\"), but which are riddled by misinformation in service of the political agenda of the organisations supporting them.<br>\nI saw somewhere on the site that you want to ensure donor involvement in projects, but I didn't understand how that would mitigate the problems I'm pointing out here. Have you thought about this?</p>",
        "id": 326641556,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675876384
    },
    {
        "content": "<p>Hi, I already thought some times ago that a solution for a scholarly institution would be to really imitate monasteries. They are the main people I know who are able to live independently while caring about their own business for a good part of their time. It means that scholars would have to use part of their time next to their scholar work to generate some funds. Most of the time I think that monks sell lot of food like cheese, alcohol (like beers!) or other products. Maybe they also produce some of their food with big gardens but probably less today than in the past because it really requires a huge area of land to produce your own food. One could also produce some wood for saving cost for heating. But it would probably be easier in a region with hot climate. I think that such a community would have to take advantage of this situation to live ethically and control their ecological impact. They could try to produce their own energy by using solar panels, wind turbines or geothermal energy. They should avoid flying to conferences also. In any way, they would not have enough money to pay the flight bills. But they could probably use the internet to organize virtual conferences. Hopefully if they succeed to produce new knowledge while respecting the planet, they would get funds by various organizations to help them grow because they would be a good example of how to use intelligence to live virtuously and would help the whole humanity by finding good ways of living on our planet. I think that they really should use some of their scholarship expertise to work on the ecological side.</p>",
        "id": 326646614,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675877734
    },
    {
        "content": "<p>Also, I think that most of the research would be in fields that don't require lot of expensive equipment, like mathematics, philosophy and practical ecology, maybe a little bit of psychology or literature etc... Not particle physics or genetic engineering sadly.</p>",
        "id": 326647586,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675878027
    },
    {
        "content": "<p>The fields of research would be imposed by what is doable in pretty rough conditions and what can possibly help to live in these pretty rough conditions. The scholars would live rather modestly probably but they could be satisfied of this life because they could chose the subjects they prefer, not have to seek all the time for funding etc...</p>",
        "id": 326647817,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675878097
    },
    {
        "content": "<blockquote>\n<p>That's not really a sufficient answer. The \"Scholarly Loop\" graphic asserts that learning how to build SIs will directly enable more building of SIs, and your answer doesn't give a basis to this claim. At the moment it's like a proof by induction without a base case (that is, it's still very much falsifiable).</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs, just the same way that learning to do anything will help you do that thing.  This is the whole point of learning.  You learn (about) X to help you do X (better, more wisely, etc.)  What part of this is unclear?  If you are looking for a base case for the loop, well the base case is Let Me Think and Scholarship Workshop.  I want to make a better diagram at some point but I am not sure how yet.</p>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession; note that this includes becoming a researcher in any field. Of the minority not accounted for by that, young people go to university to claim their independence and mature (I find the phrasing \"holding space for children to become adults\" in reference to this function of universities quite condescending), and a non-disjoint proportion go to expand the horizon of their knowledge, which is what I assume you mean by 'making people \"cultured\"'. Meanwhile, people choose their institution on the basis of the perceived quality of the education provided there, which is the \"prestige\" you mention. All of the scholarly practices you mention are inextricable from culture. What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n<blockquote>\n<p>Moreover, if your SIs are competing with universities for either participants/students or resources...</p>\n</blockquote>\n<p>SIs will only compete with universities for students who are passionate about learning.  They will not be attractive to the many students who attend universities for other reasons.</p>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n<blockquote>\n<p>My other fear if you rely on private funding...</p>\n</blockquote>\n<p>Yes I have thought about this.  I think the solution is to diversify funding sources.  That way an SI is not beholden to any particular funder.  This diminishes funder influence, and also means that the SI is in a position to decline an unsavory funder.</p>\n<blockquote>\n<p>I saw somewhere on the site that you want to ensure donor involvement in projects, but I didn't understand how that would mitigate the problems I'm pointing out here.</p>\n</blockquote>\n<p>I think donor influence is somewhat inevitable, so I don't want that influence to be implicit, I want it spelled out so everyone sees it right in front of them.</p>",
        "id": 326657339,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675880798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326646614\">said</a>:</p>\n<blockquote>\n<p>Hi, I already thought some times ago that a solution for a scholarly institution would be to really imitate monasteries. They are the main people I know who are able to live independently while caring about their own business for a good part of their time. It means that scholars would have to use part of their time next to their scholar work to generate some funds. Most of the time I think that monks sell lot of foods like cheese, alcohol (like beers!) or other products. Maybe they also produce some of their food with big gardens but probably less today than in the past because it really requires a huge area of land to produce your own food. One could also produce some wood for saving cost for heating. But it would probably be easier in a region with hot climate. I think that such a community would have to take advantage of this situation to live ethically and control their ecological impact. They could try to produce their own energy by using solar panels, wind turbines or geothermal energy. They should avoid flying to conference also. In any way, they would not have enough money to pay the flight bills. But they could probably use the internet to organize virtual conferences. Hopefully if they succeed to produce new knowledge wile respecting the planet, they would get funds by various organizations to help them grow because they would be a good example of how to use intelligence to live virtuously and would help the whole humanity by finding good ways of living on our planet. I think that they really should use some of their scholarship expertise to work on the ecological side.</p>\n</blockquote>\n<p>Yes, imitating monasteries is my thought as well.  Scholarly practice (as long as it doesn't involve expensive laboratory equipment) is really one of the cheapest things, requiring only good health, community, and cheap equipment like books, computers, internet access, etc.  As for generating funds, there are many options.  Small local businesses (e.g. cheese, alcohol, etc.), remote work (e.g. programming, consulting), rent from visitors, research grants and scholarships, etc.  I think that a monastic lifestyle could be made very cheap (maybe ~$500 per person per month after some practice) while retaining good health and leisure time for scholarly practice, and then it wouldn't be hard to put together some diversified (and hence stable) combination of funding sources to support it.</p>",
        "id": 326659299,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675881392
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326647586\">said</a>:</p>\n<blockquote>\n<p>Also, I think that most of the research would be in fields that don't require lot of expensive equipment, like mathematics, philosophy and practical ecology, maybe a little bit of psychology or literature etc... Not particle physics or genetic engineering sadly.</p>\n</blockquote>\n<p>Yes for sure.  I have the uninformed opinion that even in fields that require expensive equipment, like biology, there is plenty of great work waiting to be done simply reading the multitudes of papers produced by these fields and consolidating it into coherent narratives.  And I can also see the possibility of collaborations between SIs and existing laboratories with independent funding (at universities or not).</p>",
        "id": 326659887,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675881575
    },
    {
        "content": "<p>Here's an interesting thing about biology.  About 50% of grant money goes to fund the university, so universities want to hire and promote people who get big grants.  So, academic biologists advance their careers by getting grants - especially big grants.  You can't get big grants for doing work that just requires reading, thinking, writing or even small-scale computer programming.  So theoretical biology is systematically underdeveloped compared to experimental biology and heavy-duty data analysis that requires supercomputers.   Biologists know this.  Well, some actually think theoretical biology is a hopeless subject - but many I talk to (a biased sample) say that there's a surfeit of data in biology and not enough good conceptual frameworks to make use of this data.</p>",
        "id": 326665627,
        "sender_full_name": "John Baez",
        "timestamp": 1675883526
    },
    {
        "content": "<p>So I think this is an example - one of many, I suppose - of how the pressure on scientists to fund their universities by getting big grants warps scientific priorities.</p>",
        "id": 326665843,
        "sender_full_name": "John Baez",
        "timestamp": 1675883599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326657339\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>That's not really a sufficient answer.</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs...</p>\n</blockquote>\n<p>Learning is <em>necessary</em> but not <em>sufficient</em> for achieving your stated goal. This is the discrepancy I'm pointing out.</p>\n<blockquote>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession... What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n</blockquote>\n<p>That's a nice story, but it's in conflict with the values of inclusivity you mention elsewhere. People have families and communities which push them to prioritize pragmatic ends to their education over their \"passion for learning\". If you have to support others with your income or you are expected to pursue a vocation by those around you, it doesn't sound like a SI will fit the bill. Since such pressures are unevenly distributed through society, this is an external constraint you'll need to address!</p>\n<blockquote>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n</blockquote>\n<p>It's still just ideas for the time being, so no (unless you consider this workshop to fit your definition of SI?), but I'm hopeful you'll end up with solid counters to my scepticism.</p>",
        "id": 326666358,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675883782
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</p>\n</blockquote>\n<p>This is a pretty bold claim.  What prevents scholarship for scholarship's sake from devolving into an elite group of people sitting in ivory towers?History is not devoid of atrocities committed in the advancement of knowledge (which didn't start or end in the 1930s or 1940s, though that is an easy era to point to).  I think a prerequisite to helping people act more wisely is to give the <em>general populace</em> the education and critical thinking skills, which is a major failure point in (US) public schools.  Otherwise, scholars helping people engage in wise behaviors becomes a form of (well-intentioned) oppression.</p>",
        "id": 326669249,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1675884743
    },
    {
        "content": "<p>That would not be more ivory towers that the places where scholars live today (not because of them but because of the lack of tenure track jobs). If I understand one of the goal is to allow more people being scholars and people in SIs could be closer to the \"general populace\" because of this ease of access (and probably people in SIs would not use the word \"populace\" that sounds a little bit close to \"lettuce\" to my ears).</p>",
        "id": 326671273,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675885461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326666358\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326657339\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>That's not really a sufficient answer.</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs...</p>\n</blockquote>\n<p>Learning is <em>necessary</em> but not <em>sufficient</em> for achieving your stated goal. This is the discrepancy I'm pointing out.</p>\n</blockquote>\n<p>Sure, that's true.</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession... What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n</blockquote>\n<p>That's a nice story, but it's in conflict with the values of inclusivity you mention elsewhere. People have families and communities which push them to prioritize pragmatic ends to their education over their \"passion for learning\". If you have to support others with your income or you are expected to pursue a vocation by those around you, it doesn't sound like a SI will fit the bill. Since such pressures are unevenly distributed through society, this is an external constraint you'll need to address!</p>\n</blockquote>\n<p>This seems like a insuperable upper bound on the inclusivity possible to an SI.  Of course, if someone is pressured into spending all their time towards pragmatic ends, they won't be able to pursue a love of learning.  We can only hope to maximize inclusivity within this upper bound!  One way to do this is through SIs which allow for part-time, or virtual participation.  That way one's scholarly inclination can be supported even if one does not have the freedom to devote all their time to it.</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n</blockquote>\n<p>It's still just ideas for the time being, so no (unless you consider this workshop to fit your definition of SI?), but I'm hopeful you'll end up with solid counters to my scepticism.</p>\n</blockquote>\n<p>Actually I do think my workshop fits the definition of SI, although it is an unusual case as it will only exist for 2-months, rather than an indefinite lifetime.  This is intentional as I don't currently know the best way to run a scholarly institution and I don't want to lock in any choices made in a state of ignorance.</p>",
        "id": 326673633,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886275
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326669249\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</p>\n</blockquote>\n<p>This is a pretty bold claim.  What prevents scholarship for scholarship's sake from devolving into an elite group of people sitting in ivory towers? ...</p>\n</blockquote>\n<p>The aim of this whole project is to broaden access to scholarly practice.  A young person who wants to be a scholar shouldn't have to go into massive debt in order to go to college, where they discover that they have to take 4+ classes at once while working a part-time job, and are rewarded not on the basis of the quality of their scholarship but on their diligence in keeping up with all their variegated responsibilities to at least a low standard of quality. An adult who wants to be a scholar shouldn't have to go into financial precarity in order to be an adjunct professor only to find that they don't have time for scholarship, all they have time for is their large teaching load, and most of their students don't even want to be there...</p>",
        "id": 326675152,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886753
    },
    {
        "content": "<p>Alright, I look forward to hearing what you come up with. As a more positive contribution, I'd like to draw your attention to <a href=\"https://nesinkoyleri.org/en/introduction-to-nesin-villages/\">this village</a> in Turkey, which I think qualifies as an example of an SI.</p>",
        "id": 326675432,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675886835
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326675432\">said</a>:</p>\n<blockquote>\n<p>Alright, I look forward to hearing what you come up with. As a more positive contribution, I'd like to draw your attention to <a href=\"https://nesinkoyleri.org/en/introduction-to-nesin-villages/\">this village</a> in Turkey, which I think qualifies as an example of an SI.</p>\n</blockquote>\n<p>Yes it does!  I really want to go there</p>",
        "id": 326675501,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886864
    },
    {
        "content": "<p>Another already-existing-scholarly-institution I know of is Mimbres School: <a href=\"https://weirdeconomies.com/contributions/what-good-is-education\">https://weirdeconomies.com/contributions/what-good-is-education</a></p>\n<p>(Note: I haven't watched this video or read this essay but I've taken multiple (virtual) Mimbres classes)<br>\n(Update: Now I have watched the video and read the essay and confirm that they are very cool and very much on-topic.)</p>",
        "id": 326678054,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675887870
    },
    {
        "content": "<p>Just want to throw in a working example that I know of (and I'm not affiliated with) of an institution that is trying to break the mold, and I think doing ok at it, in its little niche. <a href=\"https://signumuniversity.org/about/mission/\">https://signumuniversity.org/about/mission/</a> It focuses on liberal arts, specifically the humanities/literature/languages, which are—like much of mathematics—relatively cheap and don't need labs/hardware/equipment/etc.</p>",
        "id": 326695167,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1675894509
    },
    {
        "content": "<p>Wow this is great!</p>",
        "id": 326703733,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675898087
    },
    {
        "content": "<p>I'm not sure if this is in scope, but I would urge you to broaden your notion of institution beyond \"place where people go to learn\", to also include things like communication mechanisms and support technologies.</p>\n<p>When I think of scholarly institutions in need of reform, a web/interaction-friendly replacement for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>LaTeX</mtext></mrow><annotation encoding=\"application/x-tex\">\\LaTeX</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8988em;vertical-align:-0.2155em;\"></span><span class=\"mord text\"><span class=\"mord textrm\">L</span><span class=\"mspace\" style=\"margin-right:-0.36em;\"></span><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.6833em;\"><span style=\"top:-2.905em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"mord\"><span class=\"mord textrm mtight sizing reset-size6 size3\">A</span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:-0.15em;\"></span><span class=\"mord text\"><span class=\"mord textrm\">T</span><span class=\"mspace\" style=\"margin-right:-0.1667em;\"></span><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.4678em;\"><span style=\"top:-2.7845em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord textrm\">E</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2155em;\"><span></span></span></span></span><span class=\"mspace\" style=\"margin-right:-0.125em;\"></span><span class=\"mord textrm\">X</span></span></span></span></span></span> is near the top of my list</p>",
        "id": 326709233,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1675901084
    },
    {
        "content": "<p>Yes good point and it is!</p>\n<blockquote>\n<p>The word institution is here used in the general, sociological<br>\nsense, to mean any social regularity. Institutions can be virtual<br>\nor in-person, formal or casual, centralized or decentralized,<br>\nsmall or big.</p>\n</blockquote>",
        "id": 326713257,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675903801
    },
    {
        "content": "<p>I am one of the 3 co-organizers of the Scholarship Workshop and Let Me Think stuff (alongside Joshua Meyers).</p>\n<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>: In my opinion your main question, regarding pragmatic resource requirements, is spot on. I knew this to be a primary puzzle piece a few years into conceiving of these ideas (by now, over 10 years ago). I'm inclined towards solutions like <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span>'s suggestion to imitate monastic economy by a clear partition of work time into valuable work (for resource acquisition) and important work (the main purpose) -- as a way of ensuring that some definite fraction of time and effort is actually available for the important work. I also agree with Jean-Baptiste that the scholarship purposes need to keep up with what is urgently important, including, right now, ecology and climate research (I would add to this economics).<br>\nThe academics' economy perhaps errs in aiming to find ways to make their important and valuable work the same. At a certain point it's obvious to many students and researchers what they should be pouring their efforts into. I think it is equally obvious that the vast majority of these people are barred from doing so because they must do a job-prep or salaried-job version of their research program as a prerequisite for full membership in our society as it is currently structured. This version is generally a poor substitute.</p>\n<p>I also think that our forward-looking proposals must go rather far beyond monastic models, to be inclusive of people who do not wish to accept exile from society, addressing <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>' point that people have families and communities that they are responsible to. Something for the lay public on Sundays, perhaps ...</p>\n<p>Related to this point: In another forum, a poster remarked that it was disconcerting that Let Me Think is not openly challenging the universities' operations. I tend to agree. It is an absolute embarassment and disgrace for academic departments in the US (I'm looking at you, math departments) that the graduate student population -- fresh young people diligently reifying the work of their elders by study and furtherance of their elders' research goals and reputations (not to mention universities' undergraduate \"teaching\" burden) -- is maintained in poverty. Housing would be a good start. I'm not talking about \"free\"/subsidized housing where they kick you out every summer. I mean a residential property owned by a student-run association, on a contract with the university that sanctions a proportion of their worktime to be used for residential maintenance, ... .<br>\nStill, we do not intend to let endless hopes for reform distract us from doing what we can right now.</p>\n<p>There is so much more to discuss. Posters here please consider keeping tabs on our Scholarship Workshop, even if you don't plan to be a participant, as there may be other opportunities to make contributions and help guide the progress. We'll be accepting visitors, soliciting speakers, organizing a \"pitch\" competition towards the end, etc.</p>\n<p>Also: Josh and I have ogled the Nesin Mathematics Village from afar for many years now ...</p>",
        "id": 326736360,
        "sender_full_name": "James Mathews",
        "timestamp": 1675922697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> could you help me understand why \"holding space for children to become adults\" came across as condescending?  Currently working on a revision of the website.</p>",
        "id": 326747983,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675928863
    },
    {
        "content": "<p>Firstly, referring to people who are typically at least 18 when they enter university as children is condescending to them. Secondly, you are dismissing the value of the personal growth that this maturation process represents, which is ironic considering that maturity and an expansion of wisdom and knowledge (ie the yields of scholarship) typically go hand in hand.</p>",
        "id": 326752657,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675930638
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> [said](<a href=\"#narrow/stream/229141-general.3A-\">https://categorytheory.zulipchat.com/#narrow/stream/229141-general.3A-</a></p>\n<blockquote>\n<p>Yes, imitating monasteries is my thought as well.  Scholarly practice (as long as it doesn't involve expensive laboratory equipment) is really one of the cheapest things, requiring only good health, community, and cheap equipment like books, computers, internet access, etc.  As for generating funds, there are many options.  Small local businesses (e.g. cheese, alcohol, etc.), remote work (e.g. programming, consulting), rent from visitors, research grants and scholarships, etc.  I think that a monastic lifestyle could be made very cheap (maybe ~$500 per person per month after some practice) while retaining good health and leisure time for scholarly practice, and then it wouldn't be hard to put together some diversified (and hence stable) combination of funding sources to support it.</p>\n</blockquote>\n<p>Funny thing, a year ago I was often speculating about researchers organising into communes modelled after artist communes such as Kunsthaus Tacheles (<a href=\"https://en.wikipedia.org/wiki/Kunsthaus_Tacheles\">https://en.wikipedia.org/wiki/Kunsthaus_Tacheles</a>), which I called the \"abandoned warehouse\" model. That's basically the same idea as a monastery except with more parties. It was never a serious idea but was a very interesting fantasy rabbit hole to go down. When it collides back with reality, the obvious conclusion is that only a <em>very</em> special kind of person would be willing to put up with living in such a situation</p>",
        "id": 326801565,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1675945735
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326801565\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> [said](<a href=\"#narrow/stream/229141-general.3A-\">https://categorytheory.zulipchat.com/#narrow/stream/229141-general.3A-</a></p>\n<blockquote>\n<p>Yes, imitating monasteries is my thought as well.  Scholarly practice (as long as it doesn't involve expensive laboratory equipment) is really one of the cheapest things, requiring only good health, community, and cheap equipment like books, computers, internet access, etc.  As for generating funds, there are many options.  Small local businesses (e.g. cheese, alcohol, etc.), remote work (e.g. programming, consulting), rent from visitors, research grants and scholarships, etc.  I think that a monastic lifestyle could be made very cheap (maybe ~$500 per person per month after some practice) while retaining good health and leisure time for scholarly practice, and then it wouldn't be hard to put together some diversified (and hence stable) combination of funding sources to support it.</p>\n</blockquote>\n<p>Funny thing, a year ago I was often speculating about researchers organising into communes modelled after artist communes such as Kunsthaus Tacheles (<a href=\"https://en.wikipedia.org/wiki/Kunsthaus_Tacheles\">https://en.wikipedia.org/wiki/Kunsthaus_Tacheles</a>), which I called the \"abandoned warehouse\" model. That's basically the same idea as a monastery except with more parties. It was never a serious idea but was a very interesting fantasy rabbit hole to go down. When it collides back with reality, the obvious conclusion is that only a <em>very</em> special kind of person would be willing to put up with living in such a situation</p>\n</blockquote>\n<p>What if you just got the minimum number of people necessary to defend a squat to live there, and most of the people involved just came to events during the day?</p>",
        "id": 326808231,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675947544
    },
    {
        "content": "<p>There would have to be more to it than that in order to provide decent food and study conditions (one of your critiques of universities being that this is not sufficiently prioritised)</p>",
        "id": 326810912,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675948311
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326810912\">said</a>:</p>\n<blockquote>\n<p>There would have to be more to it than that in order to provide decent food and study conditions (one of your critiques of universities being that this is not sufficiently prioritised)</p>\n</blockquote>\n<p>Make healthy food and sell it at the squat.  Renovate sections to make them good study areas.</p>",
        "id": 326812929,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675948849
    },
    {
        "content": "<p>Depending on the weather I might like to study on the roof of the warehouse because the air quality would be nice and you'd get a lot of sunlight.  You'd have to bring some furniture and plants up there and put up some kind of shelter to block rain and provide shade.</p>",
        "id": 326814210,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675949153
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326659299\">said</a>:</p>\n<blockquote>\n<p>Yes, imitating monasteries is my thought as well.  Scholarly practice (as long as it doesn't involve expensive laboratory equipment) is really one of the cheapest things, requiring only good health, community, and cheap equipment like books, computers, internet access, etc.</p>\n</blockquote>\n<p>As someone with poor health, I have sometimes wondered what kinds of scholarly practice can exist for people without good health. From my own experience, and from my experience from attending a support group for people with chronic fatigue syndrome, I suspect there are a significant number of people who have a lot of skills relevant to scholarly practice, but who struggle to use them in the institutions that currently exist. With poor health, it becomes more difficult to sustain concentration on a line of inquiry. It also becomes much more difficult to put in a comparable amount of time and energy, as compared to those with good health. This can make it difficult for an institution with limited resources to justify hiring such a person.</p>\n<p>However, the other things listed here - community and books/computers/internet - are often available to people with poor health. This makes me wonder if there are still some ways to create spaces where people with poor health can be engaged in scholarly practice. One idea is to create spaces for research and/or learning that do not require much top-down per-participant investment. This zulip is an example of such a space, but I suspect it would be possible to create more formal structures as well. Another thought along these lines is a sort of crowdsourced or open source research, where a line of inquiry is explored collaboratively with notes and results shared on a platform like Github.</p>\n<p>If we could find a way to better involve people with poor health in scholarly practice, I believe it would not only be helpful to these people, but that it could significantly enrich the scholarly community as well.</p>",
        "id": 326859744,
        "sender_full_name": "David Egolf",
        "timestamp": 1675960178
    },
    {
        "content": "<p>I would also like to draw attention to <em>Let Me Think</em>, which is the unincorporated association which is organizing <em>Scholarship Workshop</em>.  <em>Let Me Think</em> has the same mission as <em>Scholarship Workshop</em>, except it is not a 2-month workshop, rather it is an ongoing association which will start mostly virtual --- which makes it more inclusive to those who cannot or do not want to attend the workshop.  Here's how it will work.  I'll keep talking about it, and hopefully other people will too, and when I hear enough interest from people about it, I'll call the first General Body Meeting and we'll get a whole bunch of people who support the mission in the same Zoom room together.  From there we'll start organizing --- we'll use a consensus process to write governing documents and start collaborating on projects.  Examples of projects that <em>Let Me Think</em> could do include organizing a weekly seminar about scholarly institutions, organizing a study group about the history of universities, organizing collaborative research about scholarly institutions, organizing networking events to meet potential cofounders for scholarly institutions, etc.  These are just my ideas however, the ideas that <em>Let Me Think</em> will really end up doing will be selected by the people who show up to the General Body Meetings -- and hopefully they will be in accord with a general strategy, which will also be devised in the General Body Meetings, or by a Working Group formed at a General Body Meeting.</p>",
        "id": 326888770,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675967688
    },
    {
        "content": "<p>Also, back to <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>'s question about the perils of private funding, I am thinking that <em>Let Me Think</em> will be mostly crowdfunded (small contributions from a large number of donors), and will only solicit large grants for specific projects, such as <em>Scholarship Workshop</em>.</p>",
        "id": 326890403,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675968192
    },
    {
        "content": "<p>What is your reasoning for holding the workshop before the first body meeting? The former requires a tremendous commitment compared to the latter. I wouldn't see myself accept to spend 2 months with 20 people I have never met, even to discuss the most interesting thing.</p>",
        "id": 326895860,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1675969817
    },
    {
        "content": "<p>It's not reasoning, it's just how it ended up turning out.  I wish that the first General Body Meeting of Let Me Think would have happened before Scholarship Workshop opens applications, but momentum for Let Me Think has not been growing fast enough and Scholarship Workshop needs to find applicants before the summer, so...</p>",
        "id": 326896556,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675970033
    },
    {
        "content": "<p>I suppose it comes down to the trust of the applicants for the admissions process.  If they trust the process, they will trust it to pick out other applicants who are good, and a group of applicants who will get along.  Also, there will be virtual group meetings with the accepted participants in April and May, so they can get to know each other ahead of time and plan the daily practices and curriculum/syllabus.  If an accepted participant <em>really really</em> doesn't get along with the others, they could still withdraw at this time and we would replace them with someone on the waitlist.</p>",
        "id": 326897019,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675970193
    },
    {
        "content": "<p>Lol, I am the only one thinking that if scientists are longing for a monastic life in order to pursue their interests then we are for sure heading towards a new middle age?</p>",
        "id": 327230205,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114133
    },
    {
        "content": "<p>Namely, one of the chief characteristic of decadence is that 'the cost of maintaining infrastructure surpasses the gains that the infrastructure produces'. When this happens you'll observe loss of centralization and progressive decentralization (e.g. empires dissolve into scattered dominions owned by feudal lords).</p>",
        "id": 327230453,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114247
    },
    {
        "content": "<p>To me this seems the central point here: In principle, no one I know of dislikes universities as a concept. They are a nice piece of infrastructure devoted to educate people and produce new research. But the university system costs money and because of 'reasons' the economic system around academia has been changing in the last decades so that academia has to increasingly 'provide for itself'</p>",
        "id": 327230642,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114327
    },
    {
        "content": "<p>So now you have professors doing huge amounts of admin work, postdocs that have to find their own money etc. This seems to me like a clear example of 'infrastructure becoming too expensive to be maintainable', which is probably why people are becoming increasingly more pissed about unis.</p>",
        "id": 327230827,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114418
    },
    {
        "content": "<p>I'd basically set aside as much ideology as possible and try to solve the problem from a very practical perspective. What do people like about academia? What do people dislike about it? For instance, teaching is seen as a distraction by many, but this does not mean that many researchers don't enjoy teaching. They actually, genuinely do. The distracting part is preparing exams, filling evaluation forms, basically dealing with all the BS that turns teaching from an entertaining activity into a nightmare.</p>",
        "id": 327231107,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114528
    },
    {
        "content": "<p>So you see, before thinking about working in the cloister, doing category theory while growing our own tomatoes, I'd try to rationally pinpoint the reasons that make the current system unbearable for many, and I'd try to go for the LEAST amount of change necessary to make it good again.</p>",
        "id": 327231244,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676114599
    },
    {
        "content": "<p>Strong agreement with Fab here. But let it be put on the record that monasteries don't have to be isolated from the rest of society, on the contrary, most monasteries (or religious communes) are very integrated with the people living around them. That's what I think when I rant about growing tomatoes in the cloister, etc.</p>",
        "id": 327264170,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1676127278
    },
    {
        "content": "<p>I guess the highly despatialized societies we live in now badly accomodate such lives... This is a problem that transcends universities though</p>",
        "id": 327264305,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1676127351
    },
    {
        "content": "<p>MUGA?  (Make Universities Great Again)</p>",
        "id": 327265365,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1676127747
    },
    {
        "content": "<p>No, MUMA (Make Universities Monasteries Again)</p>",
        "id": 327265510,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1676127821
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327265365\">said</a>:</p>\n<blockquote>\n<p>MUGA?  (Make Universities Great Again)</p>\n</blockquote>\n<p>it should be called <em>The Royal Society</em> based on a charter from Prince Harry.  the publicity would overshadow all other royal societies within a week.</p>",
        "id": 327360727,
        "sender_full_name": "dusko",
        "timestamp": 1676196417
    },
    {
        "content": "<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>",
        "id": 327468535,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676266391
    },
    {
        "content": "<p>I was always curious about this. If you actually look at the accounts, do the Faculty of Football bring in net income to the university and contribute to its actual mission, or does it on average drain resources from other departments?</p>",
        "id": 327513224,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1676284217
    },
    {
        "content": "<p>Also, I can't speak for other countries, but Australian Vice-Chancellors very often (possibly all of them!) earn more than our Prime Minister, and these are public/state universities, not private outfits.</p>",
        "id": 327514972,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676284736
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327468535\">said</a>:</p>\n<blockquote>\n<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>\n</blockquote>\n<p>the answer seems to be derivable from the facts stated in the question: the university is for making money for its employees. the airlines used to be for flying people from A to B, but they consolidated and improved the services so that flying from A to B became less comfortable and less likely, but more profitable. the universities used to be for teaching students and understanding the world, but they also got optimized for different object functions. </p>\n<p>the new scholarly institutions could restore the original objectives <strong><em>provided</em></strong> that they find resources to survive in the environment where everyone else competes to burn all resources into money. it is like trying to function as, say, a liver, in an organism where all other organs are optimized to just grow.</p>",
        "id": 327528209,
        "sender_full_name": "dusko",
        "timestamp": 1676289180
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327468535\">said</a>:</p>\n<blockquote>\n<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>\n</blockquote>\n<p>This is an old trope I will never end up disagreeing with. It is true, there are football players that are paid an obscene amount of money. Those are like the 0.0001% of all the people that play football. The average football player plays as a second job, and does something else to pay the bills.<br>\nHaving said that, there is the problem of establishing 'how valuable is a football player?' No one is surprised if a Van Gogh gets sold for several million dollars. He was a genius after all, and his work made countless people feel incredible emotions.<br>\nThen I wonder in which way Ronaldo or Messi scoring impossible goals and making literally billions of people cry in bewilderment can be different. The point of view you expose here can only be motivated by thinking that, probably, organized sport isn't as emotionally engaging or entertaining as it is deemed to be, which is an elitist opinion. And fortunately enough the overwhelming majority of the human beings living on this planet heartily disagrees with it.</p>",
        "id": 327546856,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676294742
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327546856\">said</a>:</p>\n<blockquote>\n<p>Then I wonder in which way Ronaldo or Messi scoring impossible goals and making literally billions of people cry in bewilderment can be different. The point of view you expose here can only be motivated by thinking that, probably, organized sport isn't as emotionally engaging or entertaining as it is deemed to be, which is an elitist opinion. And fortunately enough the overwhelming majority of the human beings living on this planet heartily disagrees with it.</p>\n</blockquote>\n<p>While I agree with the overall idea, you could very well consider that past a certain point it just stops being ethical to pay someone such a huge amount of money, especially when you consider that some other parts of the same institution could be underfunded. The same could very well be said about the infinitesimal proportion of artists making an indecent fortune out of their work.</p>",
        "id": 327548910,
        "sender_full_name": "Josselin Poiret",
        "timestamp": 1676295308
    },
    {
        "content": "<p>Getting dragged pretty off topic, but college football is football-as-played-with-hands, which has very different economics to football-as-played-with-feet. Since it's so complex and needs a lot of safety equipment it's played by a lot less people, and probably the average salary of players is much higher, it's not like football-as-played-with-feet where a bunch of kids can get going with any vaguely flat bit of ground and anything vaguely spherical to kick</p>",
        "id": 327551607,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1676296046
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284453\">Josselin Poiret</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327548910\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327546856\">said</a>:</p>\n<blockquote>\n<p>Then I wonder in which way Ronaldo or Messi scoring impossible goals and making literally billions of people cry in bewilderment can be different. The point of view you expose here can only be motivated by thinking that, probably, organized sport isn't as emotionally engaging or entertaining as it is deemed to be, which is an elitist opinion. And fortunately enough the overwhelming majority of the human beings living on this planet heartily disagrees with it.</p>\n</blockquote>\n<p>While I agree with the overall idea, you could very well consider that past a certain point it just stops being ethical to pay someone such a huge amount of money, especially when you consider that some other parts of the same institution could be underfunded. The same could very well be said about the infinitesimal proportion of artists making an indecent fortune out of their work.</p>\n</blockquote>\n<p>This is absolutely true. But for some reason the example is always about football and never about Picasso or Jeff Coons, which is telling.</p>",
        "id": 327555402,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676297007
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327551607\">said</a>:</p>\n<blockquote>\n<p>Getting dragged pretty off topic, but college football is football-as-played-with-hands, which has very different economics to football-as-played-with-feet. Since it's so complex and needs a lot of safety equipment it's played by a lot less people, and probably the average salary of players is much higher, it's not like football-as-played-with-feet where a bunch of kids can get going with any vaguely flat bit of ground and anything vaguely spherical to kick</p>\n</blockquote>\n<p>I understand your point, but still, if what you do makes several hundreds of million of people happy (a huge chunk of North America, more or less), that should be taken into account when deciding how much you get paid. Sport-as-entertainment and sport-as-a-physical activity are different things, often appealing to different crowds.</p>",
        "id": 327555670,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676297086
    },
    {
        "content": "<p>Culminating the off-topic vector: </p>\n<p>Typically college football (and to a lesser extent, basketball) funds large American universities' entire athletic departments. Alabama's athletic department <a href=\"https://knightnewhousedata.org/fbs/sec/the-university-of-alabama\">brings in about $180M of revenue per year and spends about $170M of it</a>--in other words there is $10M per year of hard profit, plus the soft benefits to the university. Alabama's football team also brings in about $200M in benefit to Tuscaloosa per year. You might say, OK, Alabama is an outlier, and maybe even the SEC (Georgia had a $45M profit in 2021). The Pac-12 and Big 12 lose money on paper, for example. But here is the rub: those universities have programs in many other sports that bring in almost zero revenue and have huge travel expenses. If they only played football and basketball (which is not tenable because of Title IX) they would make money hand over fist.</p>",
        "id": 327557857,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676297517
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327231244\">said</a>:</p>\n<blockquote>\n<p>So you see, before thinking about working in the cloister, doing category theory while growing our own tomatoes, I'd try to rationally pinpoint the reasons that make the current system unbearable for many, and I'd try to go for the LEAST amount of change necessary to make it good again.</p>\n</blockquote>\n<p>I agree with a slight modification.  Instead of asking \"what is the least amount of change necessary to the university to make it good again\" we should ask \"what is the least amount of change necessary to our society to make scholarly practices accessible\".  My opinion is that the answer to the latter question is \"create new scholarly institutions\" rather than \"reform the universities\".  Scholarly institutions seem \"at our fingertips\" --- the resources necessary for scholarship are minimal, and the funding definitely exists.  Whereas a reformist effort would have to fight against decades of history and entrenched interests.  What do you think?</p>",
        "id": 327581584,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676303195
    },
    {
        "content": "<p>I think it is a complicated question, and the pertaining question at this point would be 'what are scholarly institutions for?'<br>\nFrom a more down-to-earth, practical point of view, the perception of academia and universities has changed a lot in the last decades. 50 years ago being a university professor was considered to be a position of high status, both socially and financially. Whereas a high school professor could easily maintain a family, a uni professor could easily maintain two.</p>\n<p>The echoes of this have endured well into my infancy. My parent's generation is the one that made its wealth in the 80s where a degree wasn't at all necessary to have a nice, decent job. Parents from that generation, at least in my country, raised their children with the idea that 'you gotta be a doctor when you grow up'. There was this - wrong, in my opinion - idea that blue collar jobs weren't just as good and respectable, they wouldn't set you for life whereas being a doctor or working in academia would.</p>\n<p>Forty years later, the academic job marketplace is as crowded as ever, imho also because of this sort of education standard. The funny result of this is that now if you learn carpentry and you make custom desks for e-sports players, you will probably make more money than you would as a postdoc.</p>\n<p>So I would argue that the financial prestige of academic institutions is totally gone, and the social prestige is also waning quite quickly. I also agree with you that society as a whole needs more scholars, in a way or another. But the problem is not 'making the scholarly practices accessible', it's more like 'setting up the right incentives so that pursuing the academia seems to be a more rewarding choice than pursuing a career as a influencer'.</p>",
        "id": 327596640,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676307109
    },
    {
        "content": "<p>The best way 'to reform society' is convincing people that academic research is a job worth pursuing. This cannot be considered as separate from very down to earth needs, such as being able to provide for your family. This is why I consider the 'monastic thing' a utopia. It may seem great for a 20-something, but as people grow up, many of them just want to be able to do the usual things: find someone you love, set up a family, provide for the people you care about etc. Unless we come up with a system that can guarantee these things to the point that people feel _safe_ pursuing this sort of career path, we're going nowhere.</p>",
        "id": 327597711,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676307380
    },
    {
        "content": "<p>Let me remind you that academic careers atm look like this: get your PhD, be a postdoc for n years, sometimes well into your 40s, all for a glimmer of hope to get a tenured position somewhere that MAYBE, just MAYBE will allow you to start planning your future. All while swapping places a trillion times, and while keeping out-of-this world high bs metrics such as H-index etc. This is the definition of a nightmare, no wonder very few people try to pursue this sort of path as of now.</p>",
        "id": 327598231,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676307532
    },
    {
        "content": "<p>So, honestly, less monasteries and more 'give me a fixed job already so that I can let my kids grow up comfortably', please.</p>",
        "id": 327598342,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676307561
    },
    {
        "content": "<p>Yeah I totally get the importance of long-term security for academics, and making it possible for them to start families and be confident that they will be able to support them.  I don't think this is the same goal as making it \"high status\" to be an academic, or as making it so that \"pursuing the academia seems to be a more rewarding choice than pursuing a career as a influencer\", or as financial or social prestige of being an academic.  Sure, these latter goals will guarantee long-term security for top academics, but they will also tend to make this long-term security very exclusive and hard to get.</p>\n<p>And I'm not married to the idea of scholarly institutions as monasteries, I merely think that monasteries have figured out a lot of the problem and thus they are a good source of inspiration.</p>",
        "id": 327603502,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676309029
    },
    {
        "content": "<p>To be more specific, consider MIT Living Wage calculator for the NYC metro area: <a href=\"https://livingwage.mit.edu/metros/35620\">https://livingwage.mit.edu/metros/35620</a>  According to this, an adult who is living in this area and supporting a non-working spouse and two children needs to make $82k/year to <em>subsist</em>.  If we say that 60% of their salary should be subsistence, 20% should be savings, and 20% should be leisure, then we see that they should get $82k/60% = ~$137k.  This is what it makes sense to pay someone living in NYCMA who is supporting a nonworking spouse and two children.  I think that an academic supporting a non-working spouse and two children in the NYC metro area, no matter how \"prestigious\", should get paid that, no less and no more (barring extenuating circumstances).  Job security will come from knowing that you won't lose your job, not from the amount of money.</p>\n<p>Also, I think academics should be encouraged to settle in less expensive areas --- in fact, I think we should be explicitly designing villages for low-cost-of-living intellectual life.  Western countries are consuming way too much resources and it's damaging our planet's life-support systems.  Intellectuals can lead the way in a transition to a less resource-intensive life.</p>",
        "id": 327605096,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676309540
    },
    {
        "content": "<p>(If both adults are working, this number becomes $106.7k.  For a single adult with no children, it is $78k.)</p>",
        "id": 327606631,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676309963
    },
    {
        "content": "<p>In general, I think people should be paid what they need, not as some kind of status indicator.  The problem is that it is often hard to determine this, so I think MIT Living Wage / 60% is a good proxy but ideally there would be a better system.</p>",
        "id": 327606896,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676310038
    },
    {
        "content": "<p>Yes, I get your point, but if I have to literally study my whole life to do my job, would I really be happy just subsisting?</p>",
        "id": 327606959,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676310053
    },
    {
        "content": "<p>The calculations you do would make the job decent, and that would already be a huge improvement</p>",
        "id": 327607019,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676310073
    },
    {
        "content": "<p>But then again, in becoming an academic there's a huge hidden cost of all the years of study one has to undertake. One may argue that 'but if I am an academic I like studying', and I get it, but still...</p>",
        "id": 327607119,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676310109
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327606896\">said</a>:</p>\n<blockquote>\n<p>In general, I think people should be paid what they need, not as some kind of status indicator.  The problem is that it is often hard to determine this, so I think MIT Living Wage / 60% is a good proxy but ideally there would be a better system.</p>\n</blockquote>\n<p>And I agree with you, but when we talk about society, what matters is what society statistically thinks. When I talk about incentives, I mean this: Imagine you are 16 years old in 2023. You are still not 100% convinced that academia is your vocation, and you look around. On one hand, you see people that study all their life and enter academia. On the other hand, you see someone that makes a lot of money by <a href=\"https://www.rollingstone.com/culture/culture-features/fart-jar-tiktok-stephanie-matto-interview-1280395/\">farting in jars</a>. I concede that this example is extreme, but all things considered, I think that making academic jobs good just for subsisting would not be enough.</p>",
        "id": 327607975,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676310366
    },
    {
        "content": "<p>As for villages, I think a big incentive that people aren't using enough yet is that many research areas could really allow for remote positions. Clearly this doesn't work if you need a lab, but as a mathematician I don't see the point of moving places again and again while I could just work from home. Allowing for this would already make academic jobs way more palatable, and would solve the living costs problems (I can stay in a small town instead of moving to an expensive metropolis)</p>",
        "id": 327608262,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676310472
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327606959\">said</a>:</p>\n<blockquote>\n<p>Yes, I get your point, but if I have to literally study my whole life to do my job, would I really be happy just subsisting?</p>\n</blockquote>\n<p>I don't think the MIT living wage is enough for anyone, exactly because it is just subsistence, that's why I divided by 60%.</p>",
        "id": 327629746,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676316794
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327607975\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327606896\">said</a>:</p>\n<blockquote>\n<p>In general, I think people should be paid what they need, not as some kind of status indicator.  The problem is that it is often hard to determine this, so I think MIT Living Wage / 60% is a good proxy but ideally there would be a better system.</p>\n</blockquote>\n<p>And I agree with you, but when we talk about society, what matters is what society statistically thinks. When I talk about incentives, I mean this: Imagine you are 16 years old in 2023. You are still not 100% convinced that academia is your vocation, and you look around. On one hand, you see people that study all their life and enter academia. On the other hand, you see someone that makes a lot of money by <a href=\"https://www.rollingstone.com/culture/culture-features/fart-jar-tiktok-stephanie-matto-interview-1280395/\">farting in jars</a>. I concede that this example is extreme, but all things considered, I think that making academic jobs good just for subsisting would not be enough.</p>\n</blockquote>\n<p>I would be happy to see people who are motivated by excessive wealth go elsewhere than academia.  I'd rather set up the incentives so that people go to academia because they love learning, thinking, truth, justice, etc.  Of course they should be supported enough (~subsistence/60% + stability) </p>\n<p>People who care about wealth too much will be worse at pursuing truth because they'll get bought more easily</p>",
        "id": 327630578,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676316977
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327546856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327468535\">said</a>:</p>\n<blockquote>\n<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>\n</blockquote>\n<p>This is an old trope I will never end up disagreeing with. <br>\n[snip]<br>\nThen I wonder in which way Ronaldo or Messi scoring impossible goals and making literally billions of people cry in bewilderment can be different. The point of view you expose here can only be motivated by thinking that, probably, organized sport isn't as emotionally engaging or entertaining as it is deemed to be, which is an elitist opinion. And fortunately enough the overwhelming majority of the human beings living on this planet heartily disagrees with it.</p>\n</blockquote>\n<p>Q1: how to self-destruct an argument in the first sentence?<br>\nA1: claim that a trope is false because it is old, but that my opinion is true because i have held it for a long time.<br>\nQ2: how do ronaldo or messi make billions of people cry?<br>\nA2: at the first sight it looks like billions of people sit in front of their tvs and cry on one type of signals, get worried on a different type of signals, and admire on a third type of signal. upon closer inspection, it turns out that the first type of signals represent the movements of a ball, the second type of signals is the family arguments of people with lots of makeup, and that the third part of signals is a stable genius of great saying \"you are fired\". those who claim that reality tv is not reality are elitists.</p>",
        "id": 327641027,
        "sender_full_name": "dusko",
        "timestamp": 1676320573
    },
    {
        "content": "<p>In all honestly I didn't understand a word of what you said <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>",
        "id": 327649394,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676323802
    },
    {
        "content": "<p>And I mean it as 'I can't parse what you are saying'. Probably a 'non-native-speaker' problem.</p>",
        "id": 327649505,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676323829
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327649394\">said</a>:</p>\n<blockquote>\n<p>In all honestly I didn't understand a word of what you said :/</p>\n</blockquote>\n<p>let me try to clarify.<br>\nAd 1. i assumed that by<br>\n\"This is an old trope I will never end up disagreeing with.\"<br>\nyou mean<br>\n\"This is an old trope I will never end disagreeing with.\"<br>\nthe claim seems to be that the view X is less likely to be true because it is old, whereas view Y is more likely to be true because it is old, where<br>\nX = \"it is wrong that football is more valuable to universities than education\" and<br>\nY= \"Fabrizio's view\".</p>\n<p>Ad 2. when people cry watching football, worry watching the osbornes, kardashians, or windsors, admire watching the apprentice or the white house, or vomit watching a horror movie, it can be interesting experience to divert the eyes from the screen for a moment, and take note of the reality: people are looking at a screen and their emotional reactions are caused not the reality itself but by the reality displayed on the screens to elicit emotional reactions. for 1000s of years, people went to theaters to discharge emotions by watching murders on the scene, without anyone being hurt. with the advent of media, the social contract of \"this is fiction\" that used to be signed at the gates of theaters got ripped up. the fact that fiction is injected into reality to better monetize it (and into money to increase its value) is not a problem in itself --- until it <strong>displaces</strong> reality. the fact that chasing a ball is mixed with education is not a problem in itself --- until it <strong>displaces</strong> education. the athletes sitting in classes and the money that they bring into the universities <strong>displace</strong> lots of poor people who would be genuinely interested to sit in classes, get educated, and discover laws of nature, but don't get to do any of that, because the university, just like the tv theaters that we watch, is not optimized for the needs of any people, but for the bottom line.</p>\n<p>sorry about the long sentences, but i tried to make it clear and explicit,  and had to spell out all associations and allusions.</p>\n<p>the fact that all organizations around us are on autopilot does not mean that you and i as individuals have to be on that same autopilot. all we need to do is look around us and think with our own minds. that means diverting our eyes from the screen from time to time.</p>",
        "id": 327656327,
        "sender_full_name": "dusko",
        "timestamp": 1676326607
    },
    {
        "content": "<p>I think probably you are influenced by the US university system that has very close ties with NFL, NBA etc.</p>",
        "id": 327657094,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676326953
    },
    {
        "content": "<p>People chasing a ball here in Europe very seldom displace people trying to get a degree of any sort.</p>",
        "id": 327657155,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676326981
    },
    {
        "content": "<p>What I meant with \"This is an old trope I will never end up disagreeing with.\" is that I heard this argument again and again and again, and I keep thinking it is a wrong argument. \"Football players earn more than policemen! Crazy!\" \"Football players earn more than doctors! Crazy!\" \"Football players earn more than &lt;place whatever profession you want here&gt;! Crazy!\" It's always the same thing, and I just think the argument is wrong in its essence, often because it compares apples and pears</p>",
        "id": 327657442,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676327108
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> I mean US college football, and not the players, but the coach, compared to the people directly contributing to the usually acknowledged goals of the university, namely research and/or teaching. Professional sport is of course a massive social construct with all kinds of benefits (though not without its costs), but that's what I'm thinking about here.</p>",
        "id": 327658354,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676327491
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327657442\">said</a>:</p>\n<blockquote>\n<p>What I meant with \"This is an old trope I will never end up disagreeing with.\" is that I heard this argument again and again and again, and I keep thinking it is a wrong argument. \"Football players earn more than policemen! Crazy!\" \"Football players earn more than doctors! Crazy!\" \"Football players earn more than &lt;place whatever profession you want here&gt;! Crazy!\" It's always the same thing, and I just think the argument is wrong in its essence, often because it compares apples and pears</p>\n</blockquote>\n<p>fabrizio, the sentence \"This is an old trope I will never end up disagreeing with\" means that you do NOT disagree with that old trope, and you will never in the future <em>end up disagreeing</em> with it, no matter what happens. i think you are trying to say that you will never <em>end disagreeing</em> with this trope. that is fair enough, but you provided a self-defeating rhetorical figure for your position, where being old is used to attack one argument and to support another one. if you want to make a logically consistent argument, you need to choose only one of the options.</p>",
        "id": 327658406,
        "sender_full_name": "dusko",
        "timestamp": 1676327515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327658406\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327657442\">said</a>:</p>\n<blockquote>\n<p>What I meant with \"This is an old trope I will never end up disagreeing with.\" is that I heard this argument again and again and again, and I keep thinking it is a wrong argument. \"Football players earn more than policemen! Crazy!\" \"Football players earn more than doctors! Crazy!\" \"Football players earn more than &lt;place whatever profession you want here&gt;! Crazy!\" It's always the same thing, and I just think the argument is wrong in its essence, often because it compares apples and pears</p>\n</blockquote>\n<p>fabrizio, the sentence \"This is an old trope I will never end up disagreeing with\" means that you do NOT disagree with that old trope, and you will never in the future <em>end up disagreeing</em> with it, no matter what happens. i think you are trying to say that you will never <em>end disagreeing</em> with this trope. that is fair enough, but you provided a self-defeating rhetorical figure for your position, where being old is used to attack one argument and to support another one. if you want to make a logically consistent argument, you need to choose only one of the options.</p>\n</blockquote>\n<p>Ok, got it.</p>",
        "id": 327658615,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1676327585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327546856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327468535\">said</a>:</p>\n<blockquote>\n<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>\n</blockquote>\n<p>This is an old trope I will never end up disagreeing with. It is true, there are football players that are paid an obscene amount of money. Those are like the 0.0001% of all the people that play football. The average football player plays as a second job, and does something else to pay the bills.</p>\n</blockquote>\n<p>I think the most relevant issue in this thread is not how much professional football players are paid, but how much the football coaches at universities are paid.   </p>\n<p>In the US - where \"football\" means something different from \"soccer\" - the top-paid university football coaches have salaries like this:</p>\n<p>James Franklin salary: $7 million (Penn State)<br>\nJim Harbaugh salary: $7.05 million (University of Michigan)<br>\nLuke Fickell salary: $7.8 million (University of Wisconsin)<br>\nMario Cristobal salary: $8 million (University Miami)<br>\n.<br>\n.<br>\n.<br>\nKirby Smart salary: $11.25 million (Georgia Tech)<br>\nDabo Swinney salary: $11.5 million (Clemson University)<br>\nNick Saban salary: $11.7 million (University of Alabama)</p>\n<p>So I thought <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> asked a good question: why do universities spend so much money on this?   In the US, they say that football is necessary to get alumni to donate money to the university.   But it would be nice to see evidence that it actually pays off.</p>\n<p>It's a bit like how the Olympics gets cities to pay a lot of money to hold the Olympics there, claiming it will be a net financial benefit to the cities.  I think this turned out not to be true.</p>",
        "id": 327658851,
        "sender_full_name": "John Baez",
        "timestamp": 1676327685
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327598342\">said</a>:</p>\n<blockquote>\n<p>So, honestly, less monasteries and more 'give me a fixed job already so that I can let my kids grow up comfortably', please.</p>\n</blockquote>\n<p>That's why I'm trying to get an industry job. I have very few requirements, basically just what you've said.</p>",
        "id": 327658981,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676327753
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327658851\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327546856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327468535\">said</a>:</p>\n<blockquote>\n<p>When the football coach earns as much or more than the boss of the university, and more money is spent on a new sports stadium than on any other actually necessary facilities, one wonders what the university is for.</p>\n</blockquote>\n<p>This is an old trope I will never end up disagreeing with. It is true, there are football players that are paid an obscene amount of money. Those are like the 0.0001% of all the people that play football. The average football player plays as a second job, and does something else to pay the bills.</p>\n</blockquote>\n<p>I think the most relevant issue in this thread is not how much professional football players are paid, but how much the football coaches at universities are paid.   </p>\n<p>In the US - where \"football\" means something different from \"soccer\" - the top-paid university football coaches have salaries like this:</p>\n<p>James Franklin salary: $7 million (Penn State)<br>\nJim Harbaugh salary: $7.05 million (University of Michigan)<br>\nLuke Fickell salary: $7.8 million (University of Wisconsin)<br>\nMario Cristobal salary: $8 million (University Miami)<br>\n.<br>\n.<br>\n.<br>\nKirby Smart salary: $11.25 million (Georgia Tech)<br>\nDabo Swinney salary: $11.5 million (Clemson University)<br>\nNick Saban salary: $11.7 million (University of Alabama)</p>\n<p>So I thought <span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> asked a good question: why do universities spend so much money on this?   In the US, they say that football is necessary to get alumni to donate money to the university.   But it would be nice to see evidence that it actually pays off.</p>\n<p>It's a bit like how the Olympics gets cities to pay a lot of money to hold the Olympics there, claiming it will be a net financial benefit to the cities.  I think this turned out not to be true.</p>\n</blockquote>\n<p>The universities don’t spend fungible money on this. The boosters (=athletics donors) pay almost all the football coaching salaries. The university is a pass through</p>",
        "id": 327684610,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676343916
    },
    {
        "content": "<p>So one could decouple the sports department from the university and have them be independent bodies?</p>",
        "id": 327685208,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676344343
    },
    {
        "content": "<p>Of Brian Kelly’s $9M per year at LSU only $400k is paid by the university</p>\n<p><a href=\"https://www.nytimes.com/2021/12/04/sports/ncaafootball/college-football-coaching-changes.html\">https://www.nytimes.com/2021/12/04/sports/ncaafootball/college-football-coaching-changes.html</a></p>",
        "id": 327685246,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676344389
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327685208\">said</a>:</p>\n<blockquote>\n<p>So one could decouple the sports department from the university and have them be independent bodies?</p>\n</blockquote>\n<p>Ohio State did this IIRC</p>",
        "id": 327685684,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676344751
    },
    {
        "content": "<p><a href=\"https://www.reddit.com/r/CFB/comments/me4k07/comment/gsdsh93/\">https://www.reddit.com/r/CFB/comments/me4k07/comment/gsdsh93/</a></p>",
        "id": 327685824,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676344895
    },
    {
        "content": "<p>Now I'm curious:  do Ohio State athletes have to be students at Ohio State University?  And does Ohio State compete in intercollegiate sports?  Those might be factors that impact the decoupling of sports departments from their host universities (along with other, possibly more direct financial incentives).</p>",
        "id": 327686164,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1676345254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277578\">@Steve Huntsman</span> \"only\"!</p>",
        "id": 327693821,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676352080
    },
    {
        "content": "<p>The University's _contribution_ to that salary is more than the Australian PM at current conversion rates.</p>",
        "id": 327708631,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1676360492
    },
    {
        "content": "<p>College football is a <em>big</em> deal, I believe it's more popular than professional NFL, so I could totally believe that universities are basically in the business of sports with a small side-gig doing education. Between the income from TV licensing and ticket sales, plus the players are not paid in cash (only in free tuition, which the university have already lying around to give away because of their handy side gig in education), for me it's entirely believable that most of their income could come from sports</p>",
        "id": 327745397,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1676372149
    },
    {
        "content": "<p>Similar idea to the (conspiracy?) theory that modern airlines are financial institutions with small and unprofitable side gigs moving passengers with planes</p>",
        "id": 327745616,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1676372210
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327708631\">said</a>:</p>\n<blockquote>\n<p>The University's _contribution_ to that salary is more than the Australian PM at current conversion rates.</p>\n</blockquote>\n<p>Lots of senior profs at public schools in finance, business, medicine, even stats and engineering make more than $400k.</p>",
        "id": 327752981,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676374468
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327686164\">said</a>:</p>\n<blockquote>\n<p>And does Ohio State compete in intercollegiate sports?  </p>\n</blockquote>\n<p>They are routinely one of the four college football playoff teams.</p>",
        "id": 327753393,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676374609
    },
    {
        "content": "<p><a href=\"https://www.ucop.edu/academic-personnel-programs/_files/2022-23/oct-2022-salary-scales/t5-9.pdf\">https://www.ucop.edu/academic-personnel-programs/_files/2022-23/oct-2022-salary-scales/t5-9.pdf</a></p>",
        "id": 327754178,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676374838
    },
    {
        "content": "<p>Both Tao and Smale make more than $400k from UCLA</p>\n<p>Or check out Utah, which even surprised me: <a href=\"https://openpayrolls.com/rank/highest-paid-employees/university-of-utah\">https://openpayrolls.com/rank/highest-paid-employees/university-of-utah</a></p>",
        "id": 327772545,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1676380565
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/327745616\">said</a>:</p>\n<blockquote>\n<p>Similar idea to the (conspiracy?) theory that modern airlines are financial institutions with small and unprofitable side gigs moving passengers with planes</p>\n</blockquote>\n<p>conspiracy theories assume that there are conspirators, just like intelligent design assumes that someone is intelligent. in the absence of intelligent conspirators, the processes that you describe are called business models and organizations, in two complementary approaches, spelling out isomorphic structures. while conspiracy theories spread through twitter, the business models are what the VCs normally study and the theory of organization led to the first memorial prize awarded to a woman.</p>",
        "id": 327851772,
        "sender_full_name": "dusko",
        "timestamp": 1676401242
    },
    {
        "content": "<p>Update: applications for Scholarship Workshop are now open! If you've been wanting to found your own scholarly institution here's your chance:</p>\n<p><a href=\"https://let-me-think.org/scholarshipworkshop.html\">https://let-me-think.org/scholarshipworkshop.html</a></p>",
        "id": 327919080,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1676433480
    },
    {
        "content": "<p>At every scholarly institution I've been to the scholars tend to be rich, from rich families, from academic familes, etc. etc. If you can manage to make a scholarly institution that does not have this class divide then I will be impressed. I think that poorer people tend not to be able to make their scholarly pursuits their top priority. I think an institution that is classless will have to accommodate this somehow but to me it seems like a math monastery would be most available to the independently wealthy. Do you have any thoughts on this?</p>",
        "id": 341996202,
        "sender_full_name": "Jade Master",
        "timestamp": 1678871534
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> are these all in the US?<br>\nNot meaning anything pointed, but the well-known situation about tertiary education costs in the US is not irrelevant here.</p>",
        "id": 342206353,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1678935625
    },
    {
        "content": "<p>I think it's true in Europe too. At least the UK and in STEM fields I've noticed the same trends.</p>",
        "id": 342206549,
        "sender_full_name": "Jade Master",
        "timestamp": 1678935727
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> I don't doubt it. My grandmother kept telling me that going to uni was a bad idea, because people who go to university don't get jobs. She finished school at about 14 or so, to work in the rural post office run by her father. I'm the only person among her descendants to go to university, as it happens. </p>\n<p>That kind of cultural attitude is rather a strong dissuasion from even considering university as an option, and here uni doesn't cost an arm and a leg like in the US.</p>",
        "id": 342208387,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1678936906
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342206549\">said</a>:</p>\n<blockquote>\n<p>I think it's true in Europe too. At least the UK and in STEM fields I've noticed the same trends.</p>\n</blockquote>\n<p>This is a very anglo thing tbf. In continental Europe tuition fees aren't anywhere close to the UK/US counterpart. In some EU countries university is free.</p>",
        "id": 342291992,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1678968673
    },
    {
        "content": "<p>Moreover, there are also differences in how university staff is considered legally. For instance, PhD students in the Netherlands are considered employees. That's another big difference.</p>",
        "id": 342292216,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1678968737
    },
    {
        "content": "<p>And, as much as it pains to admit it, the UK is not Europe. They chose to leave, and by the looks of it, it seems that they will grow closer and closer to the American way of understanding and managing universities.</p>",
        "id": 342292477,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1678968815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342291992\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342206549\">said</a>:</p>\n<blockquote>\n<p>I think it's true in Europe too. At least the UK and in STEM fields I've noticed the same trends.</p>\n</blockquote>\n<p>This is a very anglo thing tbf.</p>\n</blockquote>\n<p>I agree with you when you talk about the cost of higher education: if I remember correctly,  I got my PhD in France for a grand total of about 1k€ (I am originally from Italy, it would have been more or less the same over there I'm sure).  It was almost 20 years ago but I don't think that has changed much.  And in France too PhD students are considered employees, for example my 3 years of PhD will be taken into account for my retirement (if in the next 20 years they will not have completely abolished it <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span>).</p>\n<p>However, what I think <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> was talking about is the fact that people who attend university tend to come from a somewhat advantaged background, especially when you consider those who attend it to the level necessary to become a scholar.  This seems to be true <em>regardless of the cost of higher education</em>: I don't think that the son of a farmer, or the daughter of a hairdresser living in the wrong side of town are more likely to become a Professor in (continental) Europe than in the US, even though in theory they should be, because their parents are more likely to afford paying their studies in Europe than in the US.</p>\n<p>I don't know any statistics to back this up, so I can only say that it is an impression, but I definitely share it with Jade.  If it <em>is</em> true, then maybe one reason is that education in reality always has a cost in the form of \"negative income\", in the sense that if you're studying, you're not earning any money.  If you come from a disadvantaged background, it doesn't matter how little education costs, you or your family cannot afford you to \"waste\" years just reading books instead of contributing to put food on the table.</p>\n<p>At this point I think it's interesting to notice that even suppressing this \"negative income\" does not seem to improve the situation so much.  In France, students of certain \"special\" public schools (<em>École Normale Supérieure</em>, <em>École Polytechnique</em>, etc.) have the status of  \"civil servant\" and earn a salary.  That is, they actually <em>get paid</em> to attend university.  Access to these schools is granted by ranking high enough in certain state exams (so-called <em>concours</em>) which, in principle, are open to any student whatsoever, independently of their social background.  However, my impression is that, in practice, the students who even try to take that exam tend to be the sons and daughters of people who took that exam in the past, because to take that exam you have to go to prep school, and to go to prep school you have to have gone to the right high school, and to go to the right high school you have to have been born in the right place, from the right family, etc.  It's just that in the \"nature vs. nurture\" business, \"nurture\" seems to be much more important here, and it's <em>really</em> difficult to overcome that bias.</p>",
        "id": 342329453,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1678977010
    },
    {
        "content": "<p>From my experience of the French system, this is unfortunately painfully true. In my studies I was surrounded mostly by children of people who were not necessarily wealthy but had a good understanding of the French higher education system (my parents being a good example). Given how unreadable our system is, it's a very selecting bias.<br>\nThere is still the possibility of a high school teacher spotting a talented child and encouraging them to go for it. It does happen and would not be possible if those studies costed a lot of money. But it's way too rare.</p>",
        "id": 342343934,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1678979703
    },
    {
        "content": "<p>It's very possible it won't work out this way, but I like to hope that tools like chatGPT (or similar) may help enable more people to pursue advanced studies in areas of interest to them.</p>\n<p>I think it's currently significantly easier to pursue studies in area X if one's parents know a lot about area X, in part because it's easy to ask questions and get advice from them. Maybe having an easily accessible source of information that can answer individualized questions will help people without this background.</p>\n<p>On a related note, I think a lot of people find that they don't enjoy learning subject X after a bad experience in a class on subject X (e.g. they didn't have the background, or the teacher was unpleasant). Maybe it will help if each person has an endlessly patient tutor available to them that will discuss the topic of their interest at a level appropriate to them.</p>",
        "id": 342363059,
        "sender_full_name": "David Egolf",
        "timestamp": 1678983650
    },
    {
        "content": "<p>As a counterexample to the general law that “everywhere only people from privileged backgrounds go into higher education”, all my grandparents got university degrees (and two of them PhDs) despite coming from decidedly non-privileged backgrounds (two children of farmers, two orphans).</p>\n<p>This was in post-war socialist Yugoslavia, where education was free at all levels and working class people were specifically encouraged to pursue higher education.</p>",
        "id": 342411772,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1678997010
    },
    {
        "content": "<p>The sociologist <a href=\"https://fr.wikipedia.org/wiki/Pierre_Bourdieu\">Pierre Bourdieu</a> who explained how in France, despite the fact the university is free, mainly people from privileged families get university degrees because of the transmission of cultural capital (which is a notion he invented) in this book (with Jean-Claude Passeron): <a href=\"https://monoskop.org/images/7/71/Bourdieu_Pierre_Passeron_Jean_Claude_The_Inheritors_1979.pdf\">The Inheritors</a>, came from a very rural family. But this is the exception more than the rule. And the situation hasn't improved but has regressed since the time he was a student. Next to his familial history, I really encourage you to take a look at the work of Bourdieu if you are interested in these questions. He nicely combines philosophical concepts with fact-based studies and was clearly one of the greatest contemporary French intellectuals.</p>",
        "id": 342422658,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679000757
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276839\">Damiano Mazza</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342329453\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342291992\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342206549\">said</a>:</p>\n<blockquote>\n<p>I think it's true in Europe too. At least the UK and in STEM fields I've noticed the same trends.</p>\n</blockquote>\n<p>This is a very anglo thing tbf.</p>\n</blockquote>\n<p>I agree with you when you talk about the cost of higher education: if I remember correctly,  I got my PhD in France for a grand total of about 1k€ (I am originally from Italy, it would have been more or less the same over there I'm sure).  It was almost 20 years ago but I don't think that has changed much.  And in France too PhD students are considered employees, for example my 3 years of PhD will be taken into account for my retirement (if in the next 20 years they will not have completely abolished it <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span>).</p>\n<p>However, what I think <span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> was talking about is the fact that people who attend university tend to come from a somewhat advantaged background, especially when you consider those who attend it to the level necessary to become a scholar.  This seems to be true <em>regardless of the cost of higher education</em>: I don't think that the son of a farmer, or the daughter of a hairdresser living in the wrong side of town are more likely to become a Professor in (continental) Europe than in the US, even though in theory they should be, because their parents are more likely to afford paying their studies in Europe than in the US.</p>\n<p>I don't know any statistics to back this up, so I can only say that it is an impression, but I definitely share it with Jade.  If it <em>is</em> true, then maybe one reason is that education in reality always has a cost in the form of \"negative income\", in the sense that if you're studying, you're not earning any money.  If you come from a disadvantaged background, it doesn't matter how little education costs, you or your family cannot afford you to \"waste\" years just reading books instead of contributing to put food on the table.</p>\n<p>At this point I think it's interesting to notice that even suppressing this \"negative income\" does not seem to improve the situation so much.  In France, students of certain \"special\" public schools (<em>École Normale Supérieure</em>, <em>École Polytechnique</em>, etc.) have the status of  \"civil servant\" and earn a salary.  That is, they actually <em>get paid</em> to attend university.  Access to these schools is granted by ranking high enough in certain state exams (so-called <em>concours</em>) which, in principle, are open to any student whatsoever, independently of their social background.  However, my impression is that, in practice, the students who even try to take that exam tend to be the sons and daughters of people who took that exam in the past, because to take that exam you have to go to prep school, and to go to prep school you have to have gone to the right high school, and to go to the right high school you have to have been born in the right place, from the right family, etc.  It's just that in the \"nature vs. nurture\" business, \"nurture\" seems to be much more important here, and it's <em>really</em> difficult to overcome that bias.</p>\n</blockquote>\n<p>I agree with what you say. Still, I think that everything else staying fixed free university is much more inclusive than university that leaves you indebted for twenty years.</p>",
        "id": 342431333,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1679004501
    },
    {
        "content": "<p>It's not everything one needs but it's a big step for sure.</p>",
        "id": 342431371,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1679004527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> wrote:</p>\n<blockquote>\n<p>It's very possible it won't work out this way, but I like to hope that tools like chatGPT (or similar) may help enable more people to pursue advanced studies in areas of interest to them.</p>\n</blockquote>",
        "id": 342451412,
        "sender_full_name": "John Baez",
        "timestamp": 1679014773
    },
    {
        "content": "<p>Did you know that the Khan Academy, which gives free online math classes, is <a href=\"https://mathstodon.xyz/@johncarlosbaez\">starting to use GPT4</a> as a tutoring system?</p>",
        "id": 342451709,
        "sender_full_name": "John Baez",
        "timestamp": 1679014911
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342451709\">said</a>:</p>\n<blockquote>\n<p>Did you know that the Khan Academy, which gives free online math classes, is <a href=\"https://mathstodon.xyz/@johncarlosbaez\">starting to use GPT4</a> as a tutoring system?</p>\n</blockquote>\n<p>Yes, and I'm very interested to see how this will turn out!</p>",
        "id": 342455240,
        "sender_full_name": "David Egolf",
        "timestamp": 1679016871
    },
    {
        "content": "<p>How not to do it</p>\n<p><a href=\"https://www.adelaide.edu.au/creating-a-university-for-the-future/ua/media/15/vision-statement.pdf\">https://www.adelaide.edu.au/creating-a-university-for-the-future/ua/media/15/vision-statement.pdf</a></p>",
        "id": 344769715,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1679897775
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342455240\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/342451709\">said</a>:</p>\n<blockquote>\n<p>Did you know that the Khan Academy, which gives free online math classes, is <a href=\"https://mathstodon.xyz/@johncarlosbaez\">starting to use GPT4</a> as a tutoring system?</p>\n</blockquote>\n<p>Yes, and I'm very interested to see how this will turn out!</p>\n</blockquote>\n<p>I hope it will work well. When AI will be able to do all the teaching we'll be able to focus only on research, not so bad <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> . Undergrad students tell me that they are too lazy to come at the university, so it will actually improve the level of education if they can learn in an efficient way on their computers at home. I hope they could become better and be less catastrophic in the calculus exams and I also want these exams to be corrected by AI and not by me <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>. I'm a relatively lazy person so I have maybe a different and more optimistic persepective on this subject. I like creating and understanding things, not doing things that can be automatized.</p>",
        "id": 344783226,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679902336
    },
    {
        "content": "<p>Almost completely out of subject, but it makes me think to that and there is some logical relation: I'm interested by this paper: <a href=\"http://www.tac.mta.ca/tac/volumes/35/50/35-50abs.html\">A Categorical Reduction System for Linear Logic</a> for instance. This article try to automate diagram chasing, ie. doing proofs automatically. Not nice? I think what it does is that you give two morphisms in linear logic and it's going to decide if they are equal ie. it decides if a theorem (here an equality) is true. Theorems are more interesting than the proofs. I want to adapt this to differential categories to make automatic proofs of some facts than <span class=\"user-mention\" data-user-id=\"277105\">@JS PL (he/him)</span> did by \"brute force calculations\" (in his words), he already told me that a computer will probably be very good to do this. And he didn't  adapt these proofs in our last paper on the graded versions of these things because it was too boring. So I want to use a computer to help us <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 344785304,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679902942
    },
    {
        "content": "<p>This is very out of subject, but I wanted to say that, sorry <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> We are still on the subject of doing boring things automatically though.</p>",
        "id": 344785364,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679902966
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span> Made me think of the <a href=\"https://www.abc.net.au/news/2020-08-12/two-decades-on-ai-explored-in-canberra-duo-b%28if%29tek-album-2020/12544272\">album reviewed in this article</a></p>\n<blockquote>\n<p>The opening track on B(if)tek's 2020 album, Machines Work, was inspired by an advertisement made by The Muppets creator Jim Henson, featuring the sounds of electronic instruments inventor Raymond Scott.</p>\n<p>In 1967, multinational technology company IBM asked Henson to make an ad about their new word processor and how its technology could help people control paperwork in the office.</p>\n<p>The resulting ad, with its montage of images and words to an electronic soundtrack by Scott, provided the sample for Machines Work.</p>\n<p>\"Machines can do the work so that people have time to think,\" the sample intoned, but ended with a warning that, actually, \"people can do the work so that machines have time to think\".</p>\n<p>\"It's a fantastic little film, made to promote the idea that humans and machines would cooperate and deal with all the messy paperwork of the office,\" Crawford said.</p>\n</blockquote>",
        "id": 344801653,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1679907397
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/344785304\">said</a>:</p>\n<blockquote>\n<p>And he didn't  adapt these proofs in our last paper on the graded versions of these things because it was too boring. </p>\n</blockquote>\n<p>No not \"too boring\" per say, and more they're the same as the non-graded version of the proofs in our monster of paper here: <a href=\"https://arxiv.org/pdf/1806.04804.pdf\">https://arxiv.org/pdf/1806.04804.pdf</a> -- where the proofs in the appendix are indeed by brute force calculations (which ended being a good chunk of my phd thesis)</p>",
        "id": 344802191,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1679907544
    },
    {
        "content": "<p>(Also, we submitted to a CS conference with a strict page deadline -- so its more we didn't add them for space reasons)</p>",
        "id": 344802349,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1679907599
    },
    {
        "content": "<p>Sorry, I write crazy things, I feel a bit weird. I wanted to delete this.</p>",
        "id": 344802604,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679907667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/344785304\">said</a>:</p>\n<blockquote>\n<p>make automatic proofs of some facts than <span class=\"user-mention silent\" data-user-id=\"277105\">JS PL (he/him)</span> did by \"brute force calculations\" (in his words), he already told me that a computer will probably be very good to do this.</p>\n</blockquote>\n<p>When I said that, I had \"globular\" or \"<a href=\"http://homotopy.io\">homotopy.io</a>\" in mind for linear logic/differential categories. Which is still my dream that someday I'll have a nice web-based proof assistant to help me with my string diagram proofs for differential categories</p>",
        "id": 344802907,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1679907762
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/344801653\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> Made me think of the <a href=\"https://www.abc.net.au/news/2020-08-12/two-decades-on-ai-explored-in-canberra-duo-b%28if%29tek-album-2020/12544272\">album reviewed in this article</a></p>\n<blockquote>\n<p>The opening track on B(if)tek's 2020 album, Machines Work, was inspired by an advertisement made by The Muppets creator Jim Henson, featuring the sounds of electronic instruments inventor Raymond Scott.</p>\n<p>In 1967, multinational technology company IBM asked Henson to make an ad about their new word processor and how its technology could help people control paperwork in the office.</p>\n<p>The resulting ad, with its montage of images and words to an electronic soundtrack by Scott, provided the sample for Machines Work.</p>\n<p>\"Machines can do the work so that people have time to think,\" the sample intoned, but ended with a warning that, actually, \"people can do the work so that machines have time to think\".</p>\n<p>\"It's a fantastic little film, made to promote the idea that humans and machines would cooperate and deal with all the messy paperwork of the office,\" Crawford said.</p>\n</blockquote>\n</blockquote>\n<p>I really like this music! It's very inspiring to listen while correcting calculus exams.</p>",
        "id": 345033680,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679983548
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/344769715\">said</a>:</p>\n<blockquote>\n<p>How not to do it</p>\n<p><a href=\"https://www.adelaide.edu.au/creating-a-university-for-the-future/ua/media/15/vision-statement.pdf\">https://www.adelaide.edu.au/creating-a-university-for-the-future/ua/media/15/vision-statement.pdf</a></p>\n</blockquote>\n<p>What are the issues with this University of South Australia/Adelaide for the future? Do they want not to fund unapplied research in maths for example because it is does not create enough immediate value in the economy? It is not clear if it is case with what they say but I guess it could be the case. I see that they want to obligate students to \"have an experience in entrepreneurship\". I did that in France and I didn't like it a lot. I don't like a lot the idea that you could find great ideas by putting post-its everywhere on the walls of an office and all the brainstorming bullshit that is associated with \"entrepreneurship\". It's great to innovate but you can't really learn innovation as innovation I think...</p>",
        "id": 345033801,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679983577
    },
    {
        "content": "<p>I won't lie, I feel like making some cheese would drastically improve my undergrad's mental health too.</p>",
        "id": 345343337,
        "sender_full_name": "José Siqueira",
        "timestamp": 1680082232
    },
    {
        "content": "<blockquote>\n<p>John Baez said:<br>\n    Did you know that the Khan Academy, which gives free online math classes, is starting to use GPT4 as a tutoring system?<br>\nYes, and I'm very interested to see how this will turn out!</p>\n</blockquote>\n<p>well, I hope (but don't believe) it goes much better than chatGPT which says that 8 is prime. Delightful conversation here<br>\n<a href=\"https://cs.nyu.edu/~davise/papers/ChatGPT/ChatGPTOnPrimes.html\">https://cs.nyu.edu/~davise/papers/ChatGPT/ChatGPTOnPrimes.html</a></p>",
        "id": 345520389,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1680125962
    }
]