[
    {
        "content": "<p>I hope all you grad students out there apply for this!   It's a great opportunity to meet other category theorists and improve your skills:</p>\n<blockquote>\n<p>I'd like to make a second announcement of the Emerging Researchers in<br>\nCategory Theory (Em-Cats) Virtual Seminar, which will comprise talks given<br>\nby graduate students in Category Theory around the world.</p>\n<p>We invite students to apply to speak in the seminar. We also would<br>\nappreciate any efforts from thesis advisors and other mentors to encourage<br>\ntheir less self-confident students to apply.</p>\n<p>The first round of applications closes next week, on April 30th, 2021.</p>\n<p>The aims of the seminar are, broadly:</p>\n<ol>\n<li>Help the next generation of category theorists become wonderful speakers.</li>\n<li>\n<p>Make use of the virtual possibilities, and give opportunities to<br>\ngraduate students in places where there is not a category theory group or<br>\nlocal seminar they can usefully speak in.</p>\n</li>\n<li>\n<p>Give an opportunity to graduate students to have a global audience,<br>\nespecially giving more visibility to students from less famous/large groups.</p>\n</li>\n<li>\n<p>Make a general opportunity for community among category theorists who<br>\nare more isolated than those with local groups.</p>\n</li>\n<li>\n<p>Make a series of truly intelligible talks, which we hope students and<br>\nresearchers around the world will enjoy and appreciate.</p>\n</li>\n</ol>\n<p>Eugenia Cheng leads the seminar, and will assist each speaker in the<br>\npreparation of their talk, to ensure that all talks are excellent. We<br>\nexpect to plan one talk per month initially, starting in August or<br>\nSeptember 2021.</p>\n<p>More information, including the application form, can be found on the<br>\nseminar website: <a href=\"https://topos.site/em-cats/\">https://topos.site/em-cats/</a>.</p>\n<p>With kind regards,<br>\nBrendan<br>\n</p>\n</blockquote>",
        "id": 235992009,
        "sender_full_name": "John Baez",
        "timestamp": 1619288463
    },
    {
        "content": "<p>Such an amazing opportunity! Many thanks to the members of the Topos institute for all the great activities they have been organising lately.</p>",
        "id": 235995894,
        "sender_full_name": "Nicolas Blanco",
        "timestamp": 1619290706
    },
    {
        "content": "<p><a href=\"https://topos.site/em-cats/\">Speakers for the Em-Cats virtual seminar have been chosen!</a></p>",
        "id": 243306369,
        "sender_full_name": "John Baez",
        "timestamp": 1624200906
    },
    {
        "content": "<p>Jade Master <br>\nUniversity of California Riverside <br>\nPetri nets and compositionality of networks <br>\n17:00 UTC, 25th of August 2021</p>\n<p>Minani Iragi <br>\nUniversity of South Africa <br>\nCategorical topology <br>\n15:00 UTC, 29th of September 2021</p>\n<p>Johan García Vargas <br>\nUniversidad de los Andes <br>\nHopf monads and Galois theory <br>\n16:00 UTC, 27th of October 2021</p>\n<p>Nuiok Dicaire <br>\nUniversity of Edinburgh <br>\nLocal monads and computational effects <br>\n16:00 UTC, 17th of November 2021</p>\n<p>Gun Pinyo <br>\nUniversity of Nottingham <br>\nCubicial type theory and geometric shapes for higher structure <br>\nFebruary 2022</p>\n<p>Jennifer Brown <br>\nUniversity of California Davis <br>\nQuantum topology <br>\nMarch 2022</p>\n<p>Eli Hazel <br>\nMacquarie University <br>\nCategorical algebra <br>\nApril 2022</p>\n<p>Juan F. Meleiro <br>\nUniversidade de São Paulo <br>\nCategorical logic <br>\nMay 2022</p>",
        "id": 243306469,
        "sender_full_name": "John Baez",
        "timestamp": 1624201074
    },
    {
        "content": "<p>Is the seminar series on <a href=\"http://researchseminar.org\">researchseminar.org</a> or is there an ICS stream I can hook to my calendar? (cc <span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span> if I understand who handles these things at Topos)</p>",
        "id": 249179744,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1628722238
    },
    {
        "content": "<p>(that is me indeed!) at the moment there’s nothing, but i’ll try to set up a researchseminar calendar this week</p>",
        "id": 249179797,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1628722300
    },
    {
        "content": "<p><a href=\"https://researchseminars.org/seminar/EmCats\">https://researchseminars.org/seminar/EmCats</a></p>",
        "id": 249260531,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1628787146
    },
    {
        "content": "<p>(it's also on the webpage: <a href=\"https://topos.site/em-cats/\">https://topos.site/em-cats/</a> )</p>",
        "id": 249260551,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1628787159
    },
    {
        "content": "<p>i just sent out an announcement about the first talk for this to the topos seminars mailing list (and to the category mailing list), but i'll copy it below so people can read it here too :-)</p>",
        "id": 250163939,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1629488629
    },
    {
        "content": "<p>I hope this message finds you all well. The Topos Institute is very excited to announce a new seminar series: Em-Cats.</p>\n<p>This public series of virtual seminars is being launched after careful thought and planning by Eugenia Cheng, with the aim of helping the next generation of category theorists to become wonderful speakers, as well as to offer opportunities to graduate students in places where there is not a category theory group or local seminar that they can usefully speak in. The seminars will be held monthly, but do not have a regular schedule, so that speakers from different time zones can give their talk at a time that best suits them.</p>\n<p>The first talk will be on the 25th of August, at 17:00 UTC, when Jade Master is going to talk about the Universal Property of the Algebraic Path Problem (the abstract for which can be found at the end of this message). The seminar will be chaired by Martin Hyland, and will be moderated by Eugenia Cheng.</p>\n<p>We encourage all members of the community to come and listen, and to be involved in the question and social sessions after the talk. For more information, including links to the Zoom meeting and the YouTube livestream, please see the webpage: <a href=\"https://topos.site/em-cats\">https://topos.site/em-cats</a> .</p>\n<p>Have a nice weekend, and we look forward to seeing you all on the 25th!</p>\n<p>Best,<br>\nTim Hosgood<br>\n(Research affiliate, Topos Institute)</p>\n<p>———</p>\n<p>Jade Master: Universal Property of the Algebraic Path Problem</p>\n<p>The algebraic path problem generalizes the shortest path problem, which studies graphs weighted in the positive real numbers, and asks for the path between a given pair of vertices with the minimum total weight. This path may be computed using an expression built up from the \"min\" and \"+\" of positive real numbers. The algebraic path problem generalizes this from graphs weighted in the positive reals to graphs weighted in an arbitrary commutative semiring R. With appropriate choices of R, many well known problems in optimization, computer science, probability, and computing become instances of the algebraic path problem. <br>\nIn this talk we will show how solutions to the algebraic path problem are computed with a left adjoint, and this opens the door to reasoning about the algebraic path problem using the techniques of modern category theory. When R is \"nice\", a graph weighted in R may be regarded as an R-enriched graph, and the solution to its algebraic path problem is then given by the free R-enriched category on it. The algebraic path problem suffers from combinatorial explosion so that solutions can take a very long time to compute when the size of the graph is large. Therefore, to compute the algebraic path problem efficiently on large graphs, it helps to break it down into smaller sub-problems. The universal property of the algebraic path problem gives insight into the way that solutions to these sub-problems may be glued together to form a solution to the whole, which may be regarded as a \"practical\" application of abstract category theory.</p>",
        "id": 250163967,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1629488643
    },
    {
        "content": "<p>The next Emerging Researchers in Category Theory talk is coming soon - Wednesday November 17th, 2021!</p>\n<p>Tim Hosgood wrote:</p>\n<blockquote>\n<p>Hello everyone,</p>\n<p>This coming week will see the third talk in the Em-Cats seminar series, with Nuiok Dicaire speaking on Wednesday the 17th of November, at 16:00 UTC. For more information, including links to the Zoom meeting and the YouTube livestream, please see the seminar webpage: <a href=\"https://topos.site/em-cats\">https://topos.site/em-cats</a> .</p>\n<p>Everybody is welcome, and we look forward to seeing you all there!</p>\n<p>Best,</p>\n<p>Tim</p>\n<p>———</p>\n<p>Nuiok Dicaire: Localisable monads, from global to local</p>\n<p>Monads have many useful applications. In mathematics they are used to study algebras at the level of theories rather than specific structures. In programming languages, monads provide a convenient way to handle computational side-effects which include, roughly speaking, things like interacting with external code or altering the state of the program's variables. An important question is then how to handle several instances of such side-effects or a graded collection of them. The general approach consists in defining many “small” monads and combining them together using distributive laws.</p>\n<p>In this talk, we take a different approach and look for a pre-existing internal structure to a monoidal category that allows us to develop a fine-graining of monads. This uses techniques from tensor topology and provides an intrinsic theory of local computational effects without needing to know how the constituent effects interact beforehand. We call the monads obtained \"localisable\" and show how they are equivalent to monads in a specific 2-category. To motivate the talk, we will consider two concrete applications in concurrency and quantum theory. This is all covered in our recent paper: <a href=\"http://arxiv.org/abs/2108.01756\">arxiv.org/abs/2108.01756</a>.</p>\n</blockquote>",
        "id": 261524514,
        "sender_full_name": "John Baez",
        "timestamp": 1636994853
    },
    {
        "content": "<p>there's even a stream for this! <a class=\"stream\" data-stream-id=\"298571\" href=\"/#narrow/stream/298571-seminar.3A-EM-cats\">#seminar: EM-cats</a>  :-)</p>",
        "id": 261533315,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636998448
    },
    {
        "content": "<p>Oh, I'll move my post there.   I just saw this \"topic\"....</p>",
        "id": 261542801,
        "sender_full_name": "John Baez",
        "timestamp": 1637002747
    },
    {
        "content": "<p>Whoops, I didn't notice your announcement there.</p>",
        "id": 261543119,
        "sender_full_name": "John Baez",
        "timestamp": 1637002854
    },
    {
        "content": "<p>For some reason I wasn't subscribed.  I want to be subscribed to everything so I know what's going on!</p>",
        "id": 261543167,
        "sender_full_name": "John Baez",
        "timestamp": 1637002880
    },
    {
        "content": "<p>How will people know about a seminar if they're not subscribed to that stream?   The perennial question....</p>",
        "id": 261543226,
        "sender_full_name": "John Baez",
        "timestamp": 1637002911
    }
]