[
    {
        "content": "<p>CALL FOR CONTRIBUTIONS<br>\n<strong>GETCO 2024</strong><br>\n13th International Workshop on Geometric and Topological Methods in Computer Science</p>\n<p>Tallinn, Estonia<br>\n6--7 July 2024<br>\nassociated with ICALP/LICS<br>\n<a href=\"https://getco-conf.github.io/2024/\">https://getco-conf.github.io/2024/</a></p>\n<p>IMPORTANT DATES</p>\n<ul>\n<li>Deadline for contribunions: 30 May 2024</li>\n<li>Author notification: 3 June 2024</li>\n<li>Registration deadline: 10 June 2024</li>\n<li>Conference dates: 6-7 July 2024</li>\n</ul>\n<p>INVITED AND TUTORIAL SPEAKERS<br>\n    Uli Fahrenberg, LRE, EPITA Rennes, France<br>\n    Amar Hadzihasanovic, TalTech, Tallinn, Estonia<br>\n    Jérémy Ledent, IRIF, Université Paris Cité, France<br>\n    Georg Struth, The University of Sheffield, UK</p>\n<p>SCOPE<br>\nThe Geometric and Topological Methods in Computer Science (GETCO)<br>\nconference series focuses on applications of algebraic topology in<br>\ncomputer science with special emphasis on concurrency, distributed<br>\ncomputing, networking and other situations related to systems of<br>\nsequential computers that communicate with each other. It is aimed at<br>\nmathematicians and computer scientists working in or interested in<br>\nthese subjects, including researchers and graduate students. The aim<br>\nof the conference is to exchange ideas and to initiate or expand<br>\nresearch collaborations.<br>\nThis is the 13th incarnation of GETCO which has existed since<br>\n1999. The last two GETCOs were held in 2022 in Paris and in 2023 in<br>\nAalborg associated with the Nordic Congress of Mathematicians.<br>\nWe are calling for submission of original, unfinished, already<br>\npublished, or otherwise interesting work within the topics of the<br>\nGETCO conference. The submission can be in the form of a poster, an<br>\nabstract, a paper submitted to or published at another conference, or<br>\nin any other format. GETCO has no formal proceedings, but as for<br>\nearlier conferences, we intend to publish a journal special issue with<br>\nrevised and extended versions of a selection of the contributions.</p>\n<p>Submission is via EasyChair at<br>\n<a href=\"https://easychair.org/conferences/?conf=getco2024\">https://easychair.org/conferences/?conf=getco2024</a><br>\nFor more information, see <a href=\"https://getco-conf.github.io/2024/\">https://getco-conf.github.io/2024/</a></p>",
        "id": 438874562,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1715802549
    }
]