[
    {
        "content": "<p>The <a href=\"https://www.irif.fr/~greta/\">GReTA – Graph TRansformation Theory and Applications</a> virtual seminar series aims to serve as a platform for the international graph rewriting community, to promote recent developments and trends in the field, and to permit a regular networking and interaction between members of this community. Seminars are held twice a month in the form of Zoom sessions (some of which will be live-streamed to YouTube).</p>\n<p>Several options are available to receive regular updates on the GReTA seminars:</p>\n<ul>\n<li>Subscribe to the <a href=\"https://www.youtube.com/channel/UC6j-G6oPmkqCgOx6UQOUhSQ\">GReTA YouTube channel</a>.<div class=\"youtube-video message_inline_image\"><a data-id=\"channel\" href=\"https://www.youtube.com/channel/UC6j-G6oPmkqCgOx6UQOUhSQ\"><img src=\"https://i.ytimg.com/vi/channel/default.jpg\"></a></div></li>\n<li>Subscribe to the <a href=\"https://calendar.google.com/calendar/u/0?cid=Z3JldGEuc2VtaW5hci5vcmdhbmlzZXJzQGdtYWlsLmNvbQ\">GReTA Google Calendar</a> (or alternatively <a href=\"https://calendar.google.com/calendar/ical/greta.seminar.organisers%40gmail.com/public/basic.ics\">import it in iCal format</a>).</li>\n<li>Subscribe to the <a href=\"https://listes.irif.fr/sympa/subscribe/greta-seminar?previous_action=info\">GReTA mailing list</a>.</li>\n</ul>",
        "id": 218894348,
        "sender_full_name": "John Baez",
        "timestamp": 1607117857
    },
    {
        "content": "<p><strong>Can someone add this to our <a href=\"https://teamup.com/ksfss6k4j1bxc8vztb\">category theory calendar?</a></strong></p>",
        "id": 218894511,
        "sender_full_name": "John Baez",
        "timestamp": 1607117946
    },
    {
        "content": "<p>There was a talk today:</p>\n<ul>\n<li>Speakers: Daniel Merkle, Jakob Lykke Andersen</li>\n<li>Title: <a href=\"https://www.irif.fr/~greta/talk/dec4th2020-andersenmerkle/\">Chemical Graph Transformation and Applications</a></li>\n<li>Video: <a href=\"https://www.youtube.com/watch?v=mzIXfsp-eJE&amp;t=337s\">here</a><div class=\"youtube-video message_inline_image\"><a data-id=\"mzIXfsp-eJE\" href=\"https://www.youtube.com/watch?v=mzIXfsp-eJE&amp;t=337s\"><img src=\"https://i.ytimg.com/vi/mzIXfsp-eJE/default.jpg\"></a></div></li>\n</ul>\n<blockquote>\n<p>Abstract: Any computational method in chemistry must choose some level of precision in the modeling. One choice is made in the methods of quantum chemistry based on quantum field theory. While highly accurate, the methods are computationally very demanding, which restricts their practical use to single reactions of molecules of moderate size even when run on supercomputers. At the same time, most existing computational methods for systems chemistry and biology are formulated at the other abstraction extreme, in which the structure of molecules is represented either not at all or in a very rudimentary fashion that does not permit the tracking of individual atoms across a series of reactions.</p>\n</blockquote>\n<blockquote>\n<p>In this talk, we present our on-going work on creating a practical modelling framework for chemistry based on Double Pushout graph transformation, and how it can be applied to analyse chemical systems. We will address important technical design decisions as well as the importance of methods inspired from Algorithm Engineering in order to reach the required efficiency of our implementation. We will present chemically relevant features that our framework provides (e.g. automatic atom tracing) as well as a set of chemical systems we investigated are currently investigating. If time allows we will discuss variations of graph transformation rule compositions and their chemical validity.</p>\n</blockquote>",
        "id": 218894844,
        "sender_full_name": "John Baez",
        "timestamp": 1607118137
    },
    {
        "content": "<p>Future talks (for more info go the links above):</p>\n<ul>\n<li>\n<p>Hierarchical port graphs &amp; PORGY - port graph rewriting as a modelling tool</p>\n</li>\n<li>\n<p>Confluence of Graph Transformations</p>\n</li>\n<li>\n<p>MDEOptimiser: Searching for optimal models with EMF and Henshin</p>\n</li>\n<li>\n<p>Fast Graph Programs</p>\n</li>\n<li>\n<p>Composition-based Graph Rewriting</p>\n</li>\n</ul>",
        "id": 218895059,
        "sender_full_name": "John Baez",
        "timestamp": 1607118268
    }
]