[
    {
        "content": "<p>This online conference is just wrapping up, but the videos of all the sessions are on YouTube:<br>\n<a href=\"https://av5.ljnet.it/icgt2020/online-program/\">https://av5.ljnet.it/icgt2020/online-program/</a></p>\n<p>I'm sure a bunch of folks on here are aware of this event, but didn't see much discussion.</p>",
        "id": 202119839,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1593193093
    },
    {
        "content": "<p>Or any discussion at all, for that matter! Thanks for bringing it up. If you want to kick off discussions, what talk(s) did you enjoy? What novel things did you see at any of the talks you watched?</p>",
        "id": 202121402,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1593193974
    },
    {
        "content": "<p>Well, <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> gave a talk on joint work with <span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> on how the Grothendieck construction (well really category of elements I guess) gives a nice way of understanding the semantics of Petri nets with guards within the normal Petri net world.</p>",
        "id": 202123914,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1593195368
    },
    {
        "content": "<p>I wish those folks had used this Zulip for discussions.  <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span></p>",
        "id": 202123980,
        "sender_full_name": "John Baez",
        "timestamp": 1593195416
    },
    {
        "content": "<p>But then there a bunch of talks on double and single pushout rewriting systems in the various contexts of graphs and graphs with 'attributes.' Also stuff on tool development (coming out of Glasgow I gather) to support for instance Milner's bigraphs. Watching the talks though it seems like there is an 'applications' layer that all this stuff is useful for, but it is harder to get an idea of what that looks like since the audience for these talks is the graph transformation community who I guess already gets why this stuff is relevant.</p>",
        "id": 202124229,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1593195584
    },
    {
        "content": "<p>The talk that I haven't watched yet, but am most interested in, is from Jean Krivine and Nicholas Behr on their rewriting setup aka tracelets and Kappa. Behr and others have some recent work where they start calculating expectation values of the presence of certain diagrams in stochastic graph rewriting. For that they use machinery (commutators) inspired by quantum and it just seems super dope, though it is definitely hard to understand the details. See <a href=\"https://arxiv.org/pdf/2003.09395.pdf\">https://arxiv.org/pdf/2003.09395.pdf</a> and <a href=\"https://arxiv.org/pdf/2003.11010.pdf\">https://arxiv.org/pdf/2003.11010.pdf</a>.</p>",
        "id": 202124611,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1593195809
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275953\">Blake Pollard</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Graph.20Transformations.202020/near/202124229\">said</a>:</p>\n<blockquote>\n<p>Watching the talks though it seems like there is an 'applications' layer that all this stuff is useful for, but it is harder to get an idea of what that looks like since the audience for these talks is the graph transformation community who I guess already gets why this stuff is relevant.</p>\n</blockquote>\n<p>I've always had that problem learning theoretical computer science, ever since I was invited to a conference on it due to my work on n-categories.  Learning a subject from the \"top down\", by which I mean starting from the most abstract end, is very nerve-racking because you don't know what's important or what's just cute.  I'm so glad I learned physics from the \"bottom up\": in that subject, when I do abstract stuff, I know how or whether it's connected to anything useful.  It may <em>not</em> be, but at least I <em>know</em> that.</p>",
        "id": 202124944,
        "sender_full_name": "John Baez",
        "timestamp": 1593195995
    },
    {
        "content": "<p>I want to see stochastic graph rewriting really applied in chemistry!!!</p>",
        "id": 202124989,
        "sender_full_name": "John Baez",
        "timestamp": 1593196024
    },
    {
        "content": "<p>Sub, Spencer, and I had a chat the other day with Walter Fontana who is in systems biology at Harvard and he has been working with Daniel Merkle (part of the other MOD gang for rewriting in chemistry) and some other folks (Russ Harmer), who are working to bridge the gap to real applications. They have that postdoc ad up funded by the Danes that you posted on Azimuth. Lots of really interesting challenges, but things are definitely heating up!</p>",
        "id": 202125403,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1593196227
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275953\">Blake Pollard</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Graph.20Transformations.202020/near/202123914\">said</a>:</p>\n<blockquote>\n<p>Well, <span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> gave a talk on joint work with <span class=\"user-mention silent\" data-user-id=\"276049\">David Spivak</span> on how the Grothendieck construction (well really category of elements I guess) gives a nice way of understanding the semantics of Petri nets with guards within the normal Petri net world.</p>\n</blockquote>\n<p>Yes, it was the category of elements. But as I said in the talk we kept calling it \"Grothendieck construction\" because it sounded cooler.</p>",
        "id": 202153403,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593212740
    }
]