[
    {
        "content": "<p>There are a lot of cool talks at</p>\n<ul>\n<li><a href=\"https://www.irif.fr/~greta/#talks\">GreTA: the International Seminar on Graph Transformation Theory and Applications</a>.</li>\n</ul>",
        "id": 286129994,
        "sender_full_name": "John Baez",
        "timestamp": 1655239416
    },
    {
        "content": "<p>On Wednesday, June 29, 2022 I'm giving a talk at this seminar.</p>\n<p>I'll do it via Zoom at 19:00 Paris time, or 10:00 in California:</p>\n<ul>\n<li><a href=\"https://www.irif.fr/~greta/event/2022-jun-29/\">Compositional modeling with decorated cospans</a>.</li>\n</ul>\n<blockquote>\n<p><strong>Abstract.</strong> Decorated cospans are a general framework for composing open networks and mapping them to dynamical systems. We explain this framework and illustrate it with the example of stock and flow diagrams. These diagrams are widely used in epidemiology to model the dynamics of populations. Although tools already exist for building these diagrams and simulating the systems they describe, we have created a new software package called StockFlow which uses decorated cospans to overcome some limitations of existing software. Our approach cleanly separates the syntax of stock and flow diagrams from the semantics they can be assigned. We have implemented a semantics where stock and flow diagrams are mapped to ordinary differential equations, although others are possible. We illustrate this with code in StockFlow that implements a simplified version of a COVID-19 model used in Canada. This is joint work with Xiaoyan Li, Sophie Libkind, Nathaniel Osgood and Evan Patterson.</p>\n</blockquote>",
        "id": 286130322,
        "sender_full_name": "John Baez",
        "timestamp": 1655239582
    },
    {
        "content": "<p>Click the talk title to register to watch it on Zoom.  It should also be live-streamed and recorded on YouTube.</p>",
        "id": 286162807,
        "sender_full_name": "John Baez",
        "timestamp": 1655266879
    }
]