[
    {
        "content": "<p>I don't think it was separately announced on the Zulip, but you may be aware that these conferences are happening in Tallinn this year; see the announcement <a href=\"#narrow/stream/410322-community.3A-mailing-list-mirror/topic/ICALP-LICS-FSCD.20joint.20call.20for.20workshops/near/401025313\">here</a>.</p>\n<p>Having co-authored two submitted papers, I have just started looking into registration for the conference, and was shocked to see that attendance to either of the smaller conferences will cost an eye-watering 640 euros (and go up to 770 if one waits until May); ICALP attendance costs 800 (resp. 960) and there is a reduced combined fee of 1000 (resp. 1200) if one wishes to attend all three - but even that doesn't include the workshops or the conference dinner!<br>\nSince the majority of the organisers are here, I might as well ask: <span class=\"user-mention\" data-user-id=\"319936\">@Niccolò Veltri</span> <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span> <span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> <span class=\"user-mention\" data-user-id=\"277812\">@Matt Earnshaw</span> <span class=\"user-mention\" data-user-id=\"636946\">@Diana Kessler</span> why is this so expensive?</p>\n<p>The closest comparison available is that last year's ICALP cost 640 (resp. 740), so that's an increase of 25% (resp. 30%) on last year, and the previous year it was only 540 (resp. 640) so an increase of 48% (resp. 50%) over two years ago!</p>\n<p>Moreover, this is organised on a university campus by people working at that campus, yet attendance at ICALP costs more than attendance at (to pick an example that is essentially random but that I know about for family reasons) the <a href=\"https://www.egu24.eu/attend/register.html\">European Geosciences Union General Assembly</a>, which is hosted at an external conference center in Vienna. Last year that had <a href=\"https://www.egu23.eu/\">over 18000 attendees</a>, to give you an idea of the size, which is far more than attended ICALP, according to <a href=\"https://icalp2023.cs.upb.de/gallery/\">the gallery</a> rather than official figures... So what's the story?</p>",
        "id": 432889528,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712923539
    },
    {
        "content": "<p>While I'm on board with the sentiment here, and believe more generally that the conference system in computer science is terminally ill and ought to be euthanized , I can point to one extenuating cicrumstance.</p>\n<p>I also currently work at Taltech, and our university is not a suitable conference venue. I think the organizers have had to rent rooms elsewhere in the city. If I recall some of them are at \"Tallinn University\", but it is important to note that this is a different university!</p>",
        "id": 432913321,
        "sender_full_name": "Chad Nester",
        "timestamp": 1712931239
    },
    {
        "content": "<p>Let me also point out that this happens every few months and nothing ever comes of it. We should really do some community organizing if we want anything to come of this...</p>",
        "id": 432913837,
        "sender_full_name": "Chad Nester",
        "timestamp": 1712931390
    },
    {
        "content": "<p>Is \"this\" the arrival of a new conference with bloated registration fees?</p>",
        "id": 432915402,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712931908
    },
    {
        "content": "<p>Whatever the circumstances, some transparency about the price would be appreciated..!</p>",
        "id": 432915655,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712931986
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-community.3A-events/topic/ICALP.20LiCS.20FSCD/near/432915402\">said</a>:</p>\n<blockquote>\n<p>Is \"this\" the arrival of a new conference with bloated registration fees?</p>\n</blockquote>\n<p>I think complaints about the costs of conferences in theoretical computer science generally.</p>",
        "id": 432917502,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1712932495
    },
    {
        "content": "<p>A colleague sent me a record of such a discussion <a href=\"http://lists.seas.upenn.edu/pipermail/types-list/2023/002504.html\">on the TYPES mailing list</a> regarding POPL'24 in January. The organisers are able to find a bunch of excuses for why the costs are higher relative to previous years, but there is no transparency about the breakdown of costs.</p>",
        "id": 432931707,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712936669
    },
    {
        "content": "<p>Hi there is a breakdown and more discussion for POPL 2024 here: <a href=\"https://youtu.be/up7OJgLL5uo?t=283\">https://youtu.be/up7OJgLL5uo?t=283</a> . (I’m not involved in organizing that.)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"up7OJgLL5uo\" href=\"https://youtu.be/up7OJgLL5uo?t=283\"><img src=\"https://uploads.zulipusercontent.net/2495c0d32ce31a0a9c843e85d9adaa52c66ae2ac/68747470733a2f2f692e7974696d672e636f6d2f76692f7570374f4a674c4c35756f2f64656661756c742e6a7067\"></a></div>",
        "id": 432949169,
        "sender_full_name": "Sam Staton",
        "timestamp": 1712942811
    },
    {
        "content": "<p>Also if anyone fancies hosting any of these conferences, please do contact the steering committee chair of the conference, especially if you have a way of doing it cheaply (or even if not). My impression is that SC chairs are always very pleased to hear of willing hosts, and it often seems a bit of a struggle to find a host.</p>",
        "id": 432960901,
        "sender_full_name": "Sam Staton",
        "timestamp": 1712946631
    },
    {
        "content": "<p>So ACM take 17% on every conference and haven't gone to the effort of getting recognized as a charity in the UK and Europe, that's already annoying.<br>\nDo the provided figures apply only to the 3-day main conference, or the full 7 days including satellite events? If it's the former, the prices are still pretty hard to stomach.</p>",
        "id": 433028090,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712997194
    },
    {
        "content": "<p>Even if on average each of the 779 in-person attendees was present for five days, that's over 72£/person/day on food and drinks after tax for one meal and coffee breaks. That's not a cost I find acceptable.</p>",
        "id": 433028448,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712997564
    },
    {
        "content": "<p>It is mentioned that they thought about giving back 50£/person and decided to spend it on nicer catering instead, so I guess that explains it <span aria-label=\"eyes\" class=\"emoji emoji-1f440\" role=\"img\" title=\"eyes\">:eyes:</span> <br>\nI have no idea what IET AV is.</p>",
        "id": 433028610,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1712997798
    },
    {
        "content": "<p>Ah apparently IET AV is a contractor that does video recording at live events. According to the programme there were seven rooms where talks took place, so that's just over 600GBP/room/day. The talks were <a href=\"https://www.youtube.com/playlist?list=PLyrlk8Xaylp6IHv6D4SyE6ZO3xGp_lvBk\">live streamed</a> so this comprimes a person switching between screen templates at appropriate times (although that job might have been done by a volunteer), renting the equipment and having technical support on hand.<br>\nThat's a relatively small contribution to the cost at a little over 5GBP/attendee (including remote attendance), but it's pretty hard to judge if even that is good value.</p>",
        "id": 433229490,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713169247
    },
    {
        "content": "<p>Anyway, back to the topic at hand, are there any comments from the organisers of ICALP etc?</p>",
        "id": 433229691,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713169321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-community.3A-events/topic/ICALP.20LiCS.20FSCD/near/433229691\">said</a>:</p>\n<blockquote>\n<p>Anyway, back to the topic at hand, are there any comments from the organisers of ICALP etc?</p>\n</blockquote>\n<p>Hi Morgan -- there's no big mystery, we did our sums and that's what it costs to organise such a big, complex event in Tallinn.  Since covid and the war in Ukraine there has been a lot of inflation in this part of the world.</p>\n<p>For ICALP specifically the price rise over last year is due to the fact that this year ICALP is a five day event instead of the usual four.</p>",
        "id": 433736467,
        "sender_full_name": "Pawel Sobocinski",
        "timestamp": 1713354663
    },
    {
        "content": "<p>It's certainly hard to dispute that when we can't see your sums...<br>\nICALP was a five-day event <a href=\"https://icalp2023.cs.upb.de/programme/\">last year</a> <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 433755843,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713360233
    },
    {
        "content": "<p>Counting workshops. If we count ICALP workshops, it's a 7 day event this year. The conference itself is five days, it was four days last year.</p>\n<p>I don't really understand your tone. Are you trying to suggest we are scamming people?</p>",
        "id": 433757001,
        "sender_full_name": "Pawel Sobocinski",
        "timestamp": 1713360537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281251\">Pawel Sobocinski</span> <a href=\"#narrow/stream/229141-community.3A-events/topic/ICALP.20LiCS.20FSCD/near/433757001\">said</a>:</p>\n<blockquote>\n<p>Counting workshops. If we count ICALP workshops, it's a 7 day event this year. The conference itself is five days, it was four days last year.</p>\n</blockquote>\n<p>Ah I see, that does resolve my confusion and explain the cost increase. </p>\n<blockquote>\n<p>I don't really understand your tone. Are you trying to suggest we are scamming people?</p>\n</blockquote>\n<p>I was trying to understand why the conference registration costs so much and got a bit carried away. I'm not accusing you of anything so drastic.</p>",
        "id": 433759390,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713361181
    },
    {
        "content": "<p>The rising cost of big conferences seems to be a major systemic problem in computer science and should be talked about. But accusing our friends is not the way...</p>",
        "id": 433778647,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1713363562
    },
    {
        "content": "<p>For contrast, the most recent POPL (which I think has comparable size and importance to LiCS) cost about US$ 2k for a full ticket</p>",
        "id": 433779098,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1713363610
    },
    {
        "content": "<p>I think it's understandable for me to react with scepticism or frustration when the answer to \"Why does the conference cost so much?\" is \"That's what it costs.\"</p>",
        "id": 433822841,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1713369473
    }
]