[
    {
        "content": "<p>Hi everyone, </p>\n<p><span class=\"user-mention\" data-user-id=\"696063\">@Mohamed Barakat</span>, <span class=\"user-mention\" data-user-id=\"302073\">@Kris Brown</span>, and I  invite your submission to the session <a href=\"https://homalg-project.github.io/cct-icms-2026/\">Computational Category Theory</a> [1] at the <a href=\"https://icms-conference.org/2026/index.html\">International Congress on Mathematical Software</a> [2] this 20-23 July, 2026, at the University of Waterloo in Waterloo, Ontario, Canada. The session abstract is appended below.</p>\n<p>At this time we are requesting short abstracts for a 20-minute presentation. After acceptance, there will be an opportunity to submit an extended abstract for publication in the conference proceedings. There is no requirement to submit an extended abstract in order to speak.</p>\n<p>The deadline for short abstracts is March 1, 2026. </p>\n<p>Submissions will be accepted at <a href=\"mailto:cct_icms2026@topos.institute\">cct_icms2026@topos.institute</a>. You can send any further inquiries to the same address.</p>\n<p>If you have students, colleagues, or other contacts who you feel would be a good fit for the session, please feel free to forward this call to them. We look forward to seeing you in Waterloo!</p>\n<p>[1] <a href=\"https://homalg-project.github.io/cct-icms-2026/\">https://homalg-project.github.io/cct-icms-2026/</a></p>\n<p>[2] <a href=\"https://icms-conference.org/2026/index.html\">https://icms-conference.org/2026/index.html</a></p>",
        "id": 572911866,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1770681674
    },
    {
        "content": "<p><strong>Session abstract:</strong></p>\n<p>This workshop brings together researchers in computational category theory who contribute theoretically to the design of algorithms and practically to the development of advanced software systems. Unlike traditional category theory meetings (theoretical and applied), this workshop will primarily focus on algorithms and existing software ecosystems like (CatLab.jl, CAP project, CatColab, CQL, Lambeq, 1Lab, …). The scope will range from computational methods in classical mathematical disciplines, such as algebraic geometry and representation theory, to applications in functional programming and type theory, all the way to established topics in applied category theory, including categorical and higher categorical rewriting, databases, quantum computing, string-diagrammatic programming, topological data analysis, numerical optimization, and agent-based modeling. The program will mix brief research talks, software demonstrations, and a plenary overview. The goal is to share recent work, clarify connections between theory and tools, and encourage practical collaborations and follow-up projects.</p>",
        "id": 572911878,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1770681681
    }
]