[
    {
        "content": "<p>(Apologies if this topic has been treated elsewhere.)<br>\nThere are several highly publicized privacy and security concerns with Zoom; here's a recap: <a href=\"https://www.schneier.com/blog/archives/2020/04/security_and_pr_1.html\" title=\"https://www.schneier.com/blog/archives/2020/04/security_and_pr_1.html\">https://www.schneier.com/blog/archives/2020/04/security_and_pr_1.html</a><br>\nI've heard that for these reasons Zoom has been prohibited for members of Inria (French compsci institute).<br>\nAre there any plans to migrate the various seminars mentioned here to another platform, preferably using free software? In my experience BigBlueButton works very well for a seminar with a dozen participants, but I don't know if it scales up well.</p>",
        "id": 193381931,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1586382000
    },
    {
        "content": "<p>as a suggestion (from somebody reasonably anti-zoom), there is jitsi, which is an open-source alternative (so no nasty privacy things going on) which also seems quite popular</p>",
        "id": 193383536,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1586383024
    },
    {
        "content": "<p>Since UCR gives me for free a Zoom that lets me host meetings of 300 people, and I don't want to learn how to use any other software, I'll stick with Zoom for now.  But yes, someone should create open-source freeware that's just as good.  Let it be so!</p>",
        "id": 193385435,
        "sender_full_name": "John Baez",
        "timestamp": 1586384289
    },
    {
        "content": "<p>(Just to clarify: when I say I don't know whether BBB supports hundreds of people, I'm just saying that one cannot know without testing, but I don't have any specific reason to suspect that there would be problems)</p>",
        "id": 193385788,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1586384552
    },
    {
        "content": "<p>Jitsi is wonderful indeed. Also, if someone wants to try it, just press the little camera button below the textbox where you compose your messages and zulip will set up a jitsi call for you <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 193386550,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1586385095
    },
    {
        "content": "<p>Are Inria staff technically not allowed to participate in Zoom seminars hosted somewhere else? That would be an issue for sure</p>",
        "id": 193424827,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586423658
    },
    {
        "content": "<p>(Similarly, Max Planck Institute staff are not allowed to use Dropbox, as for all public servants of Germany, but I continue to use it anyway)</p>",
        "id": 193424871,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586423692
    }
]