[
    {
        "content": "<p>Hello,</p>\n<p>We are organizing a special session on “AMS Special Session on Applied Category Theory” at the upcoming Joint Mathematics Meetings in Washington, D.C. (<a href=\"https://jointmathematicsmeetings.org/jmm\">https://jointmathematicsmeetings.org/jmm</a>). </p>\n<p>The meeting occurs Sunday through Wednesday, January 4-7, 2026. Our session will meet on Wednesday, January 7, 2026 from 9:00 AM to 5:00 PM ET. </p>\n<p>We would like to kindly invite you to submit an abstract for an opportunity to speak at this session. The deadline for abstract submission is 11:59 PM Eastern time on Tuesday, September 9, 2025. This is a hard deadline that cannot be extended. Talks without an abstract cannot be scheduled.</p>\n<p>This session explores how applications of category theory can make a difference in practice—helping researchers model structures in ways that transcend disciplinary silos. We welcome applied results, emerging tools, and speculative directions in the areas of mathematics, computer science, artificial intelligence, engineering, and social sciences. It is a space for both experts and newcomers to share questions, and insights that push Applied Category Theory forward and we think your work would contribute greatly to the discussion.</p>\n<p>Abstracts must be submitted electronically through the AMS portal at <a href=\"https://meetings.ams.org/math/jmm2026/cfp.cgi\">https://meetings.ams.org/math/jmm2026/cfp.cgi</a>. Click “BEGIN A SUBMISSION” under “AMS (AMERICAN MATHEMATICAL SOCIETY),” create or log in to an account, and select “SS20A AMS Special Session on Applied Category Theory, I.” We strongly encourage you to submit your abstract at least a week before that deadline to avoid any last-minute problems. </p>\n<p>When the \"Conclude Submission\" button is clicked, an email will be sent to the Presenting Author's email and the Submitter's email confirming receipt of the submission. Please note your abstract is not submitted until you click the \"Conclude Submission\" button.</p>\n<p>If you have specific questions about your talk or topic, please reach out to the organizers directly with questions.</p>\n<p>Best wishes,</p>\n<p>AMS JMM 2026 Organizers</p>\n<p>Angeline Aguinaldo<br>\nNelson Niu<br>\nPriyaa Varshinee Srinivasan</p>",
        "id": 533840269,
        "sender_full_name": "Nelson Niu",
        "timestamp": 1754934395
    }
]