[
    {
        "content": "<p>I've just been advertising the deadlines for the LICS 2023 conference (Logic In Computer Science) and I thought to mention them here too. <br>\nThe abstracts/papers are due 18/23 Jan 2023. There's also a call for workshop proposals, deadline 30 November. </p>\n<p>There are several people from this Zulip on the LICS programme committee, and it seems a good venue for applied category theory, although LICS is more general than that. </p>\n<p><a href=\"https://lics.siglog.org/lics23/\">https://lics.siglog.org/lics23/</a></p>\n<p>(Is there a separate stream for conference adverts etc? Sorry if so.)</p>",
        "id": 308364437,
        "sender_full_name": "Sam Staton",
        "timestamp": 1667818342
    },
    {
        "content": "<p>(moved to <a class=\"stream\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-general.3A-events\">#general: events</a>)</p>",
        "id": 308372350,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667821562
    },
    {
        "content": "<p>It's not very important but I think the topics in LICS are both more <em>and less</em> general than applied category theory: i.e., they overlap but neither is a subset of the other.</p>",
        "id": 308397777,
        "sender_full_name": "John Baez",
        "timestamp": 1667830940
    },
    {
        "content": "<p>Sorry yes, you're quite right. Although having said that, there actually aren't many talks at ACT 2022 that seem totally off topic for LICS. I think if anyone wants to submit a paper, and is using techniques that are relevant to LICS (e.g. category theory), then that might be ok topic-wise. It's up to the programme committee I guess.</p>",
        "id": 308467096,
        "sender_full_name": "Sam Staton",
        "timestamp": 1667852586
    },
    {
        "content": "<p>Right, the impression I have is that a significant minority of the LiCS PC inherently dislike category theory, or possibly think that only Theory A methods are in-scope, so for us it seems to be even more of a lottery than you'd reasonably expect for such an important conference</p>",
        "id": 308784818,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668000019
    },
    {
        "content": "<p>I submitted to LICS a few years ago and my experience was extremely discouraging. I got a +3 review, but also a -2 review, the substance of which was:</p>\n<blockquote>\n<p>The paper is very well written, the results are clearly outlined, and these appear to be interesting results for category theorists. This said, I do not quite see what the connection to computer science is or could possibly be, and I wish the authors had made some attempt in the introduction to connect this work to some part of CS; there is a short paragraph in which the authors speculate about a possible connection to relational databases, but the link appears tenuous at best; the conclusion does not help much either as it states various possible future avenues of research in category theory. I find it difficult to recommend acceptance under the circumstances.</p>\n</blockquote>\n<p>I don't think I'll be submitting any more theoretical work to LICS. Prestigious or not, it feels like a waste of time.</p>",
        "id": 308788951,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668001326
    },
    {
        "content": "<p>... I do think my work is computer science. I work in a computer science department.</p>",
        "id": 308789386,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668001491
    },
    {
        "content": "<p>(Posting this in support of the idea that it's a lottery)</p>",
        "id": 308791396,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668002042
    },
    {
        "content": "<p>I'm sorry you experienced this. I think it's bad for everybody if newcomers get discouraged like that. I'm actually on the steering committee, and I agree this can sometimes be a problem, and we're looking into some new initiatives for avoiding this right now. Happy to also hear any suggestions. There are several ACT people on the PC this year, so maybe things would be better this year from that perspective.  </p>\n<p>For anyone, I'm happy to have a look at a draft in advance if you are worried about getting these kinds of reviews from a non-expert, in case that might help (not that I'm claiming to be magic in any way!).</p>",
        "id": 308824809,
        "sender_full_name": "Sam Staton",
        "timestamp": 1668011717
    },
    {
        "content": "<p>I appreciate you taking the time to respond. It's good that the steering committee is thinking about the problem!</p>",
        "id": 308974393,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668082046
    },
    {
        "content": "<p>I tentatively suggest making all reviews (for rejected and accepted papers) public information. They could still be anonymous, but I think there's at least some chance that knowing your review will be publicly available would make it uncomfortable to write lazy or uncharitable reviews, which would reflect poorly on the venue.</p>",
        "id": 308974928,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668082238
    },
    {
        "content": "<p>I suggest this in particular because I imagine that it would be a relatively simple change to make. You definitely know better than I do.</p>",
        "id": 308975142,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668082332
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/308784818\">said</a>:</p>\n<blockquote>\n<p>Right, the impression I have is that a significant minority of the LiCS PC inherently dislike category theory, or possibly think that only Theory A methods are in-scope, so for us it seems to be even more of a lottery than you'd reasonably expect for such an important conference</p>\n</blockquote>\n<p>Let me nitpick on words: there is basically no Theory A in LICS.  That's the stuff of STOC, FOCS, SODA...  The difference is that at a Theory B conference, you will find some people who dislike category theory; at an actual Theory A conference, you won't, because people there hardly ever heard the word \"category\" in their life <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>\n<p>About the feeling that it is a lottery: yes, the whole TCS conference system is.  It's <em>very</em> bad, and in my opinion it should be substantially reformed.  I don't want to start a discussion now, I just want to stress that it's by no means a specific problem of LICS, or of category theorists submitting to TCS conferences.</p>\n<p>So, for categorically-minded computer scientists, you shouldn't feel discouraged to submit to LICS any more than to any other TCS/Theory B conference.  In fact, depending on the PC, it is quite the contrary.  For example, my impression this year is that the lottery is not negatively biased towards category theory (not to say positively...).</p>",
        "id": 308985703,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668086095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/308974928\">said</a>:</p>\n<blockquote>\n<p>I tentatively suggest making all reviews (for rejected and accepted papers) public information. They could still be anonymous, but I think there's at least some chance that knowing your review will be publicly available would make it uncomfortable to write lazy or uncharitable reviews, which would reflect poorly on the venue.</p>\n</blockquote>\n<p>Personally, I would be 100% in favor of this.  Unfortunately, I'm not sure it will be easily accepted by a majority of people.  (In any case, I'm not on the LICS SC, so I have no saying specifically).</p>\n<p>As I said above, I think that the TCS conference system needs a substantial reform.  I am hopeful that it will happen at some point, maybe very gradually, although for the moment (and, in fact, for the past 15/20 years, at least) we're still at the stage where nearly everyone agrees that change is needed, but almost nothing changes, probably because agreeing on <em>what</em> and <em>how</em> to change is more difficult...</p>",
        "id": 308987772,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668086777
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/308974928\">said</a>:</p>\n<blockquote>\n<p>I tentatively suggest making all reviews (for rejected and accepted papers) public information. They could still be anonymous, but I think there's at least some chance that knowing your review will be publicly available would make it uncomfortable to write lazy or uncharitable reviews, which would reflect poorly on the venue.</p>\n</blockquote>\n<p>Any proposal that works against the established academics/academic establishment will be summarily vetoed, more so if it benefits the whole <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span>.</p>",
        "id": 309015011,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1668094630
    },
    {
        "content": "<p>Thanks for the discussions and the suggestion about open reviews. Do you mean like ICLR, with public accept and reject reviews? <a href=\"https://openreview.net/group?id=ICLR.cc/2021/Conference\">https://openreview.net/group?id=ICLR.cc/2021/Conference</a><br>\nIf so I'll bring the idea up when we next discuss it. <br>\nI'd also like to read more about the theory of it or the success data of it, if anyone has any references. </p>\n<p>(I will admit, I had recently been really nervous about submitting to a workshop that proposed to make reviews public, anonymously. What if someone says something grumpy about my work, or misses the point, or judges me against the wrong criteria, or damns me with faint praise. Then it would follow me round, other people might jump to conclusions, even if the paper was accepted. I can see some of that happening in the ICLR reviews. However I take your point that maybe chairs would have some incentive to say \"don't say that please, it's embarrassing for the conference\".)</p>",
        "id": 309079866,
        "sender_full_name": "Sam Staton",
        "timestamp": 1668114463
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276839\">Damiano Mazza</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/308985703\">said</a>:</p>\n<blockquote>\n<p>Let me nitpick on words: there is basically no Theory A in LICS.  </p>\n</blockquote>\n<p>Interesting, my impression is that a stereotypical LiCS paper looks like \"we characterise the exact complexity of this decision problem involving this obscure class of automata\"</p>",
        "id": 309169773,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668164581
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/309169773\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276839\">Damiano Mazza</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/308985703\">said</a>:</p>\n<blockquote>\n<p>Let me nitpick on words: there is basically no Theory A in LICS.  </p>\n</blockquote>\n<p>Interesting, my impression is that a stereotypical LiCS paper looks like \"we characterise the exact complexity of this decision problem involving this obscure class of automata\"</p>\n</blockquote>\n<p>Yes, that would be one \"half\" of LICS papers.   But the point is that automata are Theory B, not Theory A.  Theory A would be \"we improve by 0.00357 the constant of this randomized algorithm for deciding some problem on graphs\" or \"this quantum complexity class with this oracle contains this other circuit complexity class\" or \"a new variant of some algorithm for some version of public key cryptography\", etc.  Check out the list of <a href=\"http://acm-stoc.org/stoc2022/accepted-papers.html\">accepted papers at the last STOC</a> for a better idea.  You will not find a single occurrence of the word \"automata\" in the titles of the papers.</p>",
        "id": 309172875,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668165867
    },
    {
        "content": "<blockquote>\n<p>About the feeling that it is a lottery: yes, the whole TCS conference system is. It's very bad, and in my opinion it should be substantially reformed. I don't want to start a discussion now, I just want to stress that it's by no means a specific problem of LICS, or of category theorists submitting to TCS conferences.</p>\n</blockquote>\n<p>This is true! I think it's fair to pick on LICS in particular because of its influence, but the conference system is <em>absurd</em>.</p>",
        "id": 309190378,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668172440
    },
    {
        "content": "<blockquote>\n<p>Any proposal that works against the established academics/academic establishment will be summarily vetoed, more so if it benefits the whole <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span>.</p>\n</blockquote>\n<p>I don't think it would be that hard to improve things.</p>",
        "id": 309190861,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668172627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308397\">Sam Staton</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/309079866\">said</a>:</p>\n<blockquote>\n<p>Thanks for the discussions and the suggestion about open reviews. Do you mean like ICLR, with public accept and reject reviews? <a href=\"https://openreview.net/group?id=ICLR.cc/2021/Conference\">https://openreview.net/group?id=ICLR.cc/2021/Conference</a><br>\nIf so I'll bring the idea up when we next discuss it. <br>\nI'd also like to read more about the theory of it or the success data of it, if anyone has any references. </p>\n<p>(I will admit, I had recently been really nervous about submitting to a workshop that proposed to make reviews public, anonymously. What if someone says something grumpy about my work, or misses the point, or judges me against the wrong criteria, or damns me with faint praise. Then it would follow me round, other people might jump to conclusions, even if the paper was accepted. I can see some of that happening in the ICLR reviews. However I take your point that maybe chairs would have some incentive to say \"don't say that please, it's embarrassing for the conference\".)</p>\n</blockquote>\n<p>I'm not sure exactly how OpenReview works, but something like this, yes.</p>\n<p>I think it makes sense to publish the list of submitted papers together with their reviews and any responses, separately from the main list of papers accepted for presentation.</p>\n<p>If one of your reviewers misses the point, you can explain this in your response. I imagine having all this be public would give reviewers an incentive to <em>consider your response</em>, which there isn't really now. It's just more work.</p>\n<p>I think this is actually more useful to have for accepted papers. Good reviews are useful to everyone.</p>",
        "id": 309192662,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668173342
    },
    {
        "content": "<p>This could also be a pathway to getting some sort of credit (in the way that we get credit for publishing papers) for writing good reviews. Reviewing papers well is a ton of work, and more or less a thankless task. If taking the time to review a paper well \"counts\" as formal academic output somehow, I would guess that the overall quality of reviews would improve.</p>",
        "id": 309193311,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668173533
    },
    {
        "content": "<p>... I have no idea where we would find data on any of this.</p>",
        "id": 309193400,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668173566
    },
    {
        "content": "<p>A final thought is that if all submissions are published, it might disincentivize submitting poor quality work in bad faith, and hoping that it slips through the review process. Maybe this one is just wishful thinking though.</p>",
        "id": 309194040,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668173813
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308397\">Sam Staton</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/309079866\">said</a>:</p>\n<blockquote>\n<p>What if someone says something grumpy about my work, or misses the point, or judges me against the wrong criteria, or damns me with faint praise. Then it would follow me round, other people might jump to conclusions, even if the paper was accepted. I can see some of that happening in the ICLR reviews.</p>\n</blockquote>\n<p><a href=\"https://openreview.net/forum?id=ry_WPG-A-\">Here is a famous example</a></p>",
        "id": 309195869,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1668174484
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/309195869\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://openreview.net/forum?id=ry_WPG-A-\">Here is a famous example</a></p>\n</blockquote>\n<p>This reflects extremely poorly on the reviewer, no?</p>",
        "id": 309557834,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668417830
    },
    {
        "content": "<p>... the review always talks about the \"paper\" (with quotation marks).</p>",
        "id": 309558343,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668418026
    },
    {
        "content": "<p>Surely it's better to have this sort of thing out in the open. It's much easier to be an asshole when you're anonymous (see: the internet).</p>",
        "id": 309558712,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668418193
    },
    {
        "content": "<p>I agree 100% about open reviews. By the way: Even if a conference doesn't offer open reviews, you can still sign your reviews. Personally I always do. It's not much I agree, but at least it's a personal statement. If enough people start doing this probably it will be easier to change the overall system.</p>",
        "id": 310190431,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1668515474
    },
    {
        "content": "<p>While I agree that there are broken things about the current reviewing system, particularly in CS, I don't support having reviewers' names attached to their reviews.  I see the point that that would help disincentivize lazy or unfair reviewing, but it would also make it much more difficult for a reviewer to give honest and constructive criticism, particularly when the reviewer and author happen to be friends or collaborators on other projects, or when the reviewer is relatively junior to the author, and I think that is at least as important.</p>",
        "id": 310244092,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1668531242
    },
    {
        "content": "<p>Can we also talk about the fact that the LICS proceedings are not open access? The papers are just paywalled by the ACM. It's not like there are no viable alternatives in 2022. I find it baffling that people just care about the ACM stamp in their CV and do not care about their papers being actually read by peers.</p>",
        "id": 310365995,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1668590358
    },
    {
        "content": "<p>It is also not the case that ACM conferences can't be OA, by the way. POPL is OA, for example. Although there is an OA fee associated that needs to be paid by the authors...</p>",
        "id": 310366951,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1668590682
    },
    {
        "content": "<p>or that is currently covered by the ACM if the authors do not pay these fees (at least that's the case for POPL and ICFP). Not ideal, but at least all the papers of these proceedings are effectively open access in the end.</p>",
        "id": 310373705,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1668593153
    },
    {
        "content": "<p>Huh? <span class=\"user-mention\" data-user-id=\"276885\">@Kenji Maillard</span> are you saying that there's an optional OA fee for POPL? And what does \"effectively open access\" mean?</p>",
        "id": 310374339,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1668593378
    },
    {
        "content": "<p>Optional is probably not the right term. I think the relevant explanations are given <a href=\"https://www.acm.org/publications/openaccess#apcwaivers\">here</a> together with the paragraph on gold open access at ACM a bit above on the same page.</p>",
        "id": 310375597,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1668593834
    },
    {
        "content": "<p>By \"effectively open access\",  I mean that, if I am not mistaken, the published version of all papers  at POPL for the past few years are available to anyone on the ACM library, without any institutional barrier as it can be the case for other gold open access journals that only provide access to the articles whose APC have been paid by the authors.</p>",
        "id": 310376080,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1668594015
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276320\">Antonin Delpeuch</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310365995\">said</a>:</p>\n<blockquote>\n<p>Can we also talk about the fact that the LICS proceedings are not open access? The papers are just paywalled by the ACM. It's not like there are no viable alternatives in 2022. I find it baffling that people just care about the ACM stamp in their CV and do not care about their papers being actually read by peers.</p>\n</blockquote>\n<p>I always forget this! That means I can't submit or review for LiCS as a signatory of stuff, definitely broke that last year by accident</p>",
        "id": 310408315,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668605740
    },
    {
        "content": "<p>\"Gold OA\" (aka author-pays) is not in fact open access (similar to how red herrings are not herrings)</p>",
        "id": 310408648,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668605836
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310190431\">said</a>:</p>\n<blockquote>\n<p>I agree 100% about open reviews. By the way: Even if a conference doesn't offer open reviews, you can still sign your reviews. </p>\n</blockquote>\n<p>I think that the questions of whether reviews should be public or anonymous are orthogonal.   Personally, I would still keep most of my publicly accessible reviews anonymous (but of course do not object to people who want to sign theirs).</p>\n<p>So, in a similar vein, but not on an orthogonal question, one might suggest to post on our websites all/some reviews that we receive of all/some papers we submit.  If this really became a massively followed practice, I'm not entirely sure what the reaction would be.  If I am not mistaken, reviews are supposed to be confidential to the program committees/editorial boards to whom they are submitted, as well as the authors of the papers they are about, of course (is this true?).  But there is no actual way of enforcing this, in the sense that there is no \"penalty\" for breaking this confidentiality (is there?).  I don't think so, at least.  So if most people started doing it, maybe it would force the system to steer in the direction of open reviews by default.</p>\n<p>I still think though that this should be done in the context of a systemic reform and in a coordinated way, I wouldn't like this business of everyone just randomly and individually publishing the reviews they receive to become a standard, \"unguided\" practice.</p>",
        "id": 310408794,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668605881
    },
    {
        "content": "<p>I have been considering doing this.</p>",
        "id": 310409227,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668605993
    },
    {
        "content": "<p>I never thought of this, it's quite a good idea. Of course if I did this it would only be fair to also post reviews written by me...</p>",
        "id": 310409473,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668606089
    },
    {
        "content": "<p>I adopted a reviewer declaration for my last set of reviews and felt good about it, even in the case of one fairly critical review.</p>\n<p>In terms of open reviews, my preference would be to allow the authors to either have all reviews private or all reviews public, with the choice made after they see the responses.</p>",
        "id": 310414195,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1668606743
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276320\">Antonin Delpeuch</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310365995\">said</a>:</p>\n<blockquote>\n<p>Can we also talk about the fact that the LICS proceedings are not open access? The papers are just paywalled by the ACM. It's not like there are no viable alternatives in 2022. I find it baffling that people just care about the ACM stamp in their CV and do not care about their papers being actually read by peers.</p>\n</blockquote>\n<p>A few years ago I decided to stop submitting papers to LICS precisely because of this reason (my last publication there was in 2016).  But it's hard to judge people on this.  Personally, I am at a point of my career where I may allow myself not to ever publish at LICS (and it's not like I have a ton of papers there anyway!).  But for younger people, it's not so clear (which is why, for example, if I ever have a PhD student or other early-career coauthor who wants to submit a paper to LICS co-signed with me, I will not object).</p>\n<p>On the other hand, I am <em>not</em> at a point of my career where I can just refuse to be part of the PC of a \"prestigious\" conference like LICS (so this year you'll find me on it <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span>).</p>\n<p>About acting as external reviewer, I still haven't made up my mind!  My current approach is: if I think I'm one of very few people who can do a good job at fairly reviewing that paper, then I agree to take it.  Otherwise, I cite my \"LICS ban\" as an excuse to decline <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n<p>(Also, a minor quibble: it's not about the \"ACM stamp\": LICS publishes with ACM on odd years and with IEEE on even years, or the other way around, whatever (or at least they used to do that), and the number of submissions is uniform regardless of the publisher.  It's about the \"LICS stamp\", really).</p>",
        "id": 310415733,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668606914
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310409473\">said</a>:</p>\n<blockquote>\n<p>I never thought of this, it's quite a good idea. Of course if I did this it would only be fair to also post reviews written by me...</p>\n</blockquote>\n<p>Well, it would be fair for <em>other people</em> to post reviews written by you.  Again, I wouldn't mix the (breaking of) confidentiality and the (breaking of) anonymity of reviews, they don't necessarily go together.</p>",
        "id": 310419007,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1668607874
    },
    {
        "content": "<p>Hi, another point about open access. I'm actually the LICS proceedings chair (which is why I am on the SC). I personally would love for LICS to move to proper, platinum OA, e.g. an arxiv overlay. I tried some things, e.g. I often made the programme include links to arxiv preprints, but I know that's not the same. </p>\n<p>Anyway, just to be clear, in my understanding, many publications must now be open access now under Plan S. I'm not a lawyer but my understanding is that this means that many people can just assert (say) CCBY for their LICS papers. This may depend on your country, funding, arxiv versions etc. -- you'd better check for yourselves. <a href=\"https://www.coalition-s.org/blog/4-things-you-should-know-about-the-rrs-and-the-jct/\">https://www.coalition-s.org/blog/4-things-you-should-know-about-the-rrs-and-the-jct/</a> Maybe this means you're ok?</p>",
        "id": 310427795,
        "sender_full_name": "Sam Staton",
        "timestamp": 1668610391
    },
    {
        "content": "<p>Also, if you do complain about OA, please do be very clear what you think about \"Gold OA\", which as Jules said, may be regarded as a red herring (but which some people like). There's a tendency for publishers to say \"OK you all want OA, let's charge 1.5k per paper, then it's gold OA, great, sorted\". Currently that's done at several ACM conferences and you can pay at LICS too on ACM years. At POPL iirc there's a subsidy for all papers, and authors are asked to contribute $400 but that's still subsidized compared to (iirc) $900. The subsidy seems to indirectly come from other sources e.g. registration fees. I hear that there is a drive to ask universities to pay annual fees to publishers instead, which might be much more than the library access fees that they were already paying. There is a whole long debate about how much it should all really cost, who should pay, etc, which is probably another thread!</p>",
        "id": 310428328,
        "sender_full_name": "Sam Staton",
        "timestamp": 1668610548
    },
    {
        "content": "<p>I made a topic <a href=\"#narrow/stream/241990-general.3A-values/topic/open.20access/near/310436878\">here</a> to discuss the broader questions around open access and publication.</p>",
        "id": 310437046,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1668612858
    },
    {
        "content": "<p>I just posted this to some mailing lists, so in case anyone here wants to come to LICS 2023, here are some details.<br>\n<a href=\"https://lics.siglog.org/lics23/\">https://lics.siglog.org/lics23/</a><br>\nConference 26 June – 29 June 2023 preceded by workshops 24-25 June 2023<br>\nEarly registration ends 12 May 2023<br>\nStudent travel grants deadline 8 May 2023<br>\nDo book accommodation sooner rather than later. Boston can be expensive and there is another big event on 25 June.</p>",
        "id": 356242561,
        "sender_full_name": "Sam Staton",
        "timestamp": 1683362802
    },
    {
        "content": "<p>Moving to 2024, the LICS 2024 call for papers is now out. LICS 2024 (and ICALP, FSCD too) will be in Tallinn. Submission deadlines in January 2024. See <a href=\"https://lics.siglog.org/lics24/\">https://lics.siglog.org/lics24/</a> for details.</p>",
        "id": 392576588,
        "sender_full_name": "Sam Staton",
        "timestamp": 1695406195
    }
]