[
    {
        "content": "<p><strong>1st International Workshop on Logic in Quantum Computer Science (LIQCS 2026)</strong>  <br>\nJune 17-19, Paris, France  <br>\n<a href=\"https://liqcs2026.github.io/\">https://liqcs2026.github.io/</a></p>\n<hr>\n<p>IMPORTANT DATES<br>\nAll deadlines are stated with respect to the Anywhere on Earth (AoE) time zone.</p>\n<ul>\n<li>Submission deadline: Friday, 20 March 2026</li>\n<li>Notification: Monday, 20 April 2026</li>\n<li>Workshop: 17-19 June 2026</li>\n</ul>\n<hr>\n<p>OVERVIEW<br>\nLIQCS is a workshop dedicated to the logical and mathematical foundations of quantum computer science. Its goal is to bring together researchers working on rigorous frameworks for quantum computation, including logic, type theory, semantics, algebraic and categorical methods, and formal verification. The workshop welcomes contributions presenting new ideas, work in progress, recently published results, and perspectives on emerging research directions.<br>\nFor a more comprehensive list of topics, please check the website.</p>\n<hr>\n<p>SUBMISSION GUIDELINES<br>\nThe submission site is:<br>\n<a href=\"https://easychair.org/conferences?conf=liqcs2026\">https://easychair.org/conferences?conf=liqcs2026</a><br>\nWe invite submissions of extended abstracts describing original work, work in progress, or results recently published elsewhere that are relevant to the LIQCS community.</p>\n<ul>\n<li>Submissions should be in PDF format, 2-5 pages in length (excluding bibliography).</li>\n<li>Appendices or links to longer documents are welcome, but the reviewers are not obliged to read them.</li>\n<li>All submissions will be reviewed by the Program Committee for quality and relevance.</li>\n<li>Accepted contributions must be presented as talks during the workshop.</li>\n<li>Although there are no formal proceedings, we will publish the extended abstracts on the website.</li>\n</ul>\n<hr>\n<p>LIQCS 2026 CHAIRS</p>\n<ul>\n<li>Alejandro Diaz-Caro</li>\n<li>Romain Pechoux</li>\n<li>Benoit Valiron</li>\n<li>Vladimir Zamdzhiev</li>\n</ul>",
        "id": 564304727,
        "sender_full_name": "Alejandro Díaz-Caro",
        "timestamp": 1765991755
    }
]