[
    {
        "content": "<p>The call for papers for MFPS 2024 is also open. see <a href=\"https://oxford24.github.io/mfps_cfp.html\">https://oxford24.github.io/mfps_cfp.html</a></p>\n<p>MFPS XL: Mathematical Foundations of Programming Semantics<br>\nCall for papers</p>\n<p>The 40th Conference on the Mathematical Foundations of Programming Semantics (MFPS XL) takes place at the University of Oxford, UK, from 19-21 June 2024, where it will be colocated with the 7th International Conference on Applied Category Theory (ACT 2024).</p>\n<p>MFPS conferences are dedicated to the areas of mathematics, logic, and computer science that are related to models of computation in general, and to semantics of programming languages in particular. This is a forum where researchers in computer science and mathematics can meet and exchange ideas. The participation of researchers in neighbouring areas is strongly encouraged.</p>\n<p>Topics include, but are not limited to, the following: bio-computation; concurrent qualitative and quantitative distributed systems; process calculi; probabilistic systems; constructive mathematics; domain theory and categorical models; formal languages; formal methods; game semantics; lambda calculus; programming-language theory; quantum computation; security; topological models; logic; type systems; type theory. We also welcome contributions that address applications of semantics to novel areas such as complex systems, markets, and networks, for example.</p>\n<p>Conference home page: <a href=\"https://oxford24.github.io/\">https://oxford24.github.io/</a><br>\nSUBMISSION<br>\nImportant dates:</p>\n<div class=\"codehilite\"><pre><span></span><code>March 29: paper submission\nMay 3: notification of authors\nJune 3: conference papers ready\nJune 19–21: conference\n</code></pre></div>\n\n<p>Submissions</p>\n<p>Submissions should be prepared using the MFPS macros in the form of a PDF file. Submission is via EasyChair.</p>\n<p>For the first time at MFPS, there are two submission categories:</p>\n<div class=\"codehilite\"><pre><span></span><code>regular research contributions,\n\nearly announcements.\n</code></pre></div>\n\n<p>Early announcements are a new feature at MFPS XL. They offer a forum for the early presentation of new scientific contributions without the accompanying technical justification that is expected in a regular research contribution.</p>\n<p>The page limit for both kinds of submission is 15 pages, excluding bibliography and appendices. However, it is expected that early announcements will typically be much shorter, taking only as many pages as is required to present the announced contribution. Early announcements will be refereed primarily on their potential interest-value to the MFPS audience. Early announcements should be identified by clearly labelling them with “Early Announcement” at the start of the pdf document.</p>\n<p>Early announcements will be given equal presentation time to regular research contributions at the conference.<br>\nProceedings</p>\n<p>A preliminary proceedings will be distributed at the meeting, containing both regular research contributions and early announcements.</p>\n<p>Final proceedings, containing regular research contributions only, will be published in Electronic Notes in Theoretical Informatics and Computer Science (ENTICS <a href=\"https://entics.episciences.org/\">https://entics.episciences.org/</a>). This open-access series is hosted by <a href=\"http://Episciences.org\">Episciences.org</a> as an overlay for papers published by the CORR arXiv or HAL.</p>\n<p>It is planned to publish a journal special issue for selected papers from MFPS XL.<br>\nINVITED SPEAKERS</p>\n<p>There will be 4 invited speakers.</p>\n<div class=\"codehilite\"><pre><span></span><code>Philippa Gardner (Imperial College, London, UK)\nOhad Kammar (University of Edinburgh, UK)\nCatuscia Palamidessi (INRIA Saclay &amp; LIX, France)\nAndrew Pitts (University of Cambridge Emeritus, joint ACT/MFPS plenary speaker)\n</code></pre></div>\n\n<p>SPECIAL SESSIONS</p>\n<p>There will be 3 special sessions.</p>\n<div class=\"codehilite\"><pre><span></span><code>Special session in memory of Philip Scott (joint session with ACT, organiser Rick Blute)\nSpecial session on the semantics of non-wellfounded and circular proofs (organisers Anupam Das and Abhishek De)\nSpecial session associated with the invited talk of Philippa Gardner (organiser Philippa Gardner)\n</code></pre></div>",
        "id": 427807249,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1710880585
    },
    {
        "content": "<p>Hello, I feel stupid but I can't find where to register for the conference. Can somebody enlighten me?</p>",
        "id": 437097461,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1714902403
    },
    {
        "content": "<p>Hello all!<br>\nThe video recordings of the conference will be available in the following playlist. (It's going to take a few days.)<br>\n<a href=\"https://www.youtube.com/playlist?list=PLNEYE1ojDrqdXHaCPzoV6L4uDnFivA2M6\">https://www.youtube.com/playlist?list=PLNEYE1ojDrqdXHaCPzoV6L4uDnFivA2M6</a></p>",
        "id": 448899445,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1720024499
    },
    {
        "content": "<p>Okay, all the talks are now online. <br>\n(At least, all the ones for which we have a video.)<br>\nCorrection: some more videos are coming.</p>",
        "id": 449342624,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1720194962
    }
]