[
    {
        "content": "<blockquote>\n<p>Category Theory Virtual Novemberfest 2021</p>\n<p>Friday-Sunday, November 12-14</p>\n<p>Second Announcement</p>\n<p>The 2021 Category Theory Novemberfest will be held on the weekend of Friday, November 12th through Sunday, November 14th. The meeting will be virtual.  Following the tradition of past Octoberfests, this is intended to be an informal meeting, covering all areas of category theory and its applications.   Talks by PhD students and young researchers are particularly encouraged! If interested in speaking, please send title and abstract to Rick Blute at rblute@uottawa.ca&lt;mailto:<a href=\"mailto:rblute@uottawa.ca\">rblute@uottawa.ca</a>&gt; by October 20.</p>\n</blockquote>",
        "id": 256872757,
        "sender_full_name": "John Baez",
        "timestamp": 1633788390
    },
    {
        "content": "<p>I hope some of you younger category theorists offer to give talks!   Rick Blute is a cool guy doing a lot of category theory at the University of Ottawa, and the Octoberfest is a nice tradition in Canadian category theory.  I don't know why it got postponed a month this year... but anyway, they want talks by PhD students and young researchers!</p>",
        "id": 256872862,
        "sender_full_name": "John Baez",
        "timestamp": 1633788490
    },
    {
        "content": "<p>What counts as a young researcher? ;-) 'Early Career' might be a better term, but you can only report what you are given...</p>",
        "id": 256929607,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633846808
    },
    {
        "content": "<p>Sure.   I'm 60 now, so anyone below 50 counts as young to me, but of course what matters here is not age but \"need for help in developing their career\".   I know that, but I slipped.</p>",
        "id": 256959620,
        "sender_full_name": "John Baez",
        "timestamp": 1633876285
    },
    {
        "content": "<p>Not just Canadian! We have 'em on the east coast in the U.S. too :-)</p>",
        "id": 256987613,
        "sender_full_name": "Gershom",
        "timestamp": 1633902783
    },
    {
        "content": "<p>Whoops, right!</p>",
        "id": 257085229,
        "sender_full_name": "John Baez",
        "timestamp": 1633968466
    },
    {
        "content": "<blockquote>\n<p>Third Announcement</p>\n<p>The 2021 Category Theory Novemberfest will be held on the weekend of Friday, November 12th through Sunday, November 14th. The meeting will be virtual.  (Links will be provided next week.) Following the tradition of past Octoberfests, this is intended to be an informal meeting, covering all areas of category theory and its applications.  Novemberfest will begin Friday, November 12th at 3:30 PM when Tom Leinster (U. Edinburgh) will give a talk to the UOttawa Math Department entitled “The mathematics of diversity”.</p>\n<p><strong>Abstract:</strong> What is the mathematical definition of diversity? Ecologists have  debated how best to measure diversity for over 70 years, and the same question arises in multiple fields both in the life sciences and beyond. But it  is only just now being appreciated that diversity is also a fertile source  of new mathematics. It is closely related to entropy (already a core concept in subjects such as information theory), and indeed, sheds new light on this old concept. The story I will tell begins with category theory, passes through parts of geometry and analysis, and ends with an answer to the question: what is the canonical probability measure on a metric space?</p>\n<p>Then contributed talks will begin Saturday morning at 9AM. Contributed talks are 25 minutes + 5 minutes for questions. Schedule, titles and abstracts can be found at <a href=\"https://richardblute.ca/novemberfest/\">https://richardblute.ca/novemberfest/</a></p>\n</blockquote>",
        "id": 260360730,
        "sender_full_name": "John Baez",
        "timestamp": 1636080424
    },
    {
        "content": "<p>I'm giving the last talk in 10 minutes, feel free to join!</p>",
        "id": 261426461,
        "sender_full_name": "Christian Williams",
        "timestamp": 1636908654
    },
    {
        "content": "<p>Just realised that slides and recordings are available here: <a href=\"https://richardblute.ca/novemberfest/\">https://richardblute.ca/novemberfest/</a></p>",
        "id": 261439477,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1636925727
    }
]