[
    {
        "content": "<p>Just a reminder that this is in 20 minutes, for any who want to check it out:</p>\n<p>· Speaker: Nicholas Meadows, Haifa University.<br>\n· Date and Time: Wednesday April 22, 2020, 7:00 - 8:30 PM., Zoom Meeting.<br>\n· Title: Higher Homotopy Operations in (\\infty, 1)-categories.</p>\n<p>· Abstract: Traditionally, higher homotopy operations have three<br>\nprimary applications in homotopy theory: generating elements in the<br>\nhigher homotopy groups of spheres, as an obstruction theory to<br>\nrectifying homotopy commutative diagrams and describing differentials<br>\nin the spectral sequence of a (co)simplicial space. In this talk, we<br>\nwill define the spiral spectral sequence (which recovers the classical<br>\nBousfield-Friedlander spectral sequence from the E^{2} page on) in an<br>\narbitrary simplicial model category and describe the differentials in<br>\nterms of higher homotopy operations. We will also explain how to<br>\nrepresent elements in the filtration of the spiral spectral sequence<br>\nas higher homotopy operations. Finally, we will sketch how one can<br>\ndefine analogous higher homotopy operations in quasi-categories and<br>\nsimplicially enriched categories. .</p>\n<p>Zoom Meeting Information.</p>\n<p><a href=\"https://us02web.zoom.us/j/86383090855?pwd=ZGxZd1dnV1MySjg5MjRUY1k1bkFQQT09\" title=\"https://us02web.zoom.us/j/86383090855?pwd=ZGxZd1dnV1MySjg5MjRUY1k1bkFQQT09\">https://us02web.zoom.us/j/86383090855?pwd=ZGxZd1dnV1MySjg5MjRUY1k1bkFQQT09</a></p>\n<p>Meeting ID: 863 8309 0855<br>\nPassword: 066446</p>",
        "id": 194999963,
        "sender_full_name": "Gershom",
        "timestamp": 1587595211
    },
    {
        "content": "<p>Just to let you know that on the categorytheory.world calendar, this is recorded as being in 3 hours' time.</p>",
        "id": 195000145,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1587595377
    },
    {
        "content": "<p>My bad</p>",
        "id": 195002962,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1587597612
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> Also the page says 'All times in PST', but for me they're showing up as local (UK) time. So I think the calendar actually somehow knows the location of the viewer and adjusts accordingly.</p>",
        "id": 195030791,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1587630315
    },
    {
        "content": "<p>Ah, there is a clock symbol in the bottom right corner that shows 'London' for me.</p>",
        "id": 195030915,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1587630382
    },
    {
        "content": "<p>Yes it shows time for the timezone of the viewers, but when one adds events it should be possible to specify which timezone you're inputting<br>\nSo write your times, read your times. Easy.</p>",
        "id": 195165707,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1587721262
    },
    {
        "content": "<p>I should add that there's a schedule up for the new semester, alternate wednesdays at 7pm EST, starting today. <br>\n<a href=\"https://www.sci.brooklyn.cuny.edu/~noson/Seminar/index.html\">https://www.sci.brooklyn.cuny.edu/~noson/Seminar/index.html</a></p>\n<p>Speaker:     Gemma De las Cuevas, University of Innsbruck.<br>\nDate and Time:     Wednesday October 6, 2021, 7:00 - 8:30 PM., on Zoom.<br>\nTitle:     From simplicity to universality and undecidability.</p>\n<p>Speaker:     Dan Shiebler, Oxford University.<br>\nDate and Time:     Wednesday October 20, 2021, 7:00 - 8:30 PM., on Zoom.<br>\nTitle:     Out of Sample Generalization with Kan Extensions.</p>\n<p>Speaker:     Dusko Pavlovic, University of Hawai‘i at Mānoa.<br>\nDate and Time:     Wednesday November 3, 2021, 7:00 - 8:30 PM., on Zoom.</p>\n<p>Speaker:     Marco Schorlemmer, Spanish National Research Council.<br>\nDate and Time:     Wednesday November 17, 2021, 7:00 - 8:30 PM., on Zoom.</p>\n<p>Speaker:     Robert Geroch, University of Chicago.<br>\nDate and Time:     Wednesday December 1, 2021, 7:00 - 8:30 PM., on Zoom. </p>\n<p>Speaker:     Samantha Jarvis, The CUNY Graduate Center.<br>\nDate and Time:     Wednesday December 15, 2021, 7:00 - 8:30 PM., on Zoom. </p>\n<p>Speaker:     Todd Trimble, Western Connecticut State University.<br>\nDate and Time:     Wednesday December 22, 2021, 7:00 - 8:30 PM., on Zoom.</p>",
        "id": 256498588,
        "sender_full_name": "Gershom",
        "timestamp": 1633561709
    },
    {
        "content": "<p>I'd love to know more about the one that happend on Oct 6....</p>",
        "id": 256934702,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633852201
    },
    {
        "content": "<p>Since no slides are supplied on the site, and no recording seems to be available (of course, the speaker may not wish to share these directly, but if anyone watched and can give me a precis, that would be awesome.</p>",
        "id": 256939721,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633857061
    },
    {
        "content": "<p>Oh weird, they must have taken the video down, it was definitely on their Youtube channel earlier this week.</p>",
        "id": 256978221,
        "sender_full_name": "Emilio Minichiello",
        "timestamp": 1633893994
    },
    {
        "content": "<p>The categorical content was rather speculative and conversational -- the group is just looking into those methods. The question posed was sort of what the notions of \"universality\" in terms of universal turing machine have in common with other notions of universality that all regard some system being able to simulate other systems of the same sort. The main mathematical result driving this is in <a href=\"https://arxiv.org/abs/2006.03529\">https://arxiv.org/abs/2006.03529</a> and the discussion was around how to use category theory to sort of more closely couple these sorts of results, and also regarding the relationship or not of universality on the one hand (in the \"universal turing machine sense\") and undecidability (in the godel sense) on the other. David -- I made sure to point out to  Gemma De las Cuevas and Noson Yanofsky both your recent paper on minimal criteria for lawvere's diagonalization  that helped shed some light (in my mind) on some of distinctions one should be worried about :-)</p>",
        "id": 256988029,
        "sender_full_name": "Gershom",
        "timestamp": 1633903157
    },
    {
        "content": "<p>Oh, cool, thanks! I guess I should email Gemma and/or Noson.</p>",
        "id": 257004177,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633919964
    },
    {
        "content": "<p>I can understand that a talk containing speculative category theory in progress may need to not be permanently publicly available, just to give the people involved some breathing room to get the material worked out to their satisfaction before really sharing.</p>",
        "id": 257004286,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633920060
    },
    {
        "content": "<p>I should have advertised the spring semester talks. They're almost over (though prior ones available on youtube). The two remaining talks are tonight and next wednesday:</p>\n<p>Speaker:     Alex Sorokin, Northeastern University.<br>\nDate and Time:     Wednesday April 27, 2022, 7:00 - 8:30 PM., on Zoom.<br>\nTitle:     The defect of a profunctor .</p>\n<p>Abstract: In the mid 1960s Auslander introduced a notion of the defect of a finitely presented functor on a module category. In 2021 Martsinkovsky generalized it to arbitrary additive functors. In this talk I will show how to define a defect of any enriched functor with a codomain a cosmos. Under mild assumptions, the covariant (contravariant) defect functor turns out to be a left covariant (right contravariant) adjoint to the covariant (contravariant) Yoneda embedding. Both defects can be defined for any profunctor enriched in a cosmos V. They happen to be adjoints to the embeddings of V-Cat in V-Prof. Moreover, the Isbell duals of a profunctor are completely determined by the profunctor's covariant and contravariant defects. These results are based on applications of the Tensor-Hom-Cotensor adjunctions and the (co)end calculus.</p>\n<p>Speaker:     Gershom Bazerman, Arista Networks.<br>\nDate and Time:     Wednesday May 4, 2022, 7:00 - 8:30 PM., on Zoom.<br>\nTitle:     Classes of Closed Monoidal Functors which Admit Infinite Traversals.</p>\n<p>Abstract: In functional programming, functors that are equipped with a traverse operation can be thought of as data structures which permit an in-order traversal of their elements. This has been made precise by the correspondence between traversable functors and finitary containers (aka polynomial functors). This correspondence was established in the context of total, necessarily terminating, functions. However, the Haskell language is non-strict and permits functions that do not terminate. It has long been observed that traversals can at times, in practice, operate over infinite lists, for example in distributing the Reader applicative. We present work in progress that characterizes when this situation occurs, making use of the toolkit of guarded recursion.</p>",
        "id": 280391957,
        "sender_full_name": "Gershom",
        "timestamp": 1651084239
    }
]