[
    {
        "content": "<p>On 18 - 19 November 2021 there is an event organized by Matías Menni and Luis Turcio:<br>\n\"A short, informal meeting on Category Theory and an opportunity to celebrate Francisco 'Quico' Marmolejo's 60th birthday.\"</p>\n<p>The event is organized in Ciudad de México but will take place online because of the Covid pandemic. For more information, see <a href=\"https://sites.google.com/view/catcat-2021-en/inicio\">the webpage</a>.</p>\n<p>Regarding the topic, the website states: \"Since we will be celebrating Quico's birthday we particularly encourage talks on Pseudo-monads, distributive laws, Toposes and/or Axiomatic Cohesion.\" Confirmed participants are Anders Kock, Susan Niefield, Robert Paré and Robert Rosebrugh.</p>",
        "id": 256534690,
        "sender_full_name": "Jens Hemelaer",
        "timestamp": 1633591471
    },
    {
        "content": "<p>There is now a preliminary list of talks <a href=\"https://sites.google.com/view/catcat-2021-en/home/preliminary-programme\">here</a>.</p>",
        "id": 259944483,
        "sender_full_name": "John Baez",
        "timestamp": 1635817837
    },
    {
        "content": "<p>That webpage also has abstracts, but here are the speakers and talk titles:</p>\n<blockquote>\n<p>Jens Hemelaer - Are precohesive geometric morphisms locally connected?<br>\nAnders Kock - From Riemannian metric to volume form: Heron's formula.<br>\nSusan Niefield - Linear skew-bicategories<br>\nJuan Orendain - Globularly generated double categories: Then and now.<br>\nAxel Osmond - Bistable pseudofunctors and bifactorization 2-geometries for Grothendieck topoi.<br>\nRobert Paré - The double theory of monads.<br>\nMorgan Rogers - A map of properties of geometric morphisms.<br>\nBob Rosebrugh - The algebra of lenses.<br>\nCarlos Segovia - The classifying space of the 1+1 dimensional free $G$-cobordism category.<br>\nLuca Spada - Some remarks about rigs.<br>\nThomas Streicher - Precohesive toposes over arbitrary base toposes.<br>\nAdrián Vazquez - The double category of adjunctions through the 2-adjunction of type Adj-Mnd.<br>\nCharles Walker - No-iteration pseudodistributive laws.<br>\nRichard J. Wood - Towards a characterization of totally distributive categories.<br>\nWilliam Zuluaga - Coextensive varieties and the Gaeta topos: An algebraic overview</p>\n</blockquote>",
        "id": 259944643,
        "sender_full_name": "John Baez",
        "timestamp": 1635818030
    }
]