[
    {
        "content": "<p>OWLS = Online Worldwide Seminar on Logic and Semantics, so it's maybe off-topic here, but the first talk at least is on HoTT and so should be of interest</p>",
        "id": 192235129,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585562849
    },
    {
        "content": "<p>The Online Worldwide Seminar on Logic and Semantics is a new<br>\nonline-only series of fortnightly research talks, highlighting the<br>\nmost exciting recent work in the international computer science logic<br>\ncommunity. In this time of restricted international travel, a key aim<br>\nof this series is to provide a forum for informal discussion and<br>\nsocial interaction that is so important for the progress of science.<br>\nTo facilitate this, the seminar incorporates in virtual form a number<br>\nof features more normally associated with physical meetings, including<br>\nvirtual \"coffee breaks\" before and after the seminar, allowing<br>\nparticipants to chat in small groups. (Don't forget to bring your own<br>\ncoffee.)</p>\n<p>We are delighted to announce our initial programme of talks, all of<br>\nwhich take place on Wednesdays at 14:00 UTC+1. All members of the<br>\ncomputer science logic community are welcome, from students to<br>\nprofessors.</p>\n<ul>\n<li>\n<p>April 1. Kevin Buzzard, Imperial College London. \"Is HoTT the way<br>\nto do mathematics?\"</p>\n</li>\n<li>\n<p>April 15. Joost-Pieter Katoen, Aachen University. \"Termination of<br>\nprobabilistic programs\"</p>\n</li>\n<li>\n<p>April 29. Daniela Petrisan, University of Paris. \"Combining<br>\nprobabilistic and non-deterministic choice via weak distributive laws\"</p>\n</li>\n<li>\n<p>May 13. Bartek Klin, Warsaw University: \"Monadic monadic second order logic\"</p>\n</li>\n<li>May 27. Dexter Kozen, Cornell University: \"Brzozowski derivatives<br>\nas distributive laws\"</li>\n</ul>\n<p>Talks are fully interactive, with audience members able to see the<br>\nspeaker's face at the same time as the slides, and able to ask<br>\nquestions with full audio and video, just as they would in a physical<br>\nseminar, allowing the nuanced communication that is so critical for<br>\nmodern science.</p>\n<p>The seminar series is based on the Zoom technology platform, which is<br>\ncapable of handing large meetings with ease. Visit the OWLS webpage<br>\ngiven at the top of this email for more information about the seminar,<br>\nand to sign up for our reminder email list.</p>\n<p>Best wishes, the organizers:</p>\n<ul>\n<li>Alexandra Silva, University College London</li>\n<li>Pawel Sobocinski, Tallinn University of Technology</li>\n<li>Jamie Vicary, University of Birmingham</li>\n</ul>",
        "id": 192235176,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585562878
    },
    {
        "content": "<p>Great! Did you put them on the calendar already?</p>",
        "id": 192241284,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585567012
    },
    {
        "content": "<p>(BTW here's the webpage in case someone is interested <a href=\"https://www.cs.bham.ac.uk/~vicaryjo/owls/\" title=\"https://www.cs.bham.ac.uk/~vicaryjo/owls/\">https://www.cs.bham.ac.uk/~vicaryjo/owls/</a>)</p>",
        "id": 192241623,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585567221
    },
    {
        "content": "<p>No. I've lost faith in google calendar. If you or anyone else wants to do it, I'll add you to edit</p>",
        "id": 192241653,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585567253
    },
    {
        "content": "<p>It seems obvious that it won't work if every time someone wants to add an event they have to contact one person to ask for edit access</p>",
        "id": 192241678,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585567281
    },
    {
        "content": "<p>:/ It's a pity. We could have some designated curators for the calendar. In case, I volunteer to be one.</p>",
        "id": 192241882,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585567407
    },
    {
        "content": "<p>I'm sure there must be a calendar app that can be sent to publicly editable, like google apps can be. I just don't know one myself</p>",
        "id": 192242008,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1585567481
    },
    {
        "content": "<blockquote>\n<p>it won't work if every time someone wants to add an event they have to contact one person to ask for edit access</p>\n</blockquote>\n<p>if there can be multiple people who have the permission to give edit access, I don't think this is an issue</p>",
        "id": 192247453,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1585571161
    },
    {
        "content": "<p>If we have a 3-4 volunteers, covering timezones, who update each time something is posted here I think it's manageable. We can find something more sophisticate later on, if it becomes to unwieldy.</p>",
        "id": 192252704,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585573862
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229141-seminars-and.20events/topic/April.201st.3A.20OWLS/near/192241623\" title=\"#narrow/stream/229141-seminars-and.20events/topic/April.201st.3A.20OWLS/near/192241623\">said</a>:</p>\n<blockquote>\n<p>(here's the webpage in case someone is interested <a href=\"https://www.cs.bham.ac.uk/~vicaryjo/owls/\" title=\"https://www.cs.bham.ac.uk/~vicaryjo/owls/\">https://www.cs.bham.ac.uk/~vicaryjo/owls/</a>)</p>\n</blockquote>\n<p>BTW, there's an offical calendar for OWLS so you can add this in meantime (scroll down to 'Upcoming seminars', then on the bottom right corner of the Google Calendar widget there's a button to import it to your calendar)</p>",
        "id": 192259051,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1585576741
    },
    {
        "content": "<p>Makes me think of Harry Potter.</p>",
        "id": 192419069,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1585674279
    },
    {
        "content": "<p>A new round of talks:</p>\n<p><strong>ONLINE WORLDWIDE SEMINAR ON LOGIC AND SEMANTICS (OWLS)</strong><br>\n<a href=\"https://www.cs.bham.ac.uk/~vicaryjo/owls/\">https://www.cs.bham.ac.uk/~vicaryjo/owls/</a> </p>\n<p>The Online Worldwide Seminar on Logic and Semantics is an online-only<br>\nseries of research talks, highlighting the most exciting recent work<br>\nin the international computer science logic community. In this time of<br>\nrestricted international travel, a key aim of this series is to<br>\nprovide a forum for informal discussion and social interaction that is<br>\nso important for the progress of science. To facilitate this, the<br>\nseminar incorporates in virtual form a number of features more<br>\nnormally associated with physical meetings, including virtual \"coffee<br>\nbreaks\" before and after the seminar, allowing participants to chat in<br>\nsmall groups. (Don't forget to bring your own coffee.)</p>\n<p>Starting this Wednesday, we are excited to announce the first of our<br>\nOWLS Young Researcher talks, given by a researcher within 7 years of<br>\ncompleting their PhD. A new initiative, these OWLS-YR talks will take<br>\nplace fortnightly, interleaved with regular OWLS talks. Our goal is to<br>\ngive a platform to the excellent work being done by junior members of<br>\nthe community. All members of the community are encouraged to attend<br>\nthese talks.</p>",
        "id": 199536548,
        "sender_full_name": "John Baez",
        "timestamp": 1591123921
    },
    {
        "content": "<p><strong>PROGRAMME </strong></p>\n<p>Talks take place on Wednesdays at 2pm UTC+1. Abstracts are available<br>\nat the OWLS homepage. Visit this link to sign up for reminder emails<br>\non the day of the talk: <a href=\"https://bit.ly/3cm0GZG\">https://bit.ly/3cm0GZG</a></p>\n<p>- 3 June (OWLS-YR). Dmitry Chistikov, University of Warwick,<br>\n\"Parikh's theorem from the complexity viewpoint\"</p>\n<p>- 10 June (OWLS). Valeria Vignudelli, ENS Lyon, \"Monads and<br>\nquantitative equational theories for nondeterminism and probability\"</p>\n<p>- 17 June (OWLS-YR). Marie Fortin, University of Liverpool, \"FO=FO3<br>\nfor linear orders with monotone binary relations\"</p>\n<p>- 24 June (OWLS). Anupam Das, University of Birmingham</p>\n<p>- 1 July (OWLS-YR). Amina Doumane, CNRS, ENS de Lyon</p>\n<p>- 8 July (OWLS). Christine Tasson, IRIF, Paris</p>\n<p>- 15 July (OWLS-YR). Justin Hsu, University of Wisconsin–Madison, \"A<br>\nseparation logic for probabilistic independence\"</p>\n<p>- 22 July (OWLS). Tarmo Uustalu, Reykjavik University</p>",
        "id": 199536645,
        "sender_full_name": "John Baez",
        "timestamp": 1591123953
    },
    {
        "content": "<p><strong>SEMINAR INFORMATION</strong></p>\n<p>Talks are fully interactive, with audience members able to see the<br>\nspeaker's face at the same time as the slides, and able to ask<br>\nquestions with full audio and video, just as they would in a physical<br>\nseminar, allowing the nuanced communication that is so critical for<br>\nmodern science.</p>\n<p>After and before each seminar, the participants split into small<br>\ngroups for informal discussion, an optional feature of the seminars<br>\nwhich has already become a favourite feature of the series for many of<br>\nthe regular participants. Everybody is welcome to join these friendly<br>\ndiscussions.</p>\n<p>The seminar series is based on the Zoom technology platform, which is<br>\ncapable of handing large meetings with ease. Visit the OWLS webpage<br>\ngiven at the top of this email for more information about the seminar.</p>\n<p>Best wishes, the organizers:</p>\n<p>- Nathanaël Fijalkow, CNRS, Laboratoire Bordelais de Recherche en Informatique, France<br>\n   - Charles Grellois, Université Aix-Marseille, France.<br>\n   - S. Krishna, IIT Bombay, India<br>\n   - Koko Muroya, RIMS, Kyoto University, Japan<br>\n   - Alexandra Silva, University College London<br>\n   - Pawel Sobocinski, Tallinn University of Technology<br>\n   - Jamie Vicary, University of Cambridge</p>",
        "id": 199536742,
        "sender_full_name": "John Baez",
        "timestamp": 1591123996
    },
    {
        "content": "<p>It's amusing that the next two speakers of the “regular track” are both within 4-5 years of completing their PhD. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 199537442,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1591124340
    },
    {
        "content": "<p>“Many researchers are young, but only some are young researchers.”</p>",
        "id": 199537611,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1591124406
    }
]