[
    {
        "content": "<p>TL;DR: Submit your PSSL 112 abstract by February 6th 2026 to <a href=\"mailto:stiephen.pradal@nottingham.ac.uk\">stiephen.pradal@nottingham.ac.uk</a>.</p>\n<p><strong>1st CALL FOR CONTRIBUTIONS</strong><br>\n<strong>PSSL 112</strong><br>\n<strong>Nottingham, United Kingdom, 28-29 March 2026</strong></p>\n<p>We are happy to announce that the 112th Peripatetic Seminar on Sheaves and Logic (PSSL 112) will take place on March 28th-29th 2026 at the University of Nottingham, United Kingdom.</p>\n<p>PSSL is a long-running series of informal gatherings traditionally held over a weekend in a European university. This meeting marks the 112th edition and it is the first to be held in Nottingham. Talks cover all aspects and areas of category theory and its applications.</p>\n<p>Further details about the meeting, transport, accommodation and updates can be found on the <a href=\"https://sites.google.com/view/pssl112/\">PSSL 112 website</a>. Below are the current important dates and information.</p>\n<p><strong>Registration</strong><br>\nPlease fill in the registration form, which can be <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfM1CPjBF5nJ5LwV_V8zh6QURcNgRG9nKXasJ5_Q4BnLNBkKA/viewform\">found here</a>, by March 14th 2026. The registration is free.</p>\n<p><strong>Submitting a contribution</strong><br>\nIf you wish to present your work as a contributed talk, please submit a one-page pdf (not counting references) with title, speaker name and abstract to the following email address: <a href=\"mailto:stiephen.pradal@nottingham.ac.uk\">stiephen.pradal@nottingham.ac.uk</a>.</p>\n<p>Key dates to remember:</p>\n<ul>\n<li>The deadline for the abstract submissions is February 6th 2026 (AoE).</li>\n<li>The notification of accepted talks will be sent on February 16th 2026.</li>\n</ul>\n<p>Talks about work in progress are welcome, and we encourage PhD students, young researchers and minorities to give a presentation.</p>\n<p>We look forward to seeing you in Nottingham!</p>\n<p>Stiéphen, Tom and Simona</p>",
        "id": 546624259,
        "sender_full_name": "Tom de Jong",
        "timestamp": 1761209666
    }
]