[
    {
        "content": "<p><strong><a href=\"https://www.monoidal.net/paris2020/qpl/\">Quantum Physics and Logic 2020</a></strong> is taking place June 2-6 online, and if you want to tune in you have to <a href=\"https://docs.google.com/forms/d/19toflQUfVQOociBEzUL5cDPoTCZ3p1Dd7bjrNMn4GFA/viewform?edit_requested=true\">register here</a>.</p>",
        "id": 197746989,
        "sender_full_name": "John Baez",
        "timestamp": 1589573612
    },
    {
        "content": "<p>Here are the talks:</p>\n<p>Matthew Amy, Andrew N. Glaudell and Neil J. Ross. Number-Theoretic Characterizations of Some Restricted Clifford+T Circuits</p>\n<p>Ana Belén Sainz, Matthew Hoban, Paul Skrzypczyk and Leandro Aolita. Bipartite post-quantum steering in generalised scenarios</p>\n<p>David Schmid, Denis Rosset and Francesco Buscemi. Quantifying Bell nonclassicality across arbitrary resource types</p>\n<p>Thomas Galley and Lluis Masanes. How dynamics constrains probabilities in general probabilistic theories</p>\n<p>Bob Coecke and Konstantinos Meichanetzidis. Meaning updating of density matrices</p>\n<p>Andre Kornell, Bert Lindenhovius and Michael Mislove. Quantum CPOs</p>\n<p>Kenta Cho, Bas Westerbaan and John van de Wetering. Dichotomy between deterministic and probabilistic models in countably additive effectus theory</p>\n<p>Niel de Beaudrap. Well-tempered ZX and ZH calculi</p>\n<p>Hector Miller-Bakewell, Miriam Backens, Giovanni de Felice, John van de Wetering and Leo Lobski. There and back again: A circuit extraction tale</p>\n<p>Samson Abramsky and Rui Soares Barbosa. Partial boolean algebras and the logical exclusivity principle</p>\n<p>Quanlong Wang. An algebraic axiomatisation of ZX-calculus</p>\n<p>Anthony Munson, Bob Coecke and Quanlong Wang. AND-gates in ZX-calculus: spider nest identities and QBC-completeness</p>\n<p>Andre Kornell. Quantum predicate logic with equality</p>\n<p>Laurent Poinsot. Hilbertian Frobenius algebras (Extended Abstract)</p>\n<p>Adriana Correia, Henk Stoof and Michael Moortgat. Putting a Spin on Language: A Quantum Interpretation of Unary Connectives for Linguistic Applications</p>\n<p>Masanao Ozawa. Quantum Set Theories Satisfying Both the Transfer Principle and De Morgan's Laws</p>\n<p>Nikola Andrejić and Ravi Kunjwal. Joint measurability structures realizable with qubit measurements: incompatibility via marginal surgery</p>\n<p>Farid Shahandeh. Contextuality of general probabilistic theories</p>\n<p>Robert Booth and Damian Markham. Flow Conditions for Continuous Variable Measurement-based Quantum Computing</p>\n<p>Matthew Wilson and Giulio Chiribella. A Diagrammatic Approach to Information Transmission in Generalised Switches</p>\n<p>Arianne Meijer - van de Griend and Ross Duncan. Architecture-aware synthesis of phase polynomials for NISQ devices</p>\n<p>Hlér Kristjánsson, Sina Salek, Daniel Ebler, Matthew Wilson and Giulio Chiribella. Resource theories of communication with quantum superpositions of processes</p>\n<p>Konstantinos Meichanetzidis, Aleks Kissinger and Niel de Beaudrap. Tensor Network Rewriting Strategies for Satisfiability and Counting</p>\n<p>Sebastian Horvat and Borivoje Dakić. Interference as an information-theoretic game</p>\n<p>Sanjaye Ramgoolam, Mehrnoosh Sadrzadeh and Lewis Sword. Gaussianity and typicality in matrix distributional semantics </p>\n<p>Cole Comfort. The ZX&amp; calculus: A complete graphical calculus for classical circuits using spiders</p>\n<p>Konstantinos Meichanetzidis, Stefano Gogioso, Nicolò Chiappori, Giovanni De Felice, Alexis Toumi and Bob Coecke. QNLP on Near-Term Quantum Computers</p>\n<p>Nicola Pinzani and Stefano Gogioso. Giving Operational Meaning to the Superposition of Causal Orders</p>\n<p>Louis Lemonnier, Aleks Kissinger and John van de Wetering. Hypergraph simplification: Linking the path-sum approach to the ZH-calculus</p>\n<p>James Hefford and Stefano Gogioso. Hyper-decoherence in Density Hypercubes</p>\n<p>Jan Paseka and Thomas Vetterlein. Hilbert spaces reduced to their orthogonality relation</p>\n<p>Mehdi Mhalla and Sacha Huriot. Contextuality and Expressivity of Non-locality</p>\n<p>Titouan Carette, Simon Perdrix and Dominic Horsman. SZX-calculus: Scalable Graphical Quantum Reasoning</p>\n<p>Shiv Akshar Yadavalli and Ravi Kunjwal. Contextual advantage for noisy one-shot classical communication assisted by entanglement</p>\n<p>Pierre-Emmanuel Emeriau, Mark Howard and Shane Mansfield. The Torpedo Game: Quantum Advantage, Wigner Negativity, and Sequential Contextuality in a Generalised Random Access Code</p>\n<p>Lorenzo Catani and Matthew Leifer. A mathematical framework for operational fine tunings</p>\n<p>Robert Rand, Aarthi Sundaram, Kartik Singhal and Brad Lackey. Gottesman Types for Quantum Programs</p>\n<p>Kartik Singhal and John Reppy. Quantum Hoare Type Theory</p>\n<p>V. Vilasini, Lídia Del Rio and Renato Renner. Causality in definite and indefinite space-times</p>\n<p>Ämin Baumeler and Eleftherios Tselentis. Equivalence of grandfather and information antinomy under intervention</p>\n<p>Timothée Hoffreumon and Ognyan Oreshkov. The multi-round process matrix</p>\n<p>Michal Sedlak and Mario Ziman. Perfect probabilistic storage and retrieval of phase gates</p>",
        "id": 197747138,
        "sender_full_name": "John Baez",
        "timestamp": 1589573685
    }
]