[
    {
        "content": "<p>We have regular seminars at LIPN; sometimes these are on the theme of category theory, and they are streamed online and recorded, so I figure it is sensible to announce them here. Consider this a test of that idea.</p>",
        "id": 392132847,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1695221011
    },
    {
        "content": "<p>Tomorrow we are receiving <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span> , who will talk about<br>\n<strong>Relative monads and distributors</strong><br>\nAbstract: One of the oldest and most fundamental concepts in category theory is that of a monad, which may be viewed as an axiomatisation of free constructions. More recently, it has become increasingly evident that a natural generalisation, the concept of a relative monad, is even more fundamental. Relative monads generalise monads by permitting the axiomatisation of situations in which not every object admits a free construction. While there is already much evidence that relative monads will be an invaluable tool in category theory and its applications in the years to come, the theory of relative monads remains relatively undeveloped compared to the classical theory of monads. As a step towards furthering our understanding of relative monads, in this talk, I will explore the connection between relative monads and the theory of distributors. Distributors may be viewed as a categorified notion of relation, in the same way that functors may be viewed as a categorified notion of function. While categories, functors, and natural transformations are generally viewed as the basic structure of category theory, I will argue that distributors ought also to be viewed on the same footing. To justify this, I will show how many important aspects of the theory of relative monads (and consequently also non-relative monads) follow from the theory of distributors, and give several examples arising from pure category theory and categorical logic. A particular advantage of the distributor-based approach is its amenability to formalisation in the sense of formal category theory, and I will spend a little time explaining how, by working in the context of a virtual double category, we may capture analogous results for enriched relative monads, internal relative monads, and so on, with little extra work. For this talk, I will assume some basic knowledge of category theory, but will not assume familiarity with relative monads or with distributors. The talk is based on forthcoming joint work with Dylan McDermott.</p>\n<p>The seminar will be in person in Salle B107, bâtiment B, on the Villetaneuse campus of Université Sorbonne Paris Nord.<br>\n21/09/2023 10:30 - 12:00</p>\n<p>I believe it will also be streamed online via BBB, but I do not currently have a link. Please leave a star on this post by 10am tomorrow if you would like me to forward you the link once it is shared.</p>",
        "id": 392133957,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1695221372
    },
    {
        "content": "<p>Would it be possible to upload the recordings to youtube? That will make distribution easier, and will give a centralized place to go to watch the recordings (instead of having people email you every week :P)</p>",
        "id": 392227111,
        "sender_full_name": "Chris Grossack (they/them)",
        "timestamp": 1695257716
    },
    {
        "content": "<p>There is such a centralized place where videos are uploaded when they are recorded: the streaming platform BBB which we use has that facility. <br>\nI cannot (or at least probably should not) publicly post the link to the BBB rooms since I did not get permission from the speakers for that, but I am happy to share the link on an individual basis.</p>",
        "id": 392262751,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1695281024
    }
]