[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> is running a one-day Seminar on Applied Category Theory on Tuesday June 6, 2023.</p>",
        "id": 362575675,
        "sender_full_name": "John Baez",
        "timestamp": 1685568261
    },
    {
        "content": "<p>It's hybrid - you can attend using MS Teams if you go <a href=\"https://ncatlab.org/davidcorfield/show/Seminar+on+Applied+Category+Theory\">here</a>, or in person at KS23, Keynes College, University of Kent, Canterbury.</p>",
        "id": 362575885,
        "sender_full_name": "John Baez",
        "timestamp": 1685568340
    },
    {
        "content": "<p>There are 3 talks.  Times here are UK time (currently UTC +1):</p>\n<ul>\n<li>\n<p>15.30-15.50 David Corfield (Kent), Introduction: Applied Category Theory from a Philosophical Point of View</p>\n</li>\n<li>\n<p>15.50-16.50 Toby St Clere Smithe (Topos Institute, Oxford), Understanding the Bayesian Brain with Categorical Cybernetics</p>\n</li>\n<li>\n<p>17.00-18.00 John Baez (UC Riverside), Applied Category Theory</p>\n</li>\n</ul>",
        "id": 362576133,
        "sender_full_name": "John Baez",
        "timestamp": 1685568419
    },
    {
        "content": "<p>David wrote:</p>\n<blockquote>\n<p>The language of Category Theory has been under development since the 1940s and continues to evolve to this day. It was originally created as a formal language to capture common mathematical structures and inference methods across various branches of mathematics, and later found application outside of mathematics. By introducing arrows to mediate between objects, the language is designed to represent anything that can be perceived as a process - including processes of inference and physical processes.</p>\n<p>The first applications of Category Theory outside of mathematics and logic were to physics and to computer science. There was also an early application in biology by Robert Rosen.</p>\n<p>But over the past decade we have seen researchers under the banner of Applied Category Theory take on a variety of novel subjects, addressing topics which include:</p>\n<blockquote>\n<p>causality, probabilistic reasoning, statistics, learning theory, deep neural networks, dynamical systems, information theory, database theory, natural language processing, cognition, consciousness, systems biology, genomics, epidemiology, chemical reaction networks, neuroscience, complex networks, game theory, robotics, and quantum computing.</p>\n</blockquote>\n<p>In this hybrid seminar at the ]Centre for Reasoning](<a href=\"https://research.kent.ac.uk/reasoning/\">https://research.kent.ac.uk/reasoning/</a>), University of Kent, we will be hearing online from two leading practitioners. All are welcome to attend.</p>\n</blockquote>",
        "id": 362576417,
        "sender_full_name": "John Baez",
        "timestamp": 1685568491
    },
    {
        "content": "<p>This is exciting! I'll try to go -- thanks for sharing <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>!</p>",
        "id": 362766652,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1685628167
    },
    {
        "content": "<p>You can now see talk videos and talk slides for the Seminar on Applied Category Theory <a href=\"https://math.ucr.edu/home/baez/ACT/\">here</a>.</p>",
        "id": 364938263,
        "sender_full_name": "John Baez",
        "timestamp": 1686335269
    },
    {
        "content": "<p>That's these 3 talks:</p>\n<ul>\n<li>\n<p>David Corfield (Kent), Introduction: Applied Category Theory from a Philosophical Point of View</p>\n</li>\n<li>\n<p>Toby St Clere Smithe (Topos Institute, Oxford), Understanding the Bayesian Brain with Categorical Cybernetics</p>\n</li>\n<li>\n<p>John Baez (U. C. Riverside), Applied Category Theory</p>\n</li>\n</ul>",
        "id": 364938487,
        "sender_full_name": "John Baez",
        "timestamp": 1686335319
    }
]