[
    {
        "content": "<hr>\n<p>STRUCTURE MEETS POWER 2024 </p>\n<p>(LICS/ICALP workshop) </p>\n<p>Call for Contributions </p>\n<hr>\n<p>Workshop dates: 07 July 2024 (Tallinn and online) </p>\n<p><a href=\"https://www.cst.cam.ac.uk/conference/structure-meets-power-2024\">https://www.cst.cam.ac.uk/conference/structure-meets-power-2024</a></p>\n<p>Aim<br>\n——-</p>\n<p>There is a remarkable divide in the field of logic in Computer Science between two distinct strands: one focuses on semantics and compositionality (“Structure”), the other on expressiveness and complexity (“Power”). These two traditions are studied by almost disjoint research communities using distinct technical languages and methods. We believe that bringing these communities and research fields together is an important objective in Computer Science, which may hold the key to fundamental advances in the field. The aim of this workshop is to attract investigators at the boundary of the two strands, and those on either side of the divide interested in establishing new connections.</p>\n<p>Previous workshops on this theme were held as affiliated workshops of LiCS 2021, ICALP 2022 and LiCS 2023. This is a LiCS/ICALP 2024 affiliated workshop. It will be a hybrid event, however on-site participation is highly encouraged.</p>\n<p>Important dates <br>\n—————————</p>\n<p>Workshop dates: 07 July 2024<br>\nAbstract submission deadline: 17 May 2024<br>\nAuthor notification: 1 June 2024</p>\n<p>Invited speakers<br>\n—————————</p>\n<p>*Karoliina Lehtinen (LIS, Aix-Marseille University)<br>\n*Tarmo Uustalu (Reykjavik University)</p>\n<p>Submission<br>\n—————————</p>\n<p>Those wishing to give a talk at the workshop are invited to submit an Extended Abstract of up to three pages (excluding references) describing the key points of the presentation. </p>\n<p>Submissions should only have a single author — the speaker. Any <br>\nco-authors should be clearly credited in the abstract and on the <br>\nslides. </p>\n<p>For submissions please follow the instructions on the workshop <br>\nwebsite: </p>\n<p><a href=\"https://www.cst.cam.ac.uk/conference/structure-meets-power-2024\">https://www.cst.cam.ac.uk/conference/structure-meets-power-2024</a></p>\n<p>We encourage talks at all levels of progress, including novel contributions, already published results, works in progress, as well as survey-type contributions. Depending on the number of submissions, contributed talks will be 20-30 minutes long.</p>\n<p>Registration<br>\n———————</p>\n<p>TBD</p>\n<p>Organising and Programme Committee<br>\n——————————————————————</p>\n<ul>\n<li>Samson Abramsky</li>\n<li>Anuj Dawar</li>\n<li>Tomas Jakl</li>\n<li>Dan Marsden</li>\n<li>Yoàv Montacute</li>\n<li>Luca Reggio</li>\n<li>Nihil Shah</li>\n</ul>",
        "id": 430979604,
        "sender_full_name": "Dan Marsden",
        "timestamp": 1712143384
    }
]