[
    {
        "content": "<p>Some of us just finished a paper clarifying the connection between two approaches to describing open systems---that is, systems that can interact with their environment, and can be composed to form larger open systems:</p>\n<p>&bull; John Baez, Kenny Courser and Christina Vasilakopolou, <a href=\"https://arxiv.org/abs/2101.09363\">Structured versus decorated cospans</a>.</p>\n<p>And, next week I'm giving a talk about it at YAMCaTS!  This is not a conference for felines who like sweet potatoes: it's the <a href=\"https://www2.le.ac.uk/departments/mathematics/extranet/staff-material/staff-profiles/simona-paoli/yorkshire-and-midlands-category-theory-seminar-yamcats\">Yorkshire and Midlands Category Seminar</a>, organized by Simona Paoli, Nicola Gambino and Steve Vickers.  </p>\n<p>In my talk, I'll start by sketching some ideas behind Halter and Patterson's software for quickly assembling larger models of COVID-19 from smaller models.  Then, I'll dig deeper into the underlying math, where we use 'structured' or 'decorated' cospans to model open systems.  </p>\n<p>This quickly gets into some serious category theory, and since YAMCaTS is a category theory seminar, I won't shy away from that.   Here are my slides:</p>\n<p>&bull; John Baez, <a href=\"https://math.ucr.edu/home/baez/structured_vs_decorated/\">Structured vs decorated cospans</a>, YAMCaTS, 5 February 2021.</p>\n<blockquote>\n<p><strong>Abstract.</strong> One goal of applied category theory is to understand open systems: that is, systems that can interact with the external world. We compare two approaches to describing open systems as cospans equipped with extra data: structured and decorated cospans. Each approach provides a symmetric monoidal double category, and we prove that under certain conditions these symmetric monoidal double categories are isomorphic. We illustrate these ideas with applications to dynamical systems and epidemiological modeling. This is joint work with Kenny Courser and Christina Vasilakopoulou. </p>\n</blockquote>\n<p>I don't know if my talk will be recorded, but it will be on Zoom so recording it would be easy, and I'll try to get the organizers to do that.</p>",
        "id": 224605923,
        "sender_full_name": "John Baez",
        "timestamp": 1612042113
    },
    {
        "content": "<p>Here's the zoom link for my talk <a href=\"http://math.ucr.edu/home/baez/structured_vs_decorated\">Structured vs decorated cospans</a>, which will be on Friday February 5th at 17:00-18:00 UTC (= Greenwich Mean Time), or 9:00 am here in sunny California:</p>\n<p><a href=\"https://universityofleeds.zoom.us/j/81042397132?pwd=RTg3MFV1TUt2YzJXZVZJSkhoOEQwQT09\">https://universityofleeds.zoom.us/j/81042397132?pwd=RTg3MFV1TUt2YzJXZVZJSkhoOEQwQT09</a><br>\nMeeting ID: 810 4239 7132<br>\nPasscode: 683026</p>",
        "id": 224662207,
        "sender_full_name": "John Baez",
        "timestamp": 1612123951
    },
    {
        "content": "<p>Here's the talk I gave yesterday at the Topos Institute:</p>\n<p><a href=\"https://www.youtube.com/watch?v=pUTLVQc-0Ps\">Structured vs decorated cospans</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"pUTLVQc-0Ps\" href=\"https://www.youtube.com/watch?v=pUTLVQc-0Ps\"><img src=\"https://uploads.zulipusercontent.net/082ac6f633530029be0d42f6d034b945d71d5dea/68747470733a2f2f692e7974696d672e636f6d2f76692f7055544c5651632d3050732f64656661756c742e6a7067\"></a></div>",
        "id": 247617306,
        "sender_full_name": "John Baez",
        "timestamp": 1627580704
    },
    {
        "content": "<p>Decorated cospans are a framework for studying open systems invented by Brendan Fong. Since I’m now visiting the institute he and David Spivak set up—the Topos Institute—it was a great time to give a talk explaining the history of decorated cospans, their problems, and how those problems have been solved.</p>\n<blockquote>\n<p><strong>Abstract</strong>. One goal of applied category theory is to understand open systems: that is, systems that can interact with the external world. We compare two approaches to describing open systems as morphisms: structured and decorated cospans. Each approach provides a symmetric monoidal double category. Structured cospans are easier, decorated cospans are more general, but under certain conditions the two approaches are equivalent. We take this opportunity to explain some tricky issues that have only recently been resolved.</p>\n</blockquote>",
        "id": 247617502,
        "sender_full_name": "John Baez",
        "timestamp": 1627580807
    },
    {
        "content": "<p>It's probably best to <a href=\"http://math.ucr.edu/home/baez/structured_vs_decorated/structured_vs_decorated_topos_web.pdf\">get the slides here</a> and look at them along with the video, since it's a bit hard to see the slides in the video.</p>",
        "id": 247617582,
        "sender_full_name": "John Baez",
        "timestamp": 1627580853
    },
    {
        "content": "<p>For more resources on this topic go <a href=\"https://johncarlosbaez.wordpress.com/2021/07/29/structured-vs-decorated-cospans-part-2/\">here</a>.</p>",
        "id": 247617640,
        "sender_full_name": "John Baez",
        "timestamp": 1627580879
    },
    {
        "content": "<p>You should get whoever is in charge of the Youtube channel to put a link to the slides in the description of the video.</p>",
        "id": 247617795,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1627580943
    },
    {
        "content": "<p>Okay, good point.  Also they misspelled \"Cospanss\" the second time around.</p>",
        "id": 247617896,
        "sender_full_name": "John Baez",
        "timestamp": 1627580985
    },
    {
        "content": "<p>By the way, Juliet Szatko is the person at Topos who does a million administrative tasks, including putting videos on YouTube.</p>",
        "id": 247620776,
        "sender_full_name": "John Baez",
        "timestamp": 1627582320
    },
    {
        "content": "<p>After blogging about my talk, a website ripped off my blog article but gave it a strange new title:</p>\n<ul>\n<li><a href=\"https://www.yourclimatechangenews.com/structured-countertops-against-decorations-part-2/\">Structured countertops against decorations</a></li>\n</ul>\n<p><span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span></p>",
        "id": 247761845,
        "sender_full_name": "John Baez",
        "timestamp": 1627679158
    }
]