[
    {
        "content": "<p>CALL FOR SUBMISSIONS<br>\nTHIRTEENTH SYMPOSIUM ON COMPOSITIONAL STRUCTURES (SYCO 13)</p>\n<p>London, United Kingdom<br>\n24-25 April, 2025</p>\n<p>Submission deadline: Friday 7 March 2023<br>\n<a href=\"https://www.cl.cam.ac.uk/events/syco/13/\">https://www.cl.cam.ac.uk/events/syco/13/</a></p>\n<hr>\n<p>The Symposium on Compositional Structures (SYCO) is an interdisciplinary series<br>\nof meetings aiming to support the growing community of researchers interested in<br>\nthe phenomenon of compositionality, from both applied and abstract perspectives,<br>\nand in particular where category theory serves as a unifying common<br>\nlanguage. Previous SYCO events have been held in Birmingham, Strathclyde,<br>\nOxford, Chapman, Leicester, Tallinn, and Como.</p>\n<p>We welcome submissions from researchers across computer science, mathematics,<br>\nphysics, philosophy, and beyond, with the aim of fostering friendly discussion,<br>\ndisseminating new ideas, and spreading knowledge between fields. Submission is<br>\nencouraged for both mature research and work in progress, and by both<br>\nestablished academics and junior researchers, including students. Submissions is<br>\neasy, with no formatting or page restrictions. The meeting does not have<br>\nproceedings, so work can be submitted even if it has been submitted or published<br>\nelsewhere. You could submit work-in-progress, or a recently completed paper, or<br>\neven a PhD or Masters thesis.</p>\n<p>While no list of topics could be exhaustive, SYCO welcomes submissions with a<br>\ncompositional focus related to any of the following areas, in particular from<br>\nthe perspective of category theory:</p>\n<ul>\n<li>\n<p>logical methods in computer science, including classical and quantum<br>\n   programming, type theory, concurrency, natural language processing and machine<br>\n   learning;</p>\n</li>\n<li>\n<p>graphical calculi, including string diagrams, Petri nets and reaction<br>\n   networks;</p>\n</li>\n<li>\n<p>languages and frameworks, including process algebras, proof nets, type theory<br>\n   and game semantics;</p>\n</li>\n<li>\n<p>abstract algebra and pure category theory, including monoidal category theory,<br>\n   higher category theory, operads, polygraphs, and relationships to homotopy<br>\n   theory;</p>\n</li>\n<li>\n<p>quantum algebra, including quantum computation and representation theory;</p>\n</li>\n<li>\n<p>tools and techniques, including rewriting, formal proofs and proof assistants,<br>\n   and game theory;</p>\n</li>\n<li>\n<p>industrial applications, including case studies and real-world problem<br>\n   descriptions.</p>\n</li>\n</ul>\n<p>IMPORTANT DATES<br>\n===============</p>\n<p>All deadlines are 23:59 Anywhere on Earth.</p>\n<p>Submission deadline: Friday 7 March, 2025<br>\nAuthor notification: Wednesday 21 March, 2025<br>\nSymposium dates: Thursday 24 and Friday 25 April 2025</p>\n<p>SUBMISSION INSTRUCTIONS<br>\n=======================</p>\n<p>Submissions are on Easychair, via the SYCO 13 submission page:<br>\n<a href=\"https://easychair.org/my/conference?conf=syco13\">https://easychair.org/my/conference?conf=syco13</a></p>\n<p>Submission is easy, with no format requirements or page restrictions. The<br>\nmeeting does not have proceedings, so work can be submitted even if it has been<br>\nsubmitted or published elsewhere. Think creatively: you could submit a recent<br>\npaper, or notes on work in progress, or even a recent Masters or PhD thesis.</p>\n<p>In the event that more good-quality submissions are received than can be<br>\naccommodated in the timetable, the programme committee may choose to <em>defer</em><br>\nsome submissions to a future meeting, rather than reject them. Deferred<br>\nsubmissions can be re-submitted to any future SYCO meeting, where they will not<br>\nneed peer review, and where they will be prioritised for inclusion in the<br>\nprogramme. Meetings will be held sufficiently frequently to avoid a backlog of<br>\ndeferred papers.</p>\n<p>If you have a submission which was deferred from a previous SYCO meeting, it<br>\nwill not automatically be considered for SYCO 13; you still need to submit it<br>\nagain through easychair. When submitting, append the words \"DEFERRED FROM SYCO<br>\nX\" to the title of your paper, replacing \"X\" with the appropriate meeting<br>\nnumber. There is no need to attach any documents.</p>\n<p>PROGRAMME COMMITTEE<br>\n===================</p>\n<p>Mina Abbaszadeh, University College London (Chair)<br>\nRobin Piedeleu, University College London (Chair)<br>\nTai-Danae Bradley, Sandbox AQ and The Master's University<br>\nCorina Cirstea, University of Southampton<br>\nChris Heunen, University of Edinburgh<br>\nAleks Kissinger, University of Oxford<br>\nJean-Simon Pacaud Lemay, Macquarie University<br>\nMartha Lewis, University of Amsterdam<br>\nJade Master, Glasgow Lab for AI Verification<br>\nSamuel Mimram, École Polytechnique<br>\nKoko Muroya, National Institute of Informatics<br>\nPaolo Perrone, University of Oxford<br>\nMorgan Rogers, University of Sorbonne Paris Nord<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nChristina Vasilakopoulou, National Technical University of Athens<br>\nMaaike Zwart, IT University of Copenhagen</p>\n<p>STEERING COMMITTEE<br>\n==================</p>\n<p>Ross Duncan, University of Strathclyde<br>\nChris Heunen, University of Edinburgh<br>\nDominic Horsman, University of Oxford<br>\nAleks Kissinger, University of Oxford<br>\nSamuel Mimram, École Polytechnique<br>\nSimona Paoli, University of Aberdeen<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nJamie Vicary, University of Cambridge</p>",
        "id": 497412592,
        "sender_full_name": "Robin Piedeleu",
        "timestamp": 1738583710
    },
    {
        "content": "<p>Hi all, the deadline for submissions has been moved to this coming Friday, 14 of March.  We look forward to your submissions!</p>",
        "id": 504797880,
        "sender_full_name": "Christina Vasilakopoulou",
        "timestamp": 1741688748
    },
    {
        "content": "<p>The registration is not open yet. Just to make sure - there won't be registration fees, correct?</p>",
        "id": 510192011,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1743770483
    },
    {
        "content": "<p>Hi Morgan, registration is indeed free! We have just added the registration link to the website (and will be notifying authors later today).</p>",
        "id": 510212994,
        "sender_full_name": "Robin Piedeleu",
        "timestamp": 1743775796
    },
    {
        "content": "<p>Just a reminder that registration for <strong>SYCO 13</strong> closes <strong>tomorrow (Saturday, 12 April 2025, AoE)</strong>! If you’d like to attend, please fill out this form:</p>\n<p><span aria-label=\"point right\" class=\"emoji emoji-1f449\" role=\"img\" title=\"point right\">:point_right:</span> <a href=\"https://forms.gle/aLrUZr6vfh8kWQdd6\">https://forms.gle/aLrUZr6vfh8kWQdd6</a></p>\n<p>Registration is <strong>free</strong> but required—even if you plan to join online.</p>\n<p>You can find the full schedule and list of talks on the website:<br>\n<a href=\"https://www.cl.cam.ac.uk/events/syco/13/\">https://www.cl.cam.ac.uk/events/syco/13/</a></p>\n<p>We hope to see you in London on <strong>April 24–25</strong>!</p>",
        "id": 511635863,
        "sender_full_name": "Robin Piedeleu",
        "timestamp": 1744373594
    },
    {
        "content": "<p>I'm on my way to London now, is anyone meeting up this evening?</p>",
        "id": 513930112,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1745430018
    }
]