[
    {
        "content": "<hr>\n<p>CALL FOR SUBMISSIONS<br>\nTENTH SYMPOSIUM ON COMPOSITIONAL STRUCTURES (SYCO 10)</p>\n<p>Edinburgh, United Kingdom<br>\n19-20 December, 2022</p>\n<p>Submission deadline:  Monday 7 November 2022<br>\n<a href=\"https://www.cl.cam.ac.uk/events/syco/10/\">https://www.cl.cam.ac.uk/events/syco/10/</a></p>\n<hr>\n<p>The Symposium on Compositional Structures (SYCO) is an interdisciplinary<br>\nseries of meetings aiming to support the growing community of researchers<br>\ninterested in the phenomenon of compositionality, from both applied and<br>\nabstract perspectives, and in particular where category theory serves as a<br>\nunifying common language. Previous SYCO events have been held in<br>\nBirmingham, Strathclyde, Oxford, Chapman, Leicester, Tallinn, and Como.</p>\n<p>We welcome submissions from researchers across computer science,<br>\nmathematics, physics, philosophy, and beyond, with the aim of<br>\nfostering friendly discussion, disseminating new ideas, and spreading<br>\nknowledge between fields. Submission is encouraged for both mature<br>\nresearch and work in progress, and by both established academics and<br>\njunior researchers, including students. Submissions is easy, with no<br>\nformatting or page restrictions. The meeting does not have proceedings, so<br>\nwork can be submitted even if it has been submitted or published elsewhere.<br>\nYou could submit work-in-progress, or a recently completed paper, or even a<br>\nPhD or Masters thesis.</p>\n<p>While no list of topics could be exhaustive, SYCO welcomes submissions<br>\nwith a compositional focus related to any of the following areas, in<br>\nparticular from the perspective of category theory:</p>\n<ul>\n<li>\n<p>logical methods in computer science, including classical and<br>\nquantum programming, type theory, concurrency, natural language<br>\nprocessing and machine learning;</p>\n</li>\n<li>\n<p>graphical calculi, including string diagrams, Petri nets and<br>\nreaction networks;</p>\n</li>\n<li>\n<p>languages and frameworks, including process algebras, proof nets,<br>\ntype theory and game semantics;</p>\n</li>\n<li>\n<p>abstract algebra and pure category theory, including monoidal<br>\ncategory theory, higher category theory, operads, polygraphs, and<br>\nrelationships to homotopy theory;</p>\n</li>\n<li>\n<p>quantum algebra, including quantum computation and representation<br>\ntheory;</p>\n</li>\n<li>\n<p>tools and techniques, including rewriting, formal proofs and proof<br>\nassistants, and game theory;</p>\n</li>\n<li>\n<p>industrial applications, including case studies and real-world<br>\nproblem descriptions.</p>\n</li>\n</ul>\n<p><strong> IMPORTANT DATES </strong></p>\n<p>All deadlines are 23:59 Anywhere on Earth.</p>\n<p>Submission deadline: Monday 7 November, 2022<br>\nAuthor notification: Sunday 20 November, 2022<br>\nSymposium dates: Monday 19 and Tuesday 20 December 2022</p>\n<p><strong> SUBMISSION INSTRUCTIONS </strong></p>\n<p>Submissions are by OpenReview, via the SYCO 10 submission page:<br>\n<a href=\"https://openreview.net/group?id=cl.cam.ac.uk/SYCO/2022/Symposium\">https://openreview.net/group?id=cl.cam.ac.uk/SYCO/2022/Symposium</a></p>\n<p>Submission is easy, with no format requirements or page restrictions.<br>\nThe meeting does not have proceedings, so work can be submitted even<br>\nif it has been submitted or published elsewhere. Think creatively:<br>\nyou could submit a recent paper, or notes on work in progress, or even<br>\na recent Masters or PhD thesis.</p>\n<p>In the event that more good-quality submissions are received than can<br>\nbe accommodated in the timetable, the programme committee may choose<br>\nto <em>defer</em> some submissions to a future meeting, rather than reject<br>\nthem. Deferred submissions can be re-submitted to any future SYCO<br>\nmeeting, where they will not need peer review, and where they will be<br>\nprioritised for inclusion in the programme. Meetings will be held<br>\nsufficiently frequently to avoid a backlog of deferred papers.</p>\n<p>If you have a submission which was deferred from a previous SYCO<br>\nmeeting, it will not automatically be considered for SYCO 10; you still<br>\nneed to submit it again through OpenReview. When submitting, append the<br>\nwords \"DEFERRED FROM SYCO X\" to the title of your paper, replacing \"X\"<br>\nwith the appropriate meeting number. There is no need to attach any<br>\ndocuments.</p>\n<p><strong> PROGRAMME COMMITTEE </strong></p>\n<p>The PC chair is Robin Kaarsgaard, University of Edinburgh. The Programme<br>\nCommittee will be announced soon.</p>\n<p><strong> STEERING COMMITTEE </strong></p>\n<p>Ross Duncan, University of Strathclyde<br>\nChris Heunen, University of Edinburgh<br>\nDominic Horsman, University of Oxford<br>\nAleks Kissinger, University of Oxford<br>\nSamuel Mimram, École Polytechnique<br>\nSimona Paoli, University of Aberdeen<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nJamie Vicary, University of Cambridge</p>",
        "id": 303677558,
        "sender_full_name": "Robin Kaarsgaard",
        "timestamp": 1665592757
    },
    {
        "content": "<p>I'll be talking there (since it's here)!   Looking forward to seeing some folks...</p>",
        "id": 303791447,
        "sender_full_name": "John Baez",
        "timestamp": 1665654248
    },
    {
        "content": "<hr>\n<p>CALL FOR PARTICIPATION<br>\nTENTH SYMPOSIUM ON COMPOSITIONAL STRUCTURES (SYCO 10)</p>\n<p>In person at the University of Edinburgh, UK<br>\n19-20 December 2022</p>\n<p>Registration deadline: 11 December 2022 (AoE)</p>\n<p>It is possible to attend online, but not to present online.<br>\nPlease register even when attending online.</p>\n<p><a href=\"https://www.cl.cam.ac.uk/events/syco/10\">https://www.cl.cam.ac.uk/events/syco/10</a></p>\n<hr>\n<p>The Symposium on Compositional Structures (SYCO) is an<br>\ninterdisciplinary series of meetings aiming to support the growing<br>\ncommunity of researchers interested in the phenomenon of<br>\ncompositionality, from both applied and abstract perspectives, and in<br>\nparticular where category theory serves as a unifying common language.<br>\nPrevious SYCO events have been held at University of Birmingham,<br>\nUniversity of Strathclyde, University of Oxford, Chapman University,<br>\nUniversity of Leicester, Tallinn University of Technology, and <br>\nUniversity of Insubria.</p>\n<p>The programme consists of 2 invited talks and 18 contributed talks.</p>\n<hr>\n<p>INVITED TALKS</p>\n<ul>\n<li>John Baez (University of California Riverside)</li>\n<li>Emily Roff (University of Edinburgh)</li>\n</ul>\n<hr>\n<p>CONTRIBUTED TALKS<br>\nFull schedule available at <a href=\"https://www.cl.cam.ac.uk/events/syco/10\">https://www.cl.cam.ac.uk/events/syco/10</a></p>\n<ul>\n<li>Clémence Chanavat: Cubical Type Theory Inside a Presheaf Topos</li>\n<li>Jade Edenstar Master, Benjamin Merlin Bumpus, Zoltan A. Kocsis: Structured Decompositions: Structural and Algorithmic Compositionality</li>\n<li>Jade Edenstar Master: How to Compose Shortest Paths</li>\n<li>Makoto Hamana: Complete Algebraic Semantics for Second-Order Rewriting Systems based on Abstract Syntax with Variable Binding</li>\n<li>Peter Hines: On coherence for Stoic conjunction</li>\n<li>Satoshi Kura: On the Relationship Between Weakest Precondition Transformers and CPS Transformations</li>\n<li>Louis Lemonnier, Vladimir Zamdzhiev, Titouan Carette: Central Submonads and Notions of Computation</li>\n<li>Leo Lobski: Quantum quirks, classical contexts: Towards a Bohrification of effect algebras</li>\n<li>Edward Morehouse: Locally Cubical Gray-Categories</li>\n<li>Giti Omidvar, Lutz Strassburger: The Composition of Combinatorial Flows</li>\n<li>Alex Rice, Jamie Vicary, Eric Finster: A Type Theory for Strictly Associative Infinity Categories</li>\n<li>Richard Statman: Cayley Monoids</li>\n<li>Calin Tataru: A layout algorithm for higher-dimensional string diagrams</li>\n<li>Ana Luiza Tenorio, Hugo Luiz Mariano, Peter Arndt: Non-topos sheaf on non-unital monoidal categories</li>\n<li>Jamie Vicary: Exact dynamics in dual-unitary quantum circuits with projective measurements</li>\n<li>Vincent Wang: Foam, data structures, and games</li>\n<li>Carlos Zapata-Carratala: What is n-ary associativity? A Proposal of Higher-Arity Categories</li>\n</ul>\n<hr>\n<p>REGISTRATION</p>\n<p>Registration is open until the 11th of December, 2022.<br>\nYou can register for either the in person meeting or<br>\nfor the online event. Registration is free. Please register via:<br>\n<a href=\"https://forms.gle/RQeSe2zcndXghwhM6\">https://forms.gle/RQeSe2zcndXghwhM6</a></p>\n<p>More details are available on the conference website:<br>\n<a href=\"https://www.cl.cam.ac.uk/events/syco/10\">https://www.cl.cam.ac.uk/events/syco/10</a></p>\n<hr>\n<p>PROGRAMME COMMITTEE</p>\n<p>Robin Cockett, University of Calgary<br>\nCarmen Constantin, University of Edinburgh<br>\nRoss Duncan, University of Strathclyde<br>\nChris Heunen, University of Edinburgh<br>\nRobin Kaarsgaard, University of Edinburgh (chair)<br>\nMarie Kerjean, Université Paris 13<br>\nAleks Kissinger, University of Oxford<br>\nDan Marsden, University of Nottingham<br>\nJade Master, University of Strathclyde<br>\nSamuel Mimram, École Polytechnique<br>\nJean-Simon Pacaud Lemay, Kyoto University<br>\nSimona Paoli, University of Aberdeen<br>\nMathys Rennela, INRIA Paris<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nTarmo Uustalu, Reykjavik University<br>\nNiccolò Veltri, Tallinn University of Technology<br>\nJamie Vicary, University of Cambridge<br>\nMaaike Zwart, IT University of Copenhagen</p>\n<hr>\n<p>STEERING COMMITTEE</p>\n<p>Ross Duncan, University of Strathclyde<br>\nChris Heunen, University of Edinburgh<br>\nDominic Horsman, University of Grenoble<br>\nAleks Kissinger, University of Oxford<br>\nSamuel Mimram, École Polytechnique<br>\nSimona Paoli, University of Aberdeen<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nJamie Vicary, University of Cambridge</p>",
        "id": 311666451,
        "sender_full_name": "Chris Heunen",
        "timestamp": 1669137134
    }
]