[
    {
        "content": "<p>Not sure if this is quite the right place for this but...</p>\n<p>Date and time: Friday November 5, 2021, 15:00 CET</p>\n<p>Title: GReTA-ExACT: towards Executable Applied Category Theory</p>\n<p>Speaker:</p>\n<p>Nicolas Behr (Université de Paris, CNRS, IRIF, France)</p>\n<p>Abstract:</p>\n<p>This talk marks the beginning of GReTA-ExACT, a new online working group within the GReTA community. The aim of this working group will consist in providing an interdisciplinary forum for exploring the diverse aspects of applied category theory relevant in graph transformation systems and their generalizations, in developing a methodology for formalizing diagrammatic proofs as relevant in rewriting theories via proof assistants such as Coq, and in establishing a community-driven wiki system and repository for mathematical knowledge in our research field (akin to a domain-specific Coq-enabled variant of the nLab). A further research question will consist in exploring the possibility for deriving reference prototype implementations of concrete rewriting systems (e.g., over multi- or simple directed graphs) directly from the category-theoretical semantics, in the spirit of the translation-based approaches as in [1],[2] (utilizing theorem provers such as Microsoft Z3). </p>\n<p>In the first part of this talk, I will provide an illustrated tour of broad scope of mathematical concepts in modern categorical rewriting theories, ranging over the definitions of Double-Pushout (DPO) and Sesqui-Pushout (SqPO) semantics to the notions of concurrency and associativity theorems, their proofs (illustrating a particular type of diagrammatic reasoning on commutative diagrams), the theory of tracelets, their Hopf algebras and  decomposition spaces, certain concepts of opfibrations and finally double-categorical structures that are currently under active investigation (joint work with Paul-André Melliès and Noam Zeilberger). In the second part of the talk, I will outline a proposal for the new GReTA-ExACT online working group format.</p>\n<p>References:</p>\n<p>[1] R. Heckel, L. Lambers, M.G. Saadat, \"Analysis of Graph Transformation Systems: Native vs Translation-based Techniques\", EPTCS 309, 2019, pp. 1-22. <a href=\"http://dx.doi.org/10.4204/EPTCS.309.1\">http://dx.doi.org/10.4204/EPTCS.309.1</a></p>\n<p>[2] N. Behr, R. Heckel, M.G. Saadat, \"Efficient Computation of Graph Overlaps for Rule Composition: Theory and Z3 Prototyping\", EPTCS 330, 2020, pp. 126–144. <a href=\"http://dx.doi.org/10.4204/EPTCS.330.8\">http://dx.doi.org/10.4204/EPTCS.330.8</a></p>\n<p>Zoom registration link:<br>\n<a href=\"https://u-paris.zoom.us/meeting/register/tZwrcuGoqT4qGd1HCZQnhptpmt0aTiWdDF67\">https://u-paris.zoom.us/meeting/register/tZwrcuGoqT4qGd1HCZQnhptpmt0aTiWdDF67</a></p>\n<p>Link to YouTube live stream:<br>\n<a href=\"https://youtu.be/tx0asw82EXU\">https://youtu.be/tx0asw82EXU</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"tx0asw82EXU\" href=\"https://youtu.be/tx0asw82EXU\"><img src=\"https://uploads.zulipusercontent.net/3bcfed2f1d014d48730049b80043868aae634410/68747470733a2f2f692e7974696d672e636f6d2f76692f74783061737738324558552f64656661756c742e6a7067\"></a></div>",
        "id": 259845832,
        "sender_full_name": "ww",
        "timestamp": 1635761265
    }
]