[
    {
        "content": "<p>The Topos Institute has a <a href=\"http://colloquium\">colloquium</a> every week, which (alas) is usually not announced here.  But this week it's about work that a bunch of us have been doing on software for modeling epidemics, so I'm going to advertise it!  </p>\n<p>The talk is by my old grad school pal Nate Osgood.  He's a computer scientist, he helped lead Canada's COVID modeling, and he is now spear-heading a project to develop software in AlgebraicJulia that uses ideas such as decorated cospans and operads to create disease models. </p>\n<p>I am completely biased, since I'm involved in this - but I am really excited about how <em>category theory</em>, <em>computer science</em> and <em>epidemiology</em> are meeting in this project, and yielding practical tools for public health.</p>",
        "id": 369262430,
        "sender_full_name": "John Baez",
        "timestamp": 1687639942
    },
    {
        "content": "<p>His talk is Thursday June 29, 10:00-11:00 Pacific Time; to watch it either live or recorded go <a href=\"https://researchseminars.org/talk/ToposInstituteColloquium/103/\">here</a>. </p>\n<p><strong>Towards Compositional System Dynamics for Public Health</strong></p>\n<p><strong>Abstract:</strong> For decades, System Dynamics (SD) modeling has served as a prominent, diagram-centric methodology used for public health modeling. Much of its strength arises from its versatile use of 3 types of diagrams, with each serving both to elevate transparency across the interdisciplinary teams responsible for most impactful models, and to reason about patterns of system behavior. Causal loop diagrams (CLDs) are used in semi-qualitative processes early in the modeling process and seek to support insight into feedback structure, behavioral modes, and leverage points. As modeling proceeds, system structure diagrams further distinguish stocks (accumulations) from flows and material from informational dependencies. Stock &amp; flow diagrams build on that representation to characterize mathematical dependencies, quantify parameters and initial values for stocks, and have been particularly widely used in scenario simulation in public health and mathematical epidemiology. </p>\n<p>While ubiquitous use of diagrams renders SD modeling markedly effective in supporting team science and shaping stakeholders’ mental models, existing tools suffer from a number of shortcomings. These include poor support for modularity, cumbersome and obscurant model stratification, and an inability to capture the relationships between the 3 diagram types. Within this talk, we describe initial progress towards creating a framework for compositional System Dynamics, including theory, API support via StockFlow.jl within AlgebraicJulia, and ModelCollab -- a real-time collaborative tool to support interdisciplinary teams in modularly building, composing and flexibly analyzing Stock &amp; Flow diagrams. </p>\n<p>Our approach separates syntax from semantics, and characterizes diagrams using copresheaves with a schema category. Diagram composition draws on the theory of structured cospans and undirected wiring diagrams, and employs pullbacks for model stratification. Model interpretation is achieved via functorial semantics, with ordinary differential equations being just one of several semantic domains supported. After describing the current state of implementation, we describe plans for future work, including enriching support for CLDs, and adding support for several computational statistics algorithms and additional types of structurally-informed model analyses. This is joint work with John Baez, Evan Patterson, Nicholas Meadows, Sophie Libkind, Alex Alegre and Eric Redekopp.</p>",
        "id": 369262669,
        "sender_full_name": "John Baez",
        "timestamp": 1687640093
    },
    {
        "content": "<p>I wish these colloquia were announced here!  They are announced here:</p>\n<ul>\n<li><a href=\"https://topos.site/topos-colloquium\">https://topos.site/topos-colloquium</a>.</li>\n</ul>\n<p>Anyway, here's one:</p>\n<ul>\n<li>\n<p>Speaker: André Joyal: Free bicompletion of categories revisited (part 1)</p>\n</li>\n<li>\n<p>Abstract: Whitman's theory of free lattices can be extended to free lattices enriched over a quantales, to free bicomplete enriched categories and even to free bicomplete enriched oo-categories. It has applications to the semantic of Linear Logic (Hongde Hu and J.)</p>\n</li>\n<li>\n<p>Time: Thursday February 15th  at 17:00 UTC. </p>\n</li>\n<li>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a></p>\n</li>\n<li>\n<p>YouTube: <a href=\"http://youtube.com/watch?v=a4a3TOpy5MU\">youtube.com/watch?v=a4a3TOpy5MU</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"a4a3TOpy5MU\" href=\"http://youtube.com/watch?v=a4a3TOpy5MU\"><img src=\"https://uploads.zulipusercontent.net/806c614fc79973ef918fa2287e7870311e3b8fe8/68747470733a2f2f692e7974696d672e636f6d2f76692f61346133544f7079354d552f64656661756c742e6a7067\"></a></div></li>\n</ul>",
        "id": 421188577,
        "sender_full_name": "John Baez",
        "timestamp": 1707809359
    },
    {
        "content": "<p>there's also a mailing list you can sign up to, and you can add the calendar to your computer calendar using researchseminars :-)</p>",
        "id": 421330353,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1707860603
    },
    {
        "content": "<p>Some smart people have gotten post titles from my Wordpress blog, posts on the category theory mailing list, etc. to be automatically copied here.  Could someone do that for Topos colloquium announcements?</p>",
        "id": 421330919,
        "sender_full_name": "John Baez",
        "timestamp": 1707860866
    },
    {
        "content": "<p>quite possibly! but that someone is not me</p>",
        "id": 421361677,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1707879343
    },
    {
        "content": "<p>Yeah, there are people here who do such things.</p>",
        "id": 421373664,
        "sender_full_name": "John Baez",
        "timestamp": 1707888919
    },
    {
        "content": "<p>Hi all! I’ll be trying to regularly announce Topos colloquia here. If you don’t know, almost every Thursday we have a cool speaker on Zoom. You should come.</p>",
        "id": 469151018,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1725986522
    },
    {
        "content": "<p>Below is the title and abstract for the next talk at the Topos Institute Colloquium, this Thursday at 17:00 UTC. You can check what time this is in your local time zone on either the website or ResearchSeminars page. Everybody is welcome to attend, either via Zoom or by the YouTube live stream.</p>\n<p>More information can be found at <a href=\"https://topos.site/topos-colloquium\">https://topos.site/topos-colloquium</a>.</p>\n<p>Looking forward to seeing you all there!</p>\n<p>——————</p>\n<p>Talk details</p>\n<p>Christine Tasson: Semantics for Reactive Probabilistic Programming</p>\n<p>Synchronous languages are now a standard industry tool for critical embedded systems. Designers write high-level specifications by composing streams of values. These languages have been extended with Bayesian reasoning to program state-space models which compute a stream of distributions given a stream of observations [1].</p>\n<p>This talk aims at describing semantics for probabilistic synchronous languages, based on a joint work with Guillaume Baudart and Louis Mandel [2]. The key idea is to interpret probabilistic expressions as a stream of un-normalized density functions which maps random variable values to a result and positive score. Two equivalent semantics are presented: the co-iterative semantics is executable while the relational semantics is easy to use for proving program equivalence. The semantical framework is then applied to prove the correctness of a program transformation required to run an optimized inference algorithm.</p>\n<p>[1] Reactive Probabilistic Programming, Guillaume Baudart et al, PLDI 2020<br>\n[2] Density-Based Semantics for Reactive Probabilistic Programming, Guillaume Baudart, Louis Mandel, Christine Tasson, arxiv:2308.01676</p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09\">https://topos-institute.zoom.us/j/84392523736?pwd=bjdVS09wZXVscjQ0QUhTdGhvZ3pUdz09</a><br>\nYouTube: <a href=\"http://youtube.com/live/Di8rz9Vp3Rw\">youtube.com/live/Di8rz9Vp3Rw</a></p>",
        "id": 469151095,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1725986531
    },
    {
        "content": "<p>there was previously a specific channel (<a class=\"stream\" data-stream-id=\"269484\" href=\"/#narrow/stream/269484-event.3A-Topos-Colloquium\">#event: Topos Colloquium</a> ) for this, but I think it makes more sense to keep it here as a single thread, so thanks Kevin!</p>",
        "id": 469216137,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1726003057
    },
    {
        "content": "<p>Hi everyone,</p>\n<p>Below is the title and abstract for the next talk at the Topos Institute Colloquium, scheduled for <time datetime=\"2024-09-26T17:00:00Z\">2024-09-26T10:00:00-07:00</time> . Everybody is welcome to attend, either via Zoom or by the YouTube live stream. More information can be found at <a href=\"https://topos.site/topos-colloquium\">https://topos.site/topos-colloquium</a>.</p>\n<p><strong>Talk details</strong></p>\n<p>Seth Frey: <em>Online communities as model systems for commons governance</em></p>\n<p>The best citizens of a large-scale democracy are those who have built and broken several small ones to see how they work. By empowering people to build any kind of community together, the Internet has become a laboratory for self-governance experimentation. Groups who start online communities must overcome the challenges of recruiting finite resources around difficult common goals. Fortunately, they can draw on a growing range of support technologies, peer networks, and scholarship.  With their transparency, the Internet's millions of online communities can be surveyed for insights into their design and functioning. Looking at three large platforms for small self-governing online communities, we will pose several questions of institutional processes at the population level, as drawn from the literatures on common-pool resource management and institutional analysis and design.</p>",
        "id": 472336085,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1727127568
    },
    {
        "content": "<p>Hi everyone,</p>\n<p>Tomorrow we have an exciting colloquium in the form of a dialogue on systems engineering and ACT with Eswaran Subrahmanian and Yves Keraron. It's at <time datetime=\"2024-12-12T17:00:00Z\">2024-12-12T09:00:00-08:00</time>. It's on Zoom <a href=\"https://topos-institute.zoom.us/j/84392523736\">here</a>, and the password is 65537. Here's their abstract. Hope to see you there!</p>\n<p>In this talk, we will illustrate the role of information structures in engineering practices. In a particular case, we will instantiate an example of the required structures and their interaction in the systems engineering process. We will then identify Categorical representations that could formalize the models embedded in systems engineering standards and support their composition. The talk is not mathematical but an attempt to map the needs of systems engineering modeling to potential categorical representations that serve the purpose of engineering practices.</p>",
        "id": 488166692,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1733943720
    }
]