[
    {
        "content": "<p>Hi all,<br>\nI expect many people here will be interested in the <strong><a href=\"https://aroundtoposes.com/toposesonline/\">Toposes Online</a></strong> school and conference, happening on the 24th-26th ant 28th-30th June 2021 respectively. Registration is open now (see link above) and free, but closes on May 31st. Here's the description from the website for people who don't like clicking on links:</p>\n<blockquote>\n<p>The event \"Toposes online\" represents the third edition of the main international conference on topos theory, following the previous ones \"<a href=\"https://indico.math.cnrs.fr/event/747/\">Topos à l’IHES</a>\" and \"<a href=\"https://tcsc.lakecomoschool.org/\">Toposes in Como</a>\".</p>\n<p>The format of the event is the same as that of the other two editions: it will consist of a three-day school, offering introductory courses for the benefit of students and mathematicians who are not already familiar with topos theory, followed by a three-day congress featuring both invited and contributed presentations on new theoretical advances in the subject as well as applications of toposes in different fields such as algebra, topology, number theory, algebraic geometry, logic, homotopy theory, functional analysis, and computer science.</p>\n<p>The main aim of this conference series is to celebrate the unifying power and interdisciplinary applications of toposes and encourage further developments in this spirit, by promoting exchanges amongst researchers in different branches of mathematics who use toposes in their work and by introducing a new generation of scholars to the subject.</p>\n<p>Because of the pandemic, this edition of the conference will take place entirely online. The participants may take advantage of the associated <a href=\"https://aroundtoposes.com/forum/\">forum</a> to discuss with each other (please register to it if you wish to post messages).</p>\n<p><strong>School lecturers</strong></p>\n<p><span class=\"user-mention silent\" data-user-id=\"284392\">Olivia Caramello</span> (University of Insubria and IHES)<br>\nLaurent Lafforgue (IHES)<br>\n<span class=\"user-mention silent\" data-user-id=\"409006\">Charles Rezk</span> (University of Illinois)</p>\n<p><strong>Invited speakers</strong></p>\n<p>Samson Abramsky (University of Oxford)<br>\nJean-Claude Belfiore (Huawei)<br>\nDaniel Bennequin (University of Paris 7)<br>\nDustin Clausen (University of Copenhagen)<br>\n<span class=\"user-mention silent\" data-user-id=\"282722\">Jens Hemelaer</span> (University of Antwerp)<br>\nLuca Prelli (University of Padua)<br>\nPeter Scholze (University of Bonn)<br>\nIvan Tomasic (Queen Mary University of London)</p>\n<p><strong>Scientific and Organizing Committee</strong></p>\n<p>Olivia Caramello<br>\nAlain Connes<br>\nLaurent Lafforgue</p>\n</blockquote>",
        "id": 238979843,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1621172656
    },
    {
        "content": "<p>Just a reminder that this is starting tomorrow, and that the organizers have arranged a <a href=\"https://aroundtoposes.com/forum/toposes-online-forum/\">forum</a> for discussion relating to the school and conference. <br>\nAlso, more details are up on the <a href=\"https://aroundtoposes.com/toposesonline/\">conference website</a>, including the talk timetable and abstracts for the invited talks, in case you're curious.</p>",
        "id": 243651310,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1624454983
    },
    {
        "content": "<p>Will the talks be recorded? (Sorry if it is written explicitly somewhere, and I didn't notice)</p>",
        "id": 243657159,
        "sender_full_name": "Roman Kniazev",
        "timestamp": 1624457464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275972\">@Roman Kniazev</span> Yes. (See, after <strong>Sponsors</strong> in <a href=\"https://aroundtoposes.com/toposesonline/\">this page</a>.)</p>",
        "id": 243663397,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1624459927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295542\">@সায়ন্তন রায়</span> oh, right, thanks!</p>",
        "id": 243663604,
        "sender_full_name": "Roman Kniazev",
        "timestamp": 1624460040
    },
    {
        "content": "<p>I would like to ask though, how much background is required for the listeners to understand a sizable part of the mini-courses (say, e.g., Prof. Caramello's talk and Prof. Rezk's talk)?</p>",
        "id": 243663994,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1624460199
    },
    {
        "content": "<p>I believe they are designed for people with some knowledge of category theory but nothing more. That would be a good question to ask the organisers on the forum, though!</p>",
        "id": 243665749,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1624460911
    },
    {
        "content": "<p>Okay, seems like a first course in category theory at least is a more realistic necessary background...</p>",
        "id": 243754657,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1624522824
    }
]