[
    {
        "content": "<p>On the categories mailing list John Alexander Cruz Morales writes:</p>\n<blockquote>\n<p>I would like to advertise the online minicourse \"the geometry of morphisms<br>\nand equivalence of toposes\" that Professor Olivia Caramello will be given<br>\nat Universidad Nacional de Colombia on October 26, 27 and 30. More<br>\ninformation here <a href=\"https://sites.google.com/view/toposeslectures/home\">https://sites.google.com/view/toposeslectures/home</a></p>\n</blockquote>",
        "id": 214434995,
        "sender_full_name": "John Baez",
        "timestamp": 1603555488
    },
    {
        "content": "<ul>\n<li>\n<p>In the first part of the course we shall present constructions allowing to turn any morphism of sites into a a comorphism of sites inducing the same geometric morphism (up to equivalence) and conversely; moreover, we shall introduce the notion of weak morphism of toposes and characterize the functors which induce such morphisms.</p>\n</li>\n<li>\n<p>In the second part, we shall discuss continuous comorphisms of sites, present an explicit characterization for them (also in terms of relative cofinality conditions), and show that this class of comorphisms includes all fibrations as well as morphisms of fibrations. We shall also present a characterization theorem for essential geometric morphisms and locally connected morphisms in terms of continuous functors, and a topos-theoretic interpretation of (a relative version) of the comprehensive factorization of a functor.</p>\n</li>\n<li>\n<p>In the third part, we shall present a theorem providing necessary and sufficient explicit conditions for a morphism of sites to induce an equivalence of toposes; this generalizes Grothendieck’s Comparison Lemma. Lastly, we shall give an overview of results characterizing important properties of geometric morphisms of toposes (such as being an inclusion, a surjection, hyperconnected, localic, local etc.) in terms of properties of morphisms or comorphisms of sites.</p>\n</li>\n</ul>\n<p>This material is taken from the monograph draft <a href=\"https://arxiv.org/abs/1906.08737\">https://arxiv.org/abs/1906.08737</a></p>",
        "id": 214435026,
        "sender_full_name": "John Baez",
        "timestamp": 1603555543
    },
    {
        "content": "<p>A heads up that this course is being hosted at 11am GMT-5 on those days, which is 4pm UK time and 5pm CET.</p>",
        "id": 214553705,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1603706357
    },
    {
        "content": "<p>:-( That's 2.30am my time....</p>",
        "id": 214651644,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1603760815
    }
]