[
    {
        "content": "<p>If you are in Paris these days, there will be a colloquium presenting the Grothendieck Institute at the IHP:</p>\n<p><a href=\"https://igrothendieck.org/en/visions-in-mathematis-paris-14-june-2023/\">https://igrothendieck.org/en/visions-in-mathematis-paris-14-june-2023/</a></p>\n<p>Come and get to know us better!</p>",
        "id": 361597899,
        "sender_full_name": "Mateo Carmona",
        "timestamp": 1685200883
    },
    {
        "content": "<blockquote>\n<p>The colloquium “Visions in mathematics: from Grothendieck to the present day” will be held on Wednesday 14 June 2023 at the Amphithéâtre Hermite of the Institut Henri Poincaré, 11 Rue Pierre et Marie Curie, 75005 Paris, from 6 pm to 8 pm, with the participation of Olivia Caramello, Mateo Carmona, Alain Connes, Stéphane Dugowson, Johanna Grothendieck and Laurent Lafforgue.</p>\n</blockquote>\n<blockquote>\n<p>Guided by a concern to build connections between the dimensions at stake, a round table discussion will allow the speakers to freely address the questions raised for them by the person and visionary work of Alexandre Grothendieck (1928-2014), from a philosophical, historical, literary and political perspective, as well as on more specifically mathematical themes, whether it be the future of topos theory in today’s mathematical landscape, relations with academic institutions in pure and applied mathematics, industrial research, teaching or the dissemination of scientific knowledge. </p>\n</blockquote>\n<blockquote>\n<p>The discussion will then open up to the audience. The final hour of the afternoon will be devoted to a cocktail dinner offered by the Grothendieck Institute, providing a convivial opportunity to continue the conversations initiated by the round table and to take advantage of useful networking opportunities.</p>\n</blockquote>\n<blockquote>\n<p>Registration for the conference is free but compulsory and must be made by using the following form....</p>\n</blockquote>",
        "id": 361612927,
        "sender_full_name": "John Baez",
        "timestamp": 1685206226
    },
    {
        "content": "<p>Now you can find the recordings here <a href=\"https://youtu.be/ZWaZN2HywDw\">https://youtu.be/ZWaZN2HywDw</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ZWaZN2HywDw\" href=\"https://youtu.be/ZWaZN2HywDw\"><img src=\"https://uploads.zulipusercontent.net/d05bab6cd17ae0be002af6cc171ed9a492d5a09d/68747470733a2f2f692e7974696d672e636f6d2f76692f5a57615a4e3248797744772f64656661756c742e6a7067\"></a></div>",
        "id": 373309327,
        "sender_full_name": "Mateo Carmona",
        "timestamp": 1688757493
    },
    {
        "content": "<p>It's weird that they do things like that in French when 1) all people involved speak English as well and 2) non-French people could be interested in the topic.</p>",
        "id": 373331953,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1688765326
    },
    {
        "content": "<p>The event was (more or less) open to the public, hosted in France and not purely academic; moreover French is the first language of at least half of the speakers and much of the source material was written in French. Under those conditions, it doesn't seem so unreasonable to have chosen French as the language of discussion.</p>",
        "id": 373394735,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1688799121
    }
]