[
    {
        "content": "<p>Hi all! Here, participants and speakers can introduce themselves and their interests.</p>\n<p>Just briefly summary your background and interests, and feel free to point to other resources such as your website, papers, or anything else. In case that you'd be interested in arranging personal meetings with other participants, you may also want to propose a topic.</p>\n<p>Looking forward to meeting you!</p>",
        "id": 196934198,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1588963293
    },
    {
        "content": "<p>Hello all! I'm a postdoc at MIT, working in David Spivak's group. During my PhD in Leipzig I met Tobias Fritz, and since then we have been working together on a number of projects, mostly involving probability monads, and more recently, Markov categories.<br>\nMathematically, I'm mostly interested in category theory, probability and information theory, and differential geometry.<br>\nIf you want to take a closer look at my research, here's my homepage: <a href=\"http://www.paoloperrone.org\">http://www.paoloperrone.org</a>.</p>",
        "id": 198264417,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1590013082
    },
    {
        "content": "<p>Hi everyone! I'm organizing this workshop, together with Rory Luchyshyn-Wright as co-organizer and Paolo Perrone as tech support.</p>\n<p>I'm currently a senior postdoc at the <a href=\"http://pitp.ca/\">Perimeter Institute for Theoretical Physics</a>. Despite a strong interest in the foundations of physics, I now mainly do pure math with a view on its applications.</p>\n<p>My two focus areas are:</p>\n<ul>\n<li>Category-theoretic approaches to probability, the subject matter of this workshop.</li>\n<li>The theory of ordered algebraic structures, in particular ordered rings and semirings, together with applications to probability and information theory.</li>\n</ul>\n<p>In categorical probability, Paolo and I have been working on various probability monads for a few years. More recently, I have been developing <a href=\"https://arxiv.org/abs/1908.07021\">Markov categories</a>, and I have come to regard them as forming the most promising approach to categorical probability.</p>\n<p>During this workshop, I hope to learn more about the demands and perspectives of other fields on categorical probability, including probabilistic programming, applied statistics and noncommutative/quantum probability.</p>",
        "id": 199092366,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1590703678
    },
    {
        "content": "<p>Hi everyone, <br>\nI'm a statistician by training and a statistical software developer by trade. I'm interested in developing software with strong theoretical underpinnings with strong safety guarantees -- this is something all too often lacking  in statistical software and scientific software in general. I backed my way into category theory by way of functional programming by way of \"discovering\" the functional paradigm for myself as way <a href=\"https://bsaul.github.io/geex/index.html\">to represent and code up M-estimators</a>. My research interests also include looking at causal inference through a category theoretic lens and applications to applied and theoretical ecology (though as a workaday programmer, I don't have much time for these interests).</p>\n<p>During the workshop, I hope to finally understand what a statistical model is.</p>",
        "id": 199495349,
        "sender_full_name": "Bradley Saul",
        "timestamp": 1591106588
    },
    {
        "content": "<p>Hi,<br>\nMy name is Ben Sprott and I am an automation developer. I have recently started an AI company and have partnered with Conexus.  My background is in Physics, in which I have an MSc from Waterloo and was a member of PI as a student working with Lucien Hardy.  I worked with Prakash Panangaden at McGill during my MSc in Comp Sci.  Please find my latest papers here:<a href=\"https://www.researchgate.net/profile/Ben_Sprott\">https://www.researchgate.net/profile/Ben_Sprott</a></p>",
        "id": 199503120,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1591109238
    },
    {
        "content": "<p>Welcome, Bradley and Ben! Ben, I've moved your message to the Introductions topic, I hope that's okay. Looking forward to the discussions!</p>",
        "id": 199508853,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1591111418
    },
    {
        "content": "<p>Hi!<br>\nI am a pure mathematician by training (motivic homotopy theory, logic, number theory) and recently became a lecturer at a newly established master program on AI. Had to teach probability theory, statistics and information theory for this and discovered that there are category theoretical view points on this. That is great - I want more!</p>",
        "id": 199509913,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1591111788
    },
    {
        "content": "<p>Hello! I'm Arthur and I am a postdoc at IHES in France. These days, I've been thinking about categorical probability, Bayesian inference, Bayesian updating, and entropy in quantum mechanics. I have a website at <a href=\"https://arthurparzygnat.com/\">https://arthurparzygnat.com/</a>, where you can find papers, notes, videos, etc., but I am a bit behind on keeping it fully updated. <br>\nI'm hoping to learn more about the relationship between data, statistics, statistical models, and probability theory (in a language I can understand!).</p>",
        "id": 199674101,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1591216928
    },
    {
        "content": "<p>Hi all. I am currently a postdoc in Siegen, Germany, working mainly on foundations of quantum theory, mainly GPTs and various related frameworks. I also have a background in applied mathematics and my first paper ever was on cosmology. I am mainly interested in the convex structures of physical theories, where category theory keeps appearing more and more often.</p>",
        "id": 199716746,
        "sender_full_name": "Martin Plávala",
        "timestamp": 1591258577
    },
    {
        "content": "<p>My name is Bas Spitters. I'll be speaking on Sunday about our work on the Giry monad in synthetic topology (<a href=\"http://arxiv.org/abs/1912.07339\">http://arxiv.org/abs/1912.07339</a>) and it's relation to homotopy type theory.<br>\nThis is also connected the augur language as explained in our: <br>\nDaniel Huang, Greg Morrisett, Bas Spitters, An Application of Computable Distributions to the Semantics of Probabilistic Programs<br>\n<a href=\"https://arxiv.org/abs/1806.07966\">https://arxiv.org/abs/1806.07966</a></p>",
        "id": 199737226,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1591272742
    },
    {
        "content": "<p>Hi! I'm Martti and I'm a postdoc at uOttawa in Canada. My main interests are in CT and its applications. In particular, I'm interested in questions of quantum contextuality, and there I'm seeing structures that seem to relate to categorical probability, which brings me here. Roughly speaking, in the setup I'm interested in classical probability amounts to probability over a point, but more general no-signalling correlations are about probability over arbitrary simplicial complexes.</p>",
        "id": 199774123,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1591288530
    },
    {
        "content": "<p>Hello!  I am Rory Lucyshyn-Wright, one of the organizers of the workshop.  I am a mathematician specializing in category theory, at Brandon University in Canada.  My web page is at <a href=\"http://www.lucyshyn-wright.ca/\">http://www.lucyshyn-wright.ca/</a> .</p>",
        "id": 199818735,
        "sender_full_name": "Rory Lucyshyn-Wright",
        "timestamp": 1591311290
    },
    {
        "content": "<p>Hi!  I like your paper on enriched Lawvere theories.</p>",
        "id": 199819097,
        "sender_full_name": "John Baez",
        "timestamp": 1591311543
    },
    {
        "content": "<p>Hi! I'm Oliver Shetler. I am currently a Masters student at Hunter College, getting a degree in Statistics. I've been organizing Category Theory reading groups for about a year, and I will write my dissertation on describing rhetorical figures as linguistic variates using categorical grammars. I plan to pursue a Ph.D. in applied mathematics after completing my Masters degree. I'm just getting started with both Category Theory and Probability / Statistics, but I'm excited to be here as an observer.</p>",
        "id": 199819956,
        "sender_full_name": "Oliver Shetler",
        "timestamp": 1591312188
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/238032-Categorical-Probability.20and.20Statistics.202020.20workshop/topic/Introductions/near/199819097\">said</a>:</p>\n<blockquote>\n<p>Hi!  I like your paper on enriched Lawvere theories.</p>\n</blockquote>\n<p>Thanks John.</p>\n<p>For everyone interested in enriched algebraic theories and monads, here are some papers of mine on that subject:</p>\n<p><a href=\"http://www.tac.mta.ca/tac/volumes/31/5/31-05.pdf\">Enriched algebraic theories and monads for a system of arities</a>. Theory and Applications of Categories 31 (2016), 101-137. <a href=\"http://arxiv.org/abs/1511.02920\">arXiv:1511.02920</a></p>\n<p><a href=\"http://doi.org/10.1007/s10485-017-9503-1\">Commutants for enriched algebraic theories and monads</a>. Applied Categorical Structures 26 (2018), 559-596.  <a href=\"http://arxiv.org/abs/1604.08569\">arXiv:1604.08569</a></p>\n<p><a href=\"http://doi.org/10.1016/j.aim.2017.09.027\">Functional distribution monads in functional-analytic contexts</a>. Advances in Mathematics 322 (2017), 806-860. <a href=\"http://arxiv.org/abs/1701.08152\">arXiv:1701.08152</a></p>\n<p>The latter paper gives a general categorical construction that yields several monads of measures and distributions as special cases, alongside several monads of filters.</p>",
        "id": 199823600,
        "sender_full_name": "Rory Lucyshyn-Wright",
        "timestamp": 1591315301
    },
    {
        "content": "<p>Hi!  I'm Sam Tenka.  I don't know much about probability or category theory, but I am eager to learn.  Like Batman, I have two identities: by day, I think about how to get computers to program themselves.  By night, I try to sleep.</p>",
        "id": 199823661,
        "sender_full_name": "Sam Tenka",
        "timestamp": 1591315343
    },
    {
        "content": "<p>Hello all! As will be apparent from these introductions, we have people with a broad range of areas of expertise and degrees of seniority. So please feel free to discuss categorical probability and statistics and start new topics at any level. Everything is welcome, from (seeminly) basic to cutting-edge research, but especially the basic stuff.</p>",
        "id": 199825477,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1591317225
    },
    {
        "content": "<p>Hi everyone, I'm Evan. I'm just finishing my PhD in statistics. I've also been interested in ACT for several years now. On Saturday, I'll give a talk about how to understand statistical models from the viewpoint of categorical logic. During the workshop, I'm hoping to learn more about how category theory can interact with probabilistic programming languages.</p>",
        "id": 199828342,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1591320741
    },
    {
        "content": "<p>Hi! I'm a theoretical computer scientist working in the mathematics department at the University of Ljubljana in Slovenia, where I have been since 2015. Before that I was at the School of Informatics at the University of Edinburgh for 25 years. </p>\n<p>I'm interested in the foundations of mathematics and computer science in general, and especially  in applications  of category theory and logic in the two areas. I am particularly intrigued by topics in which taking a computational viewpoint can influence the mathematical development. Probability theory is very much such a subject.</p>\n<p>I am looking forward to the programme, and to meeting others with similar interests. It's also nice to see several old friends here!</p>",
        "id": 199843845,
        "sender_full_name": "Alex Simpson",
        "timestamp": 1591342849
    },
    {
        "content": "<p>Just bumping this in case that others still want to add introductions :) It would be great to read them!</p>",
        "id": 200027235,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1591541254
    },
    {
        "content": "<p>Hello all, I'm a PhD student at Oxford working with Sam Staton. I work on probabilistic programming languages, which I like to see as the internal language of categorical probability theory. Most of my current work goes into understanding quasi-Borel function spaces, which have fascinating connections to fresh name-generation and are non-positive in Tobias' terminology. I'm also interested in conditioning.</p>",
        "id": 200033910,
        "sender_full_name": "Dario Stein",
        "timestamp": 1591551160
    }
]