[
    {
        "content": "<p>Often, when undergraduate and graduate students in CS are assigned their first project involving string diagrams, or simply express curiosity about the subject, they find themselves wondering where to start. With <span class=\"user-mention\" data-user-id=\"351836\">@Fabio Zanasi</span>, we wrote this introduction to provide a starting point (which grew out of notes designed to onboard students in our own research). The idea is to offer a glimpse into the state of research with string diagrams in 2023. </p>\n<p>It is first draft---we eagerly welcome comments and feedback to improve its content!</p>\n<p><a href=\"https://arxiv.org/abs/2305.08768\">https://arxiv.org/abs/2305.08768</a></p>",
        "id": 358647820,
        "sender_full_name": "Robin Piedeleu",
        "timestamp": 1684223304
    },
    {
        "content": "<p>This is sure exciting! I'll give it a read at some point! In your opinion, for a CS student, what would be their expected/recommended background with understanding string diagrams (like perhaps in terms of prior classes, exposures to ideas, etc.)? <span class=\"user-mention\" data-user-id=\"277342\">@Robin Piedeleu</span> and <span class=\"user-mention\" data-user-id=\"351836\">@Fabio Zanasi</span> ?</p>",
        "id": 358764017,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1684249878
    },
    {
        "content": "<p>It really depends under which perspective string diagrams are introduced. The way we do it in this paper, it is useful to be familiar with how the syntax of a programming language is presented via BNF/grammars. Also knowing what 'operational semantics' and 'denotational semantics' of a PL is helps. Finally, exposure to some basic algebra of datatypes (which may come from Haskell for instance, but also from a basic course on groups/monoids etc.)</p>",
        "id": 358769276,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684250968
    },
    {
        "content": "<p>I would say though that, at least for the first few pages, we try not to assume anything without at least reminding the reader first.</p>",
        "id": 358769540,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684251018
    },
    {
        "content": "<p>This looks great!   I'll advertise it on Mathstodon.</p>",
        "id": 358788279,
        "sender_full_name": "John Baez",
        "timestamp": 1684255070
    },
    {
        "content": "<p>An incredibly tiny comment: where you say \"certain areas of computer science, such as quantum theory\" it might be better to say \"such as quantum computation\" or something like that, because the current phrasing suggests that quantum theory is (merely?) an area of computer science, which will shock some physicists.   I know that's not what you meant, but people have an amazing ability to misread things.</p>",
        "id": 358788686,
        "sender_full_name": "John Baez",
        "timestamp": 1684255165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/An.20Introduction.20to.20String.20Diagrams.20for.20Computer.20Scientists/near/358788686\">said</a>:</p>\n<blockquote>\n<p>An incredibly tiny comment: where you say \"certain areas of computer science, such as quantum theory\" it might be better to say \"such as quantum computation\" or something like that, because the current phrasing suggests that quantum theory is (merely?) an area of computer science, which will shock some physicists.   I know that's not what you meant, but people have an amazing ability to misread things.</p>\n</blockquote>\n<p>Fair point! We're going to release v2 soon and will amend this kind of things.</p>",
        "id": 358788880,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684255205
    },
    {
        "content": "<p>\"such as those involving quantum theory\" would work.</p>",
        "id": 358788910,
        "sender_full_name": "John Baez",
        "timestamp": 1684255214
    },
    {
        "content": "<p>Another equally tiny, nitpicky comment:</p>\n<blockquote>\n<p>Having products is a <em>property</em> of a category.  A monoidal product, on the other hand, is a <em>structure</em> over a category.</p>\n</blockquote>\n<p>This is a great point to make.  I think the correct phrasing is \"structure <strong>on</strong> a category\".</p>",
        "id": 358789914,
        "sender_full_name": "John Baez",
        "timestamp": 1684255421
    },
    {
        "content": "<blockquote>\n<p>An incredibly tiny comment: where you say \"certain areas of computer science, such as quantum theory\" it might be better to say \"such as quantum computation\" or something like that, because the current phrasing suggests that quantum theory is (merely?) an area of computer science, which will shock some physicists. I know that's not what you meant, but people have an amazing ability to misread things.</p>\n</blockquote>\n<p>I have some memory of a (famous?) computer scientist remarking during a talk that mathematics is a branch of computer science</p>",
        "id": 358814837,
        "sender_full_name": "Todd Schmid (he/they)",
        "timestamp": 1684260947
    },
    {
        "content": "<p>I'll try to dig up the story...</p>",
        "id": 358815222,
        "sender_full_name": "Todd Schmid (he/they)",
        "timestamp": 1684261036
    },
    {
        "content": "<p>A couple of things I found missing while skimming through.</p>\n<ul>\n<li>I would like to see simple examples of proofs using diagrammatic reasoning. You explain the idea in Remark 2.13, but I would also like several simple examples like proving that left unitality + commutativity implies right unitality in the theory of commutative monoids. Carefully expliciting alI the steps and possibly comparing them to the steps in the  derivation using equational reasoning could help. Even in that simple proof, the sliding of the unit has raised questions when I showed it once because of the invisible wire. I think it would be nice to have 1 or 2 more examples.</li>\n<li>I would like the software list to also have typesetting software/libraries.</li>\n</ul>",
        "id": 358833181,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1684266430
    },
    {
        "content": "<p>I don't know what examples of proofs using diagrammatic reasoning are in this paper, but if the hardest example is something like \"left unitality + commutativity <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>→</mo></mrow><annotation encoding=\"application/x-tex\">\\to</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.3669em;\"></span><span class=\"mrel\">→</span></span></span></span> right unitality\", some people will wonder what's the point.  After all, we usually just say</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mn>1</mn><mo>=</mo><mn>1</mn><mi>x</mi><mo>=</mo><mi>x</mi></mrow><annotation encoding=\"application/x-tex\"> x1 = 1x = x</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mord\">1</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6444em;\"></span><span class=\"mord\">1</span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">x</span></span></span></span></p>\n<p>and be done with it.  Yes, you're doing it in greater generality.  But there are some proofs where string diagrams really make things a lot easier.</p>",
        "id": 358870101,
        "sender_full_name": "John Baez",
        "timestamp": 1684282942
    },
    {
        "content": "<p>Another thing you might add is a few examples of tools in computer science that are (secretly, or not so secretly) using string diagrams.  When I advertised this paper, <a href=\"https://mathstodon.xyz/@jesuslop/110380407576880343\">Jesus Lopez</a> pointed out the example of UML (Unified Modeling Language, a popular diagram-based modeling environment).</p>",
        "id": 358870387,
        "sender_full_name": "John Baez",
        "timestamp": 1684283128
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"283877\">Todd Schmid</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/An.20Introduction.20to.20String.20Diagrams.20for.20Computer.20Scientists/near/358814837\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>I have some memory of a (famous?) computer scientist remarking during a talk that mathematics is a branch of computer science</p>\n</blockquote>\n</blockquote>\n<p>Robert Harper?<br>\n<a href=\"https://twitter.com/lindsey/status/161997443616083968\">https://twitter.com/lindsey/status/161997443616083968</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/lindsey/status/161997443616083968\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/581e7429c57478e65e740d821a42c3b4891bce49/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313032373633313635393239363738303238392f38316a48634f4c395f6e6f726d616c2e6a7067\"></a><p>\"Math is a branch of theoretical computer science.\" -- Bob Harper #popl #plmw</p><span>- Lindsey Kuper (@lindsey@recurse.social) (@lindsey)</span></div></div><p>But have not been able to find what talk that was.</p>",
        "id": 358910076,
        "sender_full_name": "Viljami Virolainen",
        "timestamp": 1684308147
    },
    {
        "content": "<p>heh, imo \"a proof is when you program paper\" is not a bad way to define constructive proofs to programmers, especially because it can be made rigorous via Curry-Howard etc</p>",
        "id": 358922232,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1684312455
    },
    {
        "content": "<p>I advertised this paper on Mastodon, and <span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> <a href=\"https://mathstodon.xyz/@highergeometer/110380494594536144\">made a good point</a>.  The first main page of the paper throws some expressions in Backus-Naur form at the reader.  A lot of computer scientists are familiar with BNF, but 1) a lot of people, including most mathematicians, are not, and 2) as far as I can tell the rest of the paper doesn't use BNF.  So this seems like a bit of unnecessary \"gatekeeping\", falsely making readers feel that if they don't understand this stuff they won't be able to read the rest of the paper.</p>",
        "id": 359027935,
        "sender_full_name": "John Baez",
        "timestamp": 1684341091
    },
    {
        "content": "<p>Thanks for reporting this point. A couple of counter-points:<br>\n1) Overall I tend to agree to the replies that say that our intention, already manifested in the title, is to make an introduction primarly aimed at computer scientists. There are already quite a few entry points for mathematicians and physicists, and we were interested in the idea of proposing a different perspective.<br>\n2) Having said that, I don't find the incipit with the grammars so discouraging, even for people with a different background. It's a simple inductive definition in disguise. Importantly, we don't really make assumptions about its understanding: we report in words what that expression means and what's its purpose. <br>\n3) Even though it's not used later, I believe it's important to draw a connection between BNF and string diagrams, because it highlights the importance of syntactic specifications. To a CS student seeing it with a BNF will look more familiar than with, say, signatures and algebras, which is what perhaps would look more familiar to a matematician.</p>",
        "id": 359652128,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684501039
    },
    {
        "content": "<p>Any CS student who doesn't understand BNF has either just started or has been very ill-served by their university. Given the clearly expository nature of the paper and the tendency of CT (as a subject and a community) to obscurity and jargon there is a glass house or black pot adjacent to any serious claim to gatekeeping that almost anyone other than an expositor like <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> could possibly make</p>",
        "id": 359657204,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684502013
    },
    {
        "content": "<p>If BNF were used in the paper it would be fine to put it on the first page like the sign on Plato's Academy saying \"let no one ignorant of geometry enter here\".  But I didn't see it used anywhere else.</p>",
        "id": 359696192,
        "sender_full_name": "John Baez",
        "timestamp": 1684509996
    },
    {
        "content": "<p>I don't see that. We are starting from something very basic, and we also explain it. It's not like we begin with geometry of interaction just to be fancy. And I re-iterate that if one reads the first page in  its entirety, it should be understandable even to someone that has not encountered grammars before. Especially if you compare (1) with the example of natural numbers given immediately below (I hope induction on natural numbers is considered universal enough, at least). I find any claim of gatekeeping unwarranted here.</p>",
        "id": 359702002,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684511370
    },
    {
        "content": "<p>My big mistake was making my second comment here: it added nothing new.   Note to self: suggesting changes to a paper is probably best done privately - and if the author doesn't want to make those changes, then let it drop!</p>",
        "id": 359766212,
        "sender_full_name": "John Baez",
        "timestamp": 1684529882
    },
    {
        "content": "<p>That syntax (in the form of BNF etc) isn't usually visible in mathematics is an old tragedy: Godel's critique of Principia Mathematica was that its syntax was a step back from Frege's (which incidentally, was also partly diagrammatic).  Even books like Enderton's classic on first order logic defines the syntax of FOL in a way that a computer scientist would find unusual nowadays.  This phenomenon is especially surprising to me because so many early results in group theory were about syntax, and its invariance under substitutions of various kinds, etc.  Anyway, here's Godel: </p>\n<p>\"It is to be regretted that this first comprehensive and thorough-going presentation of a mathematical logic and the derivation of mathematics from it [is] so greatly lacking in formal precision in the foundations (contained in <em>1-</em>21 of Principia) that it represents in this respect a considerable step backwards as compared with Frege. What is missing, above all, is a precise statement of the syntax of the formalism. Syntactical considerations are omitted even in cases where they are necessary for the cogency of the proofs\".</p>",
        "id": 359769372,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1684531017
    },
    {
        "content": "<p>Math should be more syntactic and will be more syntactic, whether people like it or not. People based math on abstract principles such as: existence, equality, true and false. But computers don't understand anything of that and so we are now obligated to find more sane foundations. At the same time, super abstract math also converge towards more syntactic stuff based on type theory because it happens that it is what we need to prove difficult things. I likely imagine than in 50 years, proofs of big theorems will consist into a sequence of 5000 rewriting rules relating two terms of the same type in some syntax. Well I don't know maybe not exactly, I want to say things on this subject but every time I write something, I erase it because I think \"Hmm no, it's not exactly that, in fact I don't understand anything to these matters.\"</p>",
        "id": 359782755,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684537667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/An.20Introduction.20to.20String.20Diagrams.20for.20Computer.20Scientists/near/359782755\">said</a>:</p>\n<blockquote>\n<p>Math should be more syntactic and will be more syntactic, whether people like it or not. People based math on abstract principles such as: existence, equality, true and false. But computers don't understand anything of that and so we are now obligated to find more sane foundations. At the same time, super abstract math also converge towards more syntactic stuff based on type theory because it happens that it is what we need to prove difficult things. I likely imagine than in 50 years, proofs of big theorems will consist into a sequence of 5000 rewriting rules relating two terms of the same type in some syntax. Well I don't know maybe not exactly, I want to say things on this subject but every time I write something, I erase it because I think \"Hmm no, it's not exactly that, in fact I don't understand anything to these matters.\"</p>\n</blockquote>\n<p>TBH the stuff you imagine 50 years from now is my definition of 'the stuff from nightmares'.</p>",
        "id": 359789407,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1684541997
    },
    {
        "content": "<p>For me it's very easy: You like 'math on paper'? Probably you are a semantics person. You like 'convincing computers than your proofs make sense'? Probably you are a syntax person. I've always considered logic to be like a language, with maths being the literature expressed in that language. Probably it is already evident from this intuitive perspective that I've always considered myself  as a very semantics-oriented person. Clearly I recognize the importance of syntax, even more now that we live in the age of 'nice automated theorem provers' (where by nice I mean 'the amount of tears you cry while using them has a vague upper bound'). Still, the idea of 'converging towards a more syntax-based mathematics' is repulsive to me, as it makes me feel like the human equivalent of a panda in a zoo. I'd really like to survive the singularity.</p>",
        "id": 359789720,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1684542217
    },
    {
        "content": "<p>you're saying mathematicians aren't just machines for turning coffee into proofs faster than a computer can systematically enumerate all of them, Fabrizio? like a late John Henry racing his hands against a steam engine?  I'm joking of course</p>",
        "id": 359790092,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1684542483
    },
    {
        "content": "<p>If a computer proves something and nobody is around to understand or use it, does it matter? The four-color theorem didn't change anything. Everyone knew it was true before and nobody learned much of anything from the proof except that it was so uninteresting a human could not be bothered to do it directly. If proof assistants become orders of magnitude more effective with their tactics, then great. Who really cares about the details of a 900 page proof of some theorem in general relativity versus its mere correctness and any key ideas that might be extracted? If a computer can prove something, surely it can summarize the proof as well. So we can concentrate not on proofs, but on ideas and applications. Wonderful!</p>",
        "id": 359795579,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684547063
    },
    {
        "content": "<p>If we all turn into critics, curators, or engineers instead of artists then great. If artistry isn't actually that special after all compared to the appreciation and use of it, then it will be a funny twist on the old conceit that the opposite was true.</p>",
        "id": 359796408,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684547771
    },
    {
        "content": "<p>It's a basic fact of mathematical exposition that if you don't need to use something later, or aren't going to explain what it is and why the reader needs to spending time thinking about it, then what is that thing actually contributing to the piece? If the article had added a single sentence reminding the reader what a BNF specification of a grammar <em>does</em> (inductively generate programs, in this case with reasoning about natural numbers, and loops or whatever), even though you assume every reader is familiar with it, I would not have blinked. It doesn't hurt <em>adding</em> reasonably basic stuff to an expository paper (to a point), in the same way that a colloquium goes over points most people in the audience are completely familiar with.</p>",
        "id": 359814815,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1684563685
    },
    {
        "content": "<p>Remember that it is supposed to be a paper for computer scientists... I don't think than BNF is usually introduced by  CS guys as a sequence 1) blablaba it does that 2) definition 3) examples. CS people don't seem to be offended that you introduce BNF only by showing one or two examples of syntax defined in the BNF way without the canonical sequence as above. They are not math people and it's ok for them to write things like this as far as I understand. So, the critics here for me are just the reaction of math guys that want CS guys to write CS stuff like math guys and CS guys don't really care about this speech because they just want that math guys let them do their stuff as they are used to do. That's my understanding of what's going on here in this debate from a \"sociological perspective\" as a person who likes CS and math at the same time. I think that it is important to take into account the background of each person to understand this interaction.</p>",
        "id": 359819450,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684566276
    },
    {
        "content": "<p>Because this is not really a debate about something but more the result of putting different people together, introduce a subject they deal with differently, and see what happens.</p>",
        "id": 359820158,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684566584
    },
    {
        "content": "<p>I find it really funny.</p>",
        "id": 359820242,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684566605
    },
    {
        "content": "<p>Ah well. You know your audience and target. I was just thinking the audience could be even broader, with a very minor tweak.</p>",
        "id": 359869256,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1684582163
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/An.20Introduction.20to.20String.20Diagrams.20for.20Computer.20Scientists/near/359814815\">said</a>:</p>\n<blockquote>\n<p>If the article had added a single sentence reminding the reader what a BNF specification of a grammar <em>does</em> (inductively generate programs, in this case with reasoning about natural numbers, and loops or whatever), even though you assume every reader is familiar with it, I would not have blinked. </p>\n</blockquote>\n<p>You may find it's not exactly what you wanted, but I think we do have such sentence, immediately below the equation:<br>\n<a href=\"/user_uploads/21317/UyN3zrD22SYWeKSz-5KcnJG3/Screenshot-2023-05-22-at-15.47.23.png\">Screenshot-2023-05-22-at-15.47.23.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/UyN3zrD22SYWeKSz-5KcnJG3/Screenshot-2023-05-22-at-15.47.23.png\" title=\"Screenshot-2023-05-22-at-15.47.23.png\"><img src=\"/user_uploads/21317/UyN3zrD22SYWeKSz-5KcnJG3/Screenshot-2023-05-22-at-15.47.23.png\"></a></div><p>By the way, we are publishing v2 of the introduction (it should be on the ArXiv anytime soon), with more examples of diagrammatic reasoning and incorporating other suggestions we received. We also tweaked this initial part, in the hope of making it even clearer. However, it is not a major revision: a deep dive into grammars is going to distract the reader from the main point we are trying to make there.</p>",
        "id": 360297005,
        "sender_full_name": "Fabio Zanasi",
        "timestamp": 1684767297
    },
    {
        "content": "<p>By the way, I think David and I would agree that a deep dive into grammars is <em>not</em> called for!   In fact it's almost the opposite of what were asking for.  We'd like such a shallow dive that the reader barely sees the water.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 360363928,
        "sender_full_name": "John Baez",
        "timestamp": 1684785494
    }
]