[
    {
        "content": "<p>You may have spotted mine and <span class=\"user-mention\" data-user-id=\"282722\">@Jens Hemelaer</span>'s new paper, <strong>Geometric morphisms between toposes of monoid actions: factorization systems</strong> hitting <a href=\"https://arxiv.org/abs/2203.09133\">arXiv</a> last week.</p>\n<p>This paper is part of our ongoing long-term collaboration on translating ideas between semigroup theory and topos theory, to get a better understanding of both. In this paper we focused on translating properties of geometric morphisms into properties of the semigroup homomorphisms and bi-actions which one can use to generate geometric morphisms. Since there are many many properties of geometric morphisms out there, we chose to focus on the properties featuring in factorization systems, and more specifically in factorization systems which were compatible enough with the algebraic data for us to be able to derive meaningful results.</p>\n<p>Personally, my hope is that this will:</p>\n<ol>\n<li>Make geometric morphisms and some of their properties more accessible.</li>\n<li>Make it easier to construct examples and counterexamples of geometric morphisms with certain properties.</li>\n<li>Connect topos theory with a few more people!</li>\n</ol>\n<p>Please let us know if you have any comments or questions. This work will surely be extended in various directions in future, so it would be nice to know what readers are interested in understanding.</p>",
        "id": 276023898,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1647854868
    },
    {
        "content": "<p>Does this line of work have any potential connections with <em>finite</em> semigroup theory / algebraic language theory?</p>",
        "id": 276069954,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1647877145
    },
    {
        "content": "<p>I would speculate that yes, but you'll have to be more specific for me to be able to answer definitively.</p>",
        "id": 276078097,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1647880191
    },
    {
        "content": "<p>Typically I wonder whether there are topos-theoretic characterizations of <a href=\"https://en.wikipedia.org/wiki/Variety_of_finite_semigroups\">varieties of finite semigroups</a></p>",
        "id": 276080949,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1647881230
    },
    {
        "content": "<p>Hmm. Well, from our previous papers, finiteness of monoids is Morita-invariant, but we haven't identified the corresponding topos-theoretic property (it must be strictly stronger than strong compactness, which is necessary, and sufficient in the special case of groups). I expect this property to be stable under pullback and composition, at which point the variety of finite monoids can be identified with the class of toposes having this property. At that point, it should be possible to translate between equational conditions and properties of toposes of actions.<br>\nI would have to know more about what kinds of question people ask about these varieties to determine whether any of that work could be worthwhile, but it's nice to be reminded that finiteness is a simple condition we haven't completely characterized yet.</p>",
        "id": 276082793,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1647881977
    },
    {
        "content": "<p>In algebraic language theory, given a variety V, people look at the word languages recognized by morphisms from free monoids into monoids of V, and try to give alternative characterizations. For instance aperiodic monoids correspond to both star-free regular expressions and first-order logic.</p>",
        "id": 276097379,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1647888466
    },
    {
        "content": "<p>That actually sounds like a great target for us, since it amounts to identifying the constraints on geometric morphisms given properties of their codomain. However, I don't think there is a lot to be gleaned from what we've done so far.</p>",
        "id": 276109292,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1647894704
    }
]