[
    {
        "content": "<p>My paper “Enriched structure-semantics adjunctions and monad-theory equivalences for subcategories of arities” with Rory Lucyshyn-Wright is <a href=\"https://arxiv.org/abs/2305.07076\">now available on the arXiv</a>. In this paper, we develop an axiomatic framework for treating enriched structure-semantics adjunctions and monad-theory equivalences in the setting of a <em>subcategory of arities</em>. We show that our framework encompasses a vast number of prior results on these topics. We also establish that our framework applies in great generality to many new examples of interest given by enriching in various convenient categories in topology and analysis, which are examples that have not been captured by any previous works on this topic. Here's the full abstract:</p>\n<hr>\n<p><strong>Enriched structure-semantics adjunctions and monad-theory equivalences for subcategories of arities</strong></p>\n<p>Lawvere's <em>algebraic theories</em>, or <em>Lawvere theories</em>, underpin a categorical approach to general algebra, and Lawvere's adjunction between <em>semantics</em> and algebraic <em>structure</em> leads to an equivalence between Lawvere theories and finitary <em>monads</em> on the category of sets. Several authors have transported these ideas to a variety of settings, including contexts of category theory enriched in a symmetric monoidal closed category. In this paper, we develop a general axiomatic framework for enriched structure-semantics adjunctions and monad-theory equivalences for <em>subcategories of arities</em>. Not only do we establish a simultaneous generalization of the monad-theory equivalences previously developed in the settings of Lawvere (1963), Linton (1966), Dubuc (1970), Borceux-Day (1980), Power (1999), Nishizawa-Power (2009), Lack-Rosický (2011), Lucyshyn-Wright (2016), and Bourke-Garner (2019), but also we establish a structure-semantics theorem that generalizes those given in the first four of these works while applying also to the remaining five, for which such a result has not previously been developed. Furthermore, we employ our axiomatic framework to establish broad new classes of examples of enriched monad-theory equivalences and structure-semantics adjunctions for subcategories of arities enriched in locally bounded closed categories, including various convenient closed categories that are relevant in topology and analysis and need not be locally presentable.</p>\n<hr>\n<p>I've given a few talks on this work over the past year, including at the 2022 ACT conference (all slides and videos can be found <a href=\"https://www.jasonparkermath.com/\">on my website</a>). Rory Lucyshyn-Wright and I will also be presenting this work at the upcoming CT2023 conference in July.</p>",
        "id": 358533530,
        "sender_full_name": "Jason Parker",
        "timestamp": 1684173274
    }
]