[
    {
        "content": "<p>Hi all, I rewrote my paper on an extensible diagrammatic language for drawing the \"missing diagrams\" in CT and I would like to ask one thing here before submitting it (tomorrow!)... its abstract - below - makes a bold claim - in boldface...</p>",
        "id": 274787710,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646885816
    },
    {
        "content": "<p>Most texts on Category Theory are written in a very terse style, in which people pretend a) that all concepts are visualizable, and b) that the readers can reconstruct the diagrams that the authors had in mind based on only the most essential cues. As an outsider I spent years believing that the techniques for drawing diagrams were part of the oral culture of the field, and that the insiders could read texts on CT reconstructing the \"missing diagrams\" in them line by line and paragraph by paragraph, and drawing for each page of text a page of diagrams with all the diagrams that the authors had omitted. My belief was wrong: there are lots of conventions for drawing diagrams scattered through the literature, <strong>but that unified diagrammatic language did not exist</strong>. In this chapter I will show an attempt to reconstruct that (imaginary) language for missing diagrams: we will see an extensible diagrammatic language, called DL, that follows the conventions of the diagrams in the literature of CT whenever possible and that seems to be adequate for drawing \"missing diagrams\" for Category Theory. Our examples include the \"missing diagrams\" for adjunctions, for the Yoneda Lemma, for Kan extensions, and for geometric morphisms, and how to formalize them in Agda.</p>",
        "id": 274787737,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646885865
    },
    {
        "content": "<p>So, if anyone here feels that he/she/they know how to supply the \"missing diagrams\" for many categorical texts, please say \"HI\"...</p>",
        "id": 274787833,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646885962
    },
    {
        "content": "<p>Here's one diagram from the paper:<br>\n<a href=\"/user_uploads/21317/SGGXM4dUNAosIf3-ELcGF1-J/sshot.png\">sshot.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/SGGXM4dUNAosIf3-ELcGF1-J/sshot.png\" title=\"sshot.png\"><img src=\"/user_uploads/21317/SGGXM4dUNAosIf3-ELcGF1-J/sshot.png\"></a></div>",
        "id": 274787955,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646886115
    },
    {
        "content": "<p>And here is a link to the paper itself:<br>\n<a href=\"http://angg.twu.net/LATEX/2022on-the-missing.pdf\">http://angg.twu.net/LATEX/2022on-the-missing.pdf</a></p>",
        "id": 274788136,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646886310
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276773\">Eduardo Ochs</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/On.20the.20the.20missing.20diagrams.20in.20Category.20Theory/near/274787737\">said</a>:</p>\n<blockquote>\n<p>Most texts on Category Theory are written in a very terse style, in which people pretend a) that all concepts are visualizable, and b) that the readers can reconstruct the diagrams that the authors had in mind based on only the most essential cues. </p>\n</blockquote>\n<p>I consider myself an insider but I don't myself employ such a visual mode of thinking, so I never even noticed that people (or a majority, or whatever) pretend that all concepts are visualisable. (That is not say I don't use diagrams. I do – but mainly to clarify what I mean when I have lots of anonymous arrows identified primarily by their formal domain and codomain.)</p>",
        "id": 274789681,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1646888040
    },
    {
        "content": "<p>If your claim is that a <em>formalized</em> \"diagrammatic language\" doesn't exist that encompasses all the sorts of diagrams that people draw, then that may be true.  But I don't think that contradicts an assertion that people can read a text on category theory and translate it into diagrams.</p>",
        "id": 274792622,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1646890868
    },
    {
        "content": "<p>You might like the book \"Categories, Allegories\". It open by presenting a formal language of diagrams.</p>",
        "id": 274794028,
        "sender_full_name": "Chad Nester",
        "timestamp": 1646892234
    },
    {
        "content": "<p>Although it might not be exactly what you're after.</p>",
        "id": 274794130,
        "sender_full_name": "Chad Nester",
        "timestamp": 1646892356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276114\">@Chad Nester</span>, \"Cats and Alligators\" and the paper that Freyd published in 1976 were some of my main influences! Take a look here: <a href=\"http://angg.twu.net/LATEX/2022on-the-missing.pdf#page=15\">http://angg.twu.net/LATEX/2022on-the-missing.pdf#page=15</a></p>",
        "id": 274796750,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646895154
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>, I've met very few people who were willing to share how they drew their diagrams, and in all of the few opportunites that I had to chat with them I asked lots of questions about what each entity in their diagrams meant and how we could translate their diagrams to other languages that were more formal. I was quite inconvenient - not on purpose - and we always reached very quickly conventions that they didn't know how to explain and things that they didn't know how to formalize... and that I didn't understand.</p>",
        "id": 274797833,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646896251
    },
    {
        "content": "<p>I hope that this paper would encourage them to show their diagrams to me and would help me to understand their diagrams... =/</p>",
        "id": 274797847,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646896268
    },
    {
        "content": "<p>I suspect you are expecting too much formality of diagrams in order to consider them \"explained\".</p>",
        "id": 274798831,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1646897291
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276773\">Eduardo Ochs</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/On.20the.20the.20missing.20diagrams.20in.20Category.20Theory/near/274787955\">said</a>:</p>\n<blockquote>\n<p>Here's one diagram from the paper:<br>\n<a href=\"/user_uploads/21317/SGGXM4dUNAosIf3-ELcGF1-J/sshot.png\">sshot.png</a></p>\n</blockquote>\n<p>What is being clarified by the diagram here? Is the positioning meaningful?</p>",
        "id": 274801568,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1646899385
    },
    {
        "content": "<p>I don't exactly agree in general that the answer to things not be explained clearly is more formalisation. But formalising diagrams is still a super interesting question. Sometimes <span class=\"user-mention\" data-user-id=\"277574\">@Conor McBride</span> talks about formalising diagrams too - in his case the goal is to communicate universal properties \"in their native language\" to a computer. Something he emphasises is that many diagrams have a sort of \"dynamics\" coming from the order of quantifiers. For example the definition of a pullback comes in 5 phases: given 2 arrows there exist 2 more arrows such that for any 2 more arrows, an arrow exists, and is equal to any other given arrow</p>",
        "id": 274817359,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1646908848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>, yes - the left half has the shape of an adjunction, the right half has the shape of the Yoneda Lemma (with a deleted node), and that whole diagram has exactly the same shape as the preceding one in the paper because it is a particular case of the preceding one. The list of conventions in section 2 includes several conventions on how diagrams with the same shape can be used.</p>",
        "id": 274829479,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1646916488
    },
    {
        "content": "<p>I wrote a paper where I tried to be very careful to include all the relevant diagrams and so on and the reviewer told me to remove them...</p>",
        "id": 274857299,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1646928769
    },
    {
        "content": "<p>Also kind of related: for a number of years I was under the impression that if you glued commutative diagrams together the resulting diagram would always be commutative. Of course, in reality there are certain topological obstructions to this. I haven't ever seen anyone ever discuss this in an introductory text or in a particularly comprehensive way. Though I admittedly haven't read Categories, Allegories and I think it might mention something about this.  (Actually, many texts don't give any definition at all for what it means for diagram to be commutative.)</p>",
        "id": 274857671,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1646928901
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"386922\">Graham Manuell</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/On.20the.20the.20missing.20diagrams.20in.20Category.20Theory/near/274857671\">said</a>:</p>\n<blockquote>\n<p>Also kind of related: for a number of years I was under the impression that if you glued commutative diagrams together the resulting diagram would always be commutative. Of course, in reality there are certain topological obstructions to this.</p>\n</blockquote>\n<p>True! That's Stokes theorem for commutative diagrams :) it only works if you around a commutative diagram. Or, in other words, if every 'irreducible' subdiagram of the glueing is commutative.</p>",
        "id": 274876539,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1646937085
    },
    {
        "content": "<p>IIRC Emily Riehl's 'Categories in context' covers the basic of diagram chasing in the first chapter, I always found that a very good choice.</p>",
        "id": 274876655,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1646937132
    }
]