[
    {
        "content": "<p>Hello everyone,</p>\n<p>I just posted the new preprint <a href=\"https://arxiv.org/abs/2208.07028\">Operads as double functors</a>, <br>\nwhich may be partly considered as an indexed (instead of fibered) version of the previous <a href=\"http://arxiv.org/abs/2201.01967\">Fibered multicategory theory</a>.<br>\nThe main achievement is the characterization of colored operads  (that is, symmetric multicategories) <br>\nas product-preserving double (lax) functors from the opposite of the double category of pullback squares in finite sets <br>\nto the double category of mappings and spans in sets; <br>\nor, equivalently, as <em>normal</em>  product-preserving double (lax) functors from the same double category<br>\n to that of functors and profunctors.<br>\nThis may be seen as a generalization of the characterization of commutative monoids <br>\nas product-preserving double functors from the opposite of the double category of pullback squares in finite sets <br>\nto the double category of squares in sets.<br>\nThis view suggests the concept of generalized operad (and of generalized commutative monoid) <br>\nobtained by replacing, in the above, the category of finite sets with any category C. <br>\nFor instance, if A is a category with small products (or sums) one gets a generalized operad with C = Set,<br>\nand by taking its isomorphism classes one gets the corresponding generalized monoid.</p>\n<p>I'm looking forward to receiving your feedback!</p>",
        "id": 294050810,
        "sender_full_name": "Claudio Pisani",
        "timestamp": 1660819386
    },
    {
        "content": "<p>Does this perspective shed any light on two-sided multicategory-like structures such as polycategories or props?</p>",
        "id": 294139433,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1660845350
    },
    {
        "content": "<p>I'm not sure, but I think that product-preserving double (lax) functors from the opposite of the double category Ref_f<br>\n(of mappings and relations on finite sets) to Span(Set), should indeed capture some natural  kind of two-sided multicategory-like structure.</p>",
        "id": 294209478,
        "sender_full_name": "Claudio Pisani",
        "timestamp": 1660890690
    }
]