[
    {
        "content": "<p>Bob Harper and I have released a new manuscript applying category theory and topos theory to type-based <strong>security</strong> in programming languages.</p>\n<p>Title: <strong>Sheaf semantics of termination-insensitive noninterference</strong><br>\nAuthors: Jonathan Sterling and Robert Harper<br>\nAbstract:</p>\n<blockquote>\n<p>We propose a new sheaf semantics for secure information flow over a space of abstract behaviors, based on synthetic domain theory: security classes are open/closed partitions, types are sheaves, and redaction of sensitive information corresponds to restricting a sheaf to a closed subspace. Our security-aware computational model satisfies termination-insensitive noninterference automatically, and therefore constitutes an intrinsic alternative to state of the art extrinsic/relational models of noninterference. Our semantics is the latest application of Sterling and Harper's recent re-interpretation of phase distinctions and noninterference in programming languages in terms of Artin gluing and topos-theoretic open/closed modalities. Prior applications include parametricity for ML modules, the proof of normalization for cubical type theory by Sterling and Angiuli, and the cost-aware logical framework of Niu et al. In this paper we employ the phase distinction perspective twice: first to reconstruct the syntax and semantics of secure information flow as a lattice of phase distinctions between \"higher\" and \"lower\" security, and second to verify the computational adequacy of our sheaf semantics vis-à-vis an extension of Abadi et al.'s dependency core calculus with a construct for declassifying termination channels.</p>\n</blockquote>\n<p>PDF: <a href=\"https://www.jonmsterling.com/papers/sterling-harper:2022.pdf\">https://www.jonmsterling.com/papers/sterling-harper:2022.pdf</a></p>\n<p>There may still be typos.</p>",
        "id": 271421368,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1644494533
    },
    {
        "content": "<p>Update: this paper is now accepted to FSCD '22!</p>",
        "id": 279434666,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1650386064
    }
]