[
    {
        "content": "<p>a couple of months ago i announced here a paper based on my daughter's ideas:<br>\nFrom Goedel's Incompleteness Theorem to the completeness of bot beliefs<br>\n<a href=\"https://arxiv.org/abs/2303.14338\">https://arxiv.org/abs/2303.14338</a></p>\n<p>a couple of you tried to read it and provided feedback. in the meantime, we put in more work, and i hope the new version is better. i am sure that it can still be improved, but it is not for a lack of effort if some things are still not clear. the problem is big and spans several areas, the coauthors come from different backgrounds...  but i think the question is important enough that it is worth the effort. so if you are interested in applying categories to self-fulfilling prophecies (e.g. the Three Witches in Macbeth), or to tipping points (e.g. how to bootstrap a social network), or to Keynes' beauty contest,  or to the logical process of lying --- here is at least a scaffolding, and i think also a general logical schema.</p>\n<p>there is no space for these examples in this extended abstract, but  will be presented in the full version in the tutorial before the WoLLIC talk <a href=\"https://www.mathstat.dal.ca/wollic2023/\">https://www.mathstat.dal.ca/wollic2023/</a></p>\n<p>THANKS again for the comments!</p>\n<p>FWIW, here is the abstract of the talk:</p>\n<p>From incompleteness of static theories to completeness of dynamic beliefs, in people and in bots</p>\n<p>Self-referential statements, referring to their own truth values, have been studied in logic ever since Epimenides. Self-fulfilling prophecies and self-defeating claims, modifying their truth values as they go, have been studied in tragedies and comedies since Sophocles and Aristophanes. In modern times, the methods for steering truth values in marketing and political campaigns have evolved so rapidly that both the logical and the dramatic traditions have been left behind in the dust. In this talk, I will try to provide a logical reconstruction of some of the methods for constructing self-confirming and self-modifying statements. </p>\n<p>The reconstruction requires broadening the logical perspective from static deductive theories to dynamic and inductive. While the main ideas are familiar from the theory of computation, the technical prerequisites may seem unfamiliar, but are combinations of familiar tools which will be explained in the introductory tutorial.</p>",
        "id": 371681192,
        "sender_full_name": "dusko",
        "timestamp": 1688293394
    }
]