[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span> and I are writing a paper on the split idempotents work started <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/Splitting.20an.20idempotent.20to.20quotient.20a.20monad\">here</a>. Since the mathematical content is not very deep or difficult, I am thinking it would be great to spend a lot of time on making the paper as accessible as possible with lots of explanations and examples. This makes me inclined to submit to TAC Expositions, but we are not completely sure what \"exposition\" means precisely.</p>\n<p>The style of the <a href=\"http://www.tac.mta.ca/tac/expositions/articles/1/te1abs.html\">only paper there</a> is more didactic than what I am used to, so that is a good sign, but reading it superficially, it also seems to be about results that have already appeared in the literature. Does \"expository\" just mean written with more pedagogical considerations, or does it also mean that it should be about stuff already recognized and appreciated elsewhere?</p>",
        "id": 387742655,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1693250922
    },
    {
        "content": "<p>From the <a href=\"http://www.tac.mta.ca/tac/expositions/geninfo_expos.html\">editorial policy</a>:</p>\n<blockquote>\n<p>Expositions in Theory and Applications of Categories (\"TAC Expositions\") is a special series specifically designed for publication of well-written and novel expository articles on topics of current research interest in the theory and/or applications of categories. While a TAC Exposition article need not include new results, it must be novel in either its arrangement or viewpoint, providing a new perspective or context for known results. Authors considering submitting an expository paper are advised to consult an editor on its suitability for TAC Expositions.</p>\n</blockquote>",
        "id": 387751879,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1693254747
    },
    {
        "content": "<p>However, that policy doesn't exactly address the question of whether a TAC Expositions article <em>can</em> include new results or whether it should be <em>purely</em> expository.  I'm an editor of TAC and I don't think I know the answer to that question either.</p>",
        "id": 387760745,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693258603
    },
    {
        "content": "<p>I got the impression that there were so few Exposition articles that the norms for them hadn't solidified yet.</p>",
        "id": 387767503,
        "sender_full_name": "John Baez",
        "timestamp": 1693262006
    },
    {
        "content": "<p>(Just one, I guess.)</p>",
        "id": 387767610,
        "sender_full_name": "John Baez",
        "timestamp": 1693262047
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/258900-practice.3A-our-papers/topic/TAC.20Expositions.20Policy/near/387760745\">said</a>:</p>\n<blockquote>\n<p>However, that policy doesn't exactly address the question of whether a TAC Expositions article <em>can</em> include new results or whether it should be <em>purely</em> expository.  I'm an editor of TAC and I don't think I know the answer to that question either.</p>\n</blockquote>\n<p>The wording \"need not include new results\" suggests to me that it may include new results.</p>",
        "id": 387769422,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1693263064
    },
    {
        "content": "<p>Or else they don't understand English grammar and they're trying to say it needs to not include new results.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 387830120,
        "sender_full_name": "John Baez",
        "timestamp": 1693296902
    },
    {
        "content": "<p>Just kidding.   I think you're right.</p>",
        "id": 387830199,
        "sender_full_name": "John Baez",
        "timestamp": 1693296936
    },
    {
        "content": "<p>Another category theory journal that allows expository papers but does not have many yet is <em>Compositionality</em>.  We are trying to figure out what kinds of expository papers we want - but not enough people are submitting them for us to  have concrete examples to think about.</p>",
        "id": 387830606,
        "sender_full_name": "John Baez",
        "timestamp": 1693297119
    },
    {
        "content": "<p>Hmm that's interesting, I do prefer Compositionality's template over TAC's.</p>",
        "id": 387832187,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1693297702
    }
]