[
    {
        "content": "<p>I've written a (mostly) expository paper that aims to bring order to some of the chaos surrounding \"generic objects\" in fibered category theory. Generic objects are important for internal category theory, but also for categorical logic (e.g. the theory of triposes), for type theory (the theory of universes), and for programming languages (denotational semantics of polymorphism).</p>\n<p><strong>Title:</strong> What should a generic object be?<br>\n<strong>Abstract:</strong> <br>\nJacobs has proposed definitions for (weak, unqualified, strong, split) generic objects for a fibered category; building on his definition of generic object and split generic object, Jacobs develops a menagerie of important fibrational structures with applications to categorical logic and computer science, including higher order fibrations, polymorphic fibrations, λ2-fibrations, triposes, and others. We observe that a split generic object need not in particular be a generic object under the given definitions, and that the definitions of polymorphic fibrations, triposes, etc. given by Jacobs are strict enough to rule out many fundamental examples that must be accounted for by any candidate definition. We argue for a new alignment of terminology that emphasizes the forms of generic object that appear most commonly in nature, i.e. in the study of internal categories, triposes, topoi, and the denotational semantics of polymorphic types. In addition, we propose a new class of acyclic generic objects inspired by recent developments in the semantics of homotopy type theory, generalizing the realignment property of universes to the setting of an arbitrary fibered category.</p>\n<p><strong>PDF</strong>: <a href=\"https://www.jonmsterling.com/papers/sterling:2022:generic-objects.pdf\">https://www.jonmsterling.com/papers/sterling:2022:generic-objects.pdf</a></p>",
        "id": 278455478,
        "sender_full_name": "Jon Sterling",
        "timestamp": 1649578786
    }
]