[
    {
        "content": "<p>What would be an appropriate translation of the phrase, \" On était juifsla plupart, et quand on était averti (par la police locale) qu’il y aurait des rafles de la Gestapo,on allait se cacher dans les bois pour une nuit ou deux, par petits groupes de deux ou trois,sans trop nous rendre compte qu’il y allait bel et bien de notre peau. \"</p>",
        "id": 212660470,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602146017
    },
    {
        "content": "<p>The following translation was suggested: \"Most of us were Jewish, and when we got warned (by the local police) that there were raids by the Gestapo(secret police of Nazi Germany) we were going to hide in the woods for a night or two, in small groups of size two or three, without realizing much that it saved our skin.\"</p>",
        "id": 212660557,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602146054
    },
    {
        "content": "<p>I think that the following would be a better translation, \"Most of us were <strong>Jews</strong>, and when we <strong>were</strong> warned (by the local police) that there <strong>would be</strong> raids by the Gestapo we <strong>would go to</strong> hide in the woods for a night or two, in small groups of size two or three, without realizing much that it saved our skin.\" (Although I don't understand the reference for \"skin\" here.) Any suggestions?</p>",
        "id": 212660655,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602146126
    },
    {
        "content": "<p>\"Saved our skin\" = \"saved our lives\".  It sounds natural to my (native English speaker) ear.  Hopefully that answers your question.</p>\n<p>Other colloquial forms:  \"Saved our butts\", \"Saved our hides\", \"Saved our bacon\".  The latter may not be in good taste, considering pigs are unclean according to Jewish law.</p>",
        "id": 212696974,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1602166981
    },
    {
        "content": "<p>\"Save our skin\" is a good colloquial expression for \"save our lives\".</p>",
        "id": 212715305,
        "sender_full_name": "John Baez",
        "timestamp": 1602174288
    },
    {
        "content": "<p>Depending on how colloquial the French is, \"saved our butts\" works too :-)</p>",
        "id": 212759815,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1602198043
    },
    {
        "content": "<p>The other bolded words/phrases make it smoother, I should add. Jew/Jewish both seem fine, though.</p>",
        "id": 212759899,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1602198117
    },
    {
        "content": "<p>Jew is better, I'd say.</p>",
        "id": 212763495,
        "sender_full_name": "John Baez",
        "timestamp": 1602201116
    },
    {
        "content": "<p>What would be an appropriate translation of the sentence, \"Peut-être parcequ’ils avaient tendance, à force, à ressembler un peu trop les uns aux autres ; mais surtout, jecrois, parce qu’ils tombaient un peu trop du ciel, comme ça à la queue-leue-leue, sans dire d’oùils venaient ni où ils allaient.\"</p>",
        "id": 213654873,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602945396
    },
    {
        "content": "<p>Google Translate says that: \"Perhaps because they tended, by force, to look a little too much to each other; but above all, I believe, because they were falling a little too much from the sky, like that in a single line, without saying where they came from or where they were going.\"</p>",
        "id": 213654917,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602945479
    },
    {
        "content": "<p><strong>Alternatives</strong>: </p>\n<ol>\n<li>\n<p>Perhaps because they had a forceful tendency to resemble each other a bit too much; but mostly, I believe, because I felt that they fell out of nowhere, [what would be an appropriate translation of \"comme ça à la queue-leue-leue\"?], without explaining where they came from or where they were going.</p>\n</li>\n<li>\n<p>Perhaps because they tended, forcefully, to resemble each other a bit too much; but mostly, I believe, because I felt that they fell out of nowhere, [what would be an appropriate translation of \"comme ça à la queue-leue-leue\"?], without explaining where they came from or where they were going.</p>\n</li>\n</ol>",
        "id": 213655272,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602945970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> I don't think that is what is intended. I think Grothendieck is simply expressing his frustration here that the problems he encountered then lacked motivation.</p>",
        "id": 213655459,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1602946266
    },
    {
        "content": "<p>Yes, I deleted my comment as soon as I read your translation.</p>",
        "id": 213655463,
        "sender_full_name": "John Baez",
        "timestamp": 1602946285
    },
    {
        "content": "<p>By the way, it's ungrammatical to say \"to resemble with each other\" - it should be \"to resemble each other\".</p>",
        "id": 213655468,
        "sender_full_name": "John Baez",
        "timestamp": 1602946303
    },
    {
        "content": "<p>I propose \"Perhaps because they tended, in the long run, to all look the same; but above all, I believe, because they came out of nowhere, one after the other, without revealing where they came from nor where they led to.\"</p>\n<p>Unfortunately, it's less poetic and uses less personification.</p>",
        "id": 213655675,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1602946681
    },
    {
        "content": "<p>\"à force\" does not have anything to do with force, it means something like \"in the long run\" with a bit of \"being bounded to\" and something to do with repetition.</p>",
        "id": 213655715,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1602946686
    },
    {
        "content": "<p>\"Lead to\" or \"led to\"? The rest of the sentence is in the past tense.</p>",
        "id": 213659822,
        "sender_full_name": "John Baez",
        "timestamp": 1602953003
    },
    {
        "content": "<p>\"led to\", thanks.</p>",
        "id": 213663078,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1602957509
    },
    {
        "content": "<p>Ralph Sarkis' version seems to get the gist of the statement in clear English.  Here's my attempt to tweak it to give back some of the poetic flow.  I do not guarantee that I succeed in the attempt to be poetic, nor do I vouch for how faithful it is to the original French.</p>\n<blockquote>\n<p>Perhaps because they tended, in the long run, to all look a bit too much alike; but above all, I believe, because it seemed a bit too much like they fell from the sky, one after another, saying nothing of where they came from or what they would lead to.</p>\n</blockquote>",
        "id": 213693532,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1603006165
    },
    {
        "content": "<p>I've been staring at this for too long, so I may have only succeeded at making the translation flow more awkwardly than it did before.  <span aria-label=\"oh no\" class=\"emoji emoji-1f615\" role=\"img\" title=\"oh no\">:oh_no:</span></p>",
        "id": 213693533,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1603006168
    },
    {
        "content": "<p>I like it.  I'm really curious who he's talking about!</p>",
        "id": 213713780,
        "sender_full_name": "John Baez",
        "timestamp": 1603038380
    },
    {
        "content": "<p>I like it!</p>",
        "id": 213731194,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1603063035
    },
    {
        "content": "<p>He is not really talking about anyone. Here \"they\" means \"problems of the textbook\".</p>",
        "id": 213738637,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1603075674
    },
    {
        "content": "<p>Oh!</p>",
        "id": 213739832,
        "sender_full_name": "John Baez",
        "timestamp": 1603077527
    },
    {
        "content": "<p>What would be an appropriate translation of the following phrase, \"Et le reste de l’année j’employais mon temps du mieux que je pouvais, pendant que le programme prévu était débité inexorablement, à longueur de trimestres.\"?</p>\n<p>Is \"And I spent the rest of the year as best as I could while the planned program was relentlessly churned through throughout trimesters\" ok?</p>",
        "id": 214924493,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1603944579
    },
    {
        "content": "<p>I take it you are translating \"débité\" as \"churned through\"?  I don't know French well enough to know how reasonable that is, but it is a bit awkward to have \"through throughout\" like that.  English does have a cognate \"inexorably\" for \"inexorablement\", which could be used instead of the synonym \"relentlessly\".  Not a criticism, per se – just a note.</p>\n<p>The main thing that strikes me as unidiomatic English is \"throughout trimesters\".  Google translate gives me \"throughout quarters\", which seems worse, both being unidiomatic and appearing to be less accurate.  I hesitate to add a definite article (throughout <strong>the</strong> trimesters), even though it would improve the English flow.  Perhaps \"across trimesters\" or \"each trimester\" works better?  So something like:</p>\n<p>\"And I spent the rest of the year as best as I could, while the planned program was inexorably churned through, across trimesters.\"</p>\n<p>I'm still not happy with it as a stand-alone sentence, so maybe someone else can polish it up better, or maybe it works better in context.</p>",
        "id": 214933137,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1603956321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/.22Recoltes.20et.20Semailles.22.20English.20Translation.20Requests/near/214933137\">said</a>:</p>\n<blockquote>\n<p>I take it you are translating \"débité\" as \"churned through\"?  I don't know French well enough to know how reasonable that is, but it is a bit awkward to have \"through throughout\" like that.  English does have a cognate \"inexorably\" for \"inexorablement\", which could be used instead of the synonym \"relentlessly\".  Not a criticism, per se – just a note.</p>\n</blockquote>\n<p>Indeed, it sounds awkward to me as well.</p>",
        "id": 214933692,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1603956859
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295542\">@Sayantan Roy</span>  can you share your translation?</p>",
        "id": 218565239,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1606920156
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319282\">Chetan Vuppulury</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/.22Recoltes.20et.20Semailles.22.20English.20Translation.20Requests/near/218565239\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"295542\">Sayantan Roy</span>  can you share your translation?</p>\n</blockquote>\n<p>Of this particular sentence?</p>",
        "id": 218566218,
        "sender_full_name": "Sayantan Roy",
        "timestamp": 1606920544
    },
    {
        "content": "<p>No, till how much ever you've completed?</p>",
        "id": 218572286,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1606922957
    }
]