[
    {
        "content": "<p>In Lack's paper <a href=\"http://www.tac.mta.ca/tac/volumes/13/9/13-09.pdf\">composing props</a> he works in the bicategory of profunctors internal to the category of monoids; regarding distributive laws of props as certain distributive laws of monads in Mon-Prof^op.  It seems to me like this is an internal, strict monoidal version of what would be the bicategory of Tamabara bimodules.  Can anyone confirm/does anyone have a reference for the (Set-enriched) bicategory of Tambara modules between (nonstrict) monoidal categories?</p>",
        "id": 388744644,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1693695638
    },
    {
        "content": "<p>In §3.2 of Spivak–Schultz–Rupel's <a href=\"https://arxiv.org/abs/1508.01069\">String diagrams for traced and compact categories are oriented 1-cobordisms</a>, they describe a double category of monoidal categories and monoidal distributors/profunctors, which ought to give the non-strict variant of the construction Lack considers.</p>\n<p>However, my understanding is that the term \"Tambara bimodule\" refers to <em>strong</em> distributors rather than monoidal distributors. Paré and Román define strong distributors in §3.5 of <a href=\"https://www.sciencedirect.com/science/article/pii/S0022404997000364\">Dinatural numbers</a>, though they don't define a bicategory or double category.</p>",
        "id": 388801823,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1693731973
    },
    {
        "content": "<p>(For what it's worth, I think the terminology \"Tambara module\" is needlessly confusing/ambiguous, when there is already a systematic naming scheme for such structures. Furthermore, Tambara was not the first to consider such structures, so it is not accurate to name them after him.)</p>",
        "id": 388802106,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1693732126
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 388839185,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1693756335
    },
    {
        "content": "<p>This was the topic of <span class=\"user-mention\" data-user-id=\"378472\">@Dylan Braithwaite</span>'s <a href=\"https://dylanbraithwaite.github.io/ct2023\">poster at last CT</a>... I guess me and him rediscovered some of the stuff in the papers Nathanael cited</p>",
        "id": 390477650,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1694510045
    }
]