[
    {
        "content": "<p>Yesterday, I watched my old friend <span class=\"user-mention\" data-user-id=\"279225\">@Paolo Brasolin</span> set up a category theory daily digest: every day at 6am arXiv's math.CT feed is scraped by an elf, all submissions of the day are downloaded, parsed, and summarized by GPT-something, which then proceeds to send an email containing a summary of the content of each paper: for example, today's <a href=\"https://arxiv.org/abs/2505.24010\">https://arxiv.org/abs/2505.24010</a> was summarized as:</p>\n<blockquote>\n<h1>Simplicial methods in the resource theory of contextuality</h1>\n<h2>Overview</h2>\n<p>The paper develops a resource theory of quantum contextuality framed in the language of symmetric monoidal categories and enriched by simplicial methods. It generalizes the presheaf-theoretic approach to contextuality using simplicial sets, enabling a incorporation of homotopical and probabilistic structures via the notion of simplicial distributions.</p>\n<h2>Key Concepts Introduced</h2>\n<p>Event Scenarios: A new category generalizing presheaf-based measurement scenarios. Event scenarios are functors from the opposite of a simplicial complex category to sets, satisfying locality, non-triviality, and local surjectivity conditions.<br>\nBundle Scenarios: Maps of simplicial complexes with properties ensuring local surjectivity and discreteness on vertices, connecting classical and simplicial frameworks. The authors prove equivalence between the category of event scenarios and bundle scenarios using the Grothendieck construction.<br>\nSimplicial Distributions and Empirical Models: Functors that assign convex sets of distributions to scenarios, built using the distribution monad and enriched by homotopy-theoretic structures from simplicial sets.<br>\nStochastic Simplicial Scenarios: Extension of simplicial scenarios by incorporating stochastic maps constructed using monads with a gluing operation, specifically the distribution monad, to capture probabilistic morphisms coherently across simplicial degrees.<br>\nResource Theory of Contextuality: The authors formalize the resource theory by forming symmetric monoidal categories of stochastic simplicial scenarios and their distributions, generalizing previous work that treated deterministic simulations and establishing a compositional framework.<br>\nMapping Scenarios: Internal hom objects providing a natural categorical construction for morphisms between scenarios, enabling a characterization of convex maps between simplicial distributions in terms of noncontextual distributions on the mapping scenario.</p>\n<h2>Main Results and Contributions</h2>\n<p>Equivalence of Categories: They show the category of event scenarios is equivalent to the category of bundle scenarios, bridging two perspectives through categorical methods.<br>\nExtension of Empirical Models: A unified framework for empirical models over event and bundle scenarios via a relative Grothendieck construction, clarifying contextuality notions and their relationships.<br>\nMonoidal Structures: The category of event scenarios is equipped with a symmetric monoidal tensor product, compatible with constructions on bundle and simplicial scenarios, allowing compositional constructions of scenarios and empirical models.<br>\nStochastic Extensions and Monad Gluing: Introduction of monads with a gluing operation (demonstrated for the distribution monad) enabling stochastic morphisms between scenarios forming a symmetric monoidal category called sScen_D.<br>\nMapping Scenario Construction: The paper provides a construction of mapping scenarios in event, bundle, and simplicial settings, connecting to classical sheaf-theoretic mapping scenarios and yielding natural isomorphisms.<br>\nCharacterization Theorem for Convex Maps: A main technical result characterizes convex maps between simplicial distributions as exactly those induced by noncontextual simplicial distributions on the mapping scenario, extending earlier categorical results in quantum foundations.<br>\nExamples: The authors give explicit examples illustrating contextuality emerging from tensor products of noncontextual factors, demonstrating the expressive power of their monoidal constructions.</p>\n<h2>Structure and Methods</h2>\n<p>The paper is detailed and organized into sections covering the definitions and categorical properties of scenarios, the construction and properties of stochastic simplicial scenarios, and the development of mapping scenarios. Appendices provide background on the Grothendieck construction, properties of the distribution monad, simplicial complexes and their monoidal structures, and comparisons to previous frameworks.</p>\n<h2>Impact and Significance</h2>\n<p>This work advances the categorical understanding of contextuality in quantum theory by fusing simplicial and probabilistic methods within a resource-theoretic framework. It unifies and extends previous approaches, offering new tools for compositional and homotopy-theoretic analysis of contextuality as a resource. The characterization of convex maps via noncontextual distributions on mapping scenarios deepens conceptual clarity and opens pathways for further exploration of quantum foundations and resource theories.</p>\n</blockquote>\n<p>In the long run, my plan is to make n8n fetch my papers' .tex source, dump everything I have ever written in my life in a single text file, compare the content of each digest with my production, and with a massive dataset of resources on category theory; then, our machine overlord outlines what I might need to know about other people's work, and/or what is a keyword also appearing in my research.</p>\n<p>There are still some sharp corners, and probably the tool can be made more ergonomic; but long gone, and ne'er coming back, are the days where research was burdened by the menial task of reading.</p>",
        "id": 521725532,
        "sender_full_name": "fosco",
        "timestamp": 1748865514
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229125-practice.3A-software/topic/category.20theory.20digest/near/521725532\">said</a>:</p>\n<blockquote>\n<p>There are still some sharp corners, and probably the tool can be made more ergonomic; but long gone, and ne'er coming back, are the days where research was burdened by the menial task of reading.</p>\n</blockquote>\n<p>The sadness I feel at seeing the phrase \"the menial task of reading\" is hard to put into words <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 521733578,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1748867486
    },
    {
        "content": "<p>Let's put this way, better:</p>\n<p>long gone are the days when I had to endure the torture of reading bad prose, in the hope/expectation (often, fortunately not always, unmet) that they contain something interesting, enduring their being written in the haste of XXIth century's publish-or-perish, so I can finally read \"Blood Meridian\", \"Infinite Jest\" and Suzuki's \"Essays in Zen Buddhism\" in the time I freed.</p>",
        "id": 521736885,
        "sender_full_name": "fosco",
        "timestamp": 1748868354
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229125-practice.3A-software/topic/category.20theory.20digest/near/521736885\">said</a>:</p>\n<blockquote>\n<p>Let's put this way, better:</p>\n<p>long gone are the days when I had to endure the torture of reading bad prose, in the hope/expectation (often, fortunately not always, unmet) that they contain something interesting, enduring their being written in the haste of XXIth century's publish-or-perish, so I can finally read \"Blood Meridian\", \"Infinite Jest\" and Suzuki's \"Essays in Zen Buddhism\" in the time I freed.</p>\n</blockquote>\n<p>I mean, Infinite Jest is not exactly terse...</p>",
        "id": 521759177,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1748873911
    },
    {
        "content": "<p>I guess I'd be pretty worried about hallucinations for this use case, since presumably the whole point is that you generally won't compare the outputs to the actual papers.</p>",
        "id": 521806675,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1748885966
    },
    {
        "content": "<p>so far, it's been just a matter to ask it to abstain from introducing anything new to the summary in th prompt (\"if for some reason you can't read part of the text, just say so and do not invent anything). Doing so, I have rarely found any substantial difference between the input text and the summary...</p>",
        "id": 521813034,
        "sender_full_name": "fosco",
        "timestamp": 1748887968
    },
    {
        "content": "<p>In my own routine, I just open my math.CT bookmark every morning and read the abstracts of the article whose title looks interesting to me. Isn't it the role of the abstract, to provide a short view of what the article is about?</p>",
        "id": 521813182,
        "sender_full_name": "Vincent Moreau",
        "timestamp": 1748888016
    },
    {
        "content": "<p>And then the introduction, to provide a somewhat longer view.</p>",
        "id": 521817363,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1748889375
    },
    {
        "content": "<p>is this why you don't think it would be useful?</p>",
        "id": 521817491,
        "sender_full_name": "fosco",
        "timestamp": 1748889425
    },
    {
        "content": "<p>Personally, I'd rather read something written by the authors of the paper, who presumably understand it as well as the larger mathematical context, and have thought about how best to summarize and introduce and motivate it.  (If they haven't thought about it sufficiently to write a good abstract or introduction, that just shows how much they really want me to read their paper.)</p>",
        "id": 521822094,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1748890946
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229125-practice.3A-software/topic/category.20theory.20digest/near/521817491\">said</a>:</p>\n<blockquote>\n<p>is this why you don't think it would be useful?</p>\n</blockquote>\n<p>Of course LLMs can be applied in useful ways to synthesize information, but in the case of the summary I would be willing to think that abstracts are probably better for the reasons Mike mentioned. But surely LLMs can produce some other useful information, like detecting patterns across several articles or things of the like, as you seemed to describe in your first post.</p>",
        "id": 521851685,
        "sender_full_name": "Vincent Moreau",
        "timestamp": 1748901458
    },
    {
        "content": "<p>There are papers that contain results that are interesting for person X and are not necessarily cited in the abstract. It happens often that one needs a paper just to cite a proof of some fact. An LLM that is trained on what someone's working on can provide a better summary than the abstract in this respect. I think it's a useful tool indeed. There are also a lot of other useful applications of this, e.g. expanding sections that have been intentionally mangled to fit into some prescribed page limit, a very common issue in academia.</p>",
        "id": 521916989,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1748933359
    },
    {
        "content": "<p>In general \"Jesus Christ, this paper seems to be written during a bathroom break\" is a comment that I uttered often during my PhD and if there's a tool - any tool - to help me suffer less while I read that's good to me.</p>",
        "id": 521917117,
        "sender_full_name": "Fabrizio Romano Genovese",
        "timestamp": 1748933406
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229125-practice.3A-software/topic/category.20theory.20digest/near/521736885\">said</a>:</p>\n<blockquote>\n<p>endure the torture of reading bad prose, in the hope/expectation (often, fortunately not always, unmet) that they contain something interesting,</p>\n</blockquote>\n<p>This to me sounds like reading LLM output. Particularly when it's LLM output that's summarising a bunch of LLM-written crank papers on math.CT</p>",
        "id": 531997465,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1753945899
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282822\">fosco</span> <a href=\"#narrow/channel/229125-practice.3A-software/topic/category.20theory.20digest/near/521813034\">said</a>:</p>\n<blockquote>\n<p>so far, it's been just a matter to ask it to abstain from introducing anything new to the summary in th prompt (\"if for some reason you can't read part of the text, just say so and do not invent anything). Doing so, I have rarely found any substantial difference between the input text and the summary...</p>\n</blockquote>\n<p>Does this prompt actually reliably work? I've never understood how it can, since the entire mechanism of LLMs is basically statement invention. I'm not saying it doesn't help, I can imagine e.g. correlating the LLM output with the paper content for \"relatedness\". But this is still different from recognizing that no \"invention\" has taken place and likely to be less reliable precisely in research areas with novel concepts.</p>",
        "id": 532043912,
        "sender_full_name": "Josh Chen",
        "timestamp": 1753959954
    },
    {
        "content": "<p>I can't resist sharing this <a href=\"https://xcancel.com/jasonlk/status/1946069562723897802\">story</a>. (tl;dr: developer asks ai not to do something, ai does it)</p>",
        "id": 532385543,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1754086078
    },
    {
        "content": "<p>The fact that <em>anyone</em> is willing to give a pattern engine the ability to <em>do</em> consequential things on its own frightens me beyond measure.</p>",
        "id": 532387205,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1754087113
    }
]