[
    {
        "content": "<p>I found this article and was wondering what the ACT community thought about it: <a href=\"https://www.marktechpost.com/2024/04/06/unifying-neural-network-design-with-category-theory-a-comprehensive-framework-for-deep-learning-architecture/\">\"Unifying Neural Network Design with Category Theory: A Comprehensive Framework for Deep Learning Architecture\"</a> By <a href=\"https://www.marktechpost.com/author/sana-hassan/\">Sana Hassan</a><br>\n\"They have proposed a solution grounded in category theory, aiming to create a more integrated and coherent methodology for neural network design. This innovative approach encapsulates the diverse landscape of neural network designs, including recurrent neural networks (RNNs), and offers a new lens to understand and develop deep learning architectures. By applying category theory, the research captures the constraints used in Geometric Deep Learning (GDL) and extends beyond to a wider array of neural network architectures.\"</p>",
        "id": 434252173,
        "sender_full_name": "Harold Kimmey",
        "timestamp": 1713481532
    },
    {
        "content": "<p>I'd try looking at the original paper and/or asking a more specific question.</p>",
        "id": 434254992,
        "sender_full_name": "Kevin Carlson (Arlin)",
        "timestamp": 1713483427
    },
    {
        "content": "<p>One of the authors of the cited <a href=\"https://arxiv.org/abs/2402.15332\">paper</a> is Bruno Gavranovic. He presents his <a href=\"#narrow/stream/274877-community.3A-our-work/topic/Bruno.20Gavranovi.C4.87\">work</a> in the \"community: our work\" thread. There is also a start-up, <a href=\"https://www.symbolica.ai/\">symbolica</a> which, I think, aims at providing categorical tools for nn architecture, as explained in the paper. </p>\n<p>As you can read in the zulip stream above, there is a concern here that the ACT community may be hit by the AI hype.</p>",
        "id": 434288018,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1713505317
    },
    {
        "content": "<p>First, my apologies as I a fairly new to Category Theory and not a Mathematician.  My background is in Computer Science and Business applications of technology, primarily for profit (Return on Investment/ROI).  My experience is fairly broad and deep, implementing technologies earlier than most by finding how they could connect to profitability earlier.  I \"think\" there are profitable business application for Category Theory and was trying to start a conversation with the purpose of learning more about Category Theory while trying to connect the dots to ROI.<br>\nWhile ROI tends to distract from some research in a technology it often brings funding that otherwise would never happen.<br>\nRegarding the paper, maybe <span class=\"user-mention\" data-user-id=\"276875\">@Bruno Gavranović</span> would help the discussion.<br>\nDo you think that the application of Category Theory would help enhance the \"exploitability\" of Neural Networks, or of AI in general?</p>",
        "id": 434358330,
        "sender_full_name": "Harold Kimmey",
        "timestamp": 1713531808
    },
    {
        "content": "<p>I think category theory should be very helpful, but it's important to keep in mind that category theory is a very general, abstract set of ideas and principles.  So, to apply it to any particular problem you have to either hope that someone has already successfully applied it to something quite similar, or be prepared to put in a lot of work.   In the latter case you need a team including experts on the problem and experts on category theory, and they need to talk to each other a lot. </p>\n<p>I know this because I've been working for about 14 years to apply category theory to modeling, and though I managed to make a lot of progress laying the foundations with some grad students and other mathematicians, the project really took off around 4 years ago when I teamed up with a group of epidemiologists and computer scientists, most of whom know quite a bit of category theory.   We are now writing software for epidemiological modeling based on category theory, and it's quite exciting.</p>",
        "id": 434377000,
        "sender_full_name": "John Baez",
        "timestamp": 1713537668
    },
    {
        "content": "<p>The paper you point to was written by a team of people working for a company, Symbolica, that has now gotten about $30 million in startup funds to develop a new approach to machine learning.    Much of the paper is an introduction to category theory.   It's not the case that anyone can just read that paper, take the time to understand it in detail, and then rapidly start applying category theory to machine learning.    The paper is not a recipe for machine learning: it's a sketch of a plan.   So I expect this team will need to work at least a year or two, and maybe longer, before getting commercially applicable results.   Luckily some of these people know a lot of category theory.  I believe others are experts on machine learning.   Anyway, that kind of mix is what's required to make progress.</p>",
        "id": 434379360,
        "sender_full_name": "John Baez",
        "timestamp": 1713538378
    },
    {
        "content": "<p>If you want to fund commercializable applications of category theory I suggest talking not only to the authors of that paper but also Shaowei Lin and Brendan Fong at the <a href=\"https://topos.institute/people\">Topos Institute</a>.  This is an institute in Berkeley devoted to working on applications of category theory.  I'm doing my work on epidemiological modeling with some people there, and I have a very high opinion of this institute.</p>",
        "id": 434380239,
        "sender_full_name": "John Baez",
        "timestamp": 1713538660
    },
    {
        "content": "<p>Thank you John for your thoughts and the connection to Shaowei Lin and Brendan Fong at the Topos Institute!  <br>\nI had recently heard of Symbolica.  I was only familiar with George Morgan, who had been at Tesla.  A friend, <span class=\"user-mention\" data-user-id=\"455684\">@Brandon Baylor</span>, had mentioned an <a href=\"https://venturebeat.com/ai/move-over-deep-learning-symbolicas-structured-approach-could-transform-ai/\">article about Symbolica</a> recently, but was not aware of the connection between the paper and the article.<br>\nIt would seem that using Category Theory would be a good fit for modeling the spread of diseases within populations due to the categories of populations and relationships between those populations (I may have very badly misstated this here, but trying...).</p>",
        "id": 434392006,
        "sender_full_name": "Harold Kimmey",
        "timestamp": 1713542439
    },
    {
        "content": "<p>If you want to read a bit more about categories in epidemiology, or watch a talk about it, you can go <a href=\"https://math.ucr.edu/home/baez/epidemiology_categories/\">here</a>.   I know it's not what you're mainly interested in, but it's an example of applied category theory that's reaching the point of practical applications, and I focus on the challenges of building a working team.</p>\n<p>Another good example is the work that people are doing at the company <a href=\"https://www.quantinuum.com/news/quantinuum-is-developing-new-frameworks-for-artificial-intelligence\">Quantinuum</a>, which does quantum computing, but also work related to AI.  (I've linked to something about AI.)</p>\n<p>And another is the work <span class=\"user-mention\" data-user-id=\"281326\">@Ryan Wisnesky</span> and others are doing at <a href=\"https://conexus.com/\">Conexus</a>, which does novel things with databases.</p>",
        "id": 434407640,
        "sender_full_name": "John Baez",
        "timestamp": 1713548471
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229125-practice.3A-software/topic/Discussion.3A.20.20ML.2FNN.20and.20ACT/near/434379360\">said</a>:</p>\n<blockquote>\n<p>The paper you point to was written by a team of people working for a company, Symbolica.</p>\n</blockquote>\n<p>For what it's worth, I think only some of the authors are associated with Symbolica - others are from Google DeepMind.</p>\n<p>I say this because it's maybe interesting that a big established organisation like DeepMind is taking interest in category theory for machine learning too.</p>",
        "id": 434576979,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1713693919
    },
    {
        "content": "<p>Thanks for clarifying that!</p>",
        "id": 434578808,
        "sender_full_name": "John Baez",
        "timestamp": 1713695570
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229125-practice.3A-software/topic/Discussion.3A.20.20ML.2FNN.20and.20ACT/near/434407640\">said</a>:</p>\n<blockquote>\n<p>If you want to read a bit more about categories in epidemiology, or watch a talk about it, you can go <a href=\"https://math.ucr.edu/home/baez/epidemiology_categories/\">here</a>. </p>\n</blockquote>\n<p>I watched the talk and found it a little easier to understand now.</p>",
        "id": 434643219,
        "sender_full_name": "Harold Kimmey",
        "timestamp": 1713756396
    },
    {
        "content": "<p>Great!</p>",
        "id": 434735269,
        "sender_full_name": "John Baez",
        "timestamp": 1713788803
    },
    {
        "content": "<p>There's more to it all than what I explained in that talk, but that's the key idea.</p>",
        "id": 434735365,
        "sender_full_name": "John Baez",
        "timestamp": 1713788827
    }
]