[
    {
        "content": "<p>I'm looking for formalization (i.e. inside proof assistants) of double categories. I want to contrast them to the one in agda-categories (which is idiosyncratic, but for good reasons).  Googling around doesn't lead anywhere.</p>\n<p>I am particularly very interested in highly universe polymorphic versions (which sadly seems to rule out the 'slick' definitions so dear to category theorists).</p>",
        "id": 377303817,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1689946610
    },
    {
        "content": "<p>I have a student that defined a \"locally thin\" version in cubical, i.e., where there is at most one square for any frame. The repo isn't public. It's maximally universe polymorphic, and looking at <code>agda-categories</code> it looks pretty much exactly the same modulo the thinness and we don't use setoids</p>",
        "id": 377378222,
        "sender_full_name": "Max New",
        "timestamp": 1689960871
    },
    {
        "content": "<p>I know that <a href=\"http://nicolasbehr.com\">Nicolas Behr</a> is looking to formalise double categories in Coq as part of <a href=\"https://coreact.wiki\">CoREACT</a> project he is leading.</p>",
        "id": 377401772,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1689966077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276642\">@Max New</span> My main \"innovation\" there is to say \"the heck with lists and natural numbers\" and use types as indices, and then make explicit the necessary equivalence proofs (which are mighty obscure over List/Nat). I was wondering if I could indeed claim credit for that observation.</p>",
        "id": 377412346,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1689968821
    },
    {
        "content": "<p>Thanks for the pointer <span class=\"user-mention\" data-user-id=\"276693\">@Bryce Clarke</span>  but my feeling is that Coq people don't worry much about universe polymorphism.</p>",
        "id": 377412615,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1689968907
    },
    {
        "content": "<p>Where do Lists/Nats come in with double categories?</p>",
        "id": 377417328,
        "sender_full_name": "Max New",
        "timestamp": 1689970269
    },
    {
        "content": "<p>D'oh!! I was mixing multi-categories with double categories!!!!</p>",
        "id": 377421896,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1689971659
    },
    {
        "content": "<p>With double categories, the issue is that the normal definition uses too much strictness, and we had to insert explicit coherences to make things match up.</p>",
        "id": 377422057,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1689971709
    }
]