[
    {
        "content": "<p>As an engineer that is coming up to speed with category theory, I often am attempting to model systems that I encounter using the basic category definitions and the graphical syntax. I know there are extensions of the basic definition that allow categories to differentiate into more specific structures, but it is daunting to go through the all the literature to find the categorical structure that makes sense for my application. It would be cool to have a tool that allows you to draw a diagram that has some semblance to the graphical syntax we're used too and then returns a list of suggested categorical constructs inferred by the shape of the diagram. It probably would require a machine-learning model and a training set of diagrams and labels (which could probably be scraped from nLab). Has someone thought of this already? Does it exist?</p>",
        "id": 231521911,
        "sender_full_name": "Angeline Aguinaldo",
        "timestamp": 1616524991
    },
    {
        "content": "<p>I'd be very surprised if it exists already... but I can think of an alternative which is easier to build. Namely, post your sketches somewhere on this Zulip and see if anyone suggests anything</p>",
        "id": 231526600,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616526729
    },
    {
        "content": "<p>(Sometimes the old ways are the best ways)</p>",
        "id": 231526656,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616526749
    },
    {
        "content": "<p>Cool! Thanks! Great to hear that this Zulip can be used in that way.</p>",
        "id": 231532810,
        "sender_full_name": "Angeline Aguinaldo",
        "timestamp": 1616529013
    },
    {
        "content": "<p>I'd suggest using <a class=\"stream\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-practice.3A-applied-ct\">#practice: applied ct</a> for engineering related things. Even very naive questions can turn into research level questions when mixing engineering + category theory, just because it's such a new thing</p>",
        "id": 231533300,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616529224
    },
    {
        "content": "<p>Oh, awesome!! I was looking for a stream like this. Thanks!</p>",
        "id": 231536061,
        "sender_full_name": "Angeline Aguinaldo",
        "timestamp": 1616530329
    }
]