[
    {
        "content": "<p>Hello there!<br>\nWelcome to <strong>Category Theory Zulip</strong>. In this chatroom we exchange knowledge and ideas about CT, and more widely math, for fun and profit.</p>\n<p>Zulip messages are organized in two levels of hierarchy, <em>streams</em> and <em>topics</em>. Streams are thematic groups of topics which are themselves thematic groups for message. For instance, you're looking now at a message in the topic <a class=\"stream-topic\" data-stream-id=\"323257\" href=\"/#narrow/stream/323257-meta.3A-welcome/topic/welcome\">#meta: welcome &gt; welcome</a> of the stream <a class=\"stream\" data-stream-id=\"323257\" href=\"/#narrow/stream/323257-meta.3A-welcome\">#meta: welcome</a>. Some streams are public and some are private. Nobody can see what you post in private streams, not even admins.</p>\n<p>To participate and follow conversations, check the <strong>+</strong> button next to the 'STREAMS' menu on the left <span aria-label=\"left\" class=\"emoji emoji-2b05\" role=\"img\" title=\"left\">:left:</span>. You can browse streams from there and subscribe to the ones you'd like to follow. To maximize discoverability, we suggest to subscribe to most streams and make use of the <a href=\"https://zulip.com/help/mute-a-topic\">mute button</a> for the topics you don't want to follow anymore.</p>\n<p>Here's a rundown of the main streams in this Zulip instance:</p>\n<ol>\n<li><a class=\"stream\" data-stream-id=\"229111\" href=\"/#narrow/stream/229111-community.3A-general\">#community: general</a>, the main square, start here to introduce yourself to the community</li>\n<li><a class=\"stream\" data-stream-id=\"229199\" href=\"/#narrow/stream/229199-learning.3A-questions\">#learning: questions</a> for any CT-related question. This is were most conversations happen.</li>\n<li><a class=\"stream\" data-stream-id=\"229136\" href=\"/#narrow/stream/229136-theory.3A-category-theory\">#theory: category theory</a> for hardcore category theory conversations.</li>\n<li><a class=\"stream\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-theory.3A-applications\">#theory: applications</a> for applied category theory conversations.</li>\n<li><a class=\"stream\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-community.3A-events\">#community: events</a> is where seminars, conferences and events of all sorts are advertised</li>\n<li><a class=\"stream\" data-stream-id=\"245502\" href=\"/#narrow/stream/245502-community.3A-positions\">#community: positions</a> is where new jobs available or gotten are advertised</li>\n<li><a class=\"stream\" data-stream-id=\"274877\" href=\"/#narrow/stream/274877-community.3A-our-work\">#community: our work</a> is where people advertise projects they're working on</li>\n<li><a class=\"stream\" data-stream-id=\"229451\" href=\"/#narrow/stream/229451-meta.3A-off-topic\">#meta: off-topic</a> OT content, memes</li>\n<li><a class=\"stream\" data-stream-id=\"229122\" href=\"/#narrow/stream/229122-meta.3A-meta\">#meta: meta</a> is where we talk about the Zulip server itself</li>\n</ol>\n<p>We invite you to browse streams and subscribe to the ones you're interested to (there's not many more tbh!).</p>\n<p>It's important to know <strong>most public streams around here are publicly archived</strong> at <a href=\"https://mattecapu.github.io/ct-zulip-archive\">this location</a>. This in order to make the content here citable and linkable to the outside world, and to keep a backup and historical record of the conversations happening here. Bear this in mind when you post! In any case, anyone can join and look around anyway, so you should expect anyone to be able to read whatever you write in a public stream.</p>\n<p>Before you go, here's the rules we gave ourselves:</p>\n<blockquote>\n<p><strong>Zulip Community Guidelines</strong></p>\n<p>The Category Theory Community Server is a friendly, welcoming environment to learn and discuss category theory and its applications, as well as mathematics, science, and life.  As part of this, we welcome beginners and encourage teaching. Technical, research-related questions and discussions are also welcome.  </p>\n<p>Here are our policies for maintaining a friendly, open culture:</p>\n<p><strong>Engage in constructive discussion.</strong> Try to understand what others know and how they are thinking. We welcome researchers, beginners and everything in between, so try to respond on the level of the readers when possible. Encourage helpful members by acknowledging their contributions publicly. </p>\n<p><strong>Appreciate diversity and uplift one another.</strong> The group is large, and our varied backgrounds and strengths are valuable. Avoid getting frustrated by ambiguity, \"newbies\" and the like: either be helpful or move along. Be patient and take satisfaction from sharing knowledge.</p>\n<p><strong>Mind others’ time.</strong> Consider that 1000+ people may read any given discussion here. Make your contributions relevant and reasonably concise. A debate is okay if it is respectful and purposeful; otherwise steer the topic back on track or let it go. </p>\n<p><strong>Be nice and inclusive.</strong> We have no tolerance for rudeness, insults, bullying, or ad hominem arguments. After one official warning, users engaging in these behaviors will be banned. If you see someone engaged in these behaviors, either respond very politely, ignore them, or send a private message to a moderator.</p>\n<p><strong>List of moderators</strong>:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275899\">Christian Williams</span>  (<a href=\"mailto:williams@math.ucr.edu\">williams@math.ucr.edu</a>)<br>\n<span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span>  (<a href=\"mailto:matteo.capucci@gmail.com\">matteo.capucci@gmail.com</a>)<br>\n<span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span>  (<a href=\"mailto:mogrog@live.co.uk\">mogrog@live.co.uk</a>)<br>\n<span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <br>\n<span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <br>\n<span class=\"user-mention silent\" data-user-id=\"275989\">Paolo Perrone</span>  (<a href=\"http://www.paoloperrone.org\">www.paoloperrone.org</a>)<br>\n<span class=\"user-mention silent\" data-user-id=\"278546\">Chris Grossack (they/them)</span> <br>\n<span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> </p>\n<p>You can summon us by tagging <code>@moderators</code> in your message.</p>\n<p>If you are having any difficulty navigating Zulip, communicate this in any way you can and someone will surely find and help you. If you are interested in joining the team of moderators, get in touch!</p>\n</blockquote>",
        "id": 280593800,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1651215987
    }
]