[
    {
        "content": "<p>Cf : <a href=\"https://inquiryintoinquiry.com/2013/01/28/riffs-and-rotes-1/\">Riffs and Rotes &bull; 1</a></p>\n<p>Re: <a href=\"https://rjlipton.wpcomstaging.com/about-me/\">Richard J. Lipton</a> &bull; <a href=\"https://rjlipton.wpcomstaging.com/2013/01/26/making-primes-more-random/\">Making Primes More Random</a></p>\n<p>There’s a study called <em>generalized primes</em> which investigates in a more general way the relationship between arbitrary elements called <em>primes</em> and the <em>composites</em> which can be formed from them according to specified rules of composition.&nbsp; Comparisons can be made among a variety of numerical systems or any orders of combinatorial species one might imagine.&nbsp; I seem to recall at least one old monograph by Rademacher on the subject.</p>\n<p>My fascination with questions like that led me many years ago to the Riff&nbsp;and&nbsp;Rote trick, a&nbsp;special case of the Make&nbsp;A&nbsp;Picture trick.&nbsp; There's a bit on that in the following article.</p>\n<ul>\n<li><a href=\"https://oeis.org/wiki/Riffs_and_Rotes\">Riffs and Rotes</a></li>\n</ul>",
        "id": 251060143,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1630161371
    },
    {
        "content": "<p>Cf: <a href=\"https://inquiryintoinquiry.com/2013/03/03/riffs-and-rotes-2/\">Riffs and Rotes &bull; 2</a></p>\n<p>Re: <a href=\"https://cameroncounts.wordpress.com/about/\">Peter Cameron</a> &bull; <a href=\"https://cameroncounts.wordpress.com/2013/03/03/two-lectures/\">Addition and Multiplication of Natural Numbers</a></p>\n<p>The interaction between addition and multiplication in the natural numbers has long been an interest of mine, leading to broader questions about the relationship between algebra and combinatorics.&nbsp; My gropings with those enigmas led me to the structures of Riffs&nbsp;and&nbsp;Rotes, extracting what we might think of as the &ldquo;purely combinatorial&rdquo; properties of primes factorizations.&nbsp; Thinking of the additive structure of the positive integers as embodied in their total linear ordering, the following two questions arise.</p>\n<ul>\n<li>How much of the natural ordering of the natural numbers is purely combinatorial?</li>\n<li>What additional axioms on the partial orders of Riffs and Rotes would restore their natural order?</li>\n</ul>\n<p><strong>Reference</strong></p>\n<ul>\n<li><a href=\"https://oeis.org/wiki/Riffs_and_Rotes\">Riffs and Rotes</a></li>\n</ul>",
        "id": 251148271,
        "sender_full_name": "Jon Awbrey",
        "timestamp": 1630260486
    }
]