[
    {
        "content": "<p>I am interested (and inspired by Spivak &amp; Fong’s “Seven Sketches of Compositionality”) to explore myriad simple systems and work out what inherent connections to category theory they can have. I mean simple hands-on things, especially a deck of cards, but also coins tosses, dice, dominoes, folding paper, drawings, etc. I think there was a famous book once, Mathematics for the Millions, which did a lot of math just with basic implements like piles of matches or something.</p>",
        "id": 377484786,
        "sender_full_name": "Julius",
        "timestamp": 1690001382
    },
    {
        "content": "<p>I am currently thinking about the conceptual nature of say, a preorder relation (since I’m reading Spivak and fong, I’m studying preorders, not categories yet). I feel like so much of category theory gives us a conceptual metaphor for what the abstract thing in the theory is (like an arrow is a “structure preserving map”), but it turns out it can be many other things (like in the first chapter, they have you consider arrows as “observations”, where the lack of perfect structure preservation is seen positively: a generative effect). Here’s one example. We talk about “subsets” constantly with the conceptual metaphor of a “sub-part”. We even use a symbol which kind of indicates Venn Diagram-esque sub-sectioning. But it doesn’t have to be that way. Actually, that’s not really what the definition says. It just says, A is a subset of B if every element in A is in B.</p>",
        "id": 377485418,
        "sender_full_name": "Julius",
        "timestamp": 1690001679
    },
    {
        "content": "<p>So, there are very diverse <em>fundamental</em> ways of intuitively thinking about even something as basic as a subset relation. I was thinking it could be called a “selection” or “selector” instead: a selection is a selection of elements in some set A. It seems more conceptually intuitive to say it this way, and it lines up with the actual definition more exactly. Maybe it helps a student later when doing proofs if the terminology is not based on a conceptual metaphor that is actually too different from a formal definition, I don’t know.</p>",
        "id": 377485782,
        "sender_full_name": "Julius",
        "timestamp": 1690001872
    },
    {
        "content": "<p>It also occurred to me that a subset is fundamentally predicative, whereas a Set is not. A subset must exist in relation to a set. Like, B(A) is a way of saying, “B is a selection of elements <em>from A</em>”. I don’t know why, that really stands out to me: it is a concept that only exists riding on the back of an argument (some pre-existing set). Again, seems minor, but to me, the intuition is everything.</p>",
        "id": 377486076,
        "sender_full_name": "Julius",
        "timestamp": 1690001992
    },
    {
        "content": "<p>What I am wondering is, are there any restrictions at all on conceptually what the arrows in a category could be? As arrows, as morphisms, we think of them with a conceptual metaphor that they are something “dynamic”: a <em>transformation</em> on an object. But, what if most abstractly, we basically just thought of a category as two collections of things, with no constraints on the <em>kind</em> of thing. For example, what if the objects were fruits, and the hom-sets were also… fruits? Like just objects and objects.</p>",
        "id": 377486747,
        "sender_full_name": "Julius",
        "timestamp": 1690002210
    },
    {
        "content": "<p>Since that last message is the only one with a question in, I'll answer that: no, there is no restriction besides having to satisfy the axioms. Thinking about the opposite of a category can help dislodge some of the overgeneralization that one might form from simple examples. There is also a one-sorted definition of category, where we ignore objects, which can give you a different perspective.<br>\nAbstract categories like monoids, where the morphisms are really just arrows with a composition law, can also provide some intuition for categories as algebraic structures.</p>",
        "id": 377575019,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1690026587
    }
]