[
    {
        "content": "<p>In an email to the CT mailing list, <span class=\"user-mention\" data-user-id=\"276695\">@Posina Venkata Rayudu</span> shared <a href=\"https://science.sciencemag.org/content/372/6537/36/tab-e-letters\">a draft of an open letter</a> recommending that the Indian government consider enabling a translation and incorporation into the pre-university syllabus of Lawvere and Schanuel's <em>Conceptual Mathematics</em>.</p>\n<p>The letter is interesting to read, and it led me to wondering: would you (the reader) encourage teaching of category theory in, say, high school (or even earlier) to your government if you could? What resources would you suggest? Is <em>Conceptual Mathematics</em> a good resource for Posina et al. to have selected, in your opinion?</p>",
        "id": 249236672,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1628776095
    },
    {
        "content": "<p>From my experience, there are three main things lacking from pre-university education in mathematics: proofs, exploration and abstract reasoning.</p>\n<p>I was lucky enough to do a bit of the first two in my last year before university and it made me change my major to include maths. Both proofs and exploration went hand in hand as we studied a bit of number theory and combinatorics.</p>\n<p>I believe teaching category theory would be a great opportunity to include abstract reasoning in the curriculum, but I see alternatives such as abstract algebra and order theory. Unfortunately, I am not really familiar with how children and teenagers learn to compare them meaningfully.</p>\n<p>I like the book (or the parts I have read), but I would suggest improving it with the advice of pedagogy experts and some in-class experiments instead of simply translating it.</p>",
        "id": 249265606,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1628789271
    },
    {
        "content": "<p>At a pre-university level, I tend to think that the best approach is not to teach CT directly, but rather to use it as a framework for teaching the existing curricula. A great example in this direction is <a href=\"https://arxiv.org/abs/1911.00892\">this recent paper</a> (which introduced me to Penrose's bubble notation for derivatives, after &gt;10 years using string diagrams).</p>",
        "id": 249358287,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1628860426
    },
    {
        "content": "<p>Thank you very much Morgan, Ralph, and Spencer for your helpful suggestions!</p>",
        "id": 261951465,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1637252791
    },
    {
        "content": "<p>Mathematics for All (Thank you Topos Institute for imagining a playground accessible to everyone :-)</p>\n<p>If I may, your time permitting, do you see any pedagogical value in the gamification of mathematics; e.g.,</p>\n<p><a href=\"https://www.youtube.com/watch?v=A-rfmuduGyY\">Why does 1 + 1 = 2?</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"A-rfmuduGyY\" href=\"https://www.youtube.com/watch?v=A-rfmuduGyY\"><img src=\"https://uploads.zulipusercontent.net/0515254f8501b42218c72866e4523f18dc9f4913/68747470733a2f2f692e7974696d672e636f6d2f76692f412d72666d7564754779592f64656661756c742e6a7067\"></a></div><p><a href=\"https://playinmath.wordpress.com/2022/05/16/gamification-of-sum/\">Gamification of SUM</a></p>\n<p>for the express purpose of facilitating:</p>\n<p>mathematics for all (we did it with literacy n will do for mathematics also :-)</p>\n<p>I eagerly look forward to your critique (unvarnished ;-)</p>\n<p>Thanking you,<br>\nposina</p>\n<p>P.S. I just thought of sharing the source of my inspiration:</p>\n<p>Professor F. William Lawvere's lifelong and ongoing efforts to raise the standards of understanding so that science becomes commonsense (as it has been throughout human experience).</p>",
        "id": 287565720,
        "sender_full_name": "Posina Venkata Rayudu",
        "timestamp": 1656330455
    }
]