[
    {
        "content": "<p>I have worked with cooperative economic networks since maybe 2004. Looks like a lot of people here are thinking of economics in terms of competitive markets with adversarial relationships. Economic networks try to avoid adversarial/market relationships as much as possible. Can't avoid them entirely, because they are immersed on a market economy.</p>\n<p>I've been looking at a bunch of <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> stuff about game theory. If I understand correctly, an economic network would be an example of the maximally cooperative version of the prisoner's dilemma. If and when any of the participants gets greedy, either the other participants will discipline them or the network will fall apart.</p>\n<p>Here's an example that I helped to organize: <a href=\"http://www.fifthseasoncoop.com/\">http://www.fifthseasoncoop.com/</a> </p>\n<p>It's a multi-stakeholder cooperative of farmers, food processors, distributors, and institutions (schools and hospitals). </p>\n<p>I've helped to organize several of these things. A couple failed because of greedy or otherwise non-cooperative dominant participants.</p>\n<p>By the way, most manufacturing supply chains are more like cooperative networks than market players internally. I worked in auto supply chains for several years and they work by negotiated long-term relationships, they don't go out on the market looking for components.</p>",
        "id": 202034515,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593124980
    },
    {
        "content": "<p>Yr possibly obligatory academic citation: <a href=\"https://www.academia.edu/10252910/The_uneasy_transition_from_supply_chains_to_ecosystems_The_value-creation_value-capture_dilemma\">https://www.academia.edu/10252910/The_uneasy_transition_from_supply_chains_to_ecosystems_The_value-creation_value-capture_dilemma</a></p>",
        "id": 202037285,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593127491
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/231468-practice.3A-economics/topic/Economic.20networks/near/202034515\">said</a>:</p>\n<blockquote>\n<p>Here's an example that I helped to organize: <a href=\"http://www.fifthseasoncoop.com/\">http://www.fifthseasoncoop.com/</a> </p>\n<p>It's a multi-stakeholder cooperative of farmers, food processors, distributors, and institutions (schools and hospitals). </p>\n<p>I've helped to organize several of these things. A couple failed because of greedy or otherwise non-cooperative dominant participants.</p>\n</blockquote>\n<p>I have ongoing work that will probably be interesting to you, with Seth Frey and Philipp Zahn (economists) and Josh Tan (ACTist). We are using open games and my software implementation of them to build models of things along these lines. One thing we're looking at is governance of common pool resources along the lines of Ostrom. We're in the process of exploring what open games can do and how they could be useful to practitioners. They certainly allow you to do rapid prototyping of models. (A major drawback is that open games are inherently equilibrium-based, and quite often you just don't care about equilibria)</p>",
        "id": 202071462,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593165514
    },
    {
        "content": "<p>So far we're not thinking about economic networks, the models we built so far have a small fixed number of players. We know how to do graphical games in theory (<a href=\"https://arxiv.org/abs/2006.03493\">https://arxiv.org/abs/2006.03493</a>) but I'm not sure how to implement it, or how to deal with any other sort of economic network besides graphical games</p>",
        "id": 202071645,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593165635
    },
    {
        "content": "<p>We're planning to write a paper along these lines, for a general audience social science venue like PNAS. Look out for a preprint some time this year, hopefully</p>",
        "id": 202071710,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593165700
    },
    {
        "content": "<p>It <em>might</em> be (but also might not be) that open games + software implementation turns out to be a good general-purpose framework for modelling of institutional dynamics</p>",
        "id": 202071857,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593165809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> I got a Haskell programmer working with me and looking at <a href=\"https://github.com/jules-hedges/open-games-hs\">https://github.com/jules-hedges/open-games-hs</a><br>\nBig question will be, we don't do adversarial games, only cooperative ones. Will open games work for that?</p>\n<p>And here's a new cooperative economic network paper that just landed in my inbox this morning:<br>\n<a href=\"https://www.academia.edu/22341736/Manufacturing_Service_Ecosystem_Achievements_of_the_European_7th_Framework_Programme_FoF-ICT_Project_MSEE_Manufacturing_SErvice_Ecosystem_Grant_No._284860_\">Manufacturing Service Ecosystems</a><br>\n&lt;excerpt&gt;</p>\n<blockquote>\n<p>High performing co-operations between independent companies with the aim to develop and to<br>\nrealise customised products are an important success factor for the competitiveness of the Euro-<br>\npean industry. Due to immense political changes and global markets, new ways of cooperations,<br>\nso called enterprise networks, can be seen in addition to the traditional supply chains. These en-<br>\nterprise networks are often formed to realise a single customers’ order and play an important role<br>\nduring the conceptual phase (product design) as well as during the realization phase (produc-<br>\ntion).<br>\nThe research unit IKAP prepares, develops and realises methods and tools to support coopera-<br>\ntive, inter-organizational enterprise networks. The research concentrates on efficient and effec-<br>\ntive collaborative design and production processes by applying innovative information and<br>\ncommunication technologies (ICT). As focus can be seen the collaborative acting of enterprises<br>\nduring distributed design and production processes as well as during the late processes of the<br>\nproduct life cycle such as the usage phase or the recycling phase.</p>\n</blockquote>\n<p>&lt;/excerpt&gt;</p>",
        "id": 202355845,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593458165
    },
    {
        "content": "<p>Those networks are cooperative and sheltered from market relations internally, but hit the markets on the edges.</p>",
        "id": 202357612,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593459146
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/231468-practice.3A-economics/topic/Economic.20networks/near/202355845\">said</a>:</p>\n<blockquote>\n<p>Big question will be, we don't do adversarial games, only cooperative ones. Will open games work for that?</p>\n</blockquote>\n<p>So I either have bad news or very bad news, but I'm not sure which</p>",
        "id": 202360810,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593460862
    },
    {
        "content": "<p>The bad news is that I have no idea how to deal with cooperative game theory compositionally. The very bad news is that my <em>guess</em> is that open games fundamentally can't deal with cooperative solution concepts. That really is just a guess though. I have never had time to look into it, somebody else is going to have to do the theory</p>",
        "id": 202360967,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593460936
    },
    {
        "content": "<p>Open games can deal with solution concepts that are \"sufficiently Nash-like\" in some way I can't make precise. I think that cooperative solution concepts don't fit</p>",
        "id": 202361066,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593460993
    },
    {
        "content": "<p>That's not to say that you can't do cooperative game theory compositionally. My <em>guess</em> is that you can, but not with open games</p>",
        "id": 202361113,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593461017
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/231468-practice.3A-economics/topic/Economic.20networks/near/202361113\">said</a>:</p>\n<blockquote>\n<p>That's not to say that you can't do cooperative game theory compositionally. My <em>guess</em> is that you can, but not with open games</p>\n</blockquote>\n<p>Thanks, Jules. Your answer will save us a lot more digging. It was an interesting excursion, though...</p>",
        "id": 202367651,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593464568
    },
    {
        "content": "<p>Does anybody know if any catsters have worked on cooperative games? <br>\nOr any other kinds of cooperative network relationships?<br>\nIf you're worried about climate change, that's part of what needs to happen.</p>",
        "id": 202374472,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593468869
    }
]