[
    {
        "content": "<p>Hello. I just wanted to register that I'm also interested in these themes, especially in thinking about new tools for post-Keynsian and other heterodox approaches. I'll keep an eye on this conversation.</p>",
        "id": 192780549,
        "sender_full_name": "Emily Roff",
        "timestamp": 1585907454
    },
    {
        "content": "<p>Glad this thread was made. I'll have time tomorrow when my weekend starts.</p>",
        "id": 192798264,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1585918295
    },
    {
        "content": "<p>In the social sciences, methodological individualism refers to the principle that theoretical analysis should be developed from the bottom up, by weaving together the informed actions and behaviours of individual agents: consumers, firms, and institutions. In my opinion, this is completely different from the view of most systems theorists (Willems 'behavioural' approach comes to mind here), most sociologists, and those economists who follow the tradition of classical political economy. </p>\n<p>Discussions about the microfoundations of macroeconomic behaviour can be inverted to focus, instead, on the macrofoundations of microeconomic behaviour (e.g. by accounting for sectoral balances and flows-of-funds between government, households, the domestic private sector, and the rest-of-the-world that drive financial instabiity, or looking at seismic shifts in the stock-flow norms influencing dividend retention and payout ratios, the progressivity of income taxes, levels of corporate remuneration to senior management and CEOs etc.). </p>\n<p>By the same token, the work of Herbert Simons on bounded rationality and satisficing, or of Keynes on fundamental uncertainty serve to undermine the extreme optimizing and perfect foresight assumptions of rational choice theory (although in his Bank of Sweden Prize lecture, Simons complained about how his views on bounded rationality had been coopted to illicitly lend support to the latter).</p>",
        "id": 192882013,
        "sender_full_name": "Archibald Juniper",
        "timestamp": 1585963411
    },
    {
        "content": "<p>I agree with you on the significance of the Sonnenschien-Mantel-Debreu lemma. And the Lucas critique along with the 'time-inconsistency problem' certainly played an important role in the dismantling of Keynesian policies from the mid-70s onwards. However, they have little relevance for fiscal policies designed to restore full utlilization  of resources when effective demand has collapsed. Moreover, the Dynamic Stochastic General Equilibrium models which rose 'phoenix-like' from the ashes in the aftermath of this counter-revolution, have been ably critiqued by former Director of the world Bank, Joseph Stiglitz in a series of papers published over the last decade . </p>\n<p>The demise of the Cold War has certainly assisted in the reappraisal of Classical Political Economy, especially the capital controversies that were launched by the work of Joan Robinson and Piero Sraffa, in which both Paul Samuelson and Luigi Pasinetti participated. One obvious task for Post Keynesians is to incorporate Sraffa's multi-sectoral modelling approach within a comprehensive macroeconomic setting. Richard M. Goodwin, who developed an economic version of the Lokta-Volterra predator-prey model,  was also interested in this proposition.</p>",
        "id": 192892776,
        "sender_full_name": "Archibald Juniper",
        "timestamp": 1585981268
    }
]