[
    {
        "content": "<p>Hi everyone! </p>\n<p>My name is Gabriel, I'm a philosophy post-doc researcher at Rio de Janeiro. I'm mostly interested in political philosophy and marxism, more specifically. For the last couple of years, however, I've been studying CT together with an autonomous research group Im part of - most of us are studying it on our own, trying to learn as much as we can about category theory while avoiding any \"intellectual impostures\" in our use of the categorial machinery for our research purposes.</p>\n<p>At the risk of sounding totally bonkers, I wanted to share here the link to a long essay we've been working on for the last year or so: in it, we attempt to reconstruct the bulk of the categories of the first volume of Marx's Capital using topos theory and operads. We called it a \"Primer on Political Phenomenology\" because the main goal of this essay is to propose a reading of Marx's critique of political economy that takes not the standpoint of how commodities appear \"for us\", but how they appear to one another. So an \"objective phenomenology\" of sorts, since economic structures are defined by their logical relations, not by our effort to represent them to ourselves. Ultimately, we want to show that an approach to political organization that is coherent with Marx's analysis of capitalism should be able to think itself in similar terms: to realize that different organizational structures \"see\" - and interact - with different aspects of social reality, and that it takes not only complex forms of organization to interact with complex social systems, but also that social composition is relevant to what 'differences make a difference\" to an organization or collective . From the standpoint of our political activities, this different approach seems very useful and practical.</p>\n<p>However, it is hard to find interlocutors interested in helping us out with this project because we managed to place ourselves at the unconfortable intersection between those interested in CT, those interested in economy, those tolerant to the speculative jargon of contemporary philosophy and those interested in radical politics - and we know its easy to dismiss our work by focusing on our naivity on any of these four fronts: we have no mastery of the categorial tools we are mobilizing, Marxian economics is mostly seen as outdated, names like \"Alain Badiou\" send shivers down the spine of many mathematicians - and \"radical politics\" is usually treated as synonym for, well, crazy people. </p>\n<p>But one never knows - perhaps someone here might be curious to see what we are up to, and to provide us with some clues of how to develop this in a more consistent way? </p>\n<p>Here is the link to the text: <a href=\"https://drive.google.com/file/d/1UYW_wCvnho5w5NhIBPR4EPtHT_M3Vqy8/view?usp=sharing\">https://drive.google.com/file/d/1UYW_wCvnho5w5NhIBPR4EPtHT_M3Vqy8/view?usp=sharing</a></p>\n<p>Sorry for the long message - and I apologize if this is not the place for something this speculative or amateurish! But I follow (to the best of my abilities!) the work of many of your with great interest and I thought Id give it a try!</p>\n<p>All the best!</p>",
        "id": 257570627,
        "sender_full_name": "Gabriel Tupinambá",
        "timestamp": 1634231329
    },
    {
        "content": "<p>Interesting..... I was only expecting to have a casual 1 minute glance, but you've got my attention by having a high concentration of string diagrams. I'm not sure when I'll have time to look seriously at it, it has to join an existing queue of long documents mixing my professional interest in categories with radical politics</p>",
        "id": 257693973,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1634303030
    },
    {
        "content": "<p>It seems tremedously interesting and I'm glad to see CT being used as a tool to make sense of patterns outside mathematics</p>",
        "id": 257695089,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1634303521
    },
    {
        "content": "<p>It might be a way for me to finally dive into Marxist philosophy</p>",
        "id": 257695154,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1634303543
    },
    {
        "content": "<p>Wow I'm browsing your website... where did you hide all this time</p>",
        "id": 257695926,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1634303902
    },
    {
        "content": "<p>Oh you're also interested in cybernetics! <a href=\"https://youtu.be/-utRjvxHnQ0?t=3243\">https://youtu.be/-utRjvxHnQ0?t=3243</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"-utRjvxHnQ0\" href=\"https://youtu.be/-utRjvxHnQ0?t=3243\"><img src=\"https://uploads.zulipusercontent.net/ead8f56edc008bfff4dbe171fbebe3763c358e9d/68747470733a2f2f692e7974696d672e636f6d2f76692f2d7574526a7678486e51302f64656661756c742e6a7067\"></a></div>",
        "id": 257699243,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1634305370
    },
    {
        "content": "<p>That's amazing</p>",
        "id": 257699254,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1634305375
    },
    {
        "content": "<p>This is interesting to me. Sadly, I can't help -- I'm no expert and am struggling to learn as much CT as I can. If nothing else though, I'm a huge fan of your project and seeing this incredibly niche intersection explored :)</p>",
        "id": 257727883,
        "sender_full_name": "Sean Gloumeau",
        "timestamp": 1634316126
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311799\">@Christian Weilbach</span></p>",
        "id": 259194356,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1635311963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"461402\">@James Mathews</span></p>",
        "id": 264452510,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1639145635
    }
]