[
    {
        "content": "<p>Recall that a vector space is an algebra of the free-vector-space monad on <strong>Set</strong>.<br>\nLikewise, a category is an identity-on-objects algebra of the free-category monad on <strong>Quiv</strong>.<br>\nMore impressively: Let a precategory be a category that doesn't have to satisfy the algebra laws.<br>\nFor a precategory on a quiver q, the following are equivalent:</p>\n<ul>\n<li>It's a category.</li>\n<li>Given it you can only build (that) one.</li>\n<li>Given it and a path, you can only build one arrow that you know to be from its source to its target. (Its composite.)</li>\n</ul>\n<p>To clarify, here's how to recover that a category C is...<br>\n  ...associative: Let's define precategories C_left and C_right: Let p be a path in C. If it hasn't length 3, it composes as in C. If it does have the form (f,g,h), it composes to C(C(f,g),h) in C_left and to C(f,C(g,h)) in C_right. Since we've now built C_left and C_right from C, they are C.<br>\n  ...unital: You could use C to conjure arrows from empty paths, then sprinkle them into other paths before you compose. By the property of C, those arrows do nothing.</p>\n<p>A functor from C to D is then an object map f plus an f-on-objects map from paths in C to arrows in D given which you can only build that one.</p>\n<p>In Haskell terms:</p>\n<div class=\"codehilite\"><pre><span></span><code>data Path q where Nil :: Path q s s; Snoc :: Path q s t -&gt; q t u -&gt; Path q s u\ntype Precategory q = forall s t. Path q s t -&gt; q s t\ntype Redefinition = forall q. Precategory q -&gt; Precategory q\n-- A category is a precategory on which all redefinitions agree. (id in particular.)\nrassoc :: Redefinition\nrassoc c (Snoc (Snoc (Snoc Nil f) g) h) = c (Snoc (Snoc Nil f) (c (Snoc (Snoc Nil g) h)))\ntype Prefunctor f q r = forall s t. Path q s t -&gt; r (f s) (f t)\ntype Redefinition2 = forall f q r. (Precategory q, Precategory r, Prefunctor f q r) -&gt; Prefunctor f q r\n-- A functor is a prefunctor between categories on which all redefinition2s agree.\n</code></pre></div>\n<p>Remark: There is exactly one \"forall q. Precategory (Path q)\".</p>\n<p><a href=\"http://golem.ph.utexas.edu/category/2012/05/postulated_colimits_and_absolu.html#c041397\">Tom Leinster's \"possible to even mention\" concept</a> is possible to mention here.</p>\n<p>Might one characterize the structure of <strong>Quiv</strong> by this property corresponding to unitality and associativity?<br>\nThe jackpot case would be that this is a compact enough seed for category theory that one can calculate out a grid of all sensible math concepts, making clever definitions obsolete and math tractable.</p>\n<p>Anyway. Ideas? Prior work?</p>",
        "id": 355571095,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1683136704
    },
    {
        "content": "<p>This sounds interesting. Could you explain how it relates to the title 'reflective stability'?</p>",
        "id": 356132862,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1683309694
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276945\">@Oscar Cunningham</span> it's not a term with a formal definition I am importing. Allusions include:</p>\n<ul>\n<li>\"reflectively stable\" = \"fixed by redefinitions\"</li>\n<li>the infamous ability of Category Theory to define itself, which may well prove characteristic.</li>\n<li>[tongue in cheek] as we reflect on our math language and remove imperfections, we shall reach a stable state; let's jump ahead to it.</li>\n</ul>",
        "id": 358256622,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1684069844
    },
    {
        "content": "<p>Re \"a category is an identity-on-objects algebra of the free-category monad on <strong>Quiv</strong>\": the unit of the free category monad <em>is</em> the identity on objects, and any algebra has to be an inverse to the unit so is the identity on objects too. So a category is an algebra for the free category monad, without caveats.<br>\nWhat is a \"category without properties\", and how does it fail to be a category?</p>",
        "id": 358259509,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1684071054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> By identity-on-objects I mean that a path from s to t has to be mapped to an arrow from s to t - the quiver morphism's objects-to-objects map is the identity.<br>\nA precategory is an identity-on-objects algebra of the free-category <em>endofunctor</em> on <strong>Quiv</strong>, that is, it does not need to satisfy the algebra-over-a-monad laws. I should have made more obvious that I didn't mean to drop \"identity-on-objects\". Edited.</p>",
        "id": 358322019,
        "sender_full_name": "Gurkenglas",
        "timestamp": 1684100070
    }
]