[
    {
        "content": "<p>Going back to Joyal-Street's classic <em>The geometry of tensor calculus</em>, I believe the following should be a way of packaging their results (I'll only consider the case of planar diagrams). Namely, I think that it should be possible to define a <em>site</em> <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"script\">S</mi></mrow><annotation encoding=\"application/x-tex\">\\mathcal{S}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathcal\" style=\"margin-right:0.075em;\">S</span></span></span></span> whose</p>\n<ul>\n<li>objects are J&amp;S's string diagrams i.e. progressive plane graphs, </li>\n<li>morphisms are certain embeddings of plane graphs, so that the isomorphisms are exactly the continuous deformations/planar isotopies allowed by J&amp;S, and the non-isomorphisms include at least the inclusions of factors of a “tensor decomposition” or a “vertical decomposition”, and</li>\n<li>the topology is given by the obvious covering families of embeddings,</li>\n</ul>\n<p>together with a functor to the category of strict monoidal categories, sending each such diagram to the free strict monoidal category on its nodes&amp;wires.</p>\n<p>Such a functor should send the covering cocones to colimits so it should extend to a functor on the topos of sheaves on this site, with a right adjoint nerve functor. Then “diagrammatic reasoning à la Joyal-Street” would, essentially, be working in this nerve.</p>\n<p>I don't know what the notion of morphism of progressive plane graphs that would make this work is. I am not against working this out myself, but to avoid duplicating work: is anyone aware of this (or something essentially equivalent) having been done?</p>",
        "id": 296828586,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662127914
    },
    {
        "content": "<p>Probably not familiar enough with J&amp;S, but, e.g., monoidal categories, as algebras for a familial monad, have a nerve (= embed fully into some presheaf cat with the image characterised by a Segal condition). Does this have anything to do with your proposal? (Just trying… <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span> )</p>",
        "id": 296839134,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1662131236
    },
    {
        "content": "<p>Not an answer: Do you have some motivation, eg. what kind of things could you learn about string diagrams and/or monoidal categories by studying the sheaf topos on this thing?</p>",
        "id": 296839825,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1662131428
    },
    {
        "content": "<p>It's for an expository paper, I'm not trying to prove anything new.</p>",
        "id": 296843211,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662132489
    },
    {
        "content": "<p>I would like to give an overview of different \"formal interpretations of diagrammatic reasoning\" in terms of different nerve functors, and it would be nice to have Joyal-Street in that form.</p>",
        "id": 296843590,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662132609
    },
    {
        "content": "<p>Oooops, sorry the monad is pointwise analytic, but not familial.</p>",
        "id": 296853380,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1662135632
    },
    {
        "content": "<p>It seems like you would need the morphisms to come equipped with extra data? Or maybe you mean something more precise when you say \"certain embeddings of plane graphs\". By this I mean that if you're taking these diagrams as a subcategory of topological spaces, you won't be able to categorically exclude the homeomorphisms of graphs that aren't well-behaved (you need some constraint on the complement of the graph in the plane too)</p>",
        "id": 296879859,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1662145478
    },
    {
        "content": "<p>Yeah, there's already extra data in the definition of plane graph; it's a topological graph, so a space with the structure of a 1d cell complex, together with an embedding into the plane</p>",
        "id": 296886565,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662148477
    },
    {
        "content": "<p>Presumably morphisms would be commutative squares of \"good\" embeddings (if not even weakly commutative?)</p>",
        "id": 296886759,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662148564
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"383799\">@Tom Hirschowitz</span> Yes I'm aware that there are good nerves of monoidal categories, in fact \"better\" ones than this would be (it would be faithful but not fully faithful), but right now I am interested in getting this one right :)</p>",
        "id": 296887741,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1662148970
    }
]