[
    {
        "content": "<p>Here's a paper I saw posted on the arxiv yesterday. It's really cool! I haven't read through it in depth yet, but I think it's exciting. Does anyone have any observations/thoughts about it?</p>\n<p><a href=\"https://arxiv.org/abs/2405.04780\">https://arxiv.org/abs/2405.04780</a></p>",
        "id": 437910854,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1715304512
    },
    {
        "content": "<p>As they say, it gives a sort of globular model for infinity categories. I wonder how the comonad here is related to the monad associated to the operad in the batanin definition of weak oo groupoids?</p>",
        "id": 437910902,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1715304579
    },
    {
        "content": "<p>Could you elaborate on which part gives a globular model for ∞-categories? From a quick skim I only see the claim for ∞-groupoids.</p>",
        "id": 437991947,
        "sender_full_name": "Josh Chen",
        "timestamp": 1715351477
    },
    {
        "content": "<p>Sorry, meant to say groupoids</p>",
        "id": 437994215,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1715352325
    },
    {
        "content": "<p>So we can define an ∞-groupoid as a strict ∞-groupoid equipped with an ∞-functor to its 'strictification' obeying some axioms? Is there a concrete description of what the strictification functor does?</p>",
        "id": 437996199,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1715353173
    },
    {
        "content": "<p>I would say not really? It's constructed using a simplicial model on both sides, algebraic kan complexes and a full subcategory thereof where the distinguished horn fillers act like \"thin\" simplices. There's a procedure to collapse together pairs of simplices that \"should be\" the same in an algebraic kan complex if it were strict and strictification is defined as iterating this procedure ω times then taking a colimit. Very based on the presentation and not very conceptual imo</p>",
        "id": 438019728,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1715362087
    }
]