[
    {
        "content": "<p>This is probably a naive question, but the main examples of absolute (co)limits (splittings of idempotents and biproducts) are also the main examples of 'bilimits' in the sense of being both limits and colimits. Is there some deep reason behind this?</p>",
        "id": 282407167,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1652617578
    },
    {
        "content": "<p>Yes!  In fact all absolute (co)limits are bilimits.  I think either Kelly or Street proved this in the setting of enriched categories, but I don't recall the reference.  The weights for absolute colimits are the ones that have right (I think) adjoints and if you use the adjoint weight for a limit you get the same object.  Similarly if you start with an absolute limit its weight has a left (I think) adjoint which gives you the same object as a colimit.</p>",
        "id": 282408822,
        "sender_full_name": "James Deikun",
        "timestamp": 1652619996
    },
    {
        "content": "<p>Thanks! It looks like the paper you are referring to is <em>Absolute colimits in enriched categories</em> by Ross Street. The paper uses some kind of parametrised version of weighted limits that I haven't seen before, so I will probably need to take some time to wrap my head around it. Street doesn't actually mention that if you use the adjoint weight for the limit it gives the same object as the colimit, though maybe this is obvious for people who understand enriched category theory better than I do.</p>",
        "id": 282409889,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1652621806
    },
    {
        "content": "<p>There's also Garner's <a href=\"http://www.tac.mta.ca/tac/volumes/29/26/29-26abs.html\">Diagrammatic characterisation of enriched absolute colimits</a></p>",
        "id": 282410562,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1652622894
    },
    {
        "content": "<p>FYI, 'bilimit' is a potentially confusing word, because it's also been used to mean \"bicategorical limit\".</p>",
        "id": 282412127,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1652625244
    },
    {
        "content": "<p>Yes, though is there any other established name for this concept?</p>",
        "id": 282415600,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1652630443
    },
    {
        "content": "<p>The nlab's <a href=\"https://ncatlab.org/nlab/show/bilimit\">[[bilimit]]</a> page seem to propose <code>ambidextrous adjunction</code> as an alternative name (with both pros and cons). Looking at the arguments (and unless there exist another good disambiguation) I might use <code>ambilimit</code> if I need to refer to these.</p>",
        "id": 282416716,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1652632084
    },
    {
        "content": "<p>An ambidextrous adjunction is an adjunction where the left adjoint is also a right adjoint.  That's a perfectly good term for <em>that</em> concept.    Of course that's not exactly the same as something that's both a limit and colimit.  But they're connected - so yes, I like the word 'ambilimit'.</p>",
        "id": 282417988,
        "sender_full_name": "John Baez",
        "timestamp": 1652633961
    },
    {
        "content": "<p>See §6 of Kelly–Schmitt's <a href=\"http://www.tac.mta.ca/tac/volumes/14/17/14-17.pdf\">Notes on enriched categories with colimits of some class</a>, which explicitly proves the result about absolute weights in terms of adjoints.</p>",
        "id": 282433813,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1652656203
    }
]