[
    {
        "content": "<p>Is there a \"standard\" term for a category which is both <a href=\"https://ncatlab.org/nlab/show/adhesive+category\">adhesive</a> and <a href=\"https://ncatlab.org/nlab/show/extensive+category\">extensive</a> (or equivalently, adhesive with a strict initial object)?<br>\nHere by \"standard\" I mean with at least one pre-existing usage.</p>",
        "id": 240955859,
        "sender_full_name": "Reid Barton",
        "timestamp": 1622559951
    },
    {
        "content": "<p>(Rationale: Any such category has a cd-structure whose distinguished squares are the pushouts of monomorphisms; what I really want is a name for the topology it generates. But this topology includes the empty family as a covering family of the initial object, and so it doesn't seem quite appropriate to call it the \"adhesive topology\", since an adhesive category doesn't have to have an initial object.)</p>",
        "id": 240956460,
        "sender_full_name": "Reid Barton",
        "timestamp": 1622560138
    },
    {
        "content": "<p>Sticky?</p>",
        "id": 240973234,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622567241
    },
    {
        "content": "<p>LOL, I thought about \"adherent\" (to imitate \"coherent\") but indeed there are many other synonyms for \"adhesive\" to consider!</p>",
        "id": 240983328,
        "sender_full_name": "Reid Barton",
        "timestamp": 1622571669
    },
    {
        "content": "<p>Do you have any examples of adhesive categories which aren't extensive. I see on the nLab page that any adhesive category with a strict initial object is extensive so I imagine most adjesive categories are extensive.</p>",
        "id": 241075444,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622581475
    },
    {
        "content": "<p>Apparently pointed sets is an example</p>",
        "id": 241084618,
        "sender_full_name": "Reid Barton",
        "timestamp": 1622587217
    },
    {
        "content": "<p>When you pull back along the coproduct inclusions, you pick up two copies of the fiber over the distinguished point, but when you add them back together, only the distinguished points get re-merged. This is an interesting example since the pullbacks <em>are</em> coproduct inclusions, but not for the same coproduct decompositions.</p>",
        "id": 241088141,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1622589842
    },
    {
        "content": "<p>Oh nice. That’s a good one.</p>",
        "id": 241100363,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1622602432
    }
]