[
    {
        "content": "<p>I've been trying to remember where I saw the description of the construction of a 2-category (or even just 2-groupoid) from a double category/groupoid. it might be hiding in a paper of Ehresmann, but I've not much to go on to do a search. Most google results are about the construction of the double category of quintets, rather than the other way around. The nLab doesn't help, it hints that there might be some such construction, possibly only in special cases.</p>\n<p>I'm very much not after the edge-symmetric case, or with connections etc, but the/a general version.</p>",
        "id": 260108826,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1635932508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> Are you after the left adjoint or the right adjoint? The left adjoint is described in Multiple Functors IV; they call it \"String\".</p>",
        "id": 260109903,
        "sender_full_name": "Alexander Campbell",
        "timestamp": 1635933106
    },
    {
        "content": "<p>Hmm, I think the left adjoint.</p>",
        "id": 260110707,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1635933560
    },
    {
        "content": "<p>Looking at the description (Proposition 8), it seems <em>very</em> familiar (though it was probably 13 years ago when I last looked), so I think that's what I'm after. Thanks, <span class=\"user-mention\" data-user-id=\"277459\">@Alexander Campbell</span> !</p>",
        "id": 260110854,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1635933620
    },
    {
        "content": "<p>There are two ways to think of a 2-globe as a degenerate square.   So given a (strict) double category D here are two ways to build a 2-category C, I think: </p>\n<ul>\n<li>\n<p>take the objects of C to be the objects of D, the 1-morphisms of C to be the vertical 1-morphisms of D, and the 2-morphisms of C to be the 2-cells of D whose top and bottom horizontal 1-morphisms are identities.</p>\n</li>\n<li>\n<p>take the objects of C to be the objects of D, the 1-morphisms of C to be the horizontal 1-morphisms of D, and the 2-morphisms of C to be the 2-cells of D whose left and right vertical 1-morphisms are identities.</p>\n</li>\n</ul>",
        "id": 260128820,
        "sender_full_name": "John Baez",
        "timestamp": 1635943909
    },
    {
        "content": "<p>While these are both in common use and very handy, I guess neither is a left or right adjoint to some way of getting a double category from a 2-category!</p>",
        "id": 260128981,
        "sender_full_name": "John Baez",
        "timestamp": 1635943971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> I believe those are both right adjoints.  The corresponding left adjoints make a 2-category into a double category with only identity horizontal 1-morphisms or only identity vertical 1-morphisms, respectively.  But David's question was about a third adjunction different from both of these.</p>",
        "id": 260146840,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1635951879
    },
    {
        "content": "<p>Okay.  I didn't take David's comment to mean he's looking for an adjoint to the quintet construction in particular.    He just said \"the other way around\".  But if that's what he wants, I just described two very useful things that aren't that!</p>",
        "id": 260150342,
        "sender_full_name": "John Baez",
        "timestamp": 1635953149
    },
    {
        "content": "<p>I'm glad they're right adjoints of something.   I should have said they're not adjoints of something symmetrical under switching vertical and horizontal (obviously).</p>",
        "id": 260150498,
        "sender_full_name": "John Baez",
        "timestamp": 1635953207
    },
    {
        "content": "<p>Yes, I was being a bit vague, but thankfully Alex figured it out.</p>",
        "id": 260210445,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1635981264
    },
    {
        "content": "<p>Wow, I didn't read the subject header until just now!</p>",
        "id": 260212365,
        "sender_full_name": "John Baez",
        "timestamp": 1635982769
    },
    {
        "content": "<p>Oh, that construction is interesting! It looks like I re-discovered it recently when I did \"The word problem for double categories\" (<a href=\"http://www.tac.mta.ca/tac/volumes/35/1/35-01abs.html\">http://www.tac.mta.ca/tac/volumes/35/1/35-01abs.html</a>). I should have a proper look to understand how they manage to make it functorial.</p>",
        "id": 260591981,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1636314194
    }
]