[
    {
        "content": "<p>i'm curious if there has been any work on an alternate presentation of category theory that uses slightly different building blocks than morphisms. In particular, i'm thinking about monads, and specifically comprehensions as an alternate building block.</p>",
        "id": 193580371,
        "sender_full_name": "Lucius Gregory Meredith",
        "timestamp": 1586531966
    },
    {
        "content": "<p>Set comprehensions are essentially the basis of the set theoretic foundations of mathematics. Monads generalize set comprehensions. Likewise, comprehensions are at the core of some of the most active areas of programming language design and practice. One has only to look at SELECT-FROM-WHERE to Haskell's do-notation to Scala's for-notation to XQuery's FLWOR expressions to the last 15 years of language integrated query to see how fertile and useful this notion is; and to see that monads lie at the heart of it.</p>",
        "id": 193580974,
        "sender_full_name": "Lucius Gregory Meredith",
        "timestamp": 1586532256
    },
    {
        "content": "<p>My intuition is that while monads currently require notions of morphisms to express, we might be able to turn the situation on its head and express notions of morphisms via monads, much in the same way as we view extensional set-theoretic views of functions as particular kinds of sets of ordered pairs.</p>",
        "id": 193581363,
        "sender_full_name": "Lucius Gregory Meredith",
        "timestamp": 1586532459
    },
    {
        "content": "<p>Hi!  By the way, a whole <em>stream</em> on this topic seems excessive.  This sort of thing would typically be a \"topic\" within some stream.</p>",
        "id": 193600379,
        "sender_full_name": "John Baez",
        "timestamp": 1586542553
    },
    {
        "content": "<p>Thanks for the comment! You mean on alternative presentations of category theory? It seems pretty broad to me. The arrows only approach is certainly worth discussion in its own right, and there may yet be other presentations. i, for one, would like to see an effective presentation in terms of a domain equation, or something like that, as well. So, i see this as extremely broad with lots of subtopics.</p>",
        "id": 193601020,
        "sender_full_name": "Lucius Gregory Meredith",
        "timestamp": 1586542959
    },
    {
        "content": "<p>Any topic could in theory become very broad if enough people wrote about it in enough different ways.</p>",
        "id": 193601149,
        "sender_full_name": "John Baez",
        "timestamp": 1586543049
    },
    {
        "content": "<p>If \"alternative presentations\" means \"alternative presentations of category theory\" I think it'd fit snugly in theory: category theory.</p>",
        "id": 193601197,
        "sender_full_name": "John Baez",
        "timestamp": 1586543092
    },
    {
        "content": "<p>But <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span> is the organizer here.  Carry on!</p>",
        "id": 193601232,
        "sender_full_name": "John Baez",
        "timestamp": 1586543111
    },
    {
        "content": "<p>In terms of an effective presentation, i have spent some time developing a domain equation/type theoretic inspired approach to graphs that can be used as a basis for a wide range of category theoretic phenomena. (<a href=\"https://github.com/rchain/ladl/blob/master/ToGL.md\" title=\"https://github.com/rchain/ladl/blob/master/ToGL.md\">https://github.com/rchain/ladl/blob/master/ToGL.md</a>)</p>",
        "id": 193601350,
        "sender_full_name": "Lucius Gregory Meredith",
        "timestamp": 1586543180
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"233122\" href=\"/#narrow/stream/233122-theory.3A-alternate-presentations/topic/alternate.20presentation.20of.20category.20theory\">#theory: alternate presentations &gt; alternate presentation of category theory</a> by <span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span></p>",
        "id": 263426645,
        "sender_full_name": "Notification Bot",
        "timestamp": 1638446564
    },
    {
        "content": "<p>This thread may well stay dead, but the otherwise inactive stream it originated from has been deleted, so I moved this here for posterity.</p>",
        "id": 263426757,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1638446648
    }
]