[
    {
        "content": "<p>Is there an existing notion of \"cartesian virtual double category\", analogous to a cartesian double category? If so, is there somewhere I could read about them?</p>\n<p>(It's a fairly idle question because I'm not very knowledgeable about cartesian double categories. I'm mostly asking because the 'virtual' perspective feels like it might be useful for thinking about what they should be like.)</p>",
        "id": 479361201,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1730150163
    },
    {
        "content": "<p>The 2-category of virtual double categories has finite products, so one may define a \"cartesian virtual double category\" to be a <a href=\"https://ncatlab.org/nlab/show/cartesian%20object\">[[cartesian object]]</a> in this 2-category. If you unwind what this means, you get something that looks similar to a cartesian double category, but satisfying a multiary 2-dimensional universal property (as is appropriate for virtual double categories). For virtual double categories <em>with restrictions</em>, the data is explicitly unwound in Proposition 2.8 of Nasu's <a href=\"https://arxiv.org/abs/2410.06792\">An Internal Logic of Virtual Double Categories</a>, but otherwise I don't know of a reference.</p>",
        "id": 479365608,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1730152545
    },
    {
        "content": "<p>Looking at that proposition, are you two absolutely <em>sure</em> that without restrictions, a universal property with respect to only special 2-cells is sufficient?  I'd think you would need a stronger version of condition (ii) that allows cells along nontrivial tight arrows.  (EDIT: apparently I was right and the previous comment was amended.)</p>",
        "id": 479376683,
        "sender_full_name": "James Deikun",
        "timestamp": 1730158322
    },
    {
        "content": "<p>That proposition is only about the case <em>with</em> restrictions, isn't it?  That's what he means by an FVDC.</p>",
        "id": 479382354,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1730162679
    },
    {
        "content": "<p>Indeed, that is what the proposition was about in its original context.  I was talking about the modification of taking out condition (iii) to make it work without restrictions.</p>",
        "id": 479387818,
        "sender_full_name": "James Deikun",
        "timestamp": 1730167108
    },
    {
        "content": "<p>Oh, I see.  Yes, I agree, in the absence of restrictions, in compensation for omitting condition (iii), surely condition (ii)(a) must be strengthened as you suggest to include cells with nontrivial tight boundary.</p>",
        "id": 479388851,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1730167866
    },
    {
        "content": "<p>Sorry, I wasn't paying close enough attention.</p>",
        "id": 479388877,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1730167894
    },
    {
        "content": "<p>Yes, sorry, my mistake, I didn't look closely enough at the definition. I've amended my previous comment.</p>",
        "id": 479420000,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1730188836
    }
]