[
    {
        "content": "<p>Is there an established name for a compact closed category in which every object is self-dual?  (I suspect that unlike ordinary compact closedness this is additional structure on a symmetric monoidal category.)</p>",
        "id": 277924652,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1649183701
    },
    {
        "content": "<p>In the literature this is often called a \"self dual compact closed category\".</p>\n<p>I think this terminology is justified as opposed to merely saying a compact closed category with self dual objects because the transpose becomes a dagger functor, thus it is actually isomorphic to its opposite category. However, I don't know if a self dual category which happens to be compact closed is automatically \"self dual compact closed\" in this sense.</p>",
        "id": 277929436,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1649185658
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277391\">Cole Comfort</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/compact.20closed.20with.20self-dual.20objects/near/277929436\">said</a>:</p>\n<blockquote>\n<p>However, I don't know if a self dual category which happens to be compact closed is automatically \"self dual compact closed\" in this sense.</p>\n</blockquote>\n<p>The category of dualizable (i.e. finitely-generated and projective) modules over a ring is equivalent to its own opposite category, but it's not always the case that the dual of a module is isomorphic to itself (although I don't have any good examples of this in my head).</p>",
        "id": 277936188,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1649189075
    },
    {
        "content": "<p>Any compact closed category is equivalent to its opposite by the dualization functor, and by fattening up the category you can make that equivalence into an isomorphism.  So I don't think \"self dual compact closed category\" is a good name.  I had thought of \"locally-self-dual compact closed category\".</p>",
        "id": 277944145,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1649193148
    },
    {
        "content": "<p>(By analogy with \"locally presentable category\", whose objects are presentable.)</p>",
        "id": 277944176,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1649193165
    },
    {
        "content": "<p>\"Locally\" is one of the most egregiously overloaded terms in category theory. That said, I don't have an alternative suggestion for the moment :)</p>",
        "id": 277965050,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1649208271
    }
]