[
    {
        "content": "<p>A double bicategory is defined as a pair of bicategory structures on the same set of objects, plus a bunch more data and properties. It would be intuitive to me that we could instead ask for a pair of bicategories with a specified equivalence between them, plus a bunch more data and properties. Has anyone worked this out? I guess what I'm hoping for with this is that we could recognize double bicategories as something more natural looking if we think of them instead as a sort of pairing between two bicategories. The defintion is pretty hefty and it would be nice to have a more conceptual framing for it</p>",
        "id": 422843704,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1708616346
    },
    {
        "content": "<p>Do you similarly feel that a double category would be more intuitive as a pairing between two categories rather than as two category structures on the same set of objects?</p>",
        "id": 422846572,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1708616981
    },
    {
        "content": "<p>Hmm, I guess not. Maybe that's a sign I'm barking up the wrong tree here</p>",
        "id": 422847247,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1708617106
    },
    {
        "content": "<p>I think I may try and write out a defintion of a double category in this decoupled way just to see what it looks like though</p>",
        "id": 422847469,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1708617147
    },
    {
        "content": "<p>Yeah thinking more about it the boundary of a square really wants to have all its vertices in one set</p>",
        "id": 422851937,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1708618312
    },
    {
        "content": "<p>Is there a nice high level definition of a double bicategory? I seem to recall there's a connection between Segal spaces in Grpd and pseudo double categories, maybe that's a place to start</p>",
        "id": 422852327,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1708618427
    },
    {
        "content": "<p>For what it's worth, <a href=\"https://arxiv.org/abs/1412.0212\">Pare and Grandis' paper on intercategories</a> explains that double bicategories correspond with a certain class of intercategories (so a pair of double categories with some extra properties and structure). I don't know if it's a more intuitive picture, but it at least avoids having to talk about the two categories having the same class of objects</p>",
        "id": 422852695,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1708618537
    },
    {
        "content": "<p>I don't know of a high-level definition that gives exactly double bicategories.</p>",
        "id": 422872415,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1708624560
    }
]