[
    {
        "content": "<p>I was wondering if the category of sheaves of commutative monoids over any site could be embedded fully faithfully and exactly into the category of modules over some commutative rig?</p>",
        "id": 313276975,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1669900775
    },
    {
        "content": "<p>I don't know a lot about sheaves and sites but Chris Heunen is speaking about generalizing the Freyd-Mitchell theorem by replacing rings by rigs in this paper: <a href=\"https://homepages.inf.ed.ac.uk/cheunen/publications/2008/semimodules/semimodules.pdf\">Semimodule enrichment</a></p>\n<p>I quote the first phrase of the introduction:<br>\n\"Mitchell’s celebrated theorem states that every Abelian category can be embedded in the category of modules over a ring [18]. This article is a first part of a generalisation from rings to semiring, which could hopefully give a representation theorem for semantic models of linear (quantum) computation.\"</p>\n<p>I'm not sure if it's useful in your context but I let you see.</p>",
        "id": 313283531,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669902606
    },
    {
        "content": "<p>Maybe we can try this: <span class=\"user-mention\" data-user-id=\"301248\">@Chris Heunen</span></p>",
        "id": 313284509,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669902896
    },
    {
        "content": "<p>But I guess that no theorem like this has yet been proved. The maths without negatives are today far from the state of development of the maths with negatives.</p>",
        "id": 313310481,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1669909823
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319282\">@Chetan Vuppulury</span>  I'm not familiar with rigs, but for every bounded topoi, the category of internal suplattices is equivalent to the category of modules over the quantale of relations on the respective bound.</p>",
        "id": 313348558,
        "sender_full_name": "Fernando Yamauti",
        "timestamp": 1669920139
    }
]