[
    {
        "content": "<p>I am reading the Grandis and Pare paper on limits in double categories and I am a little lost.</p>\n<p>When they introduce pseudo double categories they state that they have a strictly associative horizontal composition law and a weakly associative vertical composition. This suggests that for them, a pseudo double category is a pseudocategory in Cat whose category of arrows contains the vertical arrows and 2 cells, where vertical composition is part of the pseudocategory structure at the 2-categorical level, and the structure internal to the objects is horizontal composition.</p>\n<p>Then they say they will consider horizontal transformations of lax double functors, and that vertical transformations are unmanageable. But the vertical transformations are the transformations that arise from working internally in the 2-category Cat. What is the motivation for preferring the notion of natural transformation that goes in the opposite direction of that suggested by the theory of pseudocategories?</p>",
        "id": 530649974,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1753392532
    },
    {
        "content": "<p>An answer that removes the bias towards the vertical transformations is that the Grandis-Paré program was not in fact motivated by the theory of pseudocategories, which did not in any serious sense exist at the time they were writing (and is still, I'd say, rather cutting-edge.)</p>",
        "id": 530658922,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753397184
    },
    {
        "content": "<p>That done, why pick the horizontal transformations, even without the a priori bias? For me, it's easiest to see from examples. A lax double functor from the point into the double category of spans is a category, and a horizontal transformation between two such lax double functors is precisely a functor between the categories. A vertical transformation, once you pick out a definition, is some kind of unfamiliar object generalizing a retrofunctor--you would probably never find yourself asking for one organically.</p>",
        "id": 530659613,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753397568
    },
    {
        "content": "<p>Away from examples, the vertical transformations just involve more coherence conditions, and will not give you a 2-category of double categories as the tight transformations do.</p>",
        "id": 530659674,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1753397604
    },
    {
        "content": "<blockquote>\n<p>Then they say they will consider horizontal transformations of lax double functors, and that vertical transformations are unmanageable. But the vertical transformations are the transformations that arise from working internally in the 2-category Cat.</p>\n</blockquote>\n<p>They consider both \"horizontal\" and \"vertical\" transformations, but restrict consideration of the vertical transformations to the pseudo ones (their \"strong vertical transformations\").</p>",
        "id": 530712332,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753429217
    },
    {
        "content": "<p>Note that what they call \"vertical transformations\" in general are <em>not</em> the internal lax natural transformations: rather, they are what Paré later called \"modules\" in <a href=\"http://www.tac.mta.ca/tac/volumes/25/17/25-17.pdf\">Yoneda theory for double categories</a>. As such, their vertical transformations do not even compose in general.</p>",
        "id": 530712559,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753429298
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229136-theory.3A-category-theory/topic/Horizontal.20transformation.20between.20double.20functors/near/530658922\">said</a>:</p>\n<blockquote>\n<p>the Grandis-Paré program was not in fact motivated by the theory of pseudocategories, did not in any serious sense exist at the time they were writing (and is still, I'd say, rather cutting-edge.)</p>\n</blockquote>\n<p>Just to add to this, when considering double categories as pseudocategories, one needs to take care, because while the theory of pseudocategories is a useful tool for studying double categories, it can also provide misleading intuitions about the importance of certain concepts for double category theory (not every concept that seems sensible in pseudocategory theory appears of importance in double category theory, as it tends to have a bias in the loose direction).</p>",
        "id": 530713197,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1753429532
    },
    {
        "content": "<p>Okay, that's helpful to keep in mind.</p>",
        "id": 530778514,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1753451197
    }
]