[
    {
        "content": "<p>Let Poly denote the category of convex polytopes (embedded in some finite dimensional Euclidean space) and piecewise linear maps between them, and Poly0 the subcategory of that with only the affine maps. The simplex category and the cube category can be realized as (non-full) subcategories of Poly0, as can multisimplicial sets and the cube category (I'm a little uncertain about what happens with eg augmented simplicial sets, but I guess those should embed too if we accept the empty polytope?). Is the globe category a subcategory, in some natural geometric way, of (i) Poly0, (ii) Poly, (iii) the category of <em>finite</em> polytopal complexes with PL maps, (iv) the category of not necessarily finite polytopal complexes, (v) the PL topos Sh(Poly) = Sh(Poly0) where the grothendieck topology is generated by finite families of injections which are jointly surjective. One tricky thing is that the simplex and cube and globe categories are \"oriented\" while polytopes are \"unoriented\". Probably we could tag the polytopes with some extra sort of orientation or directedness data that makes things oriented?</p>",
        "id": 431456559,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1712299555
    },
    {
        "content": "<p>The maps in the globe category, as well as the <em>reflexive</em> globe category that also has “collapsing” maps, all induce closed order-preserving maps on the face posets of the globes. This defines a functor from the (reflexive) globe category to the category of (finite) posets and (closed) order-preserving maps.<br>\nYou can then compose with the order complex functor to turn these into finite simplicial complexes and simplicial maps, which embed into finite polytopal complexes and PL maps.</p>",
        "id": 431515406,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1712320770
    },
    {
        "content": "<p>And in fact the simplicial complex associated to the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-globe in this way is going to be a PL closed <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-ball.</p>",
        "id": 431515631,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1712320840
    },
    {
        "content": "<p>So I would say that (iii) and a fortiori (iv) and (v) have a positive answer.</p>",
        "id": 431516115,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1712321005
    },
    {
        "content": "<p>I do not know about (ii). There is no obvious functorial way to turn the globes into convex polytopes, given that, forgetting orientation, they are essentially “non-convex” abstract polytopes (digons, dihedra, and higher ditopes). But there may still be some “trick” that gives you such an interpretation.</p>",
        "id": 431516559,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1712321153
    },
    {
        "content": "<p>I am in the very last stages of writing a book which covers this and many related topics -- I am hoping to put it on the arXiv by the end of next week, so I will ask you for just a little patience if you need a reference.</p>",
        "id": 431517058,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1712321315
    },
    {
        "content": "<p>Oh wonderful, I look forward to seeing it</p>",
        "id": 431560374,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1712333626
    },
    {
        "content": "<p>I saw it was released, can't wait to read it!</p>",
        "id": 432827023,
        "sender_full_name": "Brendan Murphy",
        "timestamp": 1712895513
    }
]