[
    {
        "content": "<p>Ross Street has commented that his work on \"cosmoi\" has a logical aspect to it. The notation is meant to evoke set theory; he writes PA for the category of presheaves on A (P also stands for powerset) and suggests that the Yoneda embedding is like the singleton embedding A -&gt; PA. The axioms he takes, he says, are inspired by categorifying the substitution properties of equality. However, this is all he says about logic. The rest of his papers on this appear to be pure category theory. </p>\n<p>I think this idea is very interesting. In particular Kan extensions of V-valued functors would play the role of quantification. Thus a left Kan extension of a presheaf P along a functor F is an \"image\" of P along F. An element of lim P is a proof that \"for all c, P(c)\". </p>\n<p>What has been made of this from a logical point of view? Have any type theorists written down a formal theory which can be interpreted in cosmoi? I tried to work it out but it seems subtle. The pun with equality is difficult to formalize because this \"equality\" is not symmetric in general unless the category is a groupoid. It is maybe more like a reducibility relation than an equivalence relation.</p>",
        "id": 263803614,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1638758964
    },
    {
        "content": "<p>Maybe take a look at Lawvere’s first paper on hyperdoctrines where he uses the example of the category of small categories, with the ‘power object’ given by the presheaf category.</p>",
        "id": 263845364,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1638795364
    },
    {
        "content": "<p>If you want more advanced stuff, then you can take a look at Mark Weber’s paper on Yoneda structures and 2-toposes, or at Mike Shulman’s nLab page on 2-logic <a href=\"https://ncatlab.org/michaelshulman/show/2-categorical+logic\">https://ncatlab.org/michaelshulman/show/2-categorical+logic</a></p>",
        "id": 263845549,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1638795466
    },
    {
        "content": "<p>This <a href=\"https://golem.ph.utexas.edu/category/2014/03/an_exegesis_of_yoneda_structur.html\">blog post</a> on the n-cat cafe is a pretty good introduction.</p>",
        "id": 263845803,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1638795600
    },
    {
        "content": "<p>Paul-André Melliès and Noam Zeilberger further developped some of these ideas from Lawvere in <a href=\"https://arxiv.org/abs/1501.05115\">An Isbell Duality Theorem for Type Refinement Systems</a></p>",
        "id": 263851950,
        "sender_full_name": "Kenji Maillard",
        "timestamp": 1638798593
    },
    {
        "content": "<p>In general, this sort of \"directed type theory\" is quite subtle.  In addition to my unfinished work on the nlab, there's work by Harper and Licata, Nuyts, and North, but I don't think any of it has a general categorical semantics in something like cosmoi yet.</p>",
        "id": 263922836,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1638823961
    }
]