[
    {
        "content": "<p>It is well known (ie it says so on the nlab) that there is exactly one model structure on <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"sans-serif\">C</mi><mi mathvariant=\"sans-serif\">a</mi><mi mathvariant=\"sans-serif\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathsf{Cat}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\"><span class=\"mord mathsf\">Cat</span></span></span></span></span> such that the weak equivalences are the equivalences of categories, and the fibrations turn out to be exactly the isofibrations. I have two sort-of-related questions:</p>\n<ol>\n<li>are there any (known) model structures where the weak equivalences are just bijective-on-objects functors?</li>\n<li>does the class of discrete (op)fibrations define a category of fibrant objects (with b.o.o. functors as weak equivalences)?</li>\n</ol>",
        "id": 278378882,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649466192
    },
    {
        "content": "<p>it seems like (for 2, which is what i really care about) the only hard thing is constructing a path space object, but i figured this was the sort of thing that, if true, somebody somewhere (probably in australia!) already knows, so i thought i’d check first</p>",
        "id": 278378958,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649466267
    },
    {
        "content": "<p>You can't have a category of fibrant objects structure with the discrete fibrations for the silly reason that not every category is discrete over 1. But perhaps you might get some kind of fibration category structure.</p>",
        "id": 278379106,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1649466505
    },
    {
        "content": "<p>isn’t every functor to the terminal category trivially a discrete opfibration? or am i reading the definition wrong…</p>",
        "id": 278379302,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649466786
    },
    {
        "content": "<p>That happens iff the category is discrete. Every functor to 1 is an isofibration and even a Grothendieck fibration, however.</p>",
        "id": 278379388,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1649466894
    },
    {
        "content": "<p>ah sure, everything lifts the identity on the unique object otherwise</p>",
        "id": 278379486,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649466999
    },
    {
        "content": "<p>in that case, I’m still interested in answers to my questions, but where you change the words however you have to in order for there to actually be an answer 😉</p>",
        "id": 278379523,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649467057
    },
    {
        "content": "<p>maybe a fibration category is possible then, like you say, but the nlab has no information about these</p>",
        "id": 278379600,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649467139
    },
    {
        "content": "<p>“HOMOTOPY THEORY OF COFIBRATION CATEGORIES” by Szumilo also seems to say the a (co)fibration category still requires every object to be (co)fibrant, which contradicts the nlab page on cofibration categoires 😵‍💫</p>",
        "id": 278379754,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649467361
    },
    {
        "content": "<p>Unfortunately there are a lot of variations on the notion of \"category with a class of fibrations\".  Sometimes people try to distinguish them with different words like \"fibration category\" or \"category of fibrant objects\", but other times they overload terminology.</p>",
        "id": 278379829,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1649467460
    },
    {
        "content": "<p>Ad 2, the class of discrete fibrations is the right class of an orthogonal factorization system whose left class is the class of final functors.  In particular, if it were the class of fibrations in a model structure, all final functors would have to be weak equivalences (and most of them are not bijective on objects — while conversely most bijective on objects functors are not final).  I'm not sure whether the same conclusion holds in a mere fibration category, but it's at least suggestive of what a notion of \"weak equivalence\" corresponding to discrete fibrations would probably act like.</p>",
        "id": 278379983,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1649467669
    },
    {
        "content": "<p>oh of course! i literally just this week finished coauthoring a paper where we mention that initial functors and discrete opfibrations form an orthogonal factorisation system</p>",
        "id": 278380536,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649468458
    },
    {
        "content": "<p>but somehow managed to forget that fact the moment the paper had been submitted <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 278380544,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649468484
    },
    {
        "content": "<p>on a related note, i get lost in the sea of related things (fibration categories, weak factorisation system, calculi of fractions, model categories, homotopical categories, waldhausen categoires…) and i know (or at least i think i do) that there’s also this whole bunch of 2-categorical stuff (proarrow equipments?) that’s also relevant — is there any reference that explains how at least some of these things all fit together?</p>",
        "id": 278380675,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1649468667
    }
]