[
    {
        "content": "<p>I seem to have fallen down this rabbit hole... let me attempt to summarise the situation:</p>\n<ol>\n<li>A <strong>strong monad</strong> T on a monoidal category is a left-strong and right-strong monad such that the two maps (A ⊗ TB) ⊗ C → T (A ⊗ (B ⊗ C)) agree. A <strong>commutative monad</strong> is a strong monad such that the usual diagram commutes, which does not require a symmetric monoidal category.</li>\n<li>If the category is also <em>symmetric</em> monoidal (with c : A ⊗ B → B ⊗ A), then let us say that the monad is <strong>symmetrically strong</strong> if one strength determines the other, i.e. σ = Tc ∘ τ ∘ c. The nlab page on monoidal monads assumes (remark 2.1) that all strong monads on a symmetric monoidal category are symmetrically strong.</li>\n<li>In a monoidal category, there is a one-to-one correspondence between the structures of a <em>commutative monad</em> (with unrelated strengths) and a <em>monoidal monad</em> on a given monad.</li>\n<li>Under this correspondence, if the category is <em>symmetric</em> monoidal, then the property of being a <em>symmetrically strong</em> commutative monad corresponds to being a <em>symmetric</em> monoidal monad. Thus, under the nlab's assumption, we recover the correspondence between commutative monads and symmetric monoidal monads.</li>\n</ol>\n<p>3 and 4 are basically untangling the symmetry assumptions from the results of Anders Kock (<em>Monads on Symmetric Monoidal Closed Categories</em> and <em>Strong Functors and Monoidal Monads</em>), and would require careful checking but I've pretty much convinced myself they hold by skimming over the proofs and looking at where the assumptions are used.</p>\n<p>In particular this means that not all monoidal monads are symmetric: that assumption would be equivalent to the assumption that all commutative monads are symmetrically strong. (That said I have no idea if the counterexample in the linked paper is correct.)</p>",
        "id": 422108709,
        "sender_full_name": "Naïm Favier",
        "timestamp": 1708272742
    }
]