[
    {
        "content": "<p>(splitting off from <a href=\"#narrow/stream/229136-theory.3A-category.20theory/topic/monad.20over.20abelian.20cat/near/216179083\">https://categorytheory.zulipchat.com/#narrow/stream/229136-theory.3A-category.20theory/topic/monad.20over.20abelian.20cat/near/216179083</a>)</p>\n<p><span class=\"user-mention\" data-user-id=\"294557\">@dusko</span>: I find the discussion in your paper regarding the importance of retractions in the category of adjunctions very intriguing. Considering the fundamental nature of absolute (co)limits here, is there a way to derive the notion of Cauchy completeness (or the Cauchy completion) directly from the concepts in the paper (e.g. the nucleus)?<br>\nI'm also curious about the paper \"Tight bicompletions of categories: The Lambek monad\", which does not seem to be available yet. Is this related to your earlier paper \"Towards concept analysis in categories: limit inferior as algebra, limit superior as coalgebra\"? I tried to skim it, but the nonstandard terminology made it a little hard to digest without reading more carefully. Is there a relation with the Isbell envelope?</p>",
        "id": 216354353,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1605105882
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229136-theory.3A-category.20theory/topic/nucleus.20of.20an.20adjunction/near/216354353\">said</a>:</p>\n<blockquote>\n<p>(splitting off from <a href=\"#narrow/stream/229136-theory.3A-category.20theory/topic/monad.20over.20abelian.20cat/near/216179083\">https://categorytheory.zulipchat.com/#narrow/stream/229136-theory.3A-category.20theory/topic/monad.20over.20abelian.20cat/near/216179083</a>)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"294557\">dusko</span>: I find the discussion in your paper regarding the importance of retractions in the category of adjunctions very intriguing. Considering the fundamental nature of absolute (co)limits here, is there a way to derive the notion of Cauchy completeness (or the Cauchy completion) directly from the concepts in the paper (e.g. the nucleus)?<br>\nI'm also curious about the paper \"Tight bicompletions of categories: The Lambek monad\", which does not seem to be available yet. Is this related to your earlier paper \"Towards concept analysis in categories: limit inferior as algebra, limit superior as coalgebra\"? I tried to skim it, but the nonstandard terminology made it a little hard to digest without reading more carefully. Is there a relation with the Isbell envelope?</p>\n</blockquote>\n<p>sorry about the nonstandard terminology. it is a matter of taste and i am often wrong, but there are times when standards become an obstacle. yes, the whole thing with the nucleus and the bicompletion is the result of 20 years of going back to lambek's question of the dedekind-macneille completion, and of the dust that john isbell threw on it. not that any of us was obsessed with going back to a particularly humiliating problem, but whenever we would get a data analysis project, lambek's question would hit me on the head again. the whole reason why the data analysis problems keep coming back is that the numeric completions (in vector spaces + SVD)  and the DM-completions in lattices do not allow people to capture the forms of traffic that interest them, which lead not to matrices of numbers, but of datasets, and eventually to profunctors. so the quest for bicompletions that preserve what is already there is at the heart of the real problem of concept mining. some of the most run algorithms on the web are in that area. so the question was what is the right concept of bicompletion. or more precisely, find the sufficiently general concept of limits and colimits such that they construct each other, like the joins and the meets do in lattices. the gospel of absolute limits and colimits was bob pare's thesis, from something like 1969. but the monadicity theorem was already standardized, and people continued to prove it using the (do i remember how to say this?) the U-spit reflexive coequalizers.</p>",
        "id": 216418850,
        "sender_full_name": "dusko",
        "timestamp": 1605145703
    },
    {
        "content": "<p>thanks for asking :)</p>",
        "id": 216418860,
        "sender_full_name": "dusko",
        "timestamp": 1605145724
    },
    {
        "content": "<p>Is there a short description of the \"tight bicompletion\" and \"Lambek monad\" mentioned in the unreleased paper title? And how does it compare with the free bicompletion and/or the Isbell envelope, if you know? Or should I wait for the paper? :)</p>",
        "id": 216419758,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1605146646
    }
]