[
    {
        "content": "<p>There are at least two notions of pointwise left Kan extension for the category of double categories. There is a notion due to Grandis and Pare which is conceptually similar to pasting comma squares in a 2-category, this is developed in their paper \"Lax kan extensions for double categories\" , and we can also consider the virtual equipment of weak double categories, pseudo double functors and (lax) double profunctors, and apply a notion of weighted colimit (which i first found in <span class=\"user-mention\" data-user-id=\"276092\">@Nathanael Arkor</span>'s paper on formal category theory)</p>\n<p>Is it known whether these agree where they are both defined? my instinct is that the weighted colimit notion might be something closer to what Grandis and Pare call a one dimensional horizontal colimit.</p>",
        "id": 383760645,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1691702339
    },
    {
        "content": "<p>in my application all the double categories are strict and even flat so i don't need a lot of generality</p>",
        "id": 383761881,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1691702739
    },
    {
        "content": "<p>My impression was that the notion of Kan extension for double categories studied in <em>Lax Kan extensions for double categories</em> was an instance of the notion of Kan extension in a double category studied in <em>Kan extensions in double categories</em>. If this is the case, then it may be possible to use the results of <span class=\"user-mention\" data-user-id=\"584178\">@Roald Koudenburg</span>'s <a href=\"https://arxiv.org/abs/1402.0250\">On pointwise Kan extensions in double categories</a> (e.g. Theorem 5.11 and the following corollaries) to prove that the two notions of Kan extension (in the Grandis–Paré sense, or the weighted colimit sense) coincide.</p>",
        "id": 383763215,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1691703191
    },
    {
        "content": "<p>Ok I thought I had a response to this but I will look at it more carefully first.</p>",
        "id": 383794914,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1691716722
    }
]