[
    {
        "content": "<p>there was a stream called something like \"free monads\" which i am unable to find. </p>\n<p>it circled to ross street's paper on \"The formal theory of monads\", and i mentioned that it was easier to read translated into string diagrams, and someone said that they often did that, and i said that it might be  a public service to latex and post such efforts, and a couple of people said or emailed that they were down for such an effort. the question was how to get a reasonable reward for such public service, and then TAC Expositions was mentioned as a possible venue, so i said i would go ask ross street what he thought of all that.</p>\n<p>well he is enthusiastic about the idea, and agrees that commented versions of such papers are useful, and i think would probably help with explanations. BUT since TAC Expositions was established with his participation and initiative, his involvement with presenting or offering it there would not be appropriate.</p>\n<p>so if people are still interested to try this, the right person to ask would be geoff cruttwell.</p>\n<p>((strange that i am unable to find a week old stream here. if i am allowed to teach students, i should be able to find my way around a chat list. either this is a very complicated knot of threads, or my mental capabilities should be reassessed. there was also a thread about the universal properties of the slice categories, and people gave references to books from the 90s, and i said that it was in Expoase IV in SGA4 (run in 1963) --- and that last comment got cut. maybe it landed somewhere else, but it left the references that are 35 years off as the last word. which should perhaps be avoided in stream surgery))</p>",
        "id": 244350488,
        "sender_full_name": "dusko",
        "timestamp": 1625002132
    },
    {
        "content": "<p>(The previous thread <a href=\"#narrow/stream/229136-theory.3A-category.20theory/topic/.22Inverse.22.20of.20free/near/243868904\">was here</a>. I searched for \"TAC expositions\" in the search bar at the top.)</p>",
        "id": 244350764,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1625002292
    },
    {
        "content": "<p>aha, thank you. the first thought is that i am stupid that i was unable to find it. that is a distinct possibility. the second thought is that the Recent topics menu seems to have been designed for less fragmented streams, since a strem touched 4 days ago is 4 pages of topics down.</p>",
        "id": 244351234,
        "sender_full_name": "dusko",
        "timestamp": 1625002565
    },
    {
        "content": "<p>not sure whether this stream should  be moved there or not. if this kicks off, it is its own thing. if it doesn't it will sink fast, so no worries.</p>",
        "id": 244351358,
        "sender_full_name": "dusko",
        "timestamp": 1625002660
    }
]