[
    {
        "content": "<p>Is there any syntactic characterization of the generalised algebraic theories (or essentially algebraic theories, or any other syntactic specification for LP-cats) whose models are Grothendieck toposes?</p>",
        "id": 469464695,
        "sender_full_name": "Ambroise",
        "timestamp": 1726073820
    },
    {
        "content": "<p>According to Theorem 3.1 of Di Liberti and Ramos González's <a href=\"https://arxiv.org/abs/1902.09391\">Gabriel-Ulmer duality for topoi and its relation with site presentations</a>, a LFP category is a Grothendieck topos if and only if its subcategory of finitely presentable objects is extensive and pro-exact, which reduces the problem to giving syntactic characterisations of these conditions. The paper <a href=\"https://www.sciencedirect.com/science/article/pii/S0022404901000160\">Syntactic characterizations of various classes of locally presentable categories</a> of Carboni, Pedicchio, and Rosický is also relevant, though I think they mean \"syntax\" in a rather weaker sense.</p>",
        "id": 469470356,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1726075569
    },
    {
        "content": "<p>Thanks for the references!</p>",
        "id": 469470847,
        "sender_full_name": "Ambroise",
        "timestamp": 1726075729
    },
    {
        "content": "<p>Extensivity seems not too hard to me, but having to specify it only for a subcategory feels like a little bit of a wrinkle. Or rather, figuring out how to identify the subcat of fin. pres. objects feels the tricky part, but one that is specified, extensivity of that feels not too hard.</p>",
        "id": 469532290,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1726104866
    },
    {
        "content": "<p>The point is that the syntax is specified by the subcategory of finitely presentable objects. In other words, this is the starting data, not the LFP category itself.</p>",
        "id": 469572015,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1726123286
    },
    {
        "content": "<p>Ah, ok. That thought did occur to me, but I didn't realise that was the actual intention.</p>",
        "id": 469617020,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1726133975
    }
]