[
    {
        "content": "<p>I don't know what to call this, but it seems to me like it deserves a bit of terminology. The idea is that Hom objects inherit all kinds of information from the parent category, but at a lower level in the categorical sense. The basic examples are: Hom objects are sets, and endo-hom objects are monoids. If the category is enriched, or monoidal, or a higher category, etc., all kinds of interesting things happen with these hom objects. It's often the punchline to a categorical story.<br>\nCalling this \"taking homs\" is not quite distinct enough terminology. It's a kind of decategorification, but really that's something else, like truncating or taking Pi-zero. There's the analogy of homs as categorified inner products, which is closer to what I'm talking about, but I don't know if any linear algebra terminology is satisfactory for this. <br>\nThe story might go like this: you are studying a commutative ring, and end up constructing the symmetric monoidal category of modules over this ring and proving something there. But you really are interested in the original commutative ring, so you take the endo-homs on the monoidal unit, and see what the result implies about this hom, because it is the ring you started with. I think Tannakian reconstruction is another example like this... Maybe \"reconstruction\" is the word i'm looking for? It's a bit strange to call it that, because it's more like a deconstruction, or looking down a microscope..</p>",
        "id": 364806008,
        "sender_full_name": "Simon Burton",
        "timestamp": 1686306691
    },
    {
        "content": "<p>Are you talking about this?: if you choose two object x and y in an n-category, you get an (n-1)-category hom(x,y).   <a href=\"https://www.urbandictionary.com/define.php?term=Hilarity%20Ensues\">Cool math ensues</a>, especially when x = y, where you get a monoidal (n-1)-category.</p>",
        "id": 364896669,
        "sender_full_name": "John Baez",
        "timestamp": 1686325307
    },
    {
        "content": "<p>I think Jim Dolan would sometimes call hom(x,y) a \"microcosm\" of the original category, even though that clashes a bit with the use of this word in \"microcosm principle\".</p>",
        "id": 364900195,
        "sender_full_name": "John Baez",
        "timestamp": 1686326088
    },
    {
        "content": "<p>\"Reconstruction\" is only the right word for situations where you start with a thing, do something to it, and then do something else to get the thing back that you started with.</p>",
        "id": 364900863,
        "sender_full_name": "John Baez",
        "timestamp": 1686326219
    },
    {
        "content": "<p>Yes I think that's right. I'm still a bit confused about how to use this in a sentence... The \"microcosm principle\" appears to be a reversal of what we are talking about..</p>",
        "id": 366192082,
        "sender_full_name": "Simon Burton",
        "timestamp": 1686750886
    },
    {
        "content": "<p>Maybe i could just say, \"by taking microcosms\" as a fancy way of saying we are taking hom's and noticing that we get more than what we might expect.</p>",
        "id": 366192430,
        "sender_full_name": "Simon Burton",
        "timestamp": 1686750961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/taking.20homs/near/366192082\">said</a>:</p>\n<blockquote>\n<p>Yes I think that's right. I'm still a bit confused about how to use this in a sentence... The \"microcosm principle\" appears to be a reversal of what we are talking about.</p>\n</blockquote>\n<p>I don't know if it's a \"reversal\", just something different: it says (for example) a concept of some sort can most easily be internalized in a context that's an example of that concept.</p>",
        "id": 366217283,
        "sender_full_name": "John Baez",
        "timestamp": 1686755459
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/taking.20homs/near/366192430\">said</a>:</p>\n<blockquote>\n<p>Maybe i could just say, \"by taking microcosms\" as a fancy way of saying we are taking hom's and noticing that we get more than what we might expect.</p>\n</blockquote>\n<p>It's probably less clear than \"by taking homs\", although I've always felt less than thrilled about \"hom\" as a free-standing word.</p>",
        "id": 366217690,
        "sender_full_name": "John Baez",
        "timestamp": 1686755540
    }
]