[
    {
        "content": "<p>I'm curious what other people's experiences are regarding the easiest way to construct an adjunction.  Have you generally found it easier to construct a natural bijection of hom-sets, or to define a unit and counit and prove the triangle identities, or construct a universal arrow, or something else?  Or does it just depend on the situation for you and there doesn't seem to be a pattern?</p>",
        "id": 325070474,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1675228898
    },
    {
        "content": "<p>My own experience is that I often <em>think</em> it would be easier to construct a unit and counit, and it is, but then proving the triangle identities often gets very hairy.  In particular, often one of the functors in the adjunction seems to be more complicated than the other, and the triangle identity that involves <em>two</em> applications of that functor is usually the hardest.</p>",
        "id": 325070572,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1675228984
    },
    {
        "content": "<p>So I then usually retreat to some other method.</p>",
        "id": 325070587,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1675229001
    },
    {
        "content": "<p>If there are other adjoints around, then hom-sets. If not, then almost always the universal arrow, also because this doesn't require defining one of the functors on morphisms.</p>",
        "id": 325123119,
        "sender_full_name": "Tom de Jong",
        "timestamp": 1675249040
    },
    {
        "content": "<p>Depends if you need both functors explicitly/to demonstrate that two given functors are adjoint to one another. I find it easier in some cases to check that the conditions of an adjoint functor theorem are satisfied, although most of the categories I work with are cocomplete and locally small which makes this considerably easier</p>",
        "id": 325140751,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675253777
    },
    {
        "content": "<p>Sometimes if you're working with presheaf categories you can show that the functor you're considering is one side of a nerve-realization adjunction, and then the left adjoint is given by the left Kan extension formula (if you started with the nerve) or the right adjoint is the curried hom functor (if you started with the realization)</p>",
        "id": 325174673,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675262154
    },
    {
        "content": "<p>More generally you can often phrase your problem of building an adjoint in terms of Kan extensions and apply the end or coend formula.</p>",
        "id": 325175122,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675262254
    },
    {
        "content": "<p>I find myself using the hom-sets iso almost always, though recently I used the universal arrow definition bc it was very natural in the context</p>",
        "id": 325382736,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1675340171
    },
    {
        "content": "<p>I use universal arrow for the same reason as Tom above, it's just fewer things to define/conditions to check. I know there is a similar way to avoid those side conditions if you don't already have one of the adjoints (<a href=\"https://arxiv.org/abs/1112.0094\">https://arxiv.org/abs/1112.0094</a>) but I've never really found myself in that situation.</p>",
        "id": 325513787,
        "sender_full_name": "Max New",
        "timestamp": 1675378500
    }
]