[
    {
        "content": "<p>That's fun. Somebody has taken up a <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-Category Café suggestion and worked it into a paper. </p>\n<p>At <a href=\"https://golem.ph.utexas.edu/category/2020/03/pyknoticity_versus_cohesivenes.html#c057734\">some point</a> during that interesting discussion on the relationship between pyknoticity/condenseness and cohesion, I tried to initiate a thread on ultracategories. </p>\n<p>This then spun out to me trying to figure out whether there might be some 2-monad approach to them in <a href=\"https://golem.ph.utexas.edu/category/2020/04/ultracategories_and_2monads.html\">Ultracategories and 2-Monads</a> (in what might be the longest single-authored thread in Café history).</p>\n<p>In the course of this speculation, I pose a question to <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> on another <a href=\"https://golem.ph.utexas.edu/category/2010/01/generalized_multicategories.html#c058048\">thread</a> on whether they could be seen as generalized multicategories, and he duly comes up with an <a href=\"https://golem.ph.utexas.edu/category/2010/01/generalized_multicategories.html#c058061\">answer</a>.</p>\n<p>So now in </p>\n<ul>\n<li>Ali Hamad, <a href=\"https://arxiv.org/abs/2502.20597\">Ultracategories as colax algebras for a pseudo-monad on CAT</a>,</li>\n</ul>\n<p>the author claims to have properly established results in this area:</p>\n<blockquote>\n<p>We show a result inspired by a conjecture by Shulman claiming that ultracategories as defined by Lurie are normal colax algebras for a certain pseudo-monad on the category of categories CAT. Such definition allows us to regard left and right ultrafunctors as defined by Lurie as instances of lax/colax algebras morphisms.</p>\n</blockquote>",
        "id": 502983413,
        "sender_full_name": "David Corfield",
        "timestamp": 1740995582
    },
    {
        "content": "<p>I wonder this new work sits with this article:</p>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span>, <em>The geometry of Coherent topoi and Ultrastructures</em> (<a href=\"https://arxiv.org/abs/2211.03104\">arXiv:2211.03104</a>)</li>\n</ul>\n<blockquote>\n<p>The first attempt of providing a more conceptual framing to understand ultrastructures and ultracategories was given by Marmolejo in his PhD thesis [Mar95]. He was probably the first to trace some geometric aspects of the construction of ultraproducts, introducing the notion of Łoś category. We will see that the blueprint of our approach is essentially the same of Marmolejo’s, even though we have a quite different way of encoding the same idea.</p>\n</blockquote>\n<blockquote>\n<p>In more recent years Lurie [Lur] revisited the notion of ultracategory, proposing a morally similar, but technically different notion of ultrastructure, ultracategory and ultrafunctor with respect to Makkai’s one. Both Makkai’s and Lurie’s notions are justified by the fact that they manage to deliver the most compelling theorems of this theory. Yet, none of these notions appears definitive when read or encountered for the first time for several reasons. The main one being that the definition of ultracategory is in both cases very heavy, and comes together with axioms whose choice seems quite arbitrary; and indeed the two authors make different choices.</p>\n</blockquote>",
        "id": 502987286,
        "sender_full_name": "David Corfield",
        "timestamp": 1740996705
    },
    {
        "content": "<p>Very good question. So many good young people are thinking about this topic these days. I guess I'll wait for their next paper on the arXiv to know!</p>",
        "id": 502987774,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1740996847
    },
    {
        "content": "<p>Ali is one of my fellow phd student at uOttawa. The world is small <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 503021413,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1741007130
    },
    {
        "content": "<p>Cool!</p>",
        "id": 503087968,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1741024122
    },
    {
        "content": "<p>Interesting development:</p>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"692413\">@Umberto Tarantino (he/they)</span>, <span class=\"user-mention\" data-user-id=\"306459\">@Joshua Wrigley</span>, <em>Ultracategories via Kan extensions of relative monads</em> [<a href=\"https://arxiv.org/abs/2506.09788\">arXiv:2506.09788</a>]</li>\n</ul>\n<blockquote>\n<p>Many structured categories of interest are most naturally described as algebras for a relative monad, but turn out nonetheless to be algebras for an ordinary monad. We show that, under suitable hypotheses, the left oplax Kan extension of a relative 2-monad on categories yields a pseudomonad having the same category of colax algebras. In particular, we apply this to the study of ultracategories to recover the 'ultracompletion' pseudomonad.</p>\n</blockquote>\n<p>Well, I wasn't a million miles away. The guess: </p>\n<p><a href=\"/user_uploads/21317/KJ0dCRlaeNj4jJIfDsfwUvKj/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/KJ0dCRlaeNj4jJIfDsfwUvKj/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"676x300\" src=\"/user_uploads/thumbnail/21317/KJ0dCRlaeNj4jJIfDsfwUvKj/image.png/840x560.webp\"></a></div><p>Reality:</p>\n<p><a href=\"/user_uploads/21317/AImNY9ULwfPQ0taa1g2Y7Fi_/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/AImNY9ULwfPQ0taa1g2Y7Fi_/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"552x329\" src=\"/user_uploads/thumbnail/21317/AImNY9ULwfPQ0taa1g2Y7Fi_/image.png/840x560.webp\"></a></div>",
        "id": 523767653,
        "sender_full_name": "David Corfield",
        "timestamp": 1749737884
    },
    {
        "content": "<p>It's all happening in the world of ultracategories. Another paper</p>\n<ul>\n<li>Gabriel Saadia, <em>Extending conceptual completeness via virtual ultracategories</em> &lbrack;<a href=\"https://arxiv.org/abs/2506.23935\">arXiv:2506.23935</a>&rbrack;</li>\n</ul>\n<blockquote>\n<p>We introduce the notion of virtual ultracategory. From a topological point of view, this notion can be seen as a categorification of relational <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>β</mi></mrow><annotation encoding=\"application/x-tex\">\\beta</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8889em;vertical-align:-0.1944em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05278em;\">β</span></span></span></span>-algebras. From a categorical point of view, virtual ultracategories generalize ultracategories in the same way that multicategories generalize monoidal categories. From a logical point of view, whereas the points of a coherent topos form an ultracategory, the points of an arbitrary topos form a virtual ultracategory. We then extend Makkai--Lurie's conceptual completeness: a topos with enough points can be reconstructed from its virtual ultracategory of points.</p>\n</blockquote>",
        "id": 526546211,
        "sender_full_name": "David Corfield",
        "timestamp": 1751356363
    },
    {
        "content": "<p>And another:</p>\n<ul>\n<li>Ali Hamad, <em>Generalised ultracategories and conceptual completeness of geometric logic</em> &lbrack;<a href=\"https://arxiv.org/abs/2507.07922\">arXiv:2507.07922</a>&rbrack;</li>\n</ul>\n<p>Seems very similar to Saadia's construction:</p>\n<blockquote>\n<p><strong>Note.</strong> A similar result to ours was independently obtained in [25]. The author introduced the notion of virtual ultracategories. At this point, we don’t know for sure if the two notions of virtual and generalised ultracategories are the same, although we expect them to be.</p>\n</blockquote>\n<p>Abstract:</p>\n<blockquote>\n<p>We introduce the theory of generalised ultracategories, these are relational extensions to ultracategories as defined by Lurie. An essential example of generalised ultracategories are topological spaces, and these play a fundamental role in the theory of generalised ultracategories. Another example of these generalised ultracategories is points of toposes. In this paper, we show a conceptual completeness theorem for toposes with enough points, stating that any such topos can be reconstructed from its generalised ultracategory of points. This is done by considering left ultrafunctors from topological spaces to the category of points and paralleling this construction with another known fundamental result in topos theory, namely that any topos with enough points is a colimit of a topological groupoid.</p>\n</blockquote>",
        "id": 528289278,
        "sender_full_name": "David Corfield",
        "timestamp": 1752222897
    },
    {
        "content": "<p>Yes, Hamad actually refers to Saadia in the introduction and mentions that he suspects virtual ultracategories and generalised ultracategories to be the same. Looks like a rare case in pure math where someone got scooped!</p>\n<p>(Oh, you quoted that comment already.)</p>",
        "id": 528384236,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1752256369
    },
    {
        "content": "<p>This is all very cool, I wish I had time to read these papers.  It looks like none of them have anything to say about a relationship to Clementino-Tholen \"ultracategories\", though?</p>",
        "id": 528385972,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1752257095
    },
    {
        "content": "<p>They're generalizing Makkai's ultracategories, which Lurie built on; Clementino-Tholen have a totally different notion than Makkai?</p>",
        "id": 528390386,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1752259394
    },
    {
        "content": "<p>Yes, Clementino-Tholen took the ultrafilter monad on Rel, whose generalized multicategories are topological spaces, and extended it to Span and considered generalized multicategories for that.</p>",
        "id": 528390880,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1752259690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"609515\">Kevin Carlson</span> <a href=\"#narrow/channel/229136-theory.3A-category-theory/topic/Ultracategories/near/528384236\">said</a>:</p>\n<blockquote>\n<p>Looks like a rare case in pure math where someone got scooped!</p>\n</blockquote>\n<p>(Even in category theory alone, I don't think this is such a rare phenomenon.)</p>",
        "id": 528391108,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1752259829
    },
    {
        "content": "<p>Clark Barwick was talking about ultracategories in the context of his pyknotic mathematics, a close relative of condensed mathematics (cf. the first message of this thread). I wonder if this new work on ultracategories can bear on that.</p>",
        "id": 528391788,
        "sender_full_name": "David Corfield",
        "timestamp": 1752260096
    }
]