[
    {
        "content": "<p>I really like theorems like this one of Anna Giulia Montaruli:<br>\n<a href=\"http://tac.mta.ca/tac/volumes/41/40/41-40abs.html\">http://tac.mta.ca/tac/volumes/41/40/41-40abs.html</a>  namely</p>\n<blockquote>\n<p>...how to embed  in a constructive way a small abelian category into the category of sheaves of modules over a ringed space.</p>\n</blockquote>\n<p>This might be the paper I was thinking of the whole time, but there's a niggling feeling that I was actually recalling a slightly stronger result that was not just an embedding theorem, but an actual reconstruction, analogous to an abelian category version of Giraud's theorem (recreating the category as equivalent to some kind of abelian sheaves on a \"linear site\", perhaps?). Can anyone point to such a paper, or else disabuse me of thinking there is such a result?</p>",
        "id": 546349976,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761095213
    },
    {
        "content": "<p>Hmm, maybe I was thinking of <a href=\"https://doi.org/10.1007/s10485-017-9511-1\">https://doi.org/10.1007/s10485-017-9511-1</a> / <a href=\"https://arxiv.org/abs/1707.07453\">https://arxiv.org/abs/1707.07453</a> (by <span class=\"user-mention\" data-user-id=\"316468\">@Julia Ramos</span> ?) which remarks</p>\n<blockquote>\n<p>The fact that the categories of sheaves over linear sites (or linear Grothendieck topoi)<br>\nare precisely the Grothendieck categories can be deduced from Gabriel–Popescu theorem<br>\n[9] together with the main result in [5]. Indeed, Gabriel–Popescu theorem characterizes<br>\nGrothendieck categories as the localizations of presheaf categories of linear sites, that is<br>\nsubcategories of presheaf categories whose embedding functor has a left exact left adjoint.<br>\nOn the other hand, from [5, Thm 1.5] one deduces that categories of sheaves are precisely<br>\nthe localizations of presheaf categories of linear categories. Thus, the combination of the<br>\ntwo results provides a linear counterpart of the classical Giraud Theorem that characterizes<br>\nGrothendieck topoi in the classical setting.</p>\n</blockquote>",
        "id": 546350117,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761095346
    },
    {
        "content": "<p>Prior work here is by Wendy Lowen: <a href=\"https://win.uantwerpen.be/~wlowen/pdf%20papers/JPAA-GabrielPopescu.pdf\">https://win.uantwerpen.be/~wlowen/pdf%20papers/JPAA-GabrielPopescu.pdf</a> <br>\nHmm. I might have solved my first problem.</p>",
        "id": 546350354,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761095567
    },
    {
        "content": "<p>The second problem is this: is there work on the internal logic of a (Grothendieck) abelian category from this point of view, keeping in mind the usual internal logic of a (Grothendieck) topos?</p>",
        "id": 546350386,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761095609
    },
    {
        "content": "<p>I'll raise that question at my local category theory working group next week, since we have an expert on abelian categories and several logicians around <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 546389990,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1761120212
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 546394797,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1761121661
    },
    {
        "content": "<p>Have you already seen <a href=\"https://www.irif.fr/~mellies/papers/functorial-excursion.pdf\">this paper of Melliès</a>?</p>\n<p>I just skimmed through, but it seems some initial attempt at extracting some linear logic out of modules over a precosheaf on comm rings. Presumably, it shouldn't be hard to extend everything to modules over a ringed topos, which is not that far from an arbitrary Grothendieck abelian cat with a symmetric monoidal structuture inside loc pres cats.</p>\n<p>The the last section, though, says that a linear logic for alg geom still doesn't exist.</p>",
        "id": 547139462,
        "sender_full_name": "Fernando Yamauti",
        "timestamp": 1761492935
    },
    {
        "content": "<p>Also I just remembered there exists an <a href=\"https://ncatlab.org/nlab/show/torsion+theory\">analogous of a Lawvere-Tierney topology for abelian cats</a>, but I don’t know to what extent that fully internalises (what's the analogous of a subobject classifier?)</p>",
        "id": 547139835,
        "sender_full_name": "Fernando Yamauti",
        "timestamp": 1761493262
    }
]