[
    {
        "content": "<p>The context here is that of <a href=\"https://ncatlab.org/nlab/show/polynomial+functor\">[[polynomial+functor]]</a>.  In the concrete terms of <span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> 's <a href=\"https://arxiv.org/abs/2005.01894\">Poly: An abundant categorical setting for mode-dependent dynamics</a> section 2.4, I'd like to know when two <code>Lens</code> should be considered equivalent.  In other words, I'm interested in the Setoid-enriched version of Poly.</p>\n<p>In theory, I think I should be able to decategorify Gylterud's Definition 2.1.2 from <a href=\"https://www.duo.uio.no/bitstream/handle/10852/10740/thesisgylterud.pdf\">Symmetric Containers</a>, but I am not confident that I've worked it out properly. Similarly, I think Definition 7 of <a href=\"https://arxiv.org/abs/1806.10477\">Universal Properties of Bicategories of Polynomials</a> is also 'it'.</p>\n<p>Note that I am not interested in <strong>polynomial functors</strong> but rather <strong>polynomials</strong> themselves; the functors are the <em>extension</em> of the polynomials, or generated by them.</p>",
        "id": 342430820,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1679004269
    },
    {
        "content": "<p>The above might be off by 1, given some of the other things I'm reading. I was taking polynomials as objects, and morphisms as... morphisms.</p>\n<p>So it might be needed to shift everything up by 1. But the question remains: when are two morphisms of polynomials equivalent?</p>",
        "id": 342431822,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1679004768
    },
    {
        "content": "<p>By a polynomial, do you mean the representation as a bundle?</p>",
        "id": 342434212,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1679005839
    },
    {
        "content": "<p>Perhaps the question (or a question), is whether this bundle should be a fibration or an arbitrary map.</p>",
        "id": 342434339,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1679005910
    },
    {
        "content": "<p>I think my answer is Definition 3.3 in <a href=\"https://hal.science/hal-03345938/document\">A cartesian bicategory of polynomial functors in homotopy type theory</a>, I just need to unpack it. The tricky part is that the definition of polynomial morphism is a 'cartesian' morphism (which is fine), and that's not what is often done in <em>containers</em>-land.</p>",
        "id": 342441671,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1679009346
    }
]