[
    {
        "content": "<p>As a philosopher and a beginner in Category Theory I have been trying in vain to understand the Yoneda Lemma. So I decided that to understand it I would try to apply it to understanding something relatively simple like Pascal's Triangle. I have a conjecture that Pascal's Triangle contains both the Yoneda Lemma and the Co-Yoneda Lemma. I tried to work it out in a paper I recently published <a href=\"https://www.academia.edu/116150118/Binary_Expression_of_Existence\">https://www.academia.edu/116150118/Binary_Expression_of_Existence</a>. However, not being a mathematician I really don't know how to go about confirming the conjecture and actually showing it is true with a proof. It seems to me that if this conjecture were true it would offer a test case for understanding the Yoneda Lemma in a relatively simple mathematical setting which would be helpful for learners like myself. The conjecture seems like something that a Mathematician who knew the Yoneda Lemma might shed light on fairly easily. And if it were proved it might be a good way for people to understand the Yoneda Lemma as I have tried to do looking for its broader implications outside Category Theory. Anyway I thought I would mention it in case someone was interested in the problem.</p>",
        "id": 429312577,
        "sender_full_name": "Kent Palmer",
        "timestamp": 1711354346
    },
    {
        "content": "<p>I don't know about the conjecture, but here is a nice tutorial by Emily Riehl on the <a href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM\">Yoneda lemma in the category of matrices</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"SsgEvrDFJsM\" href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM\"><img src=\"https://uploads.zulipusercontent.net/94ce49e77996e0ce8807cd65122afd993a2f814a/68747470733a2f2f692e7974696d672e636f6d2f76692f53736745767244464a734d2f64656661756c742e6a7067\"></a></div>",
        "id": 429314651,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1711355090
    },
    {
        "content": "<p>She also appeared in an episode of the podcast My Favourite Theorem where she used Yoneda to prove distributivity of multiplication over addition, I think?</p>",
        "id": 429334077,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1711360246
    },
    {
        "content": "<p>As someone learning category theory, I've spent extensive time on this same task of understanding the Yoneda Lemma, and I think it is very promising to try to find simple cases of the Lemma's use. My favorite simple example of its use is in the Yoneda Embedding. In mathematical symbols, the Yoneda Lemma asserts the existence of an isomorphism of form Hom|Set^C|(Hom|C|(A, -), F) ~ F(A). Now if we take F to be another hom functor Hom|C|(B, -), then we get via substitution Hom|Set^C|(Hom|C|(A, -), Hom|C|(B, -)) ~ Hom(B, A). The order of A and B appear swapped, but we can fix that by instead working in the \"presheaf category\" [C^op, Set]. Now, we can fully associate A with the representable presheaf of A such that they essentially \"act the same\", and we get an embedding, known as the Yoneda Embedding, C -&gt; [C^op, Set]. This is the source of the common refrain that the Yoneda Lemma tells us that the objects in a category are determined up to isomorphism by the arrows, or relationships, that it has with all other objects. It's actually a really common confusion I've noticed where people think that's what the general Yoneda Lemma says, but instead it's actually a case of its use!</p>",
        "id": 429529190,
        "sender_full_name": "John Onstead",
        "timestamp": 1711409899
    },
    {
        "content": "<p>I've also taken a look at your paper \"Emergent Meta-System, Yoneda Lemma, and Platonic Theory of Forms\" which appears to be part of this project. I'm no philosopher and I admit I didn't understand most of the paper, but I did want to learn more about it! Indeed, I am quite interested in learning more about the philosophy of math in general. So I'll share my opinion on what I think it means for something like the Yoneda Lemma to have a \"philosophical significance\", and I am interested on hearing your thoughts on this matter.<br>\nI am always cautious of \"reading too much into\" mathematics and what certain theorems in math are \"saying\". It is true that math can be applied to scientific or philosophical purposes, but the (philosophical, and not purely mathematical) meaning of the math comes about in how it is applied, not in the pure math itself. As such, I don't think the Yoneda Lemma or even Embedding has any philosophical \"meaning\" or consequences, it's just a statement we've proven about an abstract construction (categories) we've made up the definition for. You can certainly apply categories to some philosophical situation, and then the Yoneda Lemma may pick up a concrete \"meaning\", but you could likely just as easily apply that same category and use of the Yoneda Lemma to some completely different philosophical situation. In addition, you could also choose to use a completely different mathematical object, where the Yoneda Lemma would not apply at all, to describe the same situation. As a good analogy, this is like how many physical systems exhibit simple harmonic motion, in which case the same mathematical equation describing SHM can be applied to many different situations, but where its symbols take on many different meanings and significances in the process. I think it's a similar thing with any mathematical object and theorem, categories and Yoneda included.</p>",
        "id": 429530792,
        "sender_full_name": "John Onstead",
        "timestamp": 1711410983
    }
]