[
    {
        "content": "<p>As far as I can see, the HoTT book gives two applications of higher inductive types in normal (i.e., non-homotopical) math: the construction of the Cauchy reals and the construction of the surreal numbers. Both definitions use the principle of \"inductive-inductive\" definitions as well. I wonder: Is this really an application of <em>higher</em> inductive types? After all, both definitions contain only point and path constructors, but not any homotopy constructors. So would both definitions also work in, say, a type theory with a notion of \"quotient type\" and inductive-inductive definitions?<br>\nAlso, aren't Theorem 11.3.9 and Corollary 11.6.5 (stating that these types are sets) trivial in some sense, because both definitions contain only point and path constructors, but not any homotopy constructors?<br>\nThe introduction to chapter 6 gives an explanation of the phenomenon of an inductive type being a higher groupoid while being defined only using point and path constructors: if the domain of some constructor has higher paths, these will carry over. But if all domains of all constructors are sets, I believe this can't happen. Do Theorem 11.3.9 and Corollary 11.6.5 also fall in some class of higher inductive types that yield sets \"for trivial reasons\"?</p>",
        "id": 249749257,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1629220343
    },
    {
        "content": "<p>What's the difference between a \"path constructor\" and a \"homotopy constructor\"?</p>",
        "id": 249749608,
        "sender_full_name": "Reid Barton",
        "timestamp": 1629220546
    },
    {
        "content": "<p>It seems like the circle-as-inductive-type (section 6.4) is a counterexample to your claim, right?</p>",
        "id": 249751067,
        "sender_full_name": "Reid Barton",
        "timestamp": 1629221264
    },
    {
        "content": "<p>I call the things between points \"paths\" and the things between paths \"homotopies\" (but not \"paths\" anymore).<br>\nI don't know what claim you are referring to, because I asked a lot of things. :-)</p>",
        "id": 249752520,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1629221874
    },
    {
        "content": "<p>I mean the last one \"But if all domains of all constructors are sets, I believe this can't happen.\"</p>",
        "id": 249752730,
        "sender_full_name": "Reid Barton",
        "timestamp": 1629221980
    },
    {
        "content": "<p>IIRC, you can recover a similar theorem if you prove that the path constructors are cycle-free. That is, consider a higher inductive type <code>T</code> generated from constructors <code>point : P → T</code> and <code>path : (x y : P) → R x y → point x = point y</code>, where <code>P : Set</code> and <code>R : P → P → Prop</code>. Then, if <code>R</code> is cycle-free in some suitable graph-theoretic sense, <code>T</code> will be a set. The circle fails the latter condition in the simplest way possible – the whole idea of the circle is that the path forms a cycle.</p>\n<p>I'd appreciate a reference, if anyone knows one, because it's not immediately clear to me how it works when <code>P</code> has large cardinality and cycle-free paths can be infinitely long.</p>",
        "id": 249776415,
        "sender_full_name": "James Wood",
        "timestamp": 1629233131
    },
    {
        "content": "<p>For the broader question, <em>quotient inductive-inductive types</em> have been studied. As far as I can tell, the Cauchy reals are a prime motivating example, along with similar cases where QIITs are enough to get around countable choice.</p>",
        "id": 249777410,
        "sender_full_name": "James Wood",
        "timestamp": 1629233645
    }
]