[
    {
        "content": "<p>After the foundations conversation I'm thinking I should actually dig my heels in and read the HoTT book. I'd like to ask questions as I go through it, but this online community seems just off topic.</p>\n<p>Is there some other online forum where \"progress updates &amp; questions\" as I read through the HoTT book would be very on topic and welcome?</p>",
        "id": 540939400,
        "sender_full_name": "Alex Kreitzberg",
        "timestamp": 1758610114
    },
    {
        "content": "<p>There's a <a href=\"https://hott.zulipchat.com/\">Homotopy Type Theory Zulip</a> that could be appropriate.</p>",
        "id": 540943016,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1758611662
    },
    {
        "content": "<p>The Univalent Agda Discord – <a href=\"https://discord.gg/ccvnFWDW\">invite link</a> – is also quite active, and has a general (not Agda-specific) HoTT channel.</p>",
        "id": 540943770,
        "sender_full_name": "Ulrik Buchholtz",
        "timestamp": 1758611965
    },
    {
        "content": "<p>You might also be interested in the recordings from the HoTTEST Summer School that happened a few years ago (available <a href=\"https://www.youtube.com/playlist?list=PLtIZ5qxwSNnzpNqfXzJjlHI9yCAzRzKtx\">here</a>). Iirc we mainly worked in book HoTT for all the non-agda lectures, and the agda lectures pivoted to cubical halfway through, but I might be misremembering</p>",
        "id": 541044329,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1758641327
    },
    {
        "content": "<p>There's a discord for the summer school (<a href=\"https://discord.gg/ySCQYzN9\">invite link</a>), but it's become less active over time. Nowadays it's basically been subsumed by the univalent agda discord that Ulrik linked. There's tons of people there would would be happy to help out with any questions you have ^_^</p>",
        "id": 541044639,
        "sender_full_name": "Chris Grossack (she/they)",
        "timestamp": 1758641398
    }
]