[
    {
        "content": "<p>Terry Tao recently wrote some nice comments on <a href=\"https://mathstodon.xyz/@tao/114915604830689046\">blue-team and red-team thinking</a> in cybersecurity and other issues.   This triggered some thoughts in me, and I wrote:</p>\n<blockquote>\n<p>Logicians are starting to think harder about this blue team / red team distinction. Constructive logic, the logic of verification, codifies some of the blue team principles you enunciate. But co-constructive logic, which seems to be a more recent topic of interest, is the logic of refutation. It codifies some of the red team principles.</p>\n</blockquote>\n<blockquote>\n<p>Mike Shulman has recently written about a form of logic that combines the constructive and co-constructive aspects. His paper is rather technical, but here's a revealing quote:</p>\n</blockquote>\n<blockquote>\n<p>\"Intuitionistic logic is often explained informally (e.g. in [TvD88a]) by the so-called Brouwer–Heyting–Kolmogorov (BHK) interpretation, which explains the meaning of the logical connectives and quantifiers “pragmatically” in terms of what counts as a proof of them. [...] Practicing constructive mathematicians, however, have found that it is often not sufficient to know what counts as a proof of a statement: it is often just as important, if not more so, to know what counts as a refutation of a statement. [...] To repeat, the problem is that the BHK interpretation and resulting intuitionistic logic privilege proofs over refutations. [...] This suggests a BHK-like explanation of logical connectives in terms of both what counts as a proof and what counts as a refutation. We now explore what such an explanation might look like.\"</p>\n</blockquote>\n<blockquote>\n<p>Studying this formally, as Mike is doing, might be useful for AI safety, etc.</p>\n</blockquote>\n<blockquote>\n<ul>\n<li>Mike Shulman, <a href=\"https://arxiv.org/abs/1805.07518\">Affine logic for constructive mathematics</a>.</li>\n</ul>\n</blockquote>\n<p>It might be nice for Mike to talk directly to Terry about this.</p>",
        "id": 531108025,
        "sender_full_name": "John Baez",
        "timestamp": 1753610289
    },
    {
        "content": "<p>That's a nice perspective of Terry's on the uses and abuses of pattern engines, and I also like your observation about the relation to game semantics, linear logic, and Chu constructions (which, as Sidney Congard pointed out, predate my work).  I'd certainly be happy to talk about it further with you, Terry, or anyone else (though not via microblogging).</p>",
        "id": 531239069,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1753661470
    },
    {
        "content": "<p>Someone the other day pointed out Clark Barwick's <a href=\"https://webhomes.maths.ed.ac.uk/~cbarwick/papers/facts.pdf\">work</a> on isolatability of points in a space, higher groupoids measuring space of ways of isolating two points. It put me somewhat in mind of Mike's ideas on duality of proof and refutation.</p>",
        "id": 531420621,
        "sender_full_name": "David Corfield",
        "timestamp": 1753723282
    }
]