[
    {
        "content": "<p>Today I started translating ReS's section on motives. Following are some of the phrases I am not able to translate. Can anyone help? Also if you can, please comment on the accuracy of the translation as well. </p>\n<ul>\n<li>Le thème du topos <strong>est issu de</strong> celui des schémas, l’année même où sont apparus les schémas — mais en étendue il dépasse largement le thème-mère.</li>\n</ul>\n<p>[<em>My attempt:</em> The theme of topos <strong>est issu de</strong> that of schemes, the same year in which schemes appeared -- but it goes far beyond the mother-theme in scope.]</p>\n<ul>\n<li><strong>Le premier s’est concrétisé entre mes mains en l’outil cohomologique <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">ℓ</mi></mrow><annotation encoding=\"application/x-tex\">\\ell</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">ℓ</span></span></span></span>-adique</strong>, qui dès à présent apparaît comme un des plus puissants outils mathématiques du siècle.</li>\n</ul>\n<p>[<em>My attempt:</em> <strong>Le premier s’est concrétisé entre mes mains en l’outil cohomologique <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">ℓ</mi></mrow><annotation encoding=\"application/x-tex\">\\ell</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">ℓ</span></span></span></span>-adique</strong>,  which now appears to be one of the most powerful mathematical tools of the century.]</p>\n<ul>\n<li>Dans mon esprit, <strong>c’était là</strong> un nouveau pas, après le développement de l’outil cohomologique <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">ℓ</mi></mrow><annotation encoding=\"application/x-tex\">\\ell</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">ℓ</span></span></span></span>-adique, en direction de ces conjectures.</li>\n</ul>\n<p>[<em>My attempt:</em> To my mind, after the development of the $\\ell$-adic cohomological tool, <strong>c’était là</strong> a new step, in the direction of these conjectures.]</p>\n<ul>\n<li>Et les quelques phénomènes-clef dégages dans les conjectures standard(**) peuvent être vus comme formant une sorte de quintessence ultime du thème motivique, comme le “souffle” vital de ce thème subtil entre tous, de ce “cœur dans le cœur” de la géométrie nouvelle.</li>\n</ul>\n<p>[<em>My attempt:</em> And the few key phenomena <strong>dégages dans</strong> the standard conjectures can be seen as forming a sort of ultimate quintessence of the motivic theme, as the vital \"breath'' of that subtle theme among all, of that \"heart within the heart'' of the new geometry.]</p>\n<ul>\n<li>C’est là, exprimé dans le langage non technique d’une métaphore musicale, la quintessence d’une idée d’une simplicité enfantine <strong>encore</strong>, délicate et audacieuse à là fois. J’ai développé cette idée, <strong>en marge des tâches de fondements</strong> que je considérais plus urgentes, sous le nom de “théorie des motifs” ou de “philosophie (ou “yoga”) des motifs”, tout au long des années 1963–69. C’est une théorie d’une richesse structurale fascinante, dont une grande partie est restée encore conjecturale.</li>\n</ul>\n<p>[<em>My attempt:</em>  There, expressed in the non-technical language of a musical metaphor, this is the quintessence of an idea of childish simplicity <strong>encore</strong>, delicate and audacious at the same time. I developed this idea, <strong>en marge des tâches de fondements</strong> that I considered more urgent, under the name of \"theory of motives'' or \"philosophy (or \"yoga'') of motives'', throughout the years 1963–69. It is a theory with a fascinating structural richness, a large part of which still remained conjectural.]</p>\n<ul>\n<li><strong>Ce n’est pas le lieu de revenir ici sur ce que j’en dis ailleurs.</strong></li>\n</ul>\n<p>[<em>Crude attempt:</em> I am particularly confused by the word \"ici\" here. Otherwise, my attempt was, \"<strong>This is not the place to return to something I say elsewhere.</strong>\"]</p>\n<ul>\n<li>Je m’exprime à diverses reprises, dans Récoltes et Semailles au sujet de ce “yoga des motifs”, qui me tient particulièrement à cœur. <strong>Ce n’est pas le lieu de revenir ici sur ce que j’en dis ailleurs.</strong> Qu’il me suffise de dire que les “conjectures standard” découlent le plus naturellement du monde de ce yoga des motifs. En même temps elles fournissent un principe d’approche pour <strong>une des constructions en forme possibles de la notion de motif</strong>.</li>\n</ul>\n<p>[<em>My attempt:</em> I express myself on various occasions, in Récoltes et Semailles on about this \"yoga of motives'', which is particularly close to my heart. <strong>Ce n’est pas le lieu de revenir ici sur ce que j’en dis ailleurs.</strong> Suffice it to say that the ``standard conjectures'' follow most naturally from the world of this yoga of motives. At the same time they provide a principle of approach for <strong>une des constructions en forme possibles de la notion de motif</strong> .]</p>\n<ul>\n<li>Ni cette question, ni l’autre question toute aussi cruciale (<strong>celle dite de la</strong> “résolution des singularités”) n’est encore résolue à l’heure actuelle. Mais alors que la deuxième de ces questions apparaît, aujourd’hui comme il y a cent ans, comme une question prestigieuse et redoutable, celle que j’ai eu l’honneur de dégager <strong>s’est vue classer</strong> par les péremptoires décrets de la mode (dès les années qui ont suivi mon départ de la scène mathématique, et tout comme le thème motivique lui-même) comme aimable fumisterie grothendieckienne.</li>\n</ul>\n<p>[<em>My attempt:</em> Neither this question, nor the other equally crucial question (<strong>celle dite de la</strong> \"resolution of singularities'') are resolved yet at present. But while the second of these questions appears, today as it did a hundred years ago, as a prestigious and formidable question, the one I had the honour of developing <strong>s’est vue classer</strong> by the peremptory decrees of the world (from the years that followed my departure from the mathematical scene, and just like the motivic theme itself) as a kind of Grothendieckian smoke and mirrors.]</p>",
        "id": 262188440,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1637421411
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"229451\" href=\"/#narrow/stream/229451-general.3A-off-topic/topic/Grothendieck\">#general: off-topic &gt; Grothendieck</a> by <span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span></p>",
        "id": 262302920,
        "sender_full_name": "Notification Bot",
        "timestamp": 1637577729
    }
]