[
    {
        "content": "<p>I've spend quite a bit of my \"free\" time doing translations of mathematical papers/books etc into English (mainly from French), and there are a few big collaborative projects (for bigger things, like the EGA) going on as well. It would be nice to hear what things the community would like translated. If there are some small things then it's something I might just enjoy working on when I get the chance, but generally it would be good for would-be translators to have some ideas of potential projects to work on <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 212335802,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1601921331
    },
    {
        "content": "<p>It would be nice to have a full translation of Joyal's <em>Une théorie combinatoire des séries formelles</em>. Brent Yorgey has an <a href=\"https://github.com/byorgey/series-formelles\">ongoing translation</a>, but it's only about half-finished, and he has mentioned in the past he's looking for collaborators.</p>",
        "id": 212336642,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1601921755
    },
    {
        "content": "<p>Personally, I would be interested in a translation of Guitart's <em>Toute theorie est algebrique et topologique</em>.</p>",
        "id": 212336959,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1601921899
    },
    {
        "content": "<p>something that I've been meaning to do for a while now is to create a directory for all community/single-person translation projects, so people can find things that are already done, things that are in progress, and things that have been \"requested\"</p>",
        "id": 212337105,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1601921988
    },
    {
        "content": "<p>but I just don't have the time as of late (as is always the case)</p>",
        "id": 212337129,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1601922002
    },
    {
        "content": "<p>Yes, that would be really useful. An nLab page would be completely suitable, I'd imagine.</p>",
        "id": 212337226,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1601922038
    },
    {
        "content": "<p>for the moment, probably, but quite a few of the translations I've done (for example) are very much not at all related to nLab stuff</p>",
        "id": 212337295,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1601922077
    },
    {
        "content": "<p>I know this is the category theory zulip, but I was thinking of a directory that was subject agnostic</p>",
        "id": 212337370,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1601922118
    },
    {
        "content": "<p>Oh, okay.</p>",
        "id": 212337502,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1601922163
    },
    {
        "content": "<p>Any translations of mathematical documents would be worth listing on, and linking from, a page at the nLab, trust me.</p>",
        "id": 212405833,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1601978063
    },
    {
        "content": "<p>Prompted by <a href=\"#narrow/stream/230123-theory.3A-algebra.20.26.20CT/topic/The.20category.20of.20fields\">the discussion over here on fields and multipresentability</a>, I think having English translations of Yves Diers's texts on locally multipresentable categories (<em>Familles universelles de morphismes</em>,  <em>Catégories Multialgébriques</em>, <em>Catégories Localement Multiprésentables</em>) would be very helpful in making these concepts more accessible (if you're still looking for requests). The latter two are ~15 pages long. However, I wasn't able to find a copy of the first one, so I'm not sure whether it's available online.</p>",
        "id": 228223920,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614602924
    },
    {
        "content": "<p>always love hearing about some requests! do you have pdf links for the latter two?</p>",
        "id": 228264733,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614617661
    },
    {
        "content": "<p>If you have access to Springer Link, they're <a href=\"https://link.springer.com/article/10.1007/BF01224953\">Catégories Multialgébriques</a> and <a href=\"https://link.springer.com/article/10.1007/BF01224971\">Catégories Localement Multiprésentables</a>.</p>",
        "id": 228264971,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614617753
    },
    {
        "content": "<p>I know that the legality of putting translations online is already a bit fuzzy, but I'm assuming that doing it for paywalled articles is doubly so...</p>",
        "id": 228266173,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614618004
    },
    {
        "content": "<p>Ah, I didn't even think about that <span aria-label=\"pensive\" class=\"emoji emoji-1f614\" role=\"img\" title=\"pensive\">:pensive:</span></p>",
        "id": 228266686,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614618140
    },
    {
        "content": "<p>Sad that people lock their work behind walls.</p>",
        "id": 228266982,
        "sender_full_name": "John Baez",
        "timestamp": 1614618248
    },
    {
        "content": "<p>I imagine the author, who presumably retains some form of copyright over the original texts, would be/have been open to translation of their work. But I wouldn't know how to go about finding out.</p>",
        "id": 228267391,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614618382
    },
    {
        "content": "<p>my approach has always been \"put up my personal translations that i made for my personal use on my website and if anybody else looks at them then woops\"</p>",
        "id": 228267483,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614618426
    },
    {
        "content": "<p>which is probably entirely legally indefensible , but (to me) morally justifiable</p>",
        "id": 228267542,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614618455
    },
    {
        "content": "<p>From a cursory glance at the Wikipedia article, it seems that translations are counted as derivative works under US/Canadian copyright, and must be approved by the original copyright holder.</p>",
        "id": 228267786,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614618541
    },
    {
        "content": "<p>i genuinely do not understand how to logically decide whether or not something infringes copyright of a mathematical article, as in, where is the line crossed? can i share personal notes i've written about a paywalled paper? can i quote parts of it? can i write a \"reader's guide\" to it? can i translate some of it, all of it, or none of it?</p>",
        "id": 228268146,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614618673
    },
    {
        "content": "<p>i think the idea of applying copyright to mathematics is just... logically inconsistent</p>",
        "id": 228268232,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614618701
    },
    {
        "content": "<p>I think one might have to write a text that contained the essential mathematical content of the original work(s), but without a direct translation of the wording/structure, to avoid these potential issues.</p>",
        "id": 228269377,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614619144
    },
    {
        "content": "<p>yeah, but the fact that this is permissible when just translating the original is not is... bizarre to me</p>",
        "id": 228270840,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614619676
    },
    {
        "content": "<p>sorry to have taken this off on a tangent, but it's just something i feel very strongly about</p>",
        "id": 228270899,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614619686
    },
    {
        "content": "<p>i am able to read a paper, to mentally translate it, to write down my mental translation in the margin, to write down my mental translation in a notebook, to show this translation to my friend in real life, to show this translation to my friend over the internet, to ... etc., but at some point in this sequence of events, what i am doing suddenly becomes illegal</p>",
        "id": 228271200,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614619801
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280178\">Tim Hosgood</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/translation.20requests/near/228270899\">said</a>:</p>\n<blockquote>\n<p>sorry to have taken this off on a tangent, but it's just something i feel very strongly about</p>\n</blockquote>\n<p>I think every mathematician would agree.</p>",
        "id": 228271456,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614619873
    },
    {
        "content": "<p>I think, <span class=\"user-mention\" data-user-id=\"280178\">@Tim Hosgood</span>, that you can imagine fields of work where people actually might want copyright protection.  For example if I wrote a song in English and it became a hit, it might serve as a reliable source of English.  If someone sang the same song translated into French I might want copyright protection.    </p>\n<blockquote>\n<p>i am able to read a paper, to mentally translate it, to write down my mental translation in the margin, to write down my mental translation in a notebook, to show this translation to my friend in real life, to show this translation to my friend over the internet, to ... etc., but at some point in this sequence of events, what i am doing suddenly becomes illegal.</p>\n</blockquote>\n<p>This sort of \"slippery slope\" is ubiquitous in law so you can't complain that a law is ridiculous just because you can come up with a continuous one-parameter family of actions that are legal at one end and illegal at the other end.   </p>\n<p>For example: right now I'm punching you in the face from my home in Riverside.  How close do I have to get to you before this counts as assault?   </p>\n<p>So, you need some better argument than the \"slippery slope\" argument if you want to change copyright law.   (I want to change it too.)</p>",
        "id": 228274241,
        "sender_full_name": "John Baez",
        "timestamp": 1614620799
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/translation.20requests/near/228274241\">said</a>:</p>\n<blockquote>\n<p>For example: right now I'm punching you in the face from my home in Riverside.  How close do I have to get to you before this counts as assault?</p>\n</blockquote>\n<p>close enough for me to complain <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 228274578,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614620908
    },
    {
        "content": "<p>i understand that my argument doesn't really hold up in the face of law, and that there must definitely be better ones, but to me this is more a sign that the way the law works is often arbitrary (but usually tilted in favour of the rich and the ruling class, to say the least) than a sign that i should change the way i think about it</p>",
        "id": 228274759,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614620985
    },
    {
        "content": "<p>anyway, this is something that i would love to be properly educated on one day, since i have a lot of thoughts and feelings (and a lot of translations to share...)</p>",
        "id": 228275034,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614621066
    },
    {
        "content": "<p>You might complain, take me to court - and fail to convict me, because my fist just whizzed one millimeter past your nose and that doesn't count.   (In fact I have no idea if that counts.  But there must be case law on this.)</p>",
        "id": 228275055,
        "sender_full_name": "John Baez",
        "timestamp": 1614621071
    },
    {
        "content": "<blockquote>\n<p>but to me this is more a sign that the way the law works is often arbitrary (but usually tilted in favour of the rich and the ruling class, to say the least) </p>\n</blockquote>\n<p>Sure.  It's been that way at least since Hammurabi, and it's a constant struggle to try to make it more just.</p>\n<p><em>“The law, in its majestic equality, forbids rich and poor alike to sleep under bridges, to beg in the streets, and to steal loaves of bread”.</em> - Anatole France, 1894.</p>",
        "id": 228275821,
        "sender_full_name": "John Baez",
        "timestamp": 1614621323
    },
    {
        "content": "<p>From what little I understand about the Fair Use doctrine, it is a very nebulous boundary between what is and what is not Fair Use.  The same court on the same day could plausibly see isomorphic ambiguously Fair Use cases with isomorphic arguments made on both sides and decide one is Fair Use and the other is not.  The more original content you can add, the more likely your Fair Use claim can stand if challenged.  If simple translation doesn't pass muster, verbose commentary might stand a better chance, even if the entire translation is included in the commentary.  </p>\n<p>Obvious caveat: I am not a lawyer, so my understanding may be flawed, and this should not be construed as legal advice.</p>",
        "id": 228288802,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1614625906
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/translation.20requests/near/228223920\">said</a>:</p>\n<blockquote>\n<p>Prompted by <a href=\"#narrow/stream/230123-theory.3A-algebra.20.26.20CT/topic/The.20category.20of.20fields\">the discussion over here on fields and multipresentability</a>, I think having English translations of Yves Diers's texts on locally multipresentable categories (<em>Familles universelles de morphismes</em>,  <em>Catégories Multialgébriques</em>, <em>Catégories Localement Multiprésentables</em>) would be very helpful in making these concepts more accessible (if you're still looking for requests). The latter two are ~15 pages long. However, I wasn't able to find a copy of the first one, so I'm not sure whether it's available online.</p>\n</blockquote>\n<p>I'm about halfway through a translation of Catégories Multialgébriques <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 228439395,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614702464
    },
    {
        "content": "<p>ok, there's a full translation of Diers' <em>Catégories Multialgébriques</em> that I've just placed on my website (for personal use, of course) <a href=\"https://labs.thosgood.com/builds/ADM-34-1980-193.pdf\">https://labs.thosgood.com/builds/ADM-34-1980-193.pdf</a></p>",
        "id": 228494400,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614722575
    },
    {
        "content": "<p>Brilliant, thank you very much! That was amazingly fast work!</p>",
        "id": 228495229,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614722893
    },
    {
        "content": "<p>thanks, and no problem! it was a pretty short paper, and i've done enough translations (especially from french) now that i've got rather speedy at them</p>",
        "id": 228496336,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614723277
    },
    {
        "content": "<p>(i'm also hoping that, if i do enough translations, then somebody like springer might eventually pay me to do an actual translation of some of their older french textbooks or something. that would be nice!)</p>\n<p>(well, it's not so much that i'm hoping to get paid, but more just that i'm hoping they'll give me \"legal permission\")</p>",
        "id": 228496548,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1614723334
    },
    {
        "content": "<p>Yes, that would be excellent.</p>",
        "id": 228498163,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614724016
    },
    {
        "content": "<p>Maybe you can get them to pay you <em>not</em> to translate things and make them open-access.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 228515706,
        "sender_full_name": "John Baez",
        "timestamp": 1614733097
    },
    {
        "content": "<p>I was thinking about this recently (prompted by an 86-page paper of Guitart I did not have the energy to slowly work through at the moment), and it occurred to me that TAC already has a reprints series of influential category theory papers, and it's not so much of a stretch to imagine they might be interested in translations of the same. There are a number of works in French and German that have been influential despite being less accessible, and many more than I believe would have been influential if they had been more widely known. The TAC editors are already familiar with copyright issues for republications, so they could be in an ideal position to facilitate this.</p>",
        "id": 248356217,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1628086841
    },
    {
        "content": "<p>are any of the editors on this Zulip ? if they ever want some translations done then i'd be more than happy to discuss ;-)</p>",
        "id": 248360233,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1628088438
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317561\">@Geoff Cruttwell</span> is on Zulip, but I'm not sure whether he's active. <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> is more active on Zulip, I believe?</p>",
        "id": 248361031,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1628088745
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/translation.20requests/near/248361031\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"317561\">Geoff Cruttwell</span> is on Zulip, but I'm not sure whether he's active. <span class=\"user-mention silent\" data-user-id=\"276656\">Valeria de Paiva</span> is more active on Zulip, I believe?</p>\n</blockquote>\n<p>hi, yes, I can suggest to the Board that the reprints series be extended to include translations, don't know how they will react, but I think it's a good idea. but it also seems to me that Yves Diers should be consulted about translations of his work. Did you write to him @Tim? it's a matter of commonsense and courtesy, no?</p>",
        "id": 248362944,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1628089508
    },
    {
        "content": "<p>I have tried to contact Yves Diers, but I have had trouble finding an up-to-date contact address for him. If you know who could point me in the right direction, I would be very grateful.</p>",
        "id": 248364288,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1628090111
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/260000-practice.3A-translation/topic/translation.20requests/near/248364288\">said</a>:</p>\n<blockquote>\n<p>I have tried to contact Yves Diers, but I have had trouble finding an up-to-date contact address for him. If you know who could point me in the right direction, I would be very grateful.</p>\n</blockquote>\n<p>ditto: i couldn't find a department page, and i don't know anybody who knows him to get an email address</p>",
        "id": 248365032,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1628090414
    },
    {
        "content": "<p>I asked on the categories mailing list, and no-one could send me an email address, so it seems likely there aren't very many people who can get in touch with him now.</p>",
        "id": 254027449,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1632133463
    },
    {
        "content": "<p>I have come across a Danish thesis that I believe has some relevance to my PhD thesis, but unfortunately, it is handwritten and so it is quite time-consuming for me to try to find the relevant results. Are there any Danish-speakers here who might be willing to skim through and let me know where the results I'm looking for are located? (I don't know whether the author is happy for the thesis to be shared publicly yet, so I would rather send it privately.) Thank you!</p>",
        "id": 258045086,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1634570176
    },
    {
        "content": "<p>I have a new translation request: Pumplün's <a href=\"https://eudml.org/doc/161964\">Eine Bemerkung über Monaden und adjungierte Funktoren</a>. From what I can tell, it has observations about adjunctions and monads that are hard to find references for elsewhere.</p>",
        "id": 258292696,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1634688550
    },
    {
        "content": "<p>If you haven't found a Danish-speaker already, I'd be happy to have a look for you.</p>",
        "id": 259206615,
        "sender_full_name": "Robin Kaarsgaard",
        "timestamp": 1635323207
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"452564\">@Robin Kaarsgaard</span>: thank you very much for the offer! I've put more details in <a href=\"#narrow/stream/260000-practice.3A-translation/topic/Bikategorien.20af.20Profunktorer/near/259230517\">this thread</a>. I've got very little idea what's going on in the thesis generally, so any insight at all would be helpful, but I've tried to narrow down (a little) the parts I'm interested in.</p>",
        "id": 259230961,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1635337899
    },
    {
        "content": "<p>If there are any Russian speakers in this stream, I have come across an old paper <a href=\"http://m.mathnet.ru/php/archive.phtml?wshow=paper&amp;jrnid=sm&amp;paperid=4544&amp;option_lang=eng\">Completion of categories by free and direct joins of objects</a> by M. S. Tsalenko and would like to know whether it has a construction of the \"free category with products and coproducts\" as suggested by the title (and, I think, also by the introduction). This is regarded as an open problem as far as I know, so it would be very satisfying if the answer was contained here. (In particular, the construction should not identify the initial and terminal objects, and should not be distributive.) I would be grateful if anyone could shed some light on it!</p>",
        "id": 284354317,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1653909471
    }
]