[
    {
        "content": "<p>An editorial in <em>Science</em>:</p>\n<ul>\n<li>Karthik Muralidharan and Abhijeet Singh, <a href=\"https://science.sciencemag.org/content/372/6537/36/tab-e-letters\">India's new National Education Policy: Evidence and challenges</a>.</li>\n</ul>\n<blockquote>\n<p>Which advanced scientific text to translate? We suggest translating Conceptual Mathematics (Lawvere and Schanuel, 2009) into Kannada as ಪರಿಕಲ್ಪನಾ ಅಧ್ಯಯನ (Parikalpane Adhyayana, based on the meaning of the etymological roots of the word: mathematics), and making the Kannada textbook ಪರಿಕಲ್ಪನಾ ಅಧ್ಯಯನ (Parikalpane Adhyayana) freely available online and in print to students attending government schools. Why Conceptual Mathematics or ಪರಿಕಲ್ಪನಾ ಅಧ್ಯಯನ (Parikalpane Adhyayana)? Before we answer this question, we must note that Lawvere and Schanuel (2009) Conceptual Mathematics is a first introduction to categories (or universes of discourse). A universe of discourse, say, a category of cats is one in which every cat in the category has the essence (in the sense of the way parts of a whole stick together; see Lawvere and Schanuel, 2009, p. 146; Lawvere, 2015) 'catness', and every transformation of any cat is a natural transformation (e.g. transformation of a small cat into a big cat, preserves the catness that characterizes the category of cats). Therefore, what we refer to as Conceptual Mathematics is also known as Category Theory or Theory of Naturality (Eilenberg and MacLane, 1945; see also Lawvere, 2006, p. 2).</p>\n</blockquote>",
        "id": 249154792,
        "sender_full_name": "John Baez",
        "timestamp": 1628708917
    },
    {
        "content": "<p>It's not completely clear to me if \"big cat\" is intended as an in joke here... but it's nice that someone wants to get <em>Conceptual Mathematics</em> translated into <a href=\"https://en.wikipedia.org/wiki/Kannada\">Kannada</a>.</p>",
        "id": 249154905,
        "sender_full_name": "John Baez",
        "timestamp": 1628708979
    }
]