[
    {
        "content": "<p>We were talking about this a while ago over on <a class=\"stream\" data-stream-id=\"271602\" href=\"/#narrow/stream/271602-general.3A-co.2Fappreciation\">#general: co/appreciation</a>, but I want to announce it on General. Due to the University of Leicester not backing down on its plans to entirely close several departments, including maths, the University &amp; College Union has \"greylisted\" the university, and calls on the international community to do the same. Here's the start of the email I received:</p>\n<p>Dear Dr Hedges</p>\n<p>I’m writing to ask you to support our union's global boycott of the University of Leicester whose management has threatened over 100 staff with compulsory redundancy. We have implemented the ultimate sanction of 'greylisting' to urge the university to stop the proposed cuts and to hold urgent talks with staff unions to resolve the current dispute.</p>\n<p>UCU calls on all members, supporters, other unions and the international academic community to support staff at Leicester including by:</p>\n<p>not applying for any advertised jobs at Leicester<br>\nnot speaking at or organising academic or other conferences at Leicester<br>\nnot accepting invitations to give lectures at Leicester<br>\nnot accepting positions as visiting professors or researchers at Leicester<br>\nnot writing for any academic journal which is edited at or produced by Leicester<br>\nnot accepting new contracts as external examiners for taught courses at Leicester<br>\nrefusing to collaborate on new research projects with Leicester.<br>\nAcademic boycott is a weapon of last resort and has only been used a handful of times in UCU's history but that is a measure of the seriousness with which we take this threat to our members’ jobs at Leicester and the level of intransigence of the employer that has left us with no choice.</p>",
        "id": 238283656,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1620728707
    },
    {
        "content": "<p>Do we know what happened to Julia Goedecke, Simona Paoli and Teimuraz Pirashvili? Andy Tonks got made redundant (I don't know any of the other people there that might be doing category theory. The whole thing is a tragedy, of course, but you can forgive me for looking out for our \"own\")</p>",
        "id": 239205466,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1621320223
    },
    {
        "content": "<p>The Deputy Head is the only permanent female academic staff member, and I can't find out who that is. If it is not Simona, and I think Julia is too junior, then they are both gone.</p>",
        "id": 239205773,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1621320421
    },
    {
        "content": "<p>Simona doesn't list being Dep Head on her staff page, so I fear she may be gone too.</p>",
        "id": 239206164,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1621320722
    },
    {
        "content": "<p>Some 3 months ago Julia told me that as a \"teaching fellow\" she is not paid for frivolous research, and thought she would still be deemed useful for teaching maths to undergrads of other departments. I hope that didn't change in the meantime.</p>",
        "id": 239228614,
        "sender_full_name": "Peter Arndt",
        "timestamp": 1621332609
    },
    {
        "content": "<p>I don't know what Simona Paoli is doing, but she told me that if she was expected to do only teaching she would look for a job outside of Leicester.  So she is probably busy looking for a job.</p>",
        "id": 239262575,
        "sender_full_name": "John Baez",
        "timestamp": 1621348040
    }
]