[
    {
        "content": "<p>There are a bunch of recent consensus algorithms that build a directed acyclic graph of blocks rather than a chain of blocks.  <a href=\"https://arxiv.org/abs/1812.02232\" title=\"https://arxiv.org/abs/1812.02232\">Casanova</a> is one of these, named for Geoffrey Rush's character Casanova Frankenstein in Mystery Men. There's a scene where he's confronted by Captain Amazing in which they have this exchange:</p>\n<blockquote>\n<p>Capt. Amazing: I knew you couldn't change.<br>\nCasanova Frankenstein: I knew you'd know that.<br>\nCapt. Amazing: Oh, I know that. AND I knew you'd know I'd know you knew.<br>\nCasanova Frankenstein: But I didn't. I only knew that you'd know that I knew. Did you know THAT?<br>\nCapt. Amazing: (Frowns, decides to fake it.) Of course.</p>\n</blockquote>\n<p>By watching to see which validators issue blocks that refer to other blocks, validators gain knowledge about who knew who knew what:  </p>\n<ol>\n<li>When a validator sees that a fault-tolerant majority has built on top of a block, it knows that the transactions in the block will eventually become accepted by all other behaving validators.  </li>\n<li>When a validator sees that a fault-tolerant majority sees that a fault-tolerant majority has seen the block, the block is finalized: no other message can change the network's mind.  This true finalization prevents the kind of 51% attack we've seen recently on networks like Ethereum classic.  </li>\n<li>When a validator sees that everyone has seen that everyone has seen a block, the block will never be referenced again by a behaving validator and the block can be archived.  This gets rid of the need to store the entire history of the network to be a contributing validator.</li>\n</ol>\n<p>These kinds of eventual knowledge seem amenable to modeling with a truth object in a topos.  A dag is a \"skeletal\" graph in much the same way that a poset is a skeletal preorder. A dag whose blocks are labeled with validators is a mashup of the theory of graphs and the theory of multisets.  On this topic I'd like to work out a category whose category of presheaves is a topos in which we can reason about what validators know about what other validators know about, and so on.</p>",
        "id": 192869068,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585951261
    },
    {
        "content": "<p>That's a lot to take in with no diagrams and with a limited knowledge of blocks, but if you break it down for me a bit I can very likely contribute to the building of a relevant topos.</p>",
        "id": 192873023,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585954176
    },
    {
        "content": "<p>First, I need to understand what the entities involved are. There are validators and blocks; how are new blocks generated/added to this system? Are the majorities you refer to out of the population of validators? Is that population fixed or constrained somehow?</p>",
        "id": 192873154,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1585954294
    },
    {
        "content": "<p>I added a link to the paper above.</p>\n<p>The theory of labeled graphs has three objects E (directed edges), B (blocks, the vertices of the graph), and V (validators). It has three morphisms s, t: E -&gt; B for source and target of each edge, and l:B -&gt; V labeling the block with the validator that created it.</p>",
        "id": 192876933,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585957433
    },
    {
        "content": "<p>In the Casanova protocol, there's a fixed population of validators, all known to each other.  It's possible to add stuff to the protocol to kick out validators that are misbehaving and to allow new validators to join, but that's not critical for finding consensus.</p>",
        "id": 192877044,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585957538
    },
    {
        "content": "<p>Validators all issue a block once every time step; they all keep time independently, so there may be drift between them.  The network is not reliable, but the liveness proof assumes that there is some upper bound (it doesn't need to be known, just exist) on the time that it takes for a message to be delivered.  Essentially that means people will notice when the network is down and it'll eventually get fixed.  Each block has to refer to the latest block that validator has received from each of the other validators.</p>",
        "id": 192877203,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585957685
    },
    {
        "content": "<p>Blocks contain transactions, but that's an optimization.  We can imagine that each transaction lives in its own block.</p>",
        "id": 192877256,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585957757
    },
    {
        "content": "<p>Transactions have \"conflict domains\"; that is, there's a way to tell when two transactions conflict with each other.  A useful case to keep in mind is when users have accounts and payments out of the accounts are totally ordered; you can think of each account as having a series of check numbers.  If Alice tries to pay both Bob and Carol with the same check number, that is a conflict.  None of Alice's payments conflict with Bob's or Carol's.</p>",
        "id": 192877425,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585957911
    },
    {
        "content": "<p>I mentioned the theory of labeled directed graphs, but that doesn't capture the time-dependent aspect of the system.  The blockdag that a validator v sees at any time is a subdag of all future blockdags.  And it is not so much subdags that we care about as much as the n-level witnessing of blocks.</p>",
        "id": 192877653,
        "sender_full_name": "Mike Stay",
        "timestamp": 1585958098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276048\">@Mike Stay</span> this looks like a Hard Problem. I'm currently thinking about classifying spaces of monoids (discussion in the category theory stream), but perhaps there will come a time in the not too distant future where I'll put some serious thought into this. Good luck in the mean time!</p>",
        "id": 193345108,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586363469
    }
]