[
    {
        "content": "<p>I don't know if this counts as a basic question, but I can't find anything in the literature and I don't see an appropriate existing thread. Perhaps someone here knows!</p>\n<p>Q: Is the category of elementary toposes and logical morphisms known to be locally finitely presentable?</p>",
        "id": 203103095,
        "sender_full_name": "Chad Nester",
        "timestamp": 1594129150
    },
    {
        "content": "<p>(realizing this is probably one of those \"this depends...\" questions, let's start with toposes internal to Set, or similar)</p>",
        "id": 203103888,
        "sender_full_name": "Chad Nester",
        "timestamp": 1594129489
    },
    {
        "content": "<p>I think it is. The category of elementary toposes and logical morphisms is the category of algebras for a finitary monad on Cat (this is shown in Dubac–Kelly's <a href=\"https://core.ac.uk/download/pdf/82757533.pdf\">A Presentation of Topoi as Algebraic Relative to Categories of Graphs</a>), and the category of algebras for a finitary monad on a locally finitely presentable category is also locally finitely presentable by the final remark of Chapter 2 of <em>Locally Presentable and Accessible Categories</em> (page 124).</p>",
        "id": 203106471,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1594130650
    },
    {
        "content": "<p>Thanks! I think that answers my question :)</p>",
        "id": 203106765,
        "sender_full_name": "Chad Nester",
        "timestamp": 1594130794
    },
    {
        "content": "<p>It depends <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span><br>\nLet's consider a simpler question: is the category of (categories with a terminal object) and (functors preserving the terminal object) lfp?<br>\nIf one interprets the question as being about categories with a <em>chosen</em> terminal object and functors which <em>strictly</em> (i.e., up to equality) preserve the chosen terminal object, then the answer is yes, by the above sort of argument. In fact, Freyd's \"Aspects of topoi\" more or less explicitly describes a finitary essentially algebraic theory of which elementary topoi in this sense (i.e., with chosen terminal object / pullbacks / subobject classifier or whatever the exact list) are the models.<br>\nIf one interprets the question in the more usual way as about categories with at least one terminal object and functors which preserve the property of being a terminal object, and if one is interested in the 1-category of such categories and functors, then the answer is no. In fact there is not even an initial category-with-terminal-object, because if we pick a category with at least two terminal objects, there cannot be exactly one terminal-object-preserving functor from any category-with-terminal-object to it.<br>\nIf however one considers the question to be about 2-categories or (2,1)-categories, then presumably the answer is yes again but one has to first understand what is meant by \"locally finitely presentable 2-category\".</p>",
        "id": 203114824,
        "sender_full_name": "Reid Barton",
        "timestamp": 1594134481
    }
]