[
    {
        "content": "<p>As I've mentioned here a few times already <span class=\"user-mention\" data-user-id=\"282722\">@Jens Hemelaer</span> and I are currently working on toposes of monoid actions. We're currently struggling with Lemma C3.2.14 of the <em>Elephant</em>, which gives necessary and sufficient criteria for essential geometric morphisms between presheaf toposes (induced by a functor at the level of small categories) to be proper. The proof invokes some heavy-duty indexed category machinery that is hard to follow. We thought we had a concrete family of counterexamples, although we're no longer as sure that they're genuine counter-examples.<br>\nMy question is: are there errata for Johnstone's <em>Sketches of an Elephant</em>? A cursory search doesn't provide any, but it would be surprising if there were no known mistakes in a reference text of that size.</p>",
        "id": 196618490,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1588763205
    },
    {
        "content": "<p>I don't know of any list of errata maintained by the author, but a few errata have been recorded at <a href=\"https://ncatlab.org/nlab/show/Elephant\" title=\"https://ncatlab.org/nlab/show/Elephant\">https://ncatlab.org/nlab/show/Elephant</a>.</p>",
        "id": 196659934,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1588782288
    },
    {
        "content": "<p>I very strongly doubt Peter Johnstone would maintain an electronic list of errata. In 2013 or 2014 he handed out printed copies of his latest preprint at a talk, the only way to get a copy without someone bootlegging it. Also he said he'd never approve ebook versions of anything he's published (Baby elephant, Stone spaces, Elephant, etc). His website is practically non-existent.</p>",
        "id": 197369398,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1589346215
    },
    {
        "content": "<p>For that matter, Vol 3 is functionally non-existent, as much as I'd like him to do a Knuth and release pre-fascicles as he goes.</p>",
        "id": 197369452,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1589346269
    },
    {
        "content": "<p>You should see his Cambridge office. I reckon he has filed hard copies of every article he's ever read in there.</p>",
        "id": 197387264,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1589362025
    },
    {
        "content": "<p>The cave of wonders!</p>",
        "id": 197490143,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1589412444
    }
]