[
    {
        "content": "<p>I'm looking for a resource that introduces double categories, ideally on the level of \"Seven Sketches in Compositionality\". I'm trying to understand the concept from the nlab, but it's slow going. Something with simpler examples would be especially helpful.</p>",
        "id": 221428484,
        "sender_full_name": "David Egolf",
        "timestamp": 1609639549
    },
    {
        "content": "<p>Consider taking Simona Paoli's course on double categories at the ACT2021 Adjoint School!</p>",
        "id": 221430578,
        "sender_full_name": "John Baez",
        "timestamp": 1609643419
    },
    {
        "content": "<p>Thanks for the suggestion. Unfortunately, I've got enough on my plate for the moment.<br>\nHowever, I did see that the readings for that course were listed, which may be useful resources:<br>\n<a href=\"https://arxiv.org/pdf/1911.04630.pdf\">Structured cospans</a><br>\n<a href=\"http://www.tac.mta.ca/tac/volumes/28/27/28-27.pdf\">A double categorical model of weak 2-categories</a><br>\n<a href=\"https://arxiv.org/pdf/1707.01868.pdf\">Segal-type models of higher categories</a></p>\n<p>This part of the description of the course is appealing: \"An approach to bicategories and double categories is available in higher category theory through models that do not require a direct checking of the coherence axioms, such as the Segal-type models.\" That sounds like it could save a lot of tedious work.</p>",
        "id": 221433490,
        "sender_full_name": "David Egolf",
        "timestamp": 1609649041
    },
    {
        "content": "<p>I found David Jaz Myers' <a href=\"https://arxiv.org/pdf/1612.02762.pdf\">String Diagrams for Double Categories and Equipments</a> very helpful. It should probably be read in conjunction with other resources, since it's not designed as an introduction to the subject as such, but it's easy to follow and the graphical language makes double categories very intuitive.</p>",
        "id": 221437773,
        "sender_full_name": "Nathaniel Virgo",
        "timestamp": 1609656996
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Basic.20Double.20Categories/near/221433490\">said</a>:</p>\n<blockquote>\n<p>This part of the description of the course is appealing: \"An approach to bicategories and double categories is available in higher category theory through models that do not require a direct checking of the coherence axioms, such as the Segal-type models.\" That sounds like it could save a lot of tedious work.</p>\n</blockquote>\n<p>As usual in category theory, it avoids tedious work by introducing another layer of abstraction.  So you have to suffer through learning a bunch more concepts, and then in the end it's supposed to pay off.... and it probably does.</p>",
        "id": 221472995,
        "sender_full_name": "John Baez",
        "timestamp": 1609710677
    },
    {
        "content": "<p>I have avoided using Segal-type models in my applications of double categories to concrete systems like electrical circuits, Markov processes, Petri nets etc., because I think practitioners of those subjects would find Segal categories even more off-putting than double categories!   </p>\n<p>In particular, the simplices in Segal categories are less intuitive than the squares in double categories, where each part - the objects, the vertical arrows, the horizontal arrows and the square itself - has a clear meaning in the applications.</p>\n<p>However it might be good to use Segal-type methods to prove some of the theorems I'm having to prove!  Some of the proofs are indeed tedious.  One could use fancier methods in the proofs, while black-boxing them so practitioners would not need to encounter them.</p>",
        "id": 221475469,
        "sender_full_name": "John Baez",
        "timestamp": 1609714294
    },
    {
        "content": "<p>Of course in the end we want to develop a \"food chain\" so that electrical engineers can talk to applied category theorists who talk to category theorists who talk to homotopy theorists and useful ideas get passed back and forth without the engineers needing to understand Segal categories or the homotopy theorists needing to understand RLC circuits!</p>",
        "id": 221476423,
        "sender_full_name": "John Baez",
        "timestamp": 1609715656
    }
]