[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Team.20of.20teams/near/199855295\">said</a>:</p>\n<blockquote>\n<p>The book is <a href=\"https://www.goodreads.com/book/show/22529127-team-of-teams\">Team of Teams</a> by <a href=\"https://en.wikipedia.org/wiki/Stanley_A._McChrystal\">General Stanley A McChrystal</a>, who described his experience of transforming the US army in Iraq into a decentralised organisation in order to fight a decentralised enemy.</p>\n</blockquote>\n<p>I don't know how good this can be, since from a strictly strategic and tactical point of view the whole Iraq thing is pretty much the dictionary definition of \"shitshow\".</p>",
        "id": 199859345,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591353660
    },
    {
        "content": "<p>I am well acquainted with the situation. I used to write books about military strategy for the Italian Secret Service years ago. When I said it's a shitshow I mean it. Anyway this is not the right group to discuss this sort of stuff, so I'd rather end the discussion here (also, I want to avoid as much as possible for things to turn political, and with Iraq war one is literally begging for it) :D</p>",
        "id": 199872836,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591362428
    },
    {
        "content": "<p>Plants are amazing: I can chop a piece off a succulent, stick it in the dirt, and it will grow into a whole new plant.  </p>\n<p>This is one of their ways of making up for the disadvantages of immobility.</p>",
        "id": 199902858,
        "sender_full_name": "John Baez",
        "timestamp": 1591375012
    },
    {
        "content": "<p>I'm fascinated by that underground \"internet\", sometimes called the Wood Wide Web.  But some people like <a href=\"https://www.newyorker.com/tech/annals-of-technology/the-secrets-of-the-wood-wide-web\">Merlin Sheldrake</a> make claims about it that seem overblown.  So I'd like to get more solid information on it.</p>",
        "id": 199958155,
        "sender_full_name": "John Baez",
        "timestamp": 1591423010
    },
    {
        "content": "<p>This is from an appendix from Peter Wohlleben's book \"The Hidden Life of Trees\". Note the part that says \"When the interwoven birches and firs were spiked with stable and radioactive isotopes, I could see, using mass spectrometers and scintillation counters, carbon being transmitted back and forth between the trees, like neurotransmitters firing in our own neural networks. The trees were communicating through the web!\"...</p>",
        "id": 199985467,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1591464935
    },
    {
        "content": "<p>The underground social networks of trees that Peter Wohlleben describes in his home woodlands of Germany were discovered in the inland temperate rainforests of western North America. In the early 1990s, when searching for clues to the remarkable fertility of these Pacific forests, we unearthed a constellation of fungi linking manifold tree species. The mycelial web, as we later discovered, was integral to the life of the forest. Peter's account that these networks, as in our old-growth forests, are also important to the wellbeing of the beech, oak, and planted spruce forests of Europe is heartening.</p>\n<p>My own search for this web in my home forests began as a quest to understand why weeding paper birches from clear-cut plantations went hand in hand with the decline of planted Douglas firs. In the rows of saplings, I would often see clusters of firs suffering from the loss of their birch neighbors. Yes, trees decline and die naturally--gracefully, beautifully, generously--as an essential part of the irrepressible life cycle of the forest. But this pattern of premature death had been concerning me for some time. The loss of synergy between broad-leaved trees and conifers, it turns out, was a concern of Peter's, too. Across the forests of Europe, planting and weeding to create clean rows has been practiced for centuries.</p>\n<p>With the web uncovered, the intricacies of the belowground alliance still remained a mystery to me, until I started my doctoral research in 1992. Paper birches, with their lush leaves and gossamer bark, seemed to be feeding the soil and helping their coniferous neighbors. But how? In pulling back the forest floor using microscopic and genetic tools, I discovered that the vast belowground mycelial network was a bustling community of mycorrhizal fungal species. These fungi are mutualistic. They connect the trees with the soil in a market exchange of carbon and nutrients and link the roots of paper birches and Douglas firs in a busy, cooperative Internet. When the interwoven birches and firs were spiked with stable and radioactive isotopes, I could see, using mass spectrometers and scintillation counters, carbon being transmitted back and forth between the trees, like neurotransmitters firing in our own neural networks. The trees were communicating through the web!</p>\n<p>I was staggered to discover that Douglas firs were receiving more photosynthetic carbon from paper birches than they were transmitting, especially when the firs were in the shade of their leafy neighbors. This helped explain the synergy of the pair's relationship. The birches, it turns out, were spurring the growth of the firs, like carers in human social networks. Looking further, we discovered that the exchange between the two tree species was dynamic: each took different turns as \"mother,\" depending on the season. And so, they forged their duality into a oneness, making a forest. This discovery was published by Nature in 1997 and called the \"wood wide web.\"</p>",
        "id": 199985470,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1591464947
    },
    {
        "content": "<p>I guess that if we follow the pointers starting from that we will be able to find how this communication between plants is being measured.</p>",
        "id": 199985539,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1591465074
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Decentralisation/near/199966571\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/232161-learning.3A-recommendations/topic/Decentralisation/near/199958155\">said</a>:</p>\n<blockquote>\n<p>But some people like <a href=\"https://www.newyorker.com/tech/annals-of-technology/the-secrets-of-the-wood-wide-web\">Merlin Sheldrake</a> make claims about it that seem overblown.</p>\n</blockquote>\n<p>The New Yorker feature is pretty innocuous. What claims has Sheldrake made that seem overblown?</p>\n</blockquote>\n<p>Hmm, maybe none!  It's been a while since I looked at this.   I guess I was just worrying that I heard about this stuff in the <em>New Yorker</em> rather than scientific papers.  Also, I was afraid Merlin was just pushing forward his dad's wacky \"morphogenetic field\" ideas in a new way.  </p>\n<p>I generally <em>do</em> think it's a safe bet to assume that biological systems interact in more complicated and interesting ways than we give them credit for.  The amount of time evolution has been going on, and the subtle games that it involves, are hard to viscerally fathom.   We tend to assume things are simple, but in biology we should probably assume things are complex.  But theories still need to be checked out critically, of course.</p>",
        "id": 199991238,
        "sender_full_name": "John Baez",
        "timestamp": 1591474365
    },
    {
        "content": "<p>I'm reading a nice book <em>Making Eden: How Plants Transformed a Barren Planet</em>.  It has a lot about plant-fungus cooperation and how over time fungi have been entering symbiotic relations with more and more plants.   Cool quote:</p>\n<blockquote>\n<p>In all about 200 species belonging to several genera of early vascular land plants produce gametophytes that develop in soil and litter and lack chlorophyll.   Unable to feed themselves by photosynthesis, they are entirely dependent on subterranean mycorrhizal networks connected to photosynthetic adults to supply carbon and nutrients.</p>\n</blockquote>",
        "id": 199991560,
        "sender_full_name": "John Baez",
        "timestamp": 1591474998
    },
    {
        "content": "<p>Rupert named his son \"Merlin\" to make it easier for him to succeed in academia.</p>",
        "id": 200033639,
        "sender_full_name": "John Baez",
        "timestamp": 1591550782
    },
    {
        "content": "<p>Once upon a time, I tried to formulate this sort of thing mathematically, with mixed success: <a href=\"https://arxiv.org/abs/1812.00450\">https://arxiv.org/abs/1812.00450</a>. The basic idea is that to a system that is defined by an ensemble, it is possible to measure the (information-theoretic) correlation between <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">n</span></span></span></span> parts, and then using this you can get an idea of how coordinated or uncoordinated the system is.</p>",
        "id": 203047614,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1594074021
    },
    {
        "content": "<p>Yikes! That's a hefty paper! Do you know of any reading group on it I could join?</p>",
        "id": 203285326,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1594223686
    },
    {
        "content": "<p>Out of context 9 months later, it looks like you were responding to your own paper, surprised at its length <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 236091509,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1619383156
    }
]