[
    {
        "content": "<p>Hello! I'm new to this site, so my apologies if this is the wrong place to ask this question. I've become interested in some issues related to global space-time structure. I haven't had a formal course in that area, though I've taken courses on General Relativity and cosmology. While I am looking at multiple books on global space-time structure, I was wondering if anyone knew of any video lectures on global space-time structure on YouTube.</p>",
        "id": 264793864,
        "sender_full_name": "James Possum",
        "timestamp": 1639444155
    },
    {
        "content": "<p>Hi James, I am not exactly sure of what you are looking for, but a couple years ago I did some leisure research on the possible topologies of spacetime, and this introductory textbook <a href=\"https://mphitchman.com/geometry/frontmatter.html\">Geometry with an Introduction to Cosmic Topology</a> was a nice finding (see Chapter 8). I also gave a <a href=\"https://drive.google.com/file/d/1ev-Z5Qxfd-4VuyZxtYG_mon9TauW7zGv/view\">short talk</a> on that topic, it's in Portuguese but perhabs you can extract something out of it.</p>",
        "id": 264796863,
        "sender_full_name": "Daniel Teixeira",
        "timestamp": 1639446892
    },
    {
        "content": "<p>Thanks for your reply! As I said, I have a number of texts already on global space-time structure -- including Hawking &amp; Ellis, etc -- though I hadn't seen the book you recommended. Thank you for your recommendation. I was looking for a series of lecture videos in particular, perhaps from a graduate level course on the subject.</p>",
        "id": 264802720,
        "sender_full_name": "James Possum",
        "timestamp": 1639451420
    },
    {
        "content": "<p>I don't really like videos - they're too slow - so I'd never know if someone taught a course on spacetime structure on YouTube, but there are some videos by Dafermos on the <a href=\"https://www.youtube.com/watch?v=Lg1Cetf7V9I\">cosmic censorship hypothesis</a>, and probably lots of other videos on other topics.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Lg1Cetf7V9I\" href=\"https://www.youtube.com/watch?v=Lg1Cetf7V9I\"><img src=\"https://uploads.zulipusercontent.net/eb3cf38a01f0ff67f2d21ab0c9d77036509fef84/68747470733a2f2f692e7974696d672e636f6d2f76692f4c673143657466375639492f64656661756c742e6a7067\"></a></div>",
        "id": 264949732,
        "sender_full_name": "John Baez",
        "timestamp": 1639528446
    },
    {
        "content": "<p>On most video players, including YouTube's, you can speed up the video (without changing the pitch).</p>",
        "id": 264972692,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1639552463
    }
]