[
    {
        "content": "<p>Currently, I am writing a thesis proposal and one of the subject I will tackle is linear logic as internal logic for monoidal categories and bicategories. Another one is Isbell duality. </p>\n<p>I need some references on these subjects. </p>\n<p>Can you help me please?</p>",
        "id": 286224359,
        "sender_full_name": "Guillaume GEOFFROY",
        "timestamp": 1655305170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"302916\">@Thomas Seiller</span> or <span class=\"user-mention\" data-user-id=\"276839\">@Damiano Mazza</span> might have some recommendations for the linear logic question.</p>",
        "id": 286228677,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1655306790
    },
    {
        "content": "<p>nLab and Google get you surprisingly far on such questions.</p>",
        "id": 286229330,
        "sender_full_name": "John Baez",
        "timestamp": 1655307092
    },
    {
        "content": "<p>What do you mean by linear logic as internal logic for bicategories ? All I know which relates linear logic and bicategories is the notion of <a href=\"https://ncatlab.org/nlab/show/linear+bicategory\">linear bicategory</a>.</p>",
        "id": 286544984,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1655501243
    },
    {
        "content": "<p>Also, the models of full linear logic are far more than monoidal categories. It's *-autonomous categories with products, coproducts, and a linear exponential comonad (named linear categories, if you replace *-autonomous by monoidal closed, but not in the same sense that linear bicategories). A good reference for categorical models of linear logic is <a href=\"https://www.irif.fr/~mellies/mpri/mpri-ens/biblio/categorical-semantics-of-linear-logic.pdf\">Categorical Semantics of Linear Logic</a> by Paul-André Melliès.</p>",
        "id": 286545629,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1655501663
    },
    {
        "content": "<p>However,  writing from scratch a sequent calculus with logical rules for bicategories and then a cut elimination procedure seems doable. The fun fact would be that you have two kind of cuts. In fact it's maybe nonsensical, you can't eliminate cuts if your only logical rules are cuts.</p>",
        "id": 286546818,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1655502497
    },
    {
        "content": "<p>Finally, I don't know the relations between symmetric monoidal categories and bicategories but I'm interested by explanations to understand your project.</p>",
        "id": 286547330,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1655502856
    },
    {
        "content": "<p>A symmetric monoidal category is a tetracategory with one object, one morphism and one 2-morphism, while a bicategory is a tetracategory with only identity 3-morphisms and 4-morphisms.</p>",
        "id": 286549723,
        "sender_full_name": "John Baez",
        "timestamp": 1655504570
    },
    {
        "content": "<p>We have to go up to tetracategories to fit in both symmetric monoidal categories and bicategories as special cases.</p>",
        "id": 286549775,
        "sender_full_name": "John Baez",
        "timestamp": 1655504626
    },
    {
        "content": "<p>Ok, very interesting ! Maybe we could cook « higher order categorical logic » in the sense of logics for higher categories. That gives me a lot to think about!</p>",
        "id": 286663064,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1655575137
    }
]