[
    {
        "content": "<p>Hello, friends.</p>\n<p>Recently, <span class=\"user-mention\" data-user-id=\"278008\">@Spencer Breiner</span> shared his <a href=\"https://www.ams.org/journals/notices/202011/rnoti-p1666.pdf\">paper</a> on CT applied to the problem of open-shop scheduling (I'm still trying to understand this paper).</p>\n<p>I was wondering what are other examples of papers focused on \"real world applications\" of CT. I mean, many applied Category Theory examples are more in terms of \"applied math\".</p>\n<p>The other examples of what I'm talking about (that I'm aware of), are: CT for Databases, and CT for epidemiology modelling.</p>",
        "id": 287838676,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1656502175
    },
    {
        "content": "<p>Category theory is being used in a couple of somewhat different ways in quantum computing.  For example there's the <a href=\"https://zxcalculus.com/publications.html\">ZX calculus</a>, based on string diagrams for symmetric monoidal categories, which I believe is used by the company <a href=\"https://zxcalculus.com/publications.html\">Cambridge Quantum</a>.   And there's a lot of work on <a href=\"https://ora.ox.ac.uk/objects/uuid:c9b6eaf8-29d4-4637-a576-5a35d3c957bb/files/m6fd78a000486caa7ba9c78bb7b1d208e\">modular tensor categories</a> for topological quantum computing, which is being pursued by <a href=\"https://projectqsydney.com/project-q-interviews-leading-figure-in-microsofts-new-quantum-computing-initiative/\">Microsoft's Project Q</a>.</p>",
        "id": 287953482,
        "sender_full_name": "John Baez",
        "timestamp": 1656544348
    },
    {
        "content": "<p>I hope you attend some talks online at <a href=\"https://msp.cis.strath.ac.uk/act2022/\">Applied Category Theory 2022</a>, or at least read the abstracts.  That should give you an overview of what people are doing in applied category theory, including \"applied\" applied category theory.</p>\n<p>By the way I slightly prefer Nicolas Behr's term \"EXACT\" - meaning \"executable applied category theory\".</p>",
        "id": 287953932,
        "sender_full_name": "John Baez",
        "timestamp": 1656544667
    }
]