[
    {
        "content": "<p>I've heard that a draft of the third volume of Johnstone's 'Sketches of an Elephant' has been circulated. Does anyone know how I can obtain a copy?</p>",
        "id": 203230048,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1594182194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319282\">@Chetan Vuppulury</span> Why don't you write an email to him?</p>",
        "id": 203237309,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1594192029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295542\">@Sayantan Roy</span> , I did write an email, but I did not receive a response from him.</p>",
        "id": 203241405,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1594195684
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> do you know something about this topic?</p>\n<p>(I apologise in case you find the ping annoying/unwanted. If I recall correctly, you asked here on Zulip before about the third volume of the Elephant, so I thought you might be interested in this discussion, in case you haven't seen it yet)</p>",
        "id": 203432596,
        "sender_full_name": "Emily",
        "timestamp": 1594324828
    },
    {
        "content": "<p>No! I wish I knew more!!</p>",
        "id": 203446671,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1594331988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319282\">@Chetan Vuppulury</span> I assume you can't get a copy. Johnstone is extremely guarded about his work being available electronically, forbidding the publisher(s) of his book from making ebook versions for sale. He had a preprint for a topic he gave a talk on once ... in paper form only.</p>",
        "id": 203446885,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1594332093
    },
    {
        "content": "<p>I think just <em>confirming</em> the existence of a complete draft would be excellent. And an ETA for publication would be even better.</p>",
        "id": 203446976,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1594332133
    },
    {
        "content": "<p>I agree; knowing when it's coming out (or at least knowing how complete the draft is) would be awesome!</p>",
        "id": 203569440,
        "sender_full_name": "Emily",
        "timestamp": 1594424861
    },
    {
        "content": "<p>His stance does make me a bit curious though; do you know why Johnstone is so insistent on making his work available in paper form only?</p>",
        "id": 203569500,
        "sender_full_name": "Emily",
        "timestamp": 1594424907
    },
    {
        "content": "<p>(I deleted and then re-sent the first message because my messages got sent in the wrong order)</p>",
        "id": 203569537,
        "sender_full_name": "Emily",
        "timestamp": 1594424958
    },
    {
        "content": "<p>By the way, it's possible to actually delete your message, instead of leaving a message that says (deleted).  You go to the drop-down menu that appears when you mouse near the date of your message, click on the down-arrow, and click on \"Delete message\".</p>",
        "id": 203569642,
        "sender_full_name": "John Baez",
        "timestamp": 1594425074
    },
    {
        "content": "<p>He's quite old-school. Also, I imagine spending decades on a book project like that, where the book costs hundreds of dollars, maybe he gets real royalties. Until only a few years back he also didn't want the original Topos Theory book to be republished, preferring people buy The Elephant. Either because it is more complete, or otherwise, I don't know.</p>",
        "id": 203593791,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1594469033
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Thanks! I had first deleted the message from my phone first, but I followed your instructions and I think that it should now be gone for good :-)</p>",
        "id": 203784695,
        "sender_full_name": "Emily",
        "timestamp": 1594683964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276422\">@David Michael Roberts</span> I see; thanks!</p>",
        "id": 203784880,
        "sender_full_name": "Emily",
        "timestamp": 1594684168
    },
    {
        "content": "<p>(still a shame though that things are so :/)</p>",
        "id": 203784893,
        "sender_full_name": "Emily",
        "timestamp": 1594684174
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276871\">@Théo</span> I happened to have an interaction with Peter Johnstone, so I asked him directly. The Synthetic Differential Geometry and realizability toposes sections are apparently essentially complete, the rest, not so much (\"there are large areas of Part E which remain unwritten.\") Certain students have access to copies for the purposes of learning the material, the circulation is very limited.</p>",
        "id": 205211463,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1595926333
    },
    {
        "content": "<p>Thanks for letting me know! :)</p>",
        "id": 205620316,
        "sender_full_name": "Emily",
        "timestamp": 1596217810
    },
    {
        "content": "<p>It's nice to know that Part III is slowly getting done, even though it seems it'll take a while for it to be completed overall</p>",
        "id": 205620463,
        "sender_full_name": "Emily",
        "timestamp": 1596217900
    }
]