[
    {
        "content": "<p>Hey, everyone. <br>\nI started learning Category Theory from more applied books, such as Seven Sketches by Brandon and David; and Category Theory for Scientists by David. I'm almost finishing Category Theory for Scientists and I've noticed that I still lack understanding of some \"basic\" concepts that people in Category Theory often talk about, e.g. sheaves, Kan extensions, fibers, and so on.</p>\n<p>To give some more perspective, I have a masters in applied mathematics and I'm now in my second year in a phd also in applied mathematics. I've also read parts of Leinester's Basic Category Theory.</p>\n<p>So my question is where to go next after reading these two introduction books. Should I go with Leinester's book?</p>",
        "id": 283869819,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1653478294
    },
    {
        "content": "<p>I would recommend sampling from the recorded talks at <a href=\"https://www.youtube.com/channel/UC1Kxtc6DOexi4JT-t57Ey9g/videos\">ACT2020, ACT2021</a>, <a href=\"https://www.youtube.com/channel/UClruKBrlCOYmrzImohpE8kg\">CT20-&gt;21</a>, or the Topos Institute's <a href=\"https://www.youtube.com/c/ToposInstitute/playlists\">online seminar series</a>. </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"c\" href=\"https://www.youtube.com/c/ToposInstitute/playlists\"><img src=\"https://uploads.zulipusercontent.net/ea4ab26c30883638a4f0661ca0be0c717f09b58d/68747470733a2f2f692e7974696d672e636f6d2f76692f632f64656661756c742e6a7067\"></a></div><div class=\"youtube-video message_inline_image\"><a data-id=\"channel\" href=\"https://www.youtube.com/channel/UClruKBrlCOYmrzImohpE8kg\"><img src=\"https://uploads.zulipusercontent.net/1476da0df5fee77805dce548fc04444608bb654b/68747470733a2f2f692e7974696d672e636f6d2f76692f6368616e6e656c2f64656661756c742e6a7067\"></a></div><div class=\"youtube-video message_inline_image\"><a data-id=\"channel\" href=\"https://www.youtube.com/channel/UC1Kxtc6DOexi4JT-t57Ey9g/videos\"><img src=\"https://uploads.zulipusercontent.net/1476da0df5fee77805dce548fc04444608bb654b/68747470733a2f2f692e7974696d672e636f6d2f76692f6368616e6e656c2f64656661756c742e6a7067\"></a></div><p>That should help you narrow down the topics you want to focus on, and then you can pick your resource based on that.</p>",
        "id": 283877587,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1653483065
    },
    {
        "content": "<p>I do think Leinster's book is a good resource. I have a friend who is an engineer and says he enjoys reading  <em>Conceptual Mathematics</em> by Lawvere and Schanuel, but I've never read it myself. </p>\n<p>The main problem I'd expect you to encounter is that  most CT authors are going to motivate things with abstract algebra and topology/homotopy primarily. That you have a degree in applied math means I don't have any grounds to guess what of these you are familiar with. The farther into CT you go, the more you will have to learn about them, as CT itself has a fundamentally algebraic and homotopical nature. To people with a pure math background, I'd recommend Emily Riehl's <em>Category Theory in Context</em>, Mac Lane's <em>Categories for the Working Mathematician</em>, and Mac Lane and Moerdijk's <em>Sheaves in Geometry and Logic</em>. And For you, maybe it would be good to just delve into those and see which walls you bump against.</p>",
        "id": 283882615,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1653485487
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> . To give more context, I love pure math, and I have some knowledge of topology (although only point-set). I'd actually love to get into the weeds of the more theoretical/pure side of CT, even though my thesis is in the application side (but that's what we phd's do, right? we study/do stuff that won't help in our thesis <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> ). Hence, if there is some basic knowledge in homotopy theory or algebra which you deem necessary in order to go deeper in CT, I'd love to here about it (books/prerequesites, and so on).</p>",
        "id": 283887879,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1653487899
    },
    {
        "content": "<p>Again, thank you very much <span class=\"user-mention\" data-user-id=\"278008\">@Spencer Breiner</span>! I'll definitely check them out.</p>",
        "id": 283888015,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1653487956
    },
    {
        "content": "<p>I think the algebraic and homotopical nature of category theory sorta naturally reveals itself over time, but this is a terrible answer to your question. It's a bit hard for me to pin down specific things to learn that are necessary. Nothing's strictly necessary, but also it's impossible to read anything about e.g. infinity categories without encountering some homotopy theory. If you play around with natural transformations long enough, you'll draw topological spaces in the form of pasting diagrams.</p>\n<p>Maybe I'll make my suggestions in the form of a list of staple categories organized by subject. I suspect you might already know a decent amount of it, but I'll list them anyway for anybody else who might be interested. It's hard to go anywhere in CT without bumping into one of the things on this list, or a relative. Learning some basic facts about these categories will demand you learn a bit about the subject. Ideally, you'd be able to say which co/limits it has, how to compute them, whether it has some other monoidal structures, some interesting functors into/out of it... I'll name them like \"&lt;objects&gt; and &lt;morphisms&gt;\" or just \"&lt;objects&gt;\" if I think it's clear. It'll be too many things, but the more of them and their relationships you learn about the better equipped you'll be, and also I'll miss some that people think are critical. Some of them are equivalent, some of them are secretly functors.</p>\n<ul>\n<li><strong>Set theory</strong>: Sets and functions, finite sets and functions, sets and relations, sets and spans of sets, sets and injections, sets and surjections, sets and partial maps, the powerset of a set</li>\n<li><strong>Linear algebra</strong>: vector spaces and linear maps, finite dimensional vector spaces and linear maps, natural numbers and matrices</li>\n<li><strong>Algebra</strong>: groups and homomorphisms, abelian groups, monoids, commutative monoids, rings, commutative rings, posets and order-preserving maps, sup lattices, </li>\n<li><strong>Combinatorics</strong>: graphs (many different types) and graph maps, Joyal's combinatorial species</li>\n<li><strong>Topology</strong>: simplicial sets and natural transformations, topological spaces and continuous maps, compactly generated topological spaces and cts maps, the fundamental groupoid of a topological space</li>\n<li><strong>Other examples</strong>: a monoid is itself a category, a poset is itself a category</li>\n</ul>",
        "id": 283894792,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1653490824
    },
    {
        "content": "<p>Yes, this is a really good list of categories to become familiar with.   Then whenever you meet a concept you can try to figure out what it amounts to in these examples!   One can learn a lot this way.</p>\n<p>For example, a coproduct in the category of groups and homomorphisms is a famous thing (often called the \"free product\").  It starts out seeming very different than a coproduct in a poset (often called a \"least upper bound\").   But when you think about this enough, they start seeming similar in flavor.</p>",
        "id": 283952667,
        "sender_full_name": "John Baez",
        "timestamp": 1653520972
    },
    {
        "content": "<p>Read Lawvere's <em>Metric spaces, generalized logic and closed categories</em>. It's an entry-point for so many things I cannot list 1/3 of them.</p>",
        "id": 283986586,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1653557349
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span> . I've had never heard of it. I'll for sure take a look.</p>",
        "id": 283997635,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1653566474
    },
    {
        "content": "<p>Warning: almost anything by Lawvere is very hard to read, especially if you're just getting started in category theory.   <em>But it's still good to try.</em>   Often you can get a few ideas the first time you read something by him, and a few more the second time, and a few more the third time, and.... so on.</p>",
        "id": 284059287,
        "sender_full_name": "John Baez",
        "timestamp": 1653598107
    },
    {
        "content": "<p>Also, it's a great introduction to how powerful and how <em>different</em> categorical thinking is.</p>",
        "id": 284059354,
        "sender_full_name": "John Baez",
        "timestamp": 1653598144
    },
    {
        "content": "<p>In his textbook <em>Conceptual Mathematics</em> (written with Schanuel) he tries to explain this way of thinking very simply.  So that's much easier to read.  But if you don't do the exercises it's easy to miss the point.</p>",
        "id": 284059432,
        "sender_full_name": "John Baez",
        "timestamp": 1653598197
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"498398\">@Davi Sales Barreira</span>,<br>\nI only understood Kan Extensions when I found a way to draw them that could be used to translate between several standard presentations and to draw particular cases... my way of drawing them is <a href=\"http://angg.twu.net/LATEX/2022on-the-missing.pdf#page=52\">here</a>.</p>",
        "id": 284088333,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1653622304
    }
]