[
    {
        "content": "<p>Here's the schedule of the Friday February 5th 2021 meeting of the Yorkshire and Midlands Category Theory Seminar.  There will be three talks.</p>\n<p><strong>YaMCATS - Friday 5th February - University of Leeds (via Zoom)</strong><br>\nAll times are UK (GMT = UTC+00:00).</p>\n<p>14:30-15:30 Martin Escardo (University of Birmingham), Equality of mathematical structures<br>\n15:30-16:30 Sina Hazratpour (University of Leeds), Kripke-Joyal semantics for dependent type theory<br>\n16:30-17:00 Break<br>\n17:00-18:00 John Baez, Structured versus decorated cospans</p>\n<p><strong>Zoom links</strong></p>\n<p>Nicola Gambino is inviting you to a scheduled Zoom meeting.<br>\nTopic: YaMCATS 23<br>\nTime: Feb 5, 2021 02:30 PM London<br>\nJoin Zoom Meeting<br>\n<a href=\"https://universityofleeds.zoom.us/j/81042397132?pwd=RTg3MFV1TUt2YzJXZVZJSkhoOEQwQT09\">https://universityofleeds.zoom.us/j/81042397132?pwd=RTg3MFV1TUt2YzJXZVZJSkhoOEQwQT09</a><br>\nMeeting ID: 810 4239 7132<br>\nuse this number to get in: 68302x where x is a perfect number</p>\n<p><strong>Abstracts</strong></p>\n<p><em>Martin Escardo</em><br>\n<em>Title:</em> Equality of mathematical structures<br>\n<em>Abstract.</em> Two groups are regarded to be the same if they are isomorphic, two  topological spaces are regarded to be the same if they are homeomorphic, two metric spaces are regarded to be the same if they are isometric, two categories are regarded to be the same if they are equivalent, etc. In Voevodsky's Univalent Foundations (HoTT/UF), the above become theorems: we can replace  \"are regarded to be the same” by \"are the same\". I will explain how  this works. I will not assume previous knowledge of HoTT/UF or type theory.</p>\n<p><em>Sina Hazratpur</em> (University of Leeds)<br>\n<em>Title:</em> Kripke-Joyal semantics for dependent type theory<br>\n<em>Abstract.</em> Every topos has an internal higher-order intuitionistic logic. The  so-called Kripke–Joyal semantics of a topos gives an interpretation  to formulas written in this language used to express ordinary mathematics in that topos. The Kripke–Joyal semantics is in fact a higher order generalization of the well-known Kripke semantic for intuitionistic propositional logic. In this talk I shall report on joint work with Steve Awodey and Nicola Gambino on extending the Kripke–Joyal semantics to dependent type theories, including homotopy type theory.</p>\n<p><em>John Baez</em> (University of California at Riverside)<br>\n<em>Title:</em> Structured versus decorated cospans<br>\n<em>Abstract.</em> One goal of applied category theory is to understand open systems:  that is, systems that can interact with the external world.  We compare two  approaches to describing open systems as cospans equipped with extra data: structured and decorated cospans.  Each approach provides a symmetric monoidal double category, and we prove that under certain conditions these symmetric monoidal double categories are equivalent.   We illustrate these ideas with applications to dynamical systems and epidemiological modeling.  This is joint work with Kenny Courser and Christina Vasilakopoulou.</p>",
        "id": 224662828,
        "sender_full_name": "John Baez",
        "timestamp": 1612124790
    },
    {
        "content": "<p>They all look like really good talks. I rue the timezone difference between here and the UK...</p>\n<p>That said, Simona once offered for me to give a talk at YAMCaTS, if I was ever in the UK, so I guess now I can be, via Zoom :-)</p>",
        "id": 224669733,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1612132175
    },
    {
        "content": "<p>I'm asking them to record my talk, and it'd be good if they recorded everyone's talk - or at least, everyone who is okay with that.</p>",
        "id": 224670325,
        "sender_full_name": "John Baez",
        "timestamp": 1612133100
    }
]