[
    {
        "content": "<p>Bonjour tout le monde! Je suis un étudiant belge étant passé par la France pour mes études, et je m'intéresse tout particulièrement à la théorie des catégorie, les catégories infinies, les liens avec la logique et les fondations des math. J'ai pas une très bonne idée de qui est chercheur dans ce genre de domaines en France, Belgique, Québec ou autres zones francophones du monde. Est-ce que vous pourriez m'aider à comprendre qui fait quoi où en francophonie dans ce domaine? Je sais qu'il y a du monde à Louvain, à Paris, à Nice, à Montréal,... Quelles autres villes sont importantes en théorie des catégories? Que font les gens là-bas? Merci de votre aide!</p>",
        "id": 196645491,
        "sender_full_name": "Pablo Bustillo Vazquez",
        "timestamp": 1588776707
    },
    {
        "content": "<p>il y a plusieurs gens à montpellier qui travaille dans le domaine des infinis catégories et des sujets liés</p>",
        "id": 196717926,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1588814515
    },
    {
        "content": "<p>y'a aussi un seminaire \"Catégories supérieures, polygraphes et homotopie\" a l'IRIF (Paris 7) <a href=\"https://www.irif.fr/seminaires/cat/index\" title=\"https://www.irif.fr/seminaires/cat/index\">https://www.irif.fr/seminaires/cat/index</a></p>",
        "id": 196744452,
        "sender_full_name": "Alexis Toumi",
        "timestamp": 1588842678
    },
    {
        "content": "<p>je sais que <span class=\"user-mention\" data-user-id=\"276363\">@Amar Hadzihasanovic</span> fait partie du groupe (mais je sais pas si il parle francais)</p>",
        "id": 196744499,
        "sender_full_name": "Alexis Toumi",
        "timestamp": 1588842709
    },
    {
        "content": "<p>le groupe DerSympApp est à montpellier, et bien que ça soit 2/3 géométrie, il y’a quand même le «Der» dans le nom 😉<br>\n<a href=\"https://damienespadon.wixsite.com/dersympapp\" title=\"https://damienespadon.wixsite.com/dersympapp\">https://damienespadon.wixsite.com/dersympapp</a></p>",
        "id": 196762064,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1588854171
    }
]