[
    {
        "content": "<p>Hi everyone.  I'd like to share an idea I've been excited about recently.</p>\n<p>The idea is that single object proarrow equipments (from the double categorical perspective) are an algebra of 'concurrent resource transformations' in the same way that monoidal categories are an algebra of 'resource transformations'. </p>\n<p>I've written a short (not very technical) paper explaining how this is so. Its been rejected from one conference, and I'm going to submit an ever shorter version to another, but I have a feeling that the idea is going to wind up as a small part of a larger paper, instead of being presented on its own. </p>\n<p>I think some of you might be interested, so I'll link the preprint of the short paper here: <a href=\"https://arxiv.org/abs/2010.08233\">https://arxiv.org/abs/2010.08233</a></p>\n<p>(I know its got a few typos in. I've fixed them locally, but won't update the arxiv version just yet).</p>",
        "id": 224330358,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611843111
    },
    {
        "content": "<p>I'd love to talk about this, so please don't be shy about questions / comments / connections.</p>",
        "id": 224330570,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611843199
    },
    {
        "content": "<p>(I hope this stream is still alive! <span aria-label=\"skull and crossbones\" class=\"emoji emoji-2620\" role=\"img\" title=\"skull and crossbones\">:skull_and_crossbones:</span>)</p>",
        "id": 224331558,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611843643
    },
    {
        "content": "<p>Cool! It seems to me like you are using double categories to represent concurrency with multiple agents, where the corners represent passing or receiving a resource from another agent. Is this how you think of it <span class=\"user-mention\" data-user-id=\"276114\">@Chad Nester</span></p>",
        "id": 224342867,
        "sender_full_name": "Jade Master",
        "timestamp": 1611848116
    },
    {
        "content": "<p>I wonder if there are concurrent process languages, like the pi-calculus for example which could be modeled in this framework</p>",
        "id": 224343426,
        "sender_full_name": "Jade Master",
        "timestamp": 1611848311
    },
    {
        "content": "<p>That's basically right, yes!</p>",
        "id": 224344202,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611848532
    },
    {
        "content": "<p>I'm not necessarily thinking of each cell as an \"agent\" (I don't really know what that means, so I could be wrong here), but I think that what distinguishes a concurrent system from, say, one in which processes unfold in parallel, is that the material histories of its components are interleaved.</p>",
        "id": 224344912,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611848803
    },
    {
        "content": "<p>The corners make it possible to represent this interleaving, while still being able to separate out the individual components.</p>",
        "id": 224345050,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611848877
    },
    {
        "content": "<p>(Exactly as you say, the corners allow something like \"sending\" and \"receiving\" of resources.)</p>",
        "id": 224345206,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611848936
    },
    {
        "content": "<p>Regarding things like the pi-calculus, I've been thinking of this more as a way to \"situate\" process calculi in the material world than as a process calculus in its own right.</p>",
        "id": 224346149,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611849308
    },
    {
        "content": "<p>... I realise that's a bit cryptic. (There's a draft paper about this but it's too young right now!)</p>",
        "id": 224346200,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611849331
    },
    {
        "content": "<p>For example, it would be nice if we could write down biological processes in some calculus, and then have them generate 'resource transformations' explaining, say, how the biomolecules involved have changed (the \"material history\" part) as they unfold. I think we need both perspectives (process calculus + material effects) to get a satisfying account.</p>",
        "id": 224346870,
        "sender_full_name": "Chad Nester",
        "timestamp": 1611849597
    }
]