[
    {
        "content": "<p><a href=\"user_uploads/21317/i3bkYhGD8Ggs4HinYSbJlPdj/0.jpg\">Non-equilibrium Thermodynamics in Biology: from Chemical Reaction Networks to Natural Selection</a> </p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/21317/i3bkYhGD8Ggs4HinYSbJlPdj/0.jpg\" title=\"Non-equilibrium Thermodynamics in Biology: from Chemical Reaction Networks to Natural Selection\"><img src=\"user_uploads/21317/i3bkYhGD8Ggs4HinYSbJlPdj/0.jpg\"></a></div><p>I'm helping run a special session on this topic at the Society of Mathematical Biology conference.     It will be on Monday June 14th, 2021.</p>\n<p>There will actually be two sessions, starting at 9:30 am and 11:30 am Pacific Time.    You're all invited!   If you want to attend you <a href=\"https://www.smb2021.org/registration\">need to register here</a>, but registration is free.</p>",
        "id": 236772083,
        "sender_full_name": "John Baez",
        "timestamp": 1619745760
    },
    {
        "content": "<p>I'll list speakers and talks later, but there are a lot of good folks speaking.</p>",
        "id": 236772148,
        "sender_full_name": "John Baez",
        "timestamp": 1619745833
    },
    {
        "content": "<p>It's only slightly related to category theory, but I'm running a special session on this topic on June 14th 2021:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2021/05/11/non-equilibrium-thermodynamics-in-biology/\">Non-equilibrium thermodynamics in biology</a>.</li>\n</ul>\n<p>You can register for free <a href=\"https://www.smb2021.org/registration\">here</a> before May 31st, 11:59 pm Pacific Time.  You need to register to watch the talks live on Zoom.   The talks may be recorded, too.</p>\n<p>Here's the idea:</p>\n<p><strong>Abstract:</strong> Since Lotka, ﻿physical scientists have argued that living things belong to a class of complex and orderly systems that exist not despite the second law of thermodynamics, but because of it. Life and evolution, through natural selection of dissipative structures, are based on non-equilibrium thermodynamics. The challenge is to develop an understanding of what the respective physical laws can tell us about flows of energy and matter in living systems, and about growth, death and selection. This session will address current challenges including understanding emergence, regulation and control across scales, and entropy production, from metabolism in microbes to evolving ecosystems.</p>",
        "id": 238255697,
        "sender_full_name": "John Baez",
        "timestamp": 1620712544
    },
    {
        "content": "<p>You can see talk slides here now:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2021/06/16/nonequilibrium-thermodynamics-in-biology-part-2/\">Nonequilibrium thermodynamics in biology (part 2)</a>.</li>\n</ul>\n<p>It's gonna take a while to hook this stuff up with network theory and category theory, but that's my goal now.</p>",
        "id": 242908465,
        "sender_full_name": "John Baez",
        "timestamp": 1623861996
    }
]