[
    {
        "content": "<p>It just hit me while I was working on the stat mech of the Carnot engine that force is the derivative of momentum in a different way than I normally think about it. I.e., I normally think about it in terms of force producing a change in momentum for a specific object. But another way of thinking about it is that it measures the flow of momentum. This became clear to me when I derived the pressure of an ideal gas by calculating the momentum flow into its boundary from collisions by particles.</p>\n<p>Two gases that are at equilibrium because they have matched pressures have a balanced equilibrium of momentum flowing in to each other.</p>\n<p>I feel like there is an essentially \"open\" quality to analysis of flow like this that is absent from the \"closed\" perspective of Hamiltonian mechanics, and I would like to understand how to bring this kind of thing into the more general setting of Hamiltonian mechanics.</p>",
        "id": 261181356,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1636662577
    },
    {
        "content": "<p>Similarly, two gases that are in equilibrium of temperature have a balanced equilibrium of kinetic energy flowing in to each other.</p>",
        "id": 261292846,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1636741919
    },
    {
        "content": "<p>This implies that temperature is the rate at which heat energy flows out of the boundary</p>",
        "id": 261292993,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1636741976
    },
    {
        "content": "<blockquote>\n<p>I feel like there is an essentially \"open\" quality to analysis of flow like this that is absent from the \"closed\" perspective of Hamiltonian mechanics, and I would like to understand how to bring this kind of thing into the more general setting of Hamiltonian mechanics.</p>\n</blockquote>\n<p>You might like my work on <a href=\"https://arxiv.org/abs/1710.11392\">open Hamitonian systems</a>.  But so far it's just getting started - there's a lot of stuff I know should be done, that we didn't get around to!  For example we worked out the open Euler-Lagrange equations but didn't write about them, and there should also be an open version of Hamilton's equations.</p>",
        "id": 261388417,
        "sender_full_name": "John Baez",
        "timestamp": 1636849479
    }
]