[
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"280755\">@Owen Lynch</span> , as a follow up to your remark \"This was my dream! To represent resistors as dumping heat into a heat bath!\" I just want to make you aware of my own work on the intersection of port-Hamiltonian systems and thermodynamics. I thought you guys might know about it, since I told <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> about it once on Twitter ;)<br>\n<a href=\"https://www.tandfonline.com/doi/full/10.1080/13873954.2021.1979592\">https://www.tandfonline.com/doi/full/10.1080/13873954.2021.1979592</a><br>\nRecently I added some notes about a proper wiring diagram syntax: <a href=\"https://www.researchgate.net/publication/358281632_EPHS_A_Port-Hamiltonian_Modelling_Language\">https://www.researchgate.net/publication/358281632_EPHS_A_Port-Hamiltonian_Modelling_Language</a></p>",
        "id": 272872038,
        "sender_full_name": "Markus Lohmayer",
        "timestamp": 1645567048
    },
    {
        "content": "<p>Thanks!  I forgot about this - thanks for reminding us!</p>",
        "id": 272872453,
        "sender_full_name": "John Baez",
        "timestamp": 1645567251
    },
    {
        "content": "<p>Basically, I would say my approach trades flexibility (in terms of which variables are used) for more simplicity. I hope this helps.</p>",
        "id": 272872550,
        "sender_full_name": "Markus Lohmayer",
        "timestamp": 1645567290
    },
    {
        "content": "<p>Can you say a bit about how you're deliberately reducing flexibility to achieve simiplicity - like, which variables you're deciding <em>not</em> to use, or what you could do that you've decided <em>not</em> to do?</p>",
        "id": 272872738,
        "sender_full_name": "John Baez",
        "timestamp": 1645567378
    },
    {
        "content": "<p>Sure. As I once said to Owen already, and I suppose he was already familiar with it, the contact geometry puts all thermodynamic variables (extensive and intensive) on the same footing. Symplecitization unifies the two existing contact descriptions for one and the same system and hence gives you the maximal choice of variables to choose from I suppose. However, I am not sure how practical this really is, whatever practical means if one thinks about applying this stuff to engineering systems.</p>\n<p>Since this is exactly my goal (I come from engineering), it makes sense that I am working on an approach which I feel is closer to applications and simpler to grasp. In the EPHS approach, all variables are energy variables, i.e. one needs to use entropy and other extensive quantities to parametrize the energy.</p>",
        "id": 272873746,
        "sender_full_name": "Markus Lohmayer",
        "timestamp": 1645567910
    }
]