[
    {
        "content": "<p>I am reading Schnakenberg's book on network thermodynamics in biology, and he makes a very interesting and possibly relevant point.</p>\n<p>He claims that the use of thermodynamics is not to predict what will happen in a given system, but rather to predict what cannot happen.</p>\n<p>So rather than looking for dynamical models of non-equilibrium thermodynamics, we should be thinking about \"black-boxing\" a variety of systems into thermodynamical systems, and then only constraining their large scale behavior based on this coarse-graining, rather than totally predicting the large-scale behavior.</p>",
        "id": 262375527,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1637614099
    },
    {
        "content": "<blockquote>\n<p>He claims that the use of thermodynamics is not to predict what will happen in a given system, but rather to predict what cannot happen.</p>\n</blockquote>\n<p>That attitude seems to describe a certain <em>kind</em> of thermodynamics.   For example in modern \"stochastic thermodynamics\" there are rules like the <a href=\"https://johncarlosbaez.wordpress.com/2016/11/18/jarzynksi-on-non-equilibrium-statistical-mechanics/\">Jarzynski equality</a> that make predictions about what <em>will</em> happen.</p>",
        "id": 262380879,
        "sender_full_name": "John Baez",
        "timestamp": 1637616988
    },
    {
        "content": "<p>Schnakenberg may have written before that... but still, the Onsager reciprocity relations, and Maxwell relations, are pretty old - and they make predictions about what you see.</p>",
        "id": 262381003,
        "sender_full_name": "John Baez",
        "timestamp": 1637617075
    },
    {
        "content": "<p>Yeah, this is definitely in a specific context, i.e. the context of biological systems. In context, he means that for biological systems it is hopeless to derive large-scale behavior from consideration of the complex inner workings of a system, rather one should constrain ones expectations of large-scale behavior by thermodynamics, and then experiment to find out the actual behavior among the behaviors allowed by thermodynamics.</p>",
        "id": 262381984,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1637617649
    },
    {
        "content": "<p>Okay.  That makes sense.  There's been some new work that claims to puts bound on the entropy production of a cow, using only macroscopic features of the cow:</p>\n<ul>\n<li>Ana-Sunčana Smith, <a href=\"https://physics.aps.org/articles/v14/152\">Measuring entropy production at the mesoscale</a>, <em>Physics</em>.</li>\n</ul>\n<p>This article is a popularization of the actual work.  The actual work uses Schnakenburg's ideas plus coarse-graining.  I'd like to understand it!</p>",
        "id": 262490728,
        "sender_full_name": "John Baez",
        "timestamp": 1637690023
    },
    {
        "content": "<p>Neat!!</p>",
        "id": 262496083,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1637692637
    },
    {
        "content": "<p>\"The duo shows that the entropic cost of maintaining a heart’s beating time decreases roughly linearly with increasing variance in the normalized waiting time distribution of the beats\" - this quotation reminded me of <a href=\"https://journals.aps.org/prx/abstract/10.1103/PhysRevX.7.031022\">this article</a> on the relationship between clock accuracy and entropy production. I first read about it in <a href=\"https://www.quantamagazine.org/the-new-science-of-clocks-prompts-questions-about-the-nature-of-time-20210831\">this Quanta article</a>. Seems like there's a connection</p>",
        "id": 262570852,
        "sender_full_name": "Robin Piedeleu",
        "timestamp": 1637750141
    },
    {
        "content": "<p>Thanks for pointing that out, Robin!  The paper in the Quanta article is this:</p>\n<ul>\n<li>Paul Erker, Mark T. Mitchison, Ralph Silva, Mischa P. Woods, Nicolas Brunner, Marcus Huber, <a href=\"https://arxiv.org/abs/1609.06704\">Autonomous quantum clocks: does thermodynamics limit our ability to measure time?</a></li>\n</ul>",
        "id": 262619865,
        "sender_full_name": "John Baez",
        "timestamp": 1637775715
    },
    {
        "content": "<p>I haven't looked at it yet, but it sounds more quantum-mechanical.   There could be a relation, though!</p>\n<p>There's also nice time-energy uncertainty principle in quantum mechanics, which is a bit tricky to state since there's no \"time observable\"... but you can, after all, state it rather nicely:</p>\n<ul>\n<li>John Baez, <a href=\"https://math.ucr.edu/home/baez/uncertainty.html\">The time-energy uncertainty relation</a>.</li>\n</ul>",
        "id": 262620090,
        "sender_full_name": "John Baez",
        "timestamp": 1637775825
    },
    {
        "content": "<p>But this is not about entropy...</p>",
        "id": 262620115,
        "sender_full_name": "John Baez",
        "timestamp": 1637775838
    },
    {
        "content": "<p>(warning: I don't know what I'm talking about) In relativistic quantum mechanics, position is still an operator, correct? Given that we don't have a strong distinction between space and time in the relativistic setting, why is position an operator and not time?</p>",
        "id": 262642956,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1637789782
    },
    {
        "content": "<p>I should have read the whole post before saying that!</p>",
        "id": 262643059,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1637789871
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280755\">Owen Lynch</span> <a href=\"#narrow/stream/306433-practice.3A-thermodynamics/topic/limitations.20of.20thermodynamics/near/262642956\">said</a>:</p>\n<blockquote>\n<p>(warning: I don't know what I'm talking about) In relativistic quantum mechanics, position is still an operator, correct? Given that we don't have a strong distinction between space and time in the relativistic setting, why is position an operator and not time?</p>\n</blockquote>\n<p>I think the post explains why there can't be a time operator if energy is bounded below.</p>\n<p>There's a kind of position operator in the relativistic quantum mechanics of a single particle, but it behaves a bit funny.  Very soon, when you do relativistic quantum mechanics, you start wanting to switch to quantum field theory, which has no position operator (or at least not a good enough one to bother with).</p>",
        "id": 262649039,
        "sender_full_name": "John Baez",
        "timestamp": 1637794415
    },
    {
        "content": "<p>I can be more specific: instead of just saying \"it behaves a bit funny\", it would be better here to focus on this: </p>\n<p>There's a position operator, but it doesn't transform the way you'd expect, or any nice way at all, under Lorentz transformations!   </p>\n<p>So, you can't cleverly use the position operator and Lorentz transformations to cook up some \"time operator\".</p>",
        "id": 262652713,
        "sender_full_name": "John Baez",
        "timestamp": 1637798021
    },
    {
        "content": "<p>(In plain old special relativity, if you know the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi></mrow><annotation encoding=\"application/x-tex\">x</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">x</span></span></span></span> coordinate of a spacetime point in enough different inertial frames (= inertial coordinate systems), you can figure out its <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">t</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6151em;\"></span><span class=\"mord mathnormal\">t</span></span></span></span> coordinate, using the formula for Lorentz transformations.  But that trick <em>doesn't work</em> for the rather crappy position operator in relativistic quantum mechanics!</p>",
        "id": 262652874,
        "sender_full_name": "John Baez",
        "timestamp": 1637798194
    }
]