[
    {
        "content": "<p>The University of Strathclyde is hiring for a <strong>Strathclyde Chancellor’s Fellow in Mathematically Structured Programming</strong>. This is a permanent academic position with reduced teaching load and limited administrative duties over the initial years for you to build a research portfolio.</p>\n<ul>\n<li>Location: Glasgow, UK</li>\n<li>Salary: £41,421 to £56,921</li>\n<li>Hours: Full Time </li>\n<li>Contract Type: Permanent </li>\n<li>Closes: 5th January 2025</li>\n</ul>\n<p>More details, and to apply: <a href=\"https://www.jobs.ac.uk/job/DKR108/strathclyde-chancellors-fellow-in-mathematically-structured-programming\">https://www.jobs.ac.uk/job/DKR108/strathclyde-chancellors-fellow-in-mathematically-structured-programming</a></p>\n<div class=\"spoiler-block\"><div class=\"spoiler-header\">\n<p>More details and specification...</p>\n</div><div class=\"spoiler-content\" aria-hidden=\"true\">\n<p>The Department of Computer and Information Sciences (CIS) seeks to appoint a Chancellors Fellow in Mathematically Structured Programming. We welcome applications from candidates with expertise in a range of topics in the mathematical foundations of computer sciences and applications, such as:<br>\n* Logic, including modal and temporal logic, model checking, and proof theory;<br>\n* Category theory, including categorical semantics, and applied category theory;<br>\n* Type theory and functional programming, including semantics, metatheory, and implementation;<br>\n* Formal and mechanised mathematics, including certified programming and the use and implementation of proof assistants.</p>\n<p>You will join the vibrant <a href=\"https://msp.cis.strath.ac.uk/\">Mathematically Structured Programming</a> group, which is internationally renowned for its research in the mathematical foundations of programming languages. We see the mathematical foundations of computation and programming as inextricably linked, and study one so as to develop the other. This reflects the symbiotic relationship between mathematics, logic, and programming — any attempt to sever this connection will diminish each component. We have a strong partnership with the <a href=\"https://spli.scot/\">Scottish Programming Languages Institute</a>, and our work finds impact through our productive links with industry.</p>\n<p>As a highly motivated scholar, you will contribute to the research, teaching, and administrative activities of the group and the wider department. We expect you to have ambitious academic goals, and an understanding of how to bring in the grant income required to fund those goals.</p>\n<p>The University of Strathclyde is a socially progressive institution that strives to ensure equality of opportunity and celebrates the diversity of its student and staff community. Strathclyde is people-oriented and collaborative, offering a supportive and flexible working culture with a deep commitment to our <a href=\"https://www.strath.ac.uk/workwithus/strathclydeglobaltalentprogramme/workforcediversityandinclusion/\">equality, diversity and inclusion charters, initiatives, groups and networks</a>.</p>\n<p>We strongly encourage applications from Black, Asian and minority ethnicity, women, LGBT+, and disabled candidates and candidates from lower socio-economic groups and care-experienced backgrounds.</p>\n<p>You’ll be rewarded with:<br>\n* Growth of your research portfolio<br>\n* Reduced teaching load and limited administrative duties over the initial years of your Fellowship<br>\n* Support through our academic career development framework to gain feedback on your performance, meet your training needs and enhance your effectiveness – allowing you to be ready for promotion within 5-years of your appointment<br>\n* Mentoring, to help you establish a balance of research, teaching, knowledge exchange and citizenship responsibilities while enhancing your leadership qualities to support your long-term career.<br>\n** Your Fellowship will normally be at lecturer level (exceptionally, at senior lecturer (Grade 9) (£58,596 - £65,814) where you have a strong track record in research leadership) for 5 years, with the expectation that you’ll meet our promotion criteria within that period and be transferred to senior lecturer (or, where you’ve been appointed as a senior lecturer, Reader) level.*</p>\n</div></div>",
        "id": 483722749,
        "sender_full_name": "Bob Atkey",
        "timestamp": 1732202328
    }
]