[
    {
        "content": "<p>I have two PhD studentships (<strong> huge caveat follows </strong>) in the Mathematically Structured Programming group at Strathclyde</p>\n<p>(Caveat: The positions are fully-funded for UK citizens. For EU citizens, we are trying to obtain scholarships, but the safe bet is that it is not fully-funded. Anybody is welcome to apply, but if you are not a UK citizen you will probably need a secondary source of funding. We live in unfortunate times.)</p>\n<p>Position 1: Is for a fixed project jointly with the National Physical Laboratory, to do with category-theoretic techniques for Bayesian inference and estimation in complex systems. Some programming experience is preferred for this project.</p>\n<p>Position 2: Has no fixed project attached, feel free to propose a research project roughly within my interests of applied category theory + economics, machine learning and optimisation/control, or to discuss with me. (See <a href=\"https://julesh.com/\">https://julesh.com/</a> for details.)</p>\n<p>To apply, email a CV plus any another documents to me at <a href=\"mailto:jules.hedges@strath.ac.uk\">jules.hedges@strath.ac.uk</a> . If you'd like to discuss with me then you can email me, or use any other public channel you can find me on (Zulip, Twitter). I'm happy to arrange a Zoom call if you prefer that.</p>\n<p>I enthusiastically encourage anyone to apply who considers themselves part of a minority group within academia</p>\n<p>Arbitrary application deadline is January 31st 2021. Start date is flexible</p>\n<p>The MSP group at Strathclyde is an exciting group to be part of, focussing on type theory, category theory and their applications. Faculty is: Neil Ghani, Conor McBride, Glynn Winskel, Radu Mardare, Clemens Kupke, Ross Duncan, Bob Atkey, Fredrik Norvall Forsberg and me. See <a href=\"http://msp.cis.strath.ac.uk/index.html\">http://msp.cis.strath.ac.uk/index.html</a></p>",
        "id": 219962182,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1608029598
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/245502-general.3A-positions/topic/2.20PhD.20positions.20at.20University.20of.20Strathclyde.2C.20Glasgow/near/219962182\">said</a>:</p>\n<blockquote>\n<p>The positions are fully-funded for UK citizens.</p>\n</blockquote>\n<p>More specifically the important thing is whether you're eligible for \"home fees\", but that's something that's changing and nobody knows what will happen</p>",
        "id": 219968320,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1608033542
    },
    {
        "content": "<p>Update: A few hours after I posted this, the university circulated an email making the funding situation with Brexit precise, namely that they precisely have no idea and haven't decided yet. I quote: “Scholarships for PGR EU fee status students are still being considered, with further information expected early in the new year… Determining which EU students will continue to be eligible for home fees, and which will fall into the new EU fee status is very complex, and depends on aspects such as family members, residency, and settled or pre settled status, and we’re waiting on further guidance from the government on some of these elements too. So it’s worth being aware that it’s not as straight forward as that if a student is from the EU they will definitely fall into the new EU fee status from 2021-22. We won’t have a full understanding of how many EU students will come under this new fee category until much closer to the 2021 intake.”</p>\n<p>This is, of course, not very helpful for applications being made now</p>",
        "id": 220114571,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1608125281
    },
    {
        "content": "<p>I'm reopening applications for one of these positions, this time with no deadline. Updated post:</p>\n<p><a href=\"https://julesh.com/2021/04/02/phd-position-at-the-university-of-strathclyde-glasgow/\">https://julesh.com/2021/04/02/phd-position-at-the-university-of-strathclyde-glasgow/</a></p>",
        "id": 232890183,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617364228
    },
    {
        "content": "<p>Funding update: We <em>think</em> (but aren't 100% certain) that EU students will be fully funded if we can get you registered by a certain deadline in July. Therefore I encourage folks from the EU to apply, if you want to study in the Scottish Free State, if you're able to start by June (including remotely), and the earlier the better to be safe</p>",
        "id": 232890240,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1617364288
    }
]