[
    {
        "content": "<p>We are advertising a 3-year postdoc at Macquarie University to come join our category theory group and work with us on differential categories, tangent categories, and other related topics. For more details and instructions for how to apply, see the application link below. For questions, feel free to reach out to myself (<a href=\"mailto:js.lemay@mq.edu.au\">js.lemay@mq.edu.au</a>) or Richard Garner (<a href=\"mailto:richard.garner@mq.edu.au\">richard.garner@mq.edu.au</a>). </p>\n<p>Application link: <br>\n<a href=\"https://mq.wd3.myworkdayjobs.com/CareersatMQ/job/Wallumattagal-Campus-North-Ryde/Postdoctoral-Research-Fellow-or-Research-Fellow-in-Category-Theory_R000014687-1\">https://mq.wd3.myworkdayjobs.com/CareersatMQ/job/Wallumattagal-Campus-North-Ryde/Postdoctoral-Research-Fellow-or-Research-Fellow-in-Category-Theory_R000014687-1</a></p>\n<p>Application Deadline: March 17 (Sydney, Australia time)</p>",
        "id": 419409293,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1706862368
    },
    {
        "content": "<p>Since a few people have asked: you do not need prior experience with/knowledge about differential categories, tangent categories, etc. to consider applying for this position.</p>",
        "id": 420181845,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1707282019
    },
    {
        "content": "<p>Since many people have asked: the start date of \"July 2024\" on the application description is just a place holder and very flexible. Of course, we would prefer someone who starts sometime in 2024. However, we understand that there can be good reasons why a delay is necessary (like finishing another postdoc position, finishing PhD, etc.) So if you're worried about the start date, this shouldn't discourage you from applying. At this point in the application process, your potential start date won't affect your application in the eyes of the hiring committee. So feel free to contact me with questions.</p>",
        "id": 424783738,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1709606328
    }
]