[
    {
        "content": "<p>Hi, everyone! The Centre of Data Innovation Research at the University of Hertfordshire (United Kingdom) is hiring a 3-year Postdoctoral Research Fellow in Applied Category Theory. Our School has been increasingly interested in the potential of Category Theory in various fields (including mathematical physics, but also computer science and AI) and it would like to start a little ACT research group. What they are ideally looking for is someone who is happy to work with both mathematically-oriented people and data science-oriented people, and to contribute developing the new research group. I hope this sounds interesting.</p>\n<p>Link: <a href=\"https://t.co/UMfISCorFr\">jobs.herts.ac.uk/go/050295</a></p>\n<blockquote>\n<p><strong>Post Title</strong>: Post Doctoral Research Fellow<br>\n<strong>SBU/Department</strong>: School of Physics, Engineering and Computer Science</p>\n<p><strong>FTE</strong>: 1 FTE (working 37 hours per week)<br>\n<strong>Duration of Contract</strong>: Fixed Term (36 Months)<br>\n<strong>Salary</strong>: UH07 £37,099 with potential to progress to £44,263 with annual increments<br>\n<strong>Location</strong>: College Lane, Hatfield<br>\n<strong>Annual Leave</strong>: 35 days plus standard public holidays and an additional 4 days including the closure of our office between Christmas and New Year</p>\n<p><strong>Main duties and responsibilities</strong><br>\nThis is an exciting opportunity to develop and explore practical applications of Applied Category Theory (ACT) to real world challenges and to contribute to the development of the ACT research group and Centre of Data Innovation Research (CoDIR) at the University of Hertfordshire.</p>\n<p>The successful candidate will work with colleagues in the School to research and develop ACT practice, methods and applications, whilst pro-actively exploring the application of ACT techniques to real world challenges across a range of sectors, disciplines and topics.</p>\n<p>The Fellow will document and report on findings to UH colleagues and any external collaborators, maintain and document any software / code / theory developed and produce quality research outputs (e.g. peer-reviewed articles in high-impact journals).</p>\n<p>You will undertake research within the scope of the project and attend project meetings as appropriate whilst seeking external funding.</p>\n<p><strong>Closing Date</strong>: 30 November 2023</p>\n</blockquote>",
        "id": 399751026,
        "sender_full_name": "Luigi Alfonsi",
        "timestamp": 1698853375
    }
]