[
    {
        "content": "<p>Daniel Merkle &lt;<a href=\"mailto:daniel@imada.sdu.dk\">daniel@imada.sdu.dk</a>&gt; is part of a group doing wonderful things applying category theory to biochemistry.   Now they have several postdoc positions available in computer science as part of a project in “Mathematical Modelling for Microbial Community Induced Metabolic Diseases”. <strong>Applications are due January 20th!</strong></p>\n<blockquote>\n<p>I got a rather large grant last year (6 years, approx. 6.5 million Euro) together with Peter Stadler, Christoph Flamm, and Martin von Bergen. And we will apply our machinery to design microbiomes. See </p>\n<p><a href=\"https://www.sdu.dk/en/forskning/matomic/about\">https://www.sdu.dk/en/forskning/matomic/about</a> </p>\n<p>for a preliminary web-page presentation on the project “Mathematical Modelling of Health and Disease” (aka: Applied category theory and coarse-graing via rule composition).</p>\n<p>(I’m also quite excited that a quite renowned Scandinavian researcher, Jens Nielsen, recently showed that some of our modelling hypotheses could indeed be implemented in the lab - the non-oxidative glycolysis pathway.)</p>\n<p>I want to make you aware of several positions in computer science that we have available:</p>\n<p><a href=\"https://www.sdu.dk/en/service/ledige_stillinger/1180823\">https://www.sdu.dk/en/service/ledige_stillinger/1180823</a> </p>\n<p>(deadline Jan 20th, Danish positions are actually quite attractive), based on the project in mathematical modelling of the microbiome. </p>\n<p>Maybe you have someone who could be interested, who knows. I apologize to contact you directly, but your scientific contributions have influenced me so much, and for sure you might know people that might fit well. Also Christoph Flamm has positions based on the project available (in Vienna), that would be more on modelling the dynamics. Even though Jan 20th is tight, note that we have quite some flexibility.</p>\n</blockquote>",
        "id": 267473279,
        "sender_full_name": "John Baez",
        "timestamp": 1641836600
    },
    {
        "content": "<p>I'd be extremely interested if the deadline was Jan 20th 2023 or 2024 <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 267489447,
        "sender_full_name": "Chad Nester",
        "timestamp": 1641843778
    },
    {
        "content": "<p>Sorry, but they may continue their research in future years with future hires.</p>",
        "id": 267505043,
        "sender_full_name": "John Baez",
        "timestamp": 1641850929
    }
]