[
    {
        "content": "<p>I'm kinda new 'round here, so sorry if this is an awkard post.... just got my bachelor's and am poking around at master's programs in different places. I think I'm kind of drifting between math, comp, and phil, and I'm looking for a school/supervisor/program where I can get myself sorted (find a specific research area I'm interested in) and advance my category theory in general. I think I'd really love to learn categorical logic in particular, but I'm having trouble finding anywhere that is studied aside from at CMU. Any advice from cat logic places to general stuff would be super super appreciated! and in any case, here's a picture of my dog in sunglasses. <br>\n<a href=\"/user_uploads/21317/4Ho1Etj25uJlvOroO9VG1e7X/DCD5FA71-3E62-4E14-8DE5-23ED026B5EF9.JPG\">DCD5FA71-3E62-4E14-8DE5-23ED026B5EF9.JPG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/4Ho1Etj25uJlvOroO9VG1e7X/DCD5FA71-3E62-4E14-8DE5-23ED026B5EF9.JPG\" title=\"DCD5FA71-3E62-4E14-8DE5-23ED026B5EF9.JPG\"><img src=\"/user_uploads/21317/4Ho1Etj25uJlvOroO9VG1e7X/DCD5FA71-3E62-4E14-8DE5-23ED026B5EF9.JPG\"></a></div>",
        "id": 245915587,
        "sender_full_name": "Liam Chung",
        "timestamp": 1626233539
    },
    {
        "content": "<p>What is your undergraduate degree in? If you know e.g. type theory then it’s a lot easier to find a graduate program.</p>",
        "id": 245927500,
        "sender_full_name": "Chad Nester",
        "timestamp": 1626247480
    },
    {
        "content": "<p>For general category theory a few places come to mind: Dalhousie University in Canada, Macquarie University in Australia, maybe Strathclyde although be warned that it will be harder to get funding if you’re not from the UK. Our group in Tallinn is pretty good for general category theory but I have no idea how MSc programs work here...</p>",
        "id": 245927631,
        "sender_full_name": "Chad Nester",
        "timestamp": 1626247581
    },
    {
        "content": "<p>Oxford has a strong group too, but other people here can tell you more about that. There are a lot of people at universities that aren’t so well-known for category theory who would be willing to supervise you. If you like someone’s work I’d encourage you to send them an email and ask about possibilities.</p>",
        "id": 245927818,
        "sender_full_name": "Chad Nester",
        "timestamp": 1626247790
    },
    {
        "content": "<p>At the university of Oxford there is a master in \"Mathematics and foundations of computer science\", where you can pick quite some category theory and related courses.<br>\n<a href=\"https://www.maths.ox.ac.uk/members/students/postgraduate-courses/msc-mfocs\">https://www.maths.ox.ac.uk/members/students/postgraduate-courses/msc-mfocs</a></p>",
        "id": 245930473,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1626249791
    },
    {
        "content": "<p>my undergrad is joint math/comp at mcgill, and I started dabbling in philosophy towards the end. I learned a bit of type theory with Prof. Pientka there and in fact I learned a bit of Idris! Thanks for the recommendations I'll surely add them to my list and talk to some people.</p>",
        "id": 245961086,
        "sender_full_name": "Liam Chung",
        "timestamp": 1626270232
    },
    {
        "content": "<p>If you like type theory, particularly Idris, go to scotland!</p>",
        "id": 245962868,
        "sender_full_name": "Chad Nester",
        "timestamp": 1626271074
    },
    {
        "content": "<p>Part III of the Mathematical Tripos at Cambridge (which you can take as a 1-year taught masters if you come from elsewhere) has a Category Theory course, and there's a good chance there will be a topos theory one next year too.</p>",
        "id": 245996468,
        "sender_full_name": "José Siqueira",
        "timestamp": 1626285514
    },
    {
        "content": "<p>Oh? Who's teaching them?</p>",
        "id": 245996553,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1626285561
    },
    {
        "content": "<p>That isn't settled yet afaik; I think there are some negotiations going on. There will either be simply one Category Theory course taught by PTJ, or both courses (with PTJ lecturing the topos theory one).</p>",
        "id": 245997216,
        "sender_full_name": "José Siqueira",
        "timestamp": 1626285869
    },
    {
        "content": "<p>Categorical Logic is in very bad shape nowadays, as many people interested in CatLog do not have permanent positions. I am sure I will forget someone, and of course the answer to this question depends on the definition of CatLog, so please do not take this list too seriously.</p>\n<p>Brno: Rosicky and Lieberman. <br>\nComo:  Caramello. <br>\nLeeds: Nicola Gambino.<br>\nAmsterdam: Benno van den Berg.<br>\nStockholm: Peter Lumsdane.<br>\nLjubljana: Andrej Bauer.<br>\nParis: Paul André Mellies, Sam van Gool, Damiano Mazza.<br>\nNice:  Mai Gehrke.</p>\n<p>I apologize, I misread the question. I thought the OP was looking for a PhD program in CatLog. Should I remove my message? Let me know.</p>",
        "id": 246000881,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1626287630
    },
    {
        "content": "<p>still quite helpful for me to know, so it's okay, thank you! I will be going for a PhD program (hopefully) soon anyways</p>",
        "id": 246025183,
        "sender_full_name": "Liam Chung",
        "timestamp": 1626298644
    },
    {
        "content": "<p>Sorry @Ivan but there are quite a few people missing from your list and it will be worse for me to list the ones that came to mind (and forget my best friends...) than for you. but there are more than 1800 people listed in this zulip and quite a few of them do categorical logic, in some shape or form. there more than 1600 people listed in the categories mailing list (quite a few also dabble in categorical logic).  Still, getting funds to do a master's or a Ph.D. is always a struggle, I grant you that.</p>",
        "id": 246026372,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1626299396
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/245502-general.3A-positions/topic/Cat.20Theory.20in.20Master's/near/246000881\">said</a>:</p>\n<blockquote>\n<p>Categorical Logic is in very bad shape nowadays, as many people interested in CatLog do not have permanent positions. I am sure I will forget someone, and of course the answer to this question depends on the definition of CatLog, so please do not take this list too seriously.</p>\n<p>Brno: Rosicky and Lieberman. <br>\nComo:  Caramello. <br>\nLeeds: Nicola Gambino.<br>\nAmsterdam: Benno van den Berg.<br>\nStockholm: Peter Lumsdane.<br>\nLjubljana: Andrej Bauer.<br>\nParis: Paul André Mellies, Sam van Gool, Damiano Mazza.<br>\nNice:  Mai Gehrke.</p>\n<p>I apologize, I misread the question. I thought the OP was looking for a PhD program in CatLog. Should I remove my message? Let me know.</p>\n</blockquote>\n<p>I would add<br>\nPadova: Maietti<br>\nGenova: Rosolini</p>",
        "id": 246076789,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1626345478
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"327536\">@Liam Chung</span> you do know that Makkai is at McGill, right? And Joyal is at UQAM.  They are both retired, but they are still excellent resources  for CT, CatLog, etc. And there are many other top category theorists in town (and probably on this Zulip): Robert Seely, Bill Boschuck, Marta Bunge, Michael Barr, Gonzalo Reyes, ... If you are in Montreal, you could try to get in touch with some of these people and see if anyone is interested in advising you.  And if you are Canadian (or even if you're not) you should look into studying at Ottawa, Dalhousie, or Mount Allison University. Check this out for example: <a href=\"https://www.mathstat.dal.ca/~selinger/atcat/\">https://www.mathstat.dal.ca/~selinger/atcat/</a></p>",
        "id": 246330417,
        "sender_full_name": "Steve Awodey",
        "timestamp": 1626536450
    }
]