[
    {
        "content": "<p>LIPN (the CS lab at Université Sorbonne Paris Nord) is opening a <em>professeur</em> position (equivalent to Full Professor).  The position is open to the every topic within the scope of the lab but priority is given to applications with a strong background in one of the following areas:</p>\n<ul>\n<li><strong>logic and computer science</strong> (which includes category theory);</li>\n<li>machine learning;</li>\n<li>natural language processing.</li>\n</ul>\n<p>Teaching is at the CS Department.  Fluency in French is expected.</p>\n<p>Deadline for application is March 29th.</p>",
        "id": 418863956,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1706628804
    },
    {
        "content": "<p>Apart from me, there are at least two other members of the group on this Zulip: <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> and <span class=\"user-mention\" data-user-id=\"402135\">@Flavien Breuvart</span>.  Do not hesitate to contact us for additional infomation.</p>",
        "id": 418864066,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1706628839
    },
    {
        "content": "<p>For international applicants, are there any specific prerequisites to be able to apply for a professorship position?</p>",
        "id": 418873687,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1706631495
    },
    {
        "content": "<p>Excellent question,  I forgot to mention this.  In theory people applying from outside of the French system (that is, who are not maître de conférence already) need to first obtain something called <em>qualification</em>.  The deadline for that is long gone <strong>but</strong> there's a workaround: applicants can ask a \"waiver\" to the University, which is granted almost automatically unless the applicant is too young, doesn't have enough experience, etc.</p>\n<p>(The difference between <em>qualification</em> and this \"waiver\" is that, once you get it, the qualification lasts four years and is valid in all French universities, whereas the waiver is granted by a single university for a single application each time).</p>",
        "id": 418902783,
        "sender_full_name": "Damiano Mazza",
        "timestamp": 1706641658
    }
]