[
    {
        "content": "<p>Hello,</p>\n<p>I'd like to advertise a funded PhD opportunity in the CS theory group at Swansea University, to be supervised by myself. The provisional topic would be exploring connections between (linear) λ-calculi and automata theory, hopefully using semantic methods. The official adverts detailing some <em>possible</em> research directions is there <a href=\"https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-comparing-2022-rs125.php\">https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-comparing-2022-rs125.php</a> (the deadline for application is July 29th, which is relatively soon)</p>\n<p>(The connections to CT here would be mainly via the categorical semantics of linear logic. With @<strong>Nguyễn Lê Thành Dũng</strong>  we had some successes proving some results in this area by freely building up some simple categories via a bunch of free constructions and noticing that we could equip those with a smcc structure and relate this to known transducers models; see in particular <a href=\"https://nguyentito.eu/thesis.pdf\">https://nguyentito.eu/thesis.pdf</a> chapters 4&amp;6. Among other things to be done that are somewhat related to CT, we think there are similar opportunities to use semantic evaluation arguments based on the non-commutative version of the <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"sans-serif\">I</mi><mi mathvariant=\"sans-serif\">n</mi><mi mathvariant=\"sans-serif\">t</mi></mrow><annotation encoding=\"application/x-tex\">\\mathsf{Int}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\"><span class=\"mord mathsf\">Int</span></span></span></span></span> construction)</p>\n<p>(Also I feel I should plug Eike Neumann who has also a call open with the same funding scheme about reachability problems and exact real number computability with the same sort of deadline/arrangement that sounds very interesting :)<br>\n<a href=\"https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-robust-2022-rs122.php\">https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-robust-2022-rs122.php</a>)</p>\n<p>If that sounds enticing, informal enquiries are very welcome! I can be reached via email (<a href=\"mailto:c.pradic@swansea.ac.uk\">c.pradic@swansea.ac.uk</a>), or one can try PMing me here if that is easier (I should also be around at ACT in Glasgow this year).<br>\nAlso happy to discuss other project ideas I would be suited to supervise (I suppose one can get some idea of what other areas I work in by browsing through my personal webpage <a href=\"https://cs-web.swan.ac.uk/~cpradic/\">https://cs-web.swan.ac.uk/~cpradic/</a> but I mostly do logic, automata and type theory I guess), and feel free to forward to anyone who might be interested.</p>",
        "id": 289151194,
        "sender_full_name": "cpradic",
        "timestamp": 1657522594
    },
    {
        "content": "<p>Hi,<br>\nJust to let you know that the position is still open, with the \"new\" advert being here <a href=\"https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-comparing-2022-rs181.php\">https://www.swansea.ac.uk/postgraduate/scholarships/research/computer-science-epsrc-su-phd-comparing-2022-rs181.php</a> and the last possible starting date being July 1st. Once again, there are words there about some topics, but happy to discuss whatever thing I might be able to usefully supervise.<br>\nUnfortunately, I believe the dreadful UKRI quota on international applicants has long been reached, so only UK applicants are eligible now :/</p>",
        "id": 324441073,
        "sender_full_name": "cpradic",
        "timestamp": 1675001639
    }
]