[
    {
        "content": "<p>Dan Christensen wrote:</p>\n<p>As usual, we have openings for strong graduate applicants in all areas, and I in particular welcome applicants interested in higher categories, homotopy type theory and homotopy theory.  Our department has lots of people working on these topics and many visitors and seminars.  Note that the deadline of February 1 is coming soon, but that applications will continue to be reviewed after that.  Our standard ad is below.</p>\n<div class=\"codehilite\"><pre><span></span><code>                   Graduate Student Positions\n\n                   Department of Mathematics\n                 University of Western Ontario\n                    London, Ontario, Canada\n</code></pre></div>\n\n<p>The Department of Mathematics at the University of Western Ontario solicits applications for its MSc and PhD programs.  We have a large number of fully funded positions available, and applicants from any country are welcome.</p>\n<p>Our faculty members supervise research in a variety of areas:</p>\n<p><a href=\"http://www.math.uwo.ca/graduate/supervisors.html\">http://www.math.uwo.ca/graduate/supervisors.html</a></p>\n<p>The Department of Mathematics is part of the School of Mathematical Sciences:</p>\n<p><a href=\"http://uwo.ca/smss/\">http://uwo.ca/smss/</a></p>\n<p>More information about our program, including the application procedure, is available at</p>\n<p><a href=\"http://www.math.uwo.ca/graduate/\">http://www.math.uwo.ca/graduate/</a></p>\n<p>Students normally start in September, in which case applications should be complete (including letters of reference and supplementary material) by February 1.  Applications received after this deadline will be reviewed as space permits.  Early applications are welcome, and we encourage applicants to apply for external scholarships they are eligible for.</p>\n<p>Please contact <a href=\"mailto:math-grad-program@uwo.ca\">math-grad-program@uwo.ca</a> with any questions you may have.</p>",
        "id": 321977989,
        "sender_full_name": "John Baez",
        "timestamp": 1674021372
    }
]