[
    {
        "content": "<p>I randomly came across something that might interest those of you who are US citizens, and are interested in doing something outside of academia: the Pacific Northwest National Laboratory is currently hiring a bunch of data scientists and senior data scientists, and lists applied category theory under \"Preferred Skillsets\". Have a look at the website! Sorry if it's old news, but someone might want to know :)</p>",
        "id": 251787903,
        "sender_full_name": "José Siqueira",
        "timestamp": 1630617451
    },
    {
        "content": "<p>Cool.  Here are the actual ads:</p>\n<ul>\n<li>\n<p><a href=\"https://pnnl.jobs/seattle-wa/mathematical-data-scientist-2/07D2AE0D62434CD6938540CC63F9F5AD/job/\">Mathematical Data Scientist 2</a>.</p>\n</li>\n<li>\n<p><a href=\"https://pnnl.jobs/seattle-wa/senior-mathematical-data-scientist-4/65975E4F783E498AA803EA10A427015D/job/\">Senior Mathematical Data Scientist 4</a>.</p>\n</li>\n</ul>\n<blockquote>\n<p>Preferred Skillsets</p>\n<p>Demonstrated ability to contribute to the academic and research strength of PNNL and have experience writing scientific publications demonstrating their insight and discovery.</p>\n<p>Demonstrated experience in applied data science computational platforms and/or languages, for example Python environments, R, Matlab, Tableau, SQL, Maple, PyTorch.</p>\n<p>Demonstrated expertise in at least one mathematical specialty of interest. Examples include:</p>\n<ul>\n<li>\n<p>Computational topology, including persistent homology, Topological Data Analysis, or applied sheaf theory.</p>\n</li>\n<li>\n<p>Hypergraph analytics and network science.</p>\n</li>\n<li>\n<p>Applied category theory.</p>\n</li>\n<li>\n<p>Geometric data analysis.</p>\n</li>\n<li>\n<p>Closely related areas in applied discrete mathematics, topology, geometry, or algebra.</p>\n</li>\n</ul>\n</blockquote>",
        "id": 251899857,
        "sender_full_name": "John Baez",
        "timestamp": 1630683550
    },
    {
        "content": "<p>Pretty cool to see a data science job advertisement that includes phrases like \"applied category theory\" and \"applied sheaf theory.\" Hope that is the beginning of a trend!</p>",
        "id": 251927751,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1630695787
    },
    {
        "content": "<p>These positions would probably be working with <a href=\"https://www.pnnl.gov/science/staff/staff_info.asp?staff_num=8847\">Cliff Joslyn</a> and/or <a href=\"https://www.pnnl.gov/science/staff/staff_info.asp?staff_num=7694\">Emilie Purvine</a>, if anyone wants to look at some related research.</p>",
        "id": 251931910,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1630697910
    },
    {
        "content": "<p>Thanks Spencer, I was wondering who was responsible for creating those positions!</p>",
        "id": 251933776,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1630698913
    },
    {
        "content": "<p>Thanks, Spencer!  I didn't think our charm had reached the point where people <em>we don't know</em> ask for applied category theory expertise.</p>",
        "id": 251934697,
        "sender_full_name": "John Baez",
        "timestamp": 1630699348
    }
]