[
    {
        "content": "<p>The Math Department at Western University has openings for strong <strong>graduate applicants</strong> in all areas, and I in particular welcome applicants interested in homotopy type theory, homotopy theory and higher categories.  Our department has lots of people working on these topics and many visitors and seminars.</p>\n<p>Note that the deadline of <strong>February 1</strong> is coming soon, but that applications will continue to be reviewed after that.  Our standard ad is below.</p>\n<hr>\n<p>Please distribute to undergraduate and master's students and appropriate counsellors and supervisors.</p>\n<p><strong>Graduate Student Positions</strong></p>\n<p><strong>Department of Mathematics, University of Western Ontario, London, Ontario, Canada</strong></p>\n<p>The Department of Mathematics at the University of Western Ontario solicits applications for its MSc and PhD programs.  We have a large number of fully funded positions available, and applicants from any country are welcome.</p>\n<p>Our faculty members supervise research in a variety of areas:</p>\n<p><a href=\"https://www.math.uwo.ca/graduate/supervisors.html\">https://www.math.uwo.ca/graduate/supervisors.html</a><br>\n<a href=\"https://www.math.uwo.ca/research/\">https://www.math.uwo.ca/research/</a></p>\n<p>The Department of Mathematics is part of the School of Mathematical Sciences:</p>\n<p><a href=\"https://uwo.ca/smss/\">https://uwo.ca/smss/</a></p>\n<p>More information about our program, including the application procedure, is available at</p>\n<p><a href=\"https://www.math.uwo.ca/graduate/\">https://www.math.uwo.ca/graduate/</a></p>\n<p>Students normally start in September, in which case applications should be complete (including letters of reference and supplementary material) by <strong>February 1</strong>.  Applications received after this deadline will be reviewed as space permits.  Early applications are welcome, and we encourage applicants to apply for external scholarships they are eligible for.</p>\n<p>Please contact <a href=\"mailto:math-grad-program@uwo.ca\">math-grad-program@uwo.ca</a> with any questions you may have.</p>",
        "id": 412404710,
        "sender_full_name": "Dan Christensen",
        "timestamp": 1705000267
    }
]