[
    {
        "content": "<p>The Applied Category Theory group at NIST (US National Institute of Standards and Technology) would like to encourage applications for the National Research Council's <a href=\"https://sites.nationalacademies.org/PGA/RAP/index.htm\">Research Associates Program (NRC RAP)</a>. </p>\n<p>Applications are due Feb. 1, to begin in the second half of 2025. Program information like eligibility, stipend, application instructions and FAQ can be found at the RAP website. Unfortunately, these positions are only open to US citizens.</p>\n<p>Our group is currently advertising three post-doctoral opportunities: </p>\n<ul>\n<li><a href=\"https://ra.nas.edu/RAPLab10/Opportunity/opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=C0391\">Generating Ontologies from Domain Corpora using Artificial Intelligence Techniques</a></li>\n<li><a href=\"https://ra.nas.edu/RAPLab10/Opportunity/opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7916\">Mathematical Foundations for System Interoperability</a></li>\n<li><a href=\"https://ra.nas.edu/RAPLab10/Opportunity/opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7529\">Research in Cyber-Physical Systems</a></li>\n</ul>\n<p>NRC applicants are encouraged to contact target institutions well before the application deadline. If you are interested, first read through the general application instructions and the specific research opportunities linked above. Then write up a 1-2 page sketch of potential research directions and send it to me at <a href=\"mailto:spencer.breiner@nist.gov\">spencer.breiner@nist.gov</a>.</p>\n<p>Feel free to post here or DM me with any questions.</p>",
        "id": 487259217,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1733839866
    },
    {
        "content": "<p>I also wanted to encourage students and advisors that are looking for positions to poke around the <a href=\"https://ra.nas.edu/RAPLab10/Opportunity/programs.aspx\">NRC database</a>. The <a href=\"https://ra.nas.edu/RAPLab10/Opportunity/search.aspx?SrchParams=SrchCtznLevel%3dC_01%26SrchLevel%3dLvl_*%252cLvl_R%252cLvl_S%26SrchKeywords%3dalgebraic%2btopology%26SrchAdvName%3d%26SrchPrograms%3d%26SrchLocations%3d&amp;R=True\">native search</a> only looks at keywords, but you can use a <a href=\"https://www.google.com/search?q=algebraic+topology+site%3Ara.nas.edu\">domain-limited google search</a> to scan the text as well. I think the RAP is not very well-known, hence a bit under-subscribed, at least relative to the absurd numbers coming in for academic positions.</p>",
        "id": 487265334,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1733841506
    }
]