[
    {
        "content": "<p>The Applied Category Theory group at NIST (US National Institute of Standards and Technology) would like to encourage applications for the National Research Council's <a href=\"https://sites.nationalacademies.org/PGA/RAP/index.htm\">Research Associates Program (NRC RAP)</a>. Applications are due August 1, to begin in the first half of 2023.</p>\n<p>Our group is currently advertising two post-doctoral opportunities focused on <a href=\"https://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7916\">Mathematical Foundations for System Interoperability</a> and <a href=\"https://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7529\">Research in Cyber-Physical Systems</a>. Program information like eligibility, stipend, application instructions and FAQ can be found at the RAP website. Unfortunately, these positions are only open to US citizens.</p>\n<p>NRC applicants are encouraged to contact target institutions well before the application deadline. If you are interested, first read through the general application instructions and the specific research opportunities linked above. Then write up a 1-2 page sketch of potential research directions and send it to me at <a href=\"mailto:spencer.breiner@nist.gov\">spencer.breiner@nist.gov</a>.</p>\n<p>Feel free to post here or DM me with any questions.</p>",
        "id": 286349166,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1655384623
    },
    {
        "content": "<p>I just want to say that I applied to NRC last year when I was looking for postdocs and it was the most honest, transparent process our of all the rest. I ended up doing something else merely because I wanted to leave that area of the US. I definitely encourage people to apply and speak with Spencer.</p>",
        "id": 286353567,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1655386698
    },
    {
        "content": "<p>Anybody interested could also reach out to me, as I’m currently an NRC postdoc at NIST in Spencer and Sub’s group.</p>",
        "id": 286366335,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1655391961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278008\">@Spencer Breiner</span>, looks like both the links to your group's opportunities are currently down for maintenance (as is the link to the participating agencies list on the NRC RAP page).  What I was able to access indicates some of the NRC RAP opportunities may only be open to postdocs who are within 5 years of receiving their Ph.D.s - is that the case for your group's two opportunities?</p>",
        "id": 286388692,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1655401759
    },
    {
        "content": "<p>Hi Jason! Thanks for your questions.</p>\n<p>I am also getting \"down for maintenance\" for the opportunities links. They worked this morning, so hopefully they will be back online soon.</p>\n<p>You are correct that both of the calls listed here are for post-doc positions that must be within 5 years of receiving a PhD. That and other eligibility criteria are listed <a href=\"https://sites.nationalacademies.org/PGA/RAP/PGA_169892\">here</a>.</p>",
        "id": 286400733,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1655407253
    },
    {
        "content": "<p>Hi all. I just wanted to let everyone know that the two post-doc opportunities I posted about last week are back on line. You can find them here:<br>\n<a href=\"https://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7916\">Mathematical Foundations for System Interoperability</a><br>\n<a href=\"https://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7529\">Research in Cyber-Physical Systems</a>.</p>",
        "id": 286918558,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1655820471
    }
]