[
    {
        "content": "<p>Dear all, the mathematics department at the <strong>University of Sāo Paulo</strong> (USP) is recruiting <strong>professors in <em>foundations</em> </strong>. </p>\n<p>The University of Sāo Paulo is one of the top universities worldwide located in the fourth biggest city on the planet. </p>\n<p>The application process in Brasil is through a \"concurso\". This is a slightly more complicated process than a mere interview, but it comes with the benefit that, once contracted as a professor, the position is tenured (meaning: for life). The concurso consists in an interview, a teaching evaluation and a written exam. If you are interested, get in touch with me or Hugo Mariano or any other faculty member here at USP.  The <a href=\"https://www.ime.usp.br/concursos/\">application details</a> can be found in the \"edital\" below. </p>\n<p><a href=\"/user_uploads/21317/pHEW2jYbl8aQvZf_jyrssEU1/Edital_048_Doutor_Fundamentos.pdf\">Edital_048_Doutor_Fundamentos.pdf</a></p>\n<p>We look forward to welcoming new colleagues here, so do get in touch. </p>\n<p>Ben</p>\n<p>(P.S. category theory enthusiasts may also know that Grothendieck did his postdoc here, so be like him, join USP <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>) </p>\n<p>Message in Portuguese from Joelma Martins: </p>\n<hr>\n<p>Bom dia.</p>\n<p>A pedido do Prof. David Pires Dias, Chefe do Departamento de Matemática, solicitamos aos professores e alunos de pós-graduação, que avisem entre seus contatos e possíveis interessados, sobre o concurso para Professor Doutor junto ao Departamento de Matemática do IME-USP, na área de conhecimento \"Fundamentos\", com as inscrições abertas de 12/09 a 10/11/2025.</p>\n<p>Segue o edital do referido concurso, que foi divulgado na página de concursos do IME, na aba Professor Doutor:  <a href=\"https://www.ime.usp.br/concursos/\">https://www.ime.usp.br/concursos/</a></p>\n<p>Agradecemos sua atenção.<br>\n<strong>Joelma Martins</strong></p>\n<p>Secretária do Departamento de Matemática</p>\n<p>Instituto de Matemática, Estatística e Ciência da Computação - USP</p>\n<p>Fone: 3091.6193</p>",
        "id": 541255350,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1758726918
    },
    {
        "content": "<p>Ben, do you know Portuguese yet? What are the language requirements/desiderata?</p>",
        "id": 541296373,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1758737378
    },
    {
        "content": "<p>Hi Kevin. There are no language desiderata: you can do the concurso in English too (it's something you'd have to specify in the application, though). That's how I did mine. Also, once hired, you can give classes in English. </p>\n<p>Faculty and students all speak English, so there should not be any language barriers there. Given it's a permanent position, eventually people will expect you to interact in Portuguese, but there's no rush. However, since most people don't speak English in Brasil, so you'd probably want to learn it in the long run anyway. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 541735976,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1758916262
    },
    {
        "content": "<p>Dear all, there are two more openings for permanent positions at USP; this time in the computer science department. One is in programming languages and the other is in data engineering. The department is CT friendly and my experience has been that there is plenty of category theory floating around the halls of the university. I've attached two PDFs with the job details (translated into english). Let me know if you have any questions! </p>\n<p><a href=\"/user_uploads/21317/uXIVrvYgiTTmM666E0MPUzKs/DataEngineering.pdf\">DataEngineering.pdf</a><br>\n<a href=\"/user_uploads/21317/K32shLfJdrOpZD0Vuwq0yUed/PRogrammingLanguages.pdf\">PRogrammingLanguages.pdf</a></p>",
        "id": 543368697,
        "sender_full_name": "Benjamin Merlin Bumpus (he/him)",
        "timestamp": 1759770160
    }
]