[
    {
        "content": "<p>In the near future, the University of Strathclyde will announce a call for</p>\n<blockquote>\n<p><strong><em>five-year research positions leading to permanent appointments</em></strong>.</p>\n</blockquote>\n<p>The Mathematically Structured Programming group in the Department of Computer and Information Sciences welcomes applications from category theorists, and would be happy to help you develop an application. Please contact Neil Ghani &lt;<a href=\"mailto:neil.ghani@strath.ac.uk\">neil.ghani@strath.ac.uk</a>&gt; if you are interested, or of course me or anyone else from the group if you have questions.</p>\n<p><strong>The MSP group</strong></p>\n<p>The MSP group's vision is to use mathematics to understand the nature of computation, and to then turn that understanding into  into the next generation of programming languages. We use ideas from category theory, type theory, and logic to do so. The group consists of Dr Robert Atkey, Dr Ross Duncan, Professor Neil Ghani, Dr Jules Hedges, Dr Clemens Kupke, Dr Jérémy Ledent, Professor Radu Mardare, Dr Conor McBride, Dr Fredrik Nordvall Forsberg, Professor Glynn Winskel, and our PhD students.</p>\n<p>For more information, please see our <a href=\"http://msp.cis.strath.ac.uk\">group website</a>, and our individual websites linked from there.</p>\n<p><strong>Glasgow and Scotland</strong></p>\n<p>The University of Strathclyde is located in the heart of Glasgow, which the <a href=\"https://www.lonelyplanet.com/scotland/glasgow/\">Lonely Planet Travel Guides</a> hail as \"one of Britain's most intriguing metropolises\". It is less than an hour away by car or public transport from the <a href=\"https://www.walkhighlands.co.uk/\">Scottish Highlands</a>. Southern Scotland provides a particularly stimulating environment for researchers in theoretical computer science, with active groups in this area at Heriot-Watt University, the University of Edinburgh, the University of Glasgow, the University of St. Andrews, and the University of Strathclyde.</p>",
        "id": 203129771,
        "sender_full_name": "Fredrik Nordvall Forsberg",
        "timestamp": 1594140983
    }
]