[
    {
        "content": "<p>I am looking for a PhD student to work with me on a project at the intersection of</p>\n<ul>\n<li>type theory,</li>\n<li>combinatorial topology,</li>\n<li>higher category theory,</li>\n<li>rewriting theory;<br>\na background in one or more of these areas is a bonus, but a strong foundation in mathematics and/or theoretical computer science will do.</li>\n</ul>\n<p>Starting date is as soon as possible; you need to have a Master's degree by the start of your PhD (but are invited to apply even if you have not completed the requirements yet).<br>\nThe expected PhD study time at TalTech is 4 years. A PhD is a salaried position and is topped with an additional tax-free stipend from the department, which ensures a good living standard in Estonia.</p>\n<p>There is a vibrant, ever-growing community of category theorists, type theorists, and theoretical computer scientists at TalTech.<br>\nThe PhD candidate would join the Compositionality group, which besides me, currently includes Pawel Sobocinski, Fosco Loregian, Priyaa Varshinee Srinivasan, Alessandro Di Giorgio, Callum Reader, Diana Kessler, Eigil Rischel, and a multitude of PhD students.<br>\nWe also work closely together with the Logic and Semantics group, which consists of Tarmo Uustalu, Niccolò Veltri, Nathanael Arkor, Bryce Clarke, Hellis Tamm, Hendrik Maarand, Silvio Capobianco, and various students.</p>\n<p>Tallinn is a beautiful city on the Baltic coast, just opposite Helsinki, which can be reached with a 2hr ferry ride. The TalTech campus is interspersed with forested areas, which cover a large part of the country, contributing to the 2nd best air quality in Europe after its neighbour Finland.<br>\nWith generous paid parental leave (up to 18 months) and a chart-topping education system, Estonia is a great place for families. In 2024, it became the first country formerly in the Eastern bloc to legalise same-sex marriage. <br>\nCandidates from all backgrounds and with all identities are encouraged to apply.</p>\n<p>Please write to me either here or via email (<a href=\"mailto:amar.hadzihasanovic@taltech.ee\">amar.hadzihasanovic@taltech.ee</a>) if you want to discuss this further. A formal application is not required at this stage; a CV and expression of interest will suffice.<br>\nYou are also encouraged to contact former or current PhD students in our group about their experience.</p>",
        "id": 527425194,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1751876782
    },
    {
        "content": "<p>There was an M2 course track with a lot of rewriting and higher category at ENS de Lyon this year. See <a href=\"http://mathematiques.ens-lyon.fr/medias/fichier/algebra-formalisation_1702642869328-pdf?ID_FICHE=230253\">the program here</a>. You should try to contact Stéphane Gaussent to ask whether he can advertise your position. (Unfortunately, I think that most ENS students will have one year of internships between their M2 and their PhDs.)</p>",
        "id": 527428490,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1751877824
    },
    {
        "content": "<p>Thanks! I have never met Stéphane but I know many of the other people involved.</p>",
        "id": 527429444,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1751878115
    }
]