[
    {
        "content": "<hr>\n<p>*** PhD Position<br>\n*** Coalgebraic Logics for Quantitative Verification <br>\n*** Mathematically Structured Programming Group<br>\n*** University of Strathclyde (Glasgow)</p>\n<hr>\n<p>Applications are invited for a fully funded (please see caveat below) PhD studentship in the area of coalgebraic logics &amp; model-checking under my supervision. The goals of the project are to work on a new mathematical framework for quantitative logics and, based on this, to create model-checking tools for verification. The research will be part of the Leverhulme project \"COVER: Coalgebraic Foundations of Quantitative Verification\" in collaboration with the University of<br>\nSouthampton and funds 2 postdoctoral researchers. This means that the new student will be embedded in an active research team with closely aligned goals.</p>\n<p>The successful applicant will have either at least a 2:1 degree or an MSc in Mathematics or Computer Science or a related subject with a strong Mathematics or Computer Science component. Ideally, they will also have a strong, documented interest in doing research. Strong mathematical background and problem-solving skills are essential.</p>\n<p>Anyone interested should contact me here or at \"clemens.kupke at <a href=\"http://strath.ac.uk\">strath.ac.uk</a>\" and outline their academic background. <br>\n===============================================<br>\n*) Caveat: For UK citizens these positions are fully-funded. For<br>\nstudents from other European countries the situation is currently not<br>\n100% clear and will have to be clarified on a case-by-case basis. <br>\nOversees fees for students from further afield are generally not covered.</p>",
        "id": 227110241,
        "sender_full_name": "Clemens Kupke",
        "timestamp": 1613847218
    },
    {
        "content": "<p>Clemens, is there a static version of this I can share? If not, can I share a screenshot of this?</p>",
        "id": 227115830,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613852778
    },
    {
        "content": "<p>Hi Jules, sadly no static version - feel free to share! It was emailed around on the categories mailing list a while ago - I could send you the email version if that's easier?</p>",
        "id": 227116945,
        "sender_full_name": "Clemens Kupke",
        "timestamp": 1613854056
    },
    {
        "content": "<p>It's ok, I'll screenshot this</p>",
        "id": 227117236,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613854416
    },
    {
        "content": "<p>Yeah, I've never been on the categories mailing list...</p>",
        "id": 227117238,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1613854425
    }
]