[
    {
        "content": "<p>A PhD position in a recently granted DFG-project \"Abstract Techniques for Programming Languages and Secure Compilation\" has just opened in the Theoretical Computer Science group (<a href=\"https://www8.cs.fau.de\">https://www8.cs.fau.de</a>) at the Friedrich-Alexander-Universität Erlangen-Nürnberg.</p>\n<p>The project builds on recent advances in Higher-Order Mathematical Operational Semantics [1,2], a pivotal generalization of Turi and Plotkin's seminal approach to structural operational semantics. We seek an apt and motivated PhD candidate, who will contribute to the development of the theory and to applications in the area of secure compilation. Further details on the planned research are summarized in the technical part of the project proposal, which can be provided by request.</p>\n<p>The position is allocated for 3 years; the starting date is Nov. 1, or later, preferably not later than Feb. 1, 2024.</p>\n<p>The project is supervised by <span class=\"user-mention\" data-user-id=\"275900\">@Stelios Tsampas</span>  and <span class=\"user-mention\" data-user-id=\"585426\">@Sergey Goncharov</span> . The position is in the TV-L E13 pay scale.</p>\n<p>Please inquire or apply by e-mail to</p>\n<div class=\"codehilite\"><pre><span></span><code>  {stelios.tsampas,sergey.goncharov}@fau.de\n</code></pre></div>\n\n<p>When applying, please, enclose your CV and the degree transcript in your application.</p>\n<p>We are interested in filling in the position as soon as possible, and will thus consider applications as they arrive.</p>\n<p>Best,</p>\n<p>Stelios and Sergey</p>\n<p>[1] Sergey Goncharov, Stefan Milius, Lutz Schröder, Stelios Tsampas, Henning Urbat, Towards a Higher-Order Mathematical Operational Semantics, POPL 2022</p>\n<p>[2] Henning Urbat, Stelios Tsampas, Sergey Goncharov, Stefan Milius, Lutz Schröder, Weak Similarity in Higher-Order Mathematical Operational Semantics, LICS 2023</p>",
        "id": 384090126,
        "sender_full_name": "Sergey Goncharov",
        "timestamp": 1691786938
    },
    {
        "content": "<p>The topic lies in the intersection of the semantics/type theory side of theoretical computer science and category theory.</p>\n<p>Also note that the (full) TV-L E13 scale, which is the scale I'm also paid at, is imho very competitive and comparable to engineering salaries in major firms here in Germany.</p>",
        "id": 384198219,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1691831457
    }
]