[
    {
        "content": "<p>The Logic and Semantics Group at the Department of Software Science of<br>\nthe Tallinn University of Technology (<a href=\"https://www.taltech.ee/\">https://www.taltech.ee/</a>)<br>\nconducts research into type theory, proof theory, category theory,<br>\nlanguages and automata, semantics of programming languages,<br>\nformalization of mathematics and programming theory.</p>\n<p>Detailed information about our profile, incl. our publications, is<br>\navailable from our webpage:</p>\n<p><a href=\"https://cs.ioc.ee/lsg/\">https://cs.ioc.ee/lsg/</a></p>\n<p>We are currently seeking strong and motivated candidates for one or<br>\ntwo PhD positions in one of the following research areas:</p>\n<ul>\n<li>\n<p>type theory and formalization of mathematics (Niccolò Veltri)</p>\n</li>\n<li>\n<p>categorical proof theory (Niccolò Veltri, Tarmo Uustalu)</p>\n</li>\n<li>\n<p>languages and automata (Hellis Tamm, Hendrik Maarand)</p>\n</li>\n<li>\n<p>categorical program semantics (Tarmo Uustalu)</p>\n</li>\n<li>\n<p>cellular automata (Silvio Capobianco)</p>\n</li>\n</ul>\n<p>We are happy to discuss potential PhD topics in all of these areas.</p>\n<p>The nominal PhD study time at TUT is 4 years. PhD studentships are<br>\nsalaried positions. At this moment, we pay PhD students a taxable<br>\ngross salary of 1828 EUR/month (~1450 EUR/month after taxes), topped<br>\nup with a tax-free stipend of 500 EUR/month. This ensures a good<br>\nliving standard in Estonia for this career stage and includes<br>\ninsurance by the national health system.</p>\n<p>The expected start time is summer or autumn 2024.</p>\n<p>To apply, please send a motivation letter together with your CV and<br>\ncopies of your diploma(s) and transcripts to Tarmo Uustalu, <br>\nfirstname at cs . ioc . ee (the lab head) and the prospective supervisor(s)<br>\nsoonest, latest by 7 April 2024. We will consider applications as they<br>\narrive. There is also a subsequent formal admission process.</p>",
        "id": 426721842,
        "sender_full_name": "Tarmo Uustalu",
        "timestamp": 1710501327
    }
]