[
    {
        "content": "<p>Dear all,</p>\n<p>I have two PhD and two postdoc positions available. The default starting date would be Oct 2025 (as they are funded through an ERC project on type theory starting in fall 2025), but earlier/later starts may be possible. If you are looking for a position, please get in touch. </p>\n<p><strong>PhD positions</strong>:</p>\n<p>If you are looking for a PhD position, please let me know your interest by email, ideally before <strong>December 15</strong>. I will review applications on a rolling basis. You can check out my website (link below) to see the areas I am working in, but in general, I'm happy to advise on projects in areas such as:</p>\n<ul>\n<li>Homotopy type theory in general</li>\n<li>Higher categories</li>\n<li>Two-level type theory</li>\n<li>Type theories with shapes, such as simplicial type theory</li>\n<li>Conservativity questions</li>\n<li>Constructive ordinal numbers</li>\n</ul>\n<p>The PhD positions are for (at least) 3.5 years, include all tuition fees, and come with a stipend at the UKRI standard (currently approx. £19,200 net annually, increases with inflation). You will not be obliged to teach but there will be opportunities to do so, paid on top of the stipend. A generous budget for travel (conference attendance, research visits, etc) is available. The place of work is Nottingham, where we have a vibrant culture of regular seminars and meetings. Current members of our group can be found on our group website: <a href=\"https://www.nottingham.ac.uk/research/groups/fp-lab/\">https://www.nottingham.ac.uk/research/groups/fp-lab/</a></p>\n<p><strong>Postdoc positions</strong>:</p>\n<p>I will advertise the postdoc positions again closer to the date and the official application portal is not yet open. However, feel free to contact me at any time for questions/discussions.</p>\n<p>Best wishes,<br>\nNicolai<br>\n<a href=\"mailto:nicolai.kraus@nottingham.ac.uk\">nicolai.kraus@nottingham.ac.uk</a></p>\n<p><a href=\"https://www.cs.nott.ac.uk/~psznk/\">https://www.cs.nott.ac.uk/~psznk/</a></p>",
        "id": 482662770,
        "sender_full_name": "Nicolai Kraus",
        "timestamp": 1731692300
    }
]