[
    {
        "content": "<p>The Department of Mathematics and Computer Science at the University of Southern Denmark (SDU), Odense, invites applications for a fully funded PhD position in the foundations of programming languages. The positions have a duration of 3 years for candidates who have completed a relevant MSc degree, or 4 years for candidates who have completed 1 year of relevant MSc studies. The hired candidates will be part of the section of Artificial Intelligence, Cybersecurity, and Programming Languages (ACP), an active, dynamic research group that combines bold research and a collaborative spirit.</p>\n<p>The proposed starting time is August or September 2025. The appointment will be made at a competitive salary and will follow the PhD study programme at the Faculty of Science.</p>\n<p><strong>Application deadline: 18 June 2025 at 23:59 hours local Danish time</strong></p>\n<p>The position is funded by the German Research Foundation (DFG), project “Abstract Techniques for Programming Languages and Secure Compilation”. The project builds on recent advances in Higher-Order Mathematical Operational Semantics, a pivotal generalization of Turi and Plotkin's seminal approach to structural operational semantics. We seek an apt and motivated PhD candidate, who will contribute to the development and implementation of the theory, and to applications in secure compilation. Further details on the planned research are summarized in the technical part of the project proposal, which can be provided by request.</p>\n<p>The Department of Mathematics and Computer Science is an inclusive and international working environment with state-of-the-art facilities and strong traditions for collaboration across sections, departments, and faculties, and with other educational institutions, municipalities, and industries. The degrees offered by the department include BSc, MSc, and PhD degrees in computer science, a BSc in artificial intelligence, and an MSc degree in data science.</p>\n<p>The project is supervised by myself and Marco Peressotti (<a href=\"mailto:peressotti@sdu.dk\">peressotti@sdu.dk</a>). For any inquiries, you can drop me an email at <a href=\"mailto:stelios@imada.sdu.dk\">stelios@imada.sdu.dk</a> or send me a message.</p>\n<p><strong>Click</strong> <a href=\"https://fa-eosd-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/2894?lastSelectedFacet=CATEGORIES&amp;selectedCategoriesFacet=300000002425892\">here</a> <strong>to apply.</strong></p>",
        "id": 519823291,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1747917248
    }
]