[
    {
        "content": "<p>The Compositional Systems and Methods group at the Tallinn University of Technology, Estonia (<a href=\"https://compose.ioc.ee\">https://compose.ioc.ee</a>) is seeking highly qualified PhD candidates.</p>\n<p>The ideal student should have a solid grounding in category theory, and in at least one of the following areas: programming languages, concurrency theory, quantum computing, database and information systems, or machine learning.</p>\n<p>The group’s lingua franca is category theory and our research concerns mathematical foundations, as well as various applications in computer science and related disciplines. They are working on relational algebra and functorial semantics, open games, process languages for smart contracts, string diagrams, compositional descriptions of models of computation and concurrency, lenses and optics in functional programming, type theory, and several other topics.</p>\n<p>The group is led by Pawel Sobocinski, has two postdoctoral researchers, Edward Morehouse and Fosco Loregian, and four PhD students: Elena Di Lavore, Nathan Haydon, Chad Nester and Mario Román. One additional postdoctoral researcher will be recruited in the autumn of 2020. Our research is supported by the ESF funded Estonian IT Academy research measure.</p>\n<p>The group’s ethos emphasises openness, and inter-group collaboration is highly encouraged. We maintain an active member-led seminar series and hold regular group meetings, research retreats in the Estonian countryside, and various cross-cutting research activities.</p>\n<p>The successful students will be awarded a generous stipend and be provided with computing equipment and resources for travelling to conferences, summer schools, and other events relevant to their projects.</p>\n<p>Applicants should hold a Masters degree in Computer Science, Mathematics or a closely related field. To apply, send a CV and a motivation letter outlining your research interests to Pawel Sobocinski (<a href=\"mailto:pawel.sobocinski@taltech.ee\">pawel.sobocinski@taltech.ee</a>).</p>\n<p>APPLICATION DEADLINE: July 31, 2020<br>\nSTARTING DATE: November 2020 or as per agreement</p>\n<p>Fosco Loregian<br>\nEdward Morehouse<br>\nPawel Sobocinski</p>",
        "id": 202197848,
        "sender_full_name": "John Baez",
        "timestamp": 1593281060
    }
]