[
    {
        "content": "<p>Dear list members,</p>\n<p>I have a fully funded PhD position in the area of modelling of molecular interactions in cells at Edinburgh Napier University. The approach that is intended is aligned with category theory.</p>\n<p>The link to the advert is:<br>\nPhD Studentship in Algebraic Modelling of Molecular Interactions in Biological Cells at Edinburgh Napier University (<a href=\"http://jobs.ac.uk\">jobs.ac.uk</a>)<br>\n<a href=\"https://www.jobs.ac.uk/job/CQZ551/phd-studentship-in-algebraic-modelling-of-molecular-interactions-in-biological-cells\">https://www.jobs.ac.uk/job/CQZ551/phd-studentship-in-algebraic-modelling-of-molecular-interactions-in-biological-cells</a></p>\n<p>The application deadline is 31st July.</p>\n<p>Project summary:<br>\nThere has been active research over the last 60 years on modelling molecular interactions through various computational approaches (Maturana &amp; Varela, 1980; Rashevsky, 1969; Rosen, 1991; Ganti, 2003; Banzhaf &amp; Yamamoto, 2015). Fontana &amp; Buss (1994) proposed a lambda calculus based approach to describe molecular interactions and molecules, while the proposal of Rosen (1991) offers an approach that is similar to category theory description of living systems. The PhD thesis of Elie Adam (2017) provides a very interesting category theory based approach to describe behaviour of interacting systems, while an earlier approach to use category theory for modelling systems is provided by Goguen (1992). Lambda calculus and category theory have close links (Scott, 1982), however these have not been explored much in the context of modelling of molecular interactions, with the exception of Andras (2011), which points to the importance of this link and suggests that appropriate models of molecular interactions must be infinite at the scale of categories.</p>\n<p>The PhD project will aim to follow the approach in Andras (2011) and build on Fontana &amp; Buss (1994) and on the category theory based modelling ideas in Adam (2017) to develop a new algebraic modelling of molecular interactions in biological cells. We will develop a modelling framework for molecular interactions in general first and then we will look at more detail at molecular interactions that happen within biological cells and aim to capture the difference between systems of molecular interactions that happen within cells and those that can happen without requiring biological cells. The modelling work will include both theoretical and computational modelling, aiming to find an appropriate computational implementation framework that allows the simulation of molecular interaction systems described by the theoretical modelling approach.</p>\n<p>References<br>\nAndras, P (2011). Modelling living systems. In Proceedings of European Conference on Artificial Life – ECAL 2009, LNCS 5778, pp.706-713.<br>\nScott, DS (1982). Lectures on a Mathematical Theory of Computation, in Theoretical Foundations of Programming Methodology (eds. M. Broy, G. Schmidt), pp.145-292.<br>\nGoguen, J (1992). Sheaf semantics for concurrent interacting objects. Mathematical Structures in Computer Science, 2:159-191<br>\nAdam, AM (2017). Systems, Generativity and Interactional Effects, PhD thesis, Department of Electrical Engineering and Computer Science, MIT.<br>\nBanzhaf, W &amp; Yamamoto, L (2015). Artificial Chemistries, MIT Press.<br>\nFontana, W &amp; Buss, L (1994). The arrival of the fittest: Toward a theory of biological organization. Bulletin of Mathematical Biology, 56: 1–64.<br>\nMaturana, HR &amp; Varela, FJ (1980). Autopoiesis and Cognition. In: The Realization of the Living. D. Reidel Publishing Company, Dordrecht.<br>\nRosen, R (1991). Life Itself. Columbia University Press.<br>\nGanti, T (2003). The Principles of Life. Oxford University Press, Oxford.<br>\nRashevsky, N (1969). Outline of a unified approach to physics, biology and sociology. Bulletin of Mathematical Biophysics 31: 159–198</p>\n<p>Candidate Profile<br>\nCandidates should have a first class Honours degree or Masters degree at Distinction level. The ideal candidate will have a strong grounding in mathematics with a good understanding of category theory and related computational and modelling tools and ideally also some understanding of the theory of computing, including lambda calculus, type theory and pi-calculus or related topics. The ideal candidate should also have an interest in biology and in particular cellular biology or biochemistry. A first degree or an MSc in computer science or mathematics is preferred, but other related areas will be also considered (e.g. physics, chemistry, biology).</p>\n<p>Application<br>\nApplicants should email the following documents to Ms Laura Cooper; email: <a href=\"mailto:L.Cooper@napier.ac.uk\">L.Cooper@napier.ac.uk</a><br>\nA two-page research proposal for the selected research topic that demonstrates an understanding of the background to the area and outlines the questions that the applicant is interested in researching.<br>\nCurriculum vitae<br>\nCover letter (one page) explaining why the candidate is interested in applying for this studentship.<br>\nNames and contact details of two referees<br>\nInformal enquiries about the research area can be made to Professor Peter Andras <a href=\"mailto:P.Andras@napier.ac.uk\">P.Andras@napier.ac.uk</a>.</p>\n<p>Best regards,<br>\nPeter</p>\n<hr>\n<p>Professor Peter Andras<br>\nDean<br>\nSchools of Computing and Engineering &amp; the Built Environment<br>\nEdinburgh Napier University<br>\nMerchiston Campus<br>\n10 Colinton Road<br>\nEH10 5DT<br>\nEdinburgh<br>\nUK</p>",
        "id": 289825869,
        "sender_full_name": "Peter Andras",
        "timestamp": 1657974502
    }
]