[
    {
        "content": "<p>From Clemens Kupke (<a href=\"mailto:clemens.kupke@strath.ac.uk\">clemens.kupke@strath.ac.uk</a>) on the category theory mailing list:</p>\n<blockquote>\n<p>The University of Strathclyde is hiring a Chancellor’s Fellow in Mathematically Structured Programming. This is a permanent academic position with reduced teaching load and limited administrative duties over the initial years for you to build a research portfolio. Please feel free to contact me or any other member of the Mathematically Structured Programming research group if you have any questions.</p>\n<p>Location: Glasgow, Scotland, UK<br>\nSalary: £41,421 to £56,921 (Grade 8); £58,596 to £65,814 (Grade 9)<br>\nHours: Full Time<br>\nContract Type: Permanent<br>\nCloses: 5th January 2025<br>\nMore details, and to apply: <a href=\"https://url.au.m.mimecastprotect.com/s/8FxdCZY146s5QgL5nhzfyHBjD4N?domain=jobs.ac.uk\">https://www.jobs.ac.uk/job/DKR108/strathclyde-chancellors-fellow-in-mathematically-structured-programming</a></p>\n<p>The Department of Computer and Information Sciences at the University of Strathclyde seeks to appoint a Chancellors Fellow in Mathematically Structured Programming. We welcome applications from candidates with expertise in a range of topics in the mathematical foundations of computer sciences and applications, such as:</p>\n<ul>\n<li>Logic, including modal and temporal logic, model checking, and proof theory;</li>\n<li>Category theory, including categorical semantics, and applied category theory;</li>\n<li>Type theory and functional programming, including semantics, metatheory, and implementation;</li>\n<li>Formal and mechanised mathematics, including certified programming and the use and implementation of proof assistants.</li>\n</ul>\n<p>You will join the vibrant Mathematically Structured Programming group (<a href=\"https://url.au.m.mimecastprotect.com/s/uavZC1WLjwsMqGoMwhGhEHVkYr5?domain=msp.cis.strath.ac.uk/\">https://msp.cis.strath.ac.uk/</a> ), which is internationally renowned for its research in the mathematical foundations of programming languages. We see the mathematical foundations of computation and programming as inextricably linked, and study one so as to develop the other. This reflects the symbiotic relationship between mathematics, logic, and programming — any attempt to sever this connection will diminish each component We have a strong partnership with the Scottish Programming Languages Institute (<a href=\"https://url.au.m.mimecastprotect.com/s/dSPeC2xMRkUp83XpocBiAH5S7Y2?domain=spli.scot/\">https://spli.scot/</a> ), and our work finds impact through our productive links with industry.</p>\n<p>As a highly motivated scholar, you will contribute to the research, teaching, and administrative activities of the group and the wider department. We expect you to have ambitious academic goals, and an understanding of how to bring in the grant income required to fund those goals. Your Fellowship will normally be at lecturer level (Grade 8) for 5 years, with the expectation that you'll meet our promotion criteria within that period and be transferred to senior lecturer. Exceptionally, where you have a strong track record in research leadership, you can be appointed at senior lecturer level (Grade 9), with expected promotion to Reader within 5 years.</p>\n<p>The University of Strathclyde is socially progressive and offers a supportive and flexible working culture. As a Department we have had exceptional recent successes across all of our activities, so you will be joining a energetic, happy, friendly and forward looking department keen to do more. We are committed to equality and diversity and work hard to ensure equal participation and equality of opportunities for all. The CIS department was recently awarded the Athena Swan Bronze level award. We strongly encourage applications from Black, Asian and minority ethnicity, women, LGBTQIA+, disabled candidates, candidates from lower socio-economic groups, and care-experienced backgrounds.</p>\n</blockquote>",
        "id": 485177677,
        "sender_full_name": "John Baez",
        "timestamp": 1732927627
    }
]