[
    {
        "content": "<p>There are two new positions at Topos UK in Oxford:</p>\n<ul>\n<li>Director of UK Operations (<a href=\"https://topos.institute/community/jobs/uk-2025-ops/\">https://topos.institute/community/jobs/uk-2025-ops/</a>)</li>\n<li>Postdoc in compositional conceptual modelling (<a href=\"https://topos.institute/community/jobs/uk-2025-ccmp/\">https://topos.institute/community/jobs/uk-2025-ccmp/</a>)</li>\n</ul>\n<p>Let me copy some of the second job description, since that one is more interesting to category theorists:</p>\n<blockquote>\n<p>Our ideal candidate either:</p>\n<ul>\n<li>has a background in algebraic systems theory or model/system validation with some knowledge of category theory and an eagerness to learn double categorical systems theory; or</li>\n<li>has a background in 2-category theory or categorical logic and an eagerness to work on systems modelling and validation.</li>\n</ul>\n<p>You should have (or soon be obtaining) a PhD or equivalent in, or have made significant contributions to, one of the areas of algebraic systems theory, system validation, model validation, 2-category theory, or categorical logic.</p>\n<p>There is evidence to suggest that women and people of color are less likely to apply for jobs unless they believe they meet every one of the qualifications as described in the job description. If this role speaks to you, we encourage you to apply, even if you don’t believe you tick all the boxes.</p>\n<h2>Eligibility criteria</h2>\n<p>Topos will consider sponsoring a UK visa for a successful applicant. <strong>Please include details of your visa requirements (if any) in your application</strong> (e.g. in your cover letter).</p>\n<p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or disability.</p>\n<h2>Us and you</h2>\n<p>We are dedicated to shaping the future of technology to ensure a more equitable and just world, and we believe that a technology that supports a healthy society can only be built by an organisation that supports its team members. As such, Topos is committed to ensuring that we clearly and compassionately negotiate your role and responsibilities while you’re at Topos, and then ensuring that you have the support that you need to fulfill that role.</p>\n<p>Topos UK offers benefits including private health and dental insurance, 30 days paid holiday (plus public holidays), and a variable pension plan.</p>\n</blockquote>\n<p>For more details go here: <a href=\"https://topos.institute/community/jobs/uk-2025-ccmp/\">https://topos.institute/community/jobs/uk-2025-ccmp/</a></p>",
        "id": 542143097,
        "sender_full_name": "John Baez",
        "timestamp": 1759181212
    }
]