[
    {
        "content": "<p>The Laboratory for Software Science at the Institute of Computer Science at the University of Tartu is seeking an aspiring talented and hard-working young scientist to fill a postdoctoral position.</p>\n<p>The successful candidate will work with Dr. Danel Ahman on topics at the intersection of dependent and refinement types, computational effects (in particular, algebraic effects and effect handlers) and type-and-effect systems, and modal types, with specifics determined based on the common interests of the candidate and the supervisor. Candidates from other related PL areas are also encouraged to apply.</p>\n<p>Our group currently consists of 4 faculty, 3 (soon 4) PhD students, and soon 1 more postdoc (in addition to this advertisement), with expertise in a wide range of PL topics, ranging from type systems and semantics of programming languages, to abstract interpretation based automated verification tools, to various topics in category theory. Consult our webpage for more information on us: <a href=\"https://sws.cs.ut.ee/\">https://sws.cs.ut.ee</a>.</p>\n<p>In Estonia, we also have close ties and regularly collaborate with the Algebra Group (<a href=\"https://math.ut.ee/en/content/algebra\">https://math.ut.ee/en/content/algebra</a>) at the Institute of Mathematics and Statistics at the University of Tartu, and the Logic and Semantics Group (<a href=\"https://cs.ioc.ee/lsg/\">https://cs.ioc.ee/lsg/</a>) at the Tallinn University of Technology. We also collaborate actively internationally.</p>\n<p>The position is for up to 18 months, with a start date on 1 Oct 2025 or soon thereafter. The monthly gross salary will start from 2700 EUR depending on the experience of the candidate. The salary includes coverage by the national health insurance system, paid annual leave etc. A salary like this ensures a high standard of living in Estonia.</p>\n<p>Knowledge of Estonian is not required for this position, and for living in Tartu in general. The working language of our group is English. For more information about life in Tartu and more broadly in Estonia, see <a href=\"https://visittartu.com/\">https://visittartu.com</a> and <a href=\"https://visitestonia.com/en\">https://visitestonia.com/en</a>. </p>\n<p>The job advertisement and application instructions can be found at</p>\n<p><a href=\"https://candidate.recrur.com/public/jobad/EN/6b969e7f-8\">https://candidate.recrur.com/public/jobad/EN/6b969e7f-8</a></p>\n<p>The application deadline is <strong>01 Aug 2025</strong>.</p>\n<p>Interested candidates should contact Danel Ahman (<a href=\"mailto:danel.ahman@ut.ee\">danel.ahman@ut.ee</a>) with any questions.</p>",
        "id": 526551373,
        "sender_full_name": "Danel Ahman",
        "timestamp": 1751357934
    },
    {
        "content": "<p>As one of the members of the group in Tartu, I endorse this advertisement!</p>",
        "id": 526577343,
        "sender_full_name": "Chad Nester",
        "timestamp": 1751366182
    }
]