[
    {
        "content": "<p>Dear all,</p>\n<p>I would like to invite applications for two postdoctoral positions in homotopy type theory at the University of Nottingham, UK.  The positions are initially for three years, after which an extension is likely to be possible.  The suggested starting date is 1 October this year, but please get in touch even if you could only start later (email: <a href=\"mailto:nicolai.kraus@nottingham.ac.uk\">nicolai.kraus@nottingham.ac.uk</a> ).</p>\n<p>Our group in Nottingham has multiple academics, postdocs, and PhD students working in the field, and we have regular seminars and informal discussions which contribute to a great environment for working, learning, and collaboration.  There are no teaching obligations attached to these positions, but there are teaching and supervision opportunities.</p>\n<p>The current call primarily addresses candidates who already work in (homotopy) type theory.  However, if you work in a related area and are interested in type theory, please do not hesitate to contact me for an informal discussion!</p>\n<p>The official advert can be found <a href=\"https://jobs.nottingham.ac.uk/vacancy.aspx?ref=SCI174425\">here</a>, and the closing date is 25 July.  Please note that my university's application form is somewhat non-standard.  There are very subject-specific questions (for example, asking you to demonstrate your experience with proof assistants) and text fields, but no obvious places to upload a CV or cover letter.  You may use Section 5 (\"additional information\") to include the information you would usually add in a CV or cover letter.  Please do not be discouraged by the subject-specific questions; it is not necessary to have experience with everything.  Also note that the university asks for referee details per default; you do not need letters at the time you apply, you only need to list their contact details at this stage.  Members of underrepresented groups are particularly encouraged to apply.</p>\n<p>If you are interested, I would encourage you to get in touch with me!</p>\n<p>Best wishes,<br>\nNicolai<br>\n<a href=\"mailto:nicolai.kraus@nottingham.ac.uk\">nicolai.kraus@nottingham.ac.uk</a></p>\n<p>application link:  <a href=\"https://jobs.nottingham.ac.uk/vacancy.aspx?ref=SCI174425\">https://jobs.nottingham.ac.uk/vacancy.aspx?ref=SCI174425</a></p>",
        "id": 527461217,
        "sender_full_name": "Nicolai Kraus",
        "timestamp": 1751888971
    }
]