[
    {
        "content": "<p>The Applied Category Theory group at the National Institute of Standards and Technology (NIST) is looking to hire postdocs!</p>\n<p>Details can be found here:<br>\n<a href=\"http://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7916\">Mathematical Foundations for System Interoperability</a><br>\n<a href=\"http://nrc58.nas.edu/RAPLab10/Opportunity/Opportunity.aspx?LabCode=50&amp;ROPCD=507751&amp;RONum=B7529\">Research in Cyber-Physical Systems</a></p>\n<p>The upcoming application deadline is <strong>August 1st</strong>.</p>\n<p>The group develops use cases, tools and methodology to apply category theory and related methods in a broad range of disciplines centered around the design, implementation, operation and evolution of engineered systems. </p>\n<p>These 2-year postdoctoral positions are only open to US citizens, come with a generous stipend and great benefits. NIST is located in Gaithersburg, Maryland just outside of Washington DC.</p>\n<p>I've been at NIST working with <span class=\"user-mention\" data-user-id=\"278008\">@Spencer Breiner</span>, <span class=\"user-mention\" data-user-id=\"278332\">@Eswaran Subrahmanian</span>  and others for over 2 years and am happy to answer questions about the position and share my experience. </p>\n<p>NIST is an amazing place to work, filled with brilliant people. You can literally walk down the hall or across campus and talk to experts in smart grid, industrial robotics, additive manufacturing, quantum computing, 2D materials, cyber security, and more. You name it, and someone at NIST is working on it. There are regular colloquia and lectures from people around the world as well as resident NISTers. The group there is very open and supportive, giving you the opportunity to drive the direction of research. The campus is idyllic, with deer running around, regular ultimate frisbee and soccer matches, two small ponds, a tree grafted from Newton's apple tree, and on and on. NIST occupies a unique role at the intersection of government, academia, and industry. It is like a university, without the tenure/funding hustle, no teaching freshman calculus, and with world class facilities and people. I can't recommend working there enough.</p>",
        "id": 203970219,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1594826854
    },
    {
        "content": "<p>FYI this opportunity is only for US citizens</p>",
        "id": 203971069,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594827175
    },
    {
        "content": "<p>Indeed, these positions are only open to US citizens. That said, there are other mechanisms to host/pay guest researchers at NIST, so those interested but ineligible for these postdocs should still reach out to me or Spencer or Sub.</p>",
        "id": 203971644,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1594827389
    },
    {
        "content": "<p>Very nice! I wonder, if the group is expanding, does this signal that you are in favour with the Powers That Be?</p>",
        "id": 203972023,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1594827561
    },
    {
        "content": "<p>Our division chief as well as the director of the entire Information Technology Lab at NIST have been very supportive of all the ACT efforts. So the 'higher-ups' are definitely on board. Also, we have way too much on our plate right now in terms of projects and definitely need to expand.</p>",
        "id": 203972869,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1594827939
    },
    {
        "content": "<p>Having visited NIST and worked at a DOE Lab, which has a similar institutional role, I can say that working at NIST with Blake, Spencer, and Sub is a great opportunity!</p>",
        "id": 203990738,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594836210
    }
]