[
    {
        "content": "<p>Hi, I'm looking for a postdoc to work on probabilistic programming, possibly including categorical theories of probability. Maybe you saw my CPS tutorial or talk. <br>\nClosing date 17 Sept 2020 (NB our HR use noon UK time!).</p>\n<ul>\n<li><a href=\"http://www.cs.ox.ac.uk/news/1838-full.html\">job ad</a></li>\n<li><a href=\"http://www.cs.ox.ac.uk/people/samuel.staton/blast/\">BLAST project preliminary website</a></li>\n</ul>\n<p>Do get in touch with any questions!</p>",
        "id": 207730714,
        "sender_full_name": "Sam Staton",
        "timestamp": 1598112796
    },
    {
        "content": "<p>Hi, I'm looking for three more research associates (postdocs) in Oxford. Job ads <a href=\"https://www.cs.ox.ac.uk/news/2143-full.html\">here</a> and <a href=\"https://www.cs.ox.ac.uk/news/2144-full.html\">here</a>; do apply to both.</p>\n<ul>\n<li>\n<p>The funding is based around probabilistic and quantum programming, but the work topics are fairly flexible. As the essential criteria I put </p>\n<blockquote>\n<p>Expertise in one or more of the following areas (in alphabetical order): category theory, measure theory, probabilistic programming, programming language theory, quantum theory, statistical machine learning, or theory of statistics, evidenced by published papers.</p>\n</blockquote>\n</li>\n<li>\n<p>Oxford is a lively place. Here's <a href=\"https://www.cs.ox.ac.uk/people/samuel.staton/main.html#team\">my current immediate group</a>. Beyond myself, there are quite a few category-theory-sympathetic people in CS (e.g. <a href=\"https://www.cs.ox.ac.uk/research/pl/people.html\">PL</a>, <a href=\"https://www.cs.ox.ac.uk/research/fls/people.html\">Quantum</a>) and lots of interaction, with various informal seminars etc.; also there's even more in maths and over in Quantinuum etc..</p>\n</li>\n<li>Closing date 19th April 2023 noon UK time. Let me know if you need longer.</li>\n</ul>\n<p>As always, let me know about any questions, if you're curious, or if you know people who might be.</p>",
        "id": 342556610,
        "sender_full_name": "Sam Staton",
        "timestamp": 1679058652
    }
]