[
    {
        "content": "<p>Cavenwell is an early stage startup.  We have developed a decision support technology that will supercede the current LLM transformer technology, solving the problems of cost, hallucination and data security, while providing powerful quantitative reasoning.</p>\n<p>We are partnered with The Children's Hospital of Eastern Ontario and Deloitte and are in talks with Warner Brothers to introduce a groundbreaking, system-level-change inducing technology to their companies or clients.</p>\n<p>I would like to be introduced to a student or professional who is a very talented programmer and mathematician and understands natural language processing (a la Sadrzadeh), data (a la Spivak) and probability (a la Jacobs).  This colleague should be ready to join our company and commit themselves full time with equity and salary as compensation.  Salary will become available in 8 months after a successful funding round.  There won't be a need for much work before the funding comes in.  We just need to solidify the team now.</p>\n<p>If you, or someone you know can do this, please consider making an introduction. </p>\n<p>Thank you for reading.</p>\n<p>Ben Sprott<br>\nFounder, CEO and Architect<br>\nCavenwell Industrial AI<br>\n<a href=\"https://www.cavenwell.ai/about\">https://www.cavenwell.ai/about</a><br>\n<a href=\"mailto:ben@cavenwell.ai\">ben@cavenwell.ai</a></p>",
        "id": 468009984,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1725581152
    },
    {
        "content": "<blockquote>\n<p>join our company and commit themselves full time with equity and salary as compensation. Salary will become available in 8 months after a successful funding round. There won't be a need for much work before the funding comes in.</p>\n</blockquote>\n<p>Can you clarify this part? I don't quite understand when the person would be joining full-time and when they would start getting paid.</p>",
        "id": 468019335,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725584812
    },
    {
        "content": "<p>Sure.  I have been asked by investors to have a bigger team.  In the early days, the person would \"join\", attend investor meetings, and when deals close, the work begins and so would the salary.</p>",
        "id": 468019967,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1725585076
    },
    {
        "content": "<p>I see, thanks.</p>",
        "id": 468034140,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1725588920
    },
    {
        "content": "<p>Is there a barrier to keep someone else from delivering your value proposition?</p>",
        "id": 468314999,
        "sender_full_name": "JR",
        "timestamp": 1725669741
    },
    {
        "content": "<p>We have several patents on our technology.  They are quite broad, being written in Category Theory.</p>",
        "id": 468320154,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1725673439
    },
    {
        "content": "<p>UK only?</p>",
        "id": 468332919,
        "sender_full_name": "JR",
        "timestamp": 1725679244
    },
    {
        "content": "<p>Our patents are in the US and Canada.</p>",
        "id": 468402805,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1725712793
    },
    {
        "content": "<p>Mostly US.</p>",
        "id": 468402873,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1725712803
    }
]