[
    {
        "content": "<p>The Department of Mathematics at the University of Western Ontario is advertising two tenure-track positions as well as one or more postdoctoral positions.</p>\n<p>The first tenure-track position is intended for mathematicians whose research focus is in \"applied algebra\", interpreted in the broadest possible sense. This could include applications of category theory, or applications of algebra to other parts of mathematics, e.g. algebraic topology. The deadline to apply for this position is <strong>December 7, 2021</strong>:</p>\n<p><a href=\"https://www.mathjobs.org/jobs/list/18557\">https://www.mathjobs.org/jobs/list/18557</a></p>\n<p>The second tenure-track position is open to mathematicians in any area, but includes having part of your teaching in our newly established Data Science program.  I'd like to stress that you don't need to do research in data science nor do you need teaching experience related to data science. You do however, in the language of the ad, need to have some \"expertise relevant to teaching data science.\" I believe the committee will be open to all kinds of ways in which such expertise can be demonstrated.  The deadline to apply for this position is <strong>January 2, 2022</strong>:</p>\n<p><a href=\"https://www.mathjobs.org/jobs/list/19046\">https://www.mathjobs.org/jobs/list/19046</a></p>\n<p>Last but not least, we're also advertising postdoctoral fellowships, open to applicants in all areas of mathematics, both pure and applied.  The deadline to apply for these positions is <strong>December 5, 2021</strong>:</p>\n<p><a href=\"https://www.mathjobs.org/jobs/list/18780\">https://www.mathjobs.org/jobs/list/18780</a></p>\n<p>The Department of Mathematics has a number of faculty interested in category theory, higher category theory, algebraic topology and homotopy type theory.  With many seminars and topics courses, and a strong graduate program, it is an excellent place for researchers in these areas.</p>\n<p>I hope to see many people who frequent this zulip apply for these positions!  If you have questions about either of these positions, please get in touch and I'll be happy to answer them.</p>",
        "id": 262619645,
        "sender_full_name": "Dan Christensen",
        "timestamp": 1637775600
    }
]