[
    {
        "content": "<p>I'm afraid this is a real job where you gotta really work, not a research position.     Brendan Fong writes:</p>\n<blockquote>\n<p>Topos is hiring! We're looking for an operations assistant to assist across the organization with office management, bookkeeping, grant administration, coordination with donors, and so on. It'll be full-time, and will eventually require regular in-office work in Berkeley.</p>\n<p>Do you know anyone who might be interested, or how to reach potentially interested parties based in Berkeley or nearby? We've advertised an entry-level-ish position, but would also be open to creating a more senior position for the right candidate. We're hoping for someone with whom our mission of shaping tech for public benefit really resonates, even if it's not a technical/scientific role itself.</p>\n<p>Here's the position description: <a href=\"https://topos.site/topos_operations_assistant.pdf\">https://topos.site/topos_operations_assistant.pdf</a><br>\nIt's also linked on our website: <a href=\"https://topos.institute/contact\">https://topos.institute/contact</a> </p>\n</blockquote>",
        "id": 236545280,
        "sender_full_name": "John Baez",
        "timestamp": 1619630305
    },
    {
        "content": "<p>Nothing is more frightening than the idea of having to do real work &gt;.&lt;</p>",
        "id": 236590873,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619649282
    },
    {
        "content": "<p>Says the guy who just lectured for 7 hours straight <span aria-label=\"smirk\" class=\"emoji emoji-1f60f\" role=\"img\" title=\"smirk\">:smirk:</span></p>",
        "id": 236601019,
        "sender_full_name": "Jade Master",
        "timestamp": 1619656156
    },
    {
        "content": "<p>I consider that more similar to a workout! <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></p>",
        "id": 236641584,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619687056
    },
    {
        "content": "<p>The Topos Institute is expanding!    Here's one sign of that:</p>\n<blockquote>\n<p>We invite applications to join the Topos Institute as a Research Software Engineer (RSE), to work on software for compositional data integration and scientific modeling in the Julia programming language. The position is for one year with possibility of conversion to a regular position. A strong background in programming is required. Knowledge of category theory and prior experience with Julia are preferred but not required.</p>\n</blockquote>\n<p>For more information, including instructions on how to apply, <a href=\"https://topos.site/blog/2022/02/topos-seeks-research-software-engineer/\">go here</a>.</p>",
        "id": 273119543,
        "sender_full_name": "John Baez",
        "timestamp": 1645722679
    }
]