[
    {
        "content": "<p>A message from the Topos Institute:</p>\n<blockquote>\n<p><strong>Recruiting</strong></p>\n<p>Next month Dr Kevin Arlin will be joining us as a Research Software Engineer. Kevin has a PhD in higher category theory from UCLA, and a Part III from Cambridge, and is coming to us from a role as a curriculum developer at The Art of Problem Solving. He's an experienced category theorist with a strong interest in making it accessible to others, both through education and building software.</p>\n<p>Applications have now closed for our summer research associate program, and we have selected a passionate and diverse cohort of seven students, with interests ranging across type theory, machine learning, natural language processing, scientific computing, polynomial functors, and mathematics outreach. We're excited for the new energy and perspectives they'll bring to Topos this summer.</p>\n<p>We are continuing to recruit for the following positions, all based in Berkeley:</p>\n<ul>\n<li>\n<p><a href=\"https://topos.site/files/Call%20for%20Applications_%20Director%20of%20Research.pdf\">Director of Research</a></p>\n</li>\n<li>\n<p><a href=\"https://topos.site/files/Topos_Finance_Operations_call.pdf\">Finance and Operations Manager</a></p>\n</li>\n<li>\n<p><a href=\"https://topos.site/files/Topos_%20Postdoctoral%20Researcher_Call.pdf\">Postdoctoral Fellow</a></p>\n</li>\n<li>\n<p><a href=\"https://topos.site/files/Research_Software_Engineer.pdf\">Research Software Engineer</a></p>\n</li>\n</ul>\n<p>We're also working hard on a call for applications for a Research Ethicist, to be posted shortly. Please feel free to spread the word.</p>\n</blockquote>",
        "id": 340517618,
        "sender_full_name": "John Baez",
        "timestamp": 1678340641
    },
    {
        "content": "<p>That's interesting. I've never heard of the job \"research ethicist\" before. Looking forward to the job description.</p>",
        "id": 340813109,
        "sender_full_name": "Jade Master",
        "timestamp": 1678442881
    }
]