[
    {
        "content": "<p>I already posted this advertisement on the categories mailing list but I'm reposting it here in case it reaches other interested people, and also to emphasize that we (<span class=\"user-mention\" data-user-id=\"276828\">@Luigi Santocanale</span> and I) are happy to take informal questions about the positions.  The potential topics of the postdocs and their overlaps with different areas of category theory are open-ended (in the original ad we mentioned monoidal closed categories and multicategories, but really the overlaps are broader), so if you may be interested I recommend you have a look at the scientific part of our grant proposal (linked to from the project page, as well as <a href=\"https://www.lix.polytechnique.fr/LambdaComb/docs/lambdacomb-scientific.pdf\">here</a>), and once again we two are happy to discuss more about it.  Job advertisement follows.<br>\n====<br>\n<strong>Announcement for two 11-15-month postdoctoral positions funded by the ANR LambdaComb.</strong></p>\n<p>Project summary : LambdaComb is an interdisciplinary project financed by the French Agence Nationale de la Recherche. Broadly, the project aims to deepen connections between lambda calculus and logic on the one hand and combinatorics on the other. One important motivation for the project is the discovery over recent years of a host of surprising links between subsystems of lambda calculus and enumeration of graphs on surfaces, or \"maps\", the latter being an active subfield of combinatorics with roots in W. T. Tutte's work in the 1960s.  More informations can be found on the project webpage:  <a href=\"https://www.lix.polytechnique.fr/LambdaComb/\">https://www.lix.polytechnique.fr/LambdaComb/</a></p>\n<p>We seek candidates holding or soon to receive a PhD in Computer Science or Mathematics and with expertise in one or several of the following areas:</p>\n<ul>\n<li>Category theory</li>\n<li>Combinatorics</li>\n<li>Logic and lattice theory</li>\n<li>Proof theory, types, and Curry-Howard correspondence</li>\n</ul>\n<p>The ideal candidate will have a strong background in one of the areas and at least an interest in the others.</p>\n<p>We aim to recruit two postdocs who will be employed respectively at:</p>\n<ul>\n<li>LIS research laboratory (<a href=\"https://www.lis-lab.fr/\">https://www.lis-lab.fr/</a>) in Marseille, France, working under the mentorship of Luigi Santocanale</li>\n<li>LIX laboratory (<a href=\"https://www.lix.polytechnique.fr/\">https://www.lix.polytechnique.fr/</a>) in Palaiseau, France (south of Paris), working under the mentorship of Noam Zeilberger</li>\n</ul>\n<p>Both postdocs will have opportunities for visiting other partner institutions and for collaborating with other members of the project (see full list at the project page linked above).</p>\n<p>Application process:</p>\n<ul>\n<li>\n<p>Deadline for applications is March 27, 2022, for a starting date in September 2022 (or sooner, negotiable).</p>\n</li>\n<li>\n<p>Candidates can send their application to Luigi Santocanale (<a href=\"mailto:luigi.santocanale@lis-lab.fr\">luigi.santocanale@lis-lab.fr</a>) and/or Noam Zeilberger (<a href=\"mailto:noam.zeilberger@lix.polytechnique.fr\">noam.zeilberger@lix.polytechnique.fr</a>) with a subject containing “[LambdaComb post-doc application]”.</p>\n</li>\n<li>\n<p>The application should contain a CV, a brief research statement (1-2 pages) &amp; at least two contacts of reference persons (or reference letters if available).</p>\n</li>\n<li>\n<p>The salary and precise length of the contract will depend on the successful candidate's prior research experience, with a guaranteed minimum of 2466 EUR/month gross salary for the LIS postdoc and of 2520 EUR/month gross salary for the LIX postdoc.</p>\n</li>\n<li>\n<p>The selection process will be achieved in collaboration with other project coordinators.</p>\n</li>\n</ul>\n<p>Further enquiries about the position may be addressed to Luigi Santocanale (<a href=\"mailto:luigi.santocanale@lis-lab.fr\">luigi.santocanale@lis-lab.fr</a>) or Noam Zeilberger (<a href=\"mailto:noam.zeilberger@lix.polytechnique.fr\">noam.zeilberger@lix.polytechnique.fr</a>).</p>",
        "id": 273108092,
        "sender_full_name": "Noam Zeilberger",
        "timestamp": 1645718181
    }
]