[
    {
        "content": "<p>Hi All <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> </p>\n<p>I'm new to this group, so a brief introduction is in order. I'm working in bioinformatics, but with a background in maths/stats and some experience with group theory (but only a rough understanding of the basics of category theory).</p>\n<p>I'm fed up with compromises with data management, so I want to create a well-designed, robust framework for the language I use for data analysis (Julia). So far, I've written a bit of a manifesto with my thoughts on data management (<a href=\"https://tecosaur.com/public/DataManagement.html\">https://tecosaur.com/public/DataManagement.html</a>). At the end of this, I have a suspicion that my approach might be able to be reformulated as a category theory problem, and in doing so provide a clean abstraction/model for what I'm doing.</p>\n<p>Unfortunately, I don't know enough about category theory to take my suspicion any further, which is where I'm hoping you fine folks might be able to help me out <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>.</p>",
        "id": 278001959,
        "sender_full_name": "Timothy",
        "timestamp": 1649239751
    },
    {
        "content": "<p>(I'm guessing this is the right place to post my question/help request, if not please let me know where it should go)</p>",
        "id": 278002057,
        "sender_full_name": "Timothy",
        "timestamp": 1649239804
    },
    {
        "content": "<p>In case it's of any help, here's a diagram showing a bit of the nature of my approach:</p>\n<p><a href=\"/user_uploads/21317/vdlGF4BQeETJHAdQYFdg_ExE/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/vdlGF4BQeETJHAdQYFdg_ExE/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/vdlGF4BQeETJHAdQYFdg_ExE/image.png\"></a></div>",
        "id": 278002182,
        "sender_full_name": "Timothy",
        "timestamp": 1649239905
    },
    {
        "content": "<p>I cannot comment directly on your approach right now but have you read the excellent paper written by <span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span> <span class=\"user-mention\" data-user-id=\"280755\">@Owen Lynch</span> and <span class=\"user-mention\" data-user-id=\"275927\">@James Fairbanks</span>  on Attributed C-Sets? <a href=\"https://arxiv.org/abs/2106.04703\">https://arxiv.org/abs/2106.04703</a></p>\n<p>Very practical for applying category theory to code.<br>\nAlso, be sure to check out <a href=\"https://www.algebraicjulia.org/\">AlgebraicJulia here</a> and especially their blog!</p>",
        "id": 278044156,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1649260009
    },
    {
        "content": "<p>P.S. Nice to cross paths again <span class=\"user-mention\" data-user-id=\"492402\">@Timothy</span> <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 278044198,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1649260035
    },
    {
        "content": "<p>Hello! I recognise that avatar... <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> </p>\n<p>Thanks for the links, I'll check out that paper.</p>",
        "id": 278044365,
        "sender_full_name": "Timothy",
        "timestamp": 1649260105
    },
    {
        "content": "<p>Hello, Timothy! <br>\nIt might be a bit hardar way to obtain some good intuition around category theory, <br>\nbut I would like you to enjoy starting them! <br>\nIn my understanding, Category theory is much depending on Homology theory! <br>\nIt might help you to try some simple homology theory and then famous books such as <br>\nMac Lane's \"category theory for working mathematician\" and Emily Riehl's \"Category theory in context\" ! <br>\nThese books are really general introduction for CT, and really deep such that the generalization would capture any regions of science in a good manner :-)<br>\nIf you have already been introduced to category theory properly, I hope you will enjoy ∞-category theory by Cisinski's book ! <a href=\"http://www.mathematik.uni-regensburg.de/cisinski/CatLR.pdf\">http://www.mathematik.uni-regensburg.de/cisinski/CatLR.pdf</a><br>\nIn applied category theory, there might be lots of works depending on modern cateogry theory and geometric invariances such as homotopy and homology. To see the works of good abstractions, these books would help.</p>\n<p>In reality, I have been depending much on Kashiwara Schapira's \"categories and sheaves\" to understand category theory, but it was  a bit elaboration to read this one. However, it gave me great details.</p>",
        "id": 279901941,
        "sender_full_name": "GhaS Shee",
        "timestamp": 1650683310
    },
    {
        "content": "<p><em>One</em> approach to category theory is through algebraic topology and algebraic geometry.   This is the historical approach.  Eilenberg and Mac Lane invented categories to formalize the notion of \"natural isomorphism\" between cohomology theories, Grothendieck and others invented abelian categories to help understand sheaf cohomology, later Grothendieck invented topoi to understand sheaves more deeply, Quillen invented model categories to formalize the analogy between chain complexes and topological spaces, and so on.  </p>\n<p>But by now there are many other routes to category theory!   For example, there are a lot of people using category theory in computer science, and such people don't need to understand algebraic topology or algebraic geometry to learn category theory.</p>\n<p>There are also a lot of people using category theory to study quantum physics and quantum field theory: that's how I got interested in categories.</p>\n<p>And there are people applying category theory to other things.    I'll soon be mentoring a group of 14 students on a project about category theory and chemistry, where understanding \"Petri nets with rates\" is much more important than understanding anything about algebraic topology.</p>\n<p>So nobody should feel they need to understand cohomology to learn category theory!   </p>\n<p>(But of course cohomology theory is fascinating in itself, and I've spent years studying it.)</p>",
        "id": 279936865,
        "sender_full_name": "John Baez",
        "timestamp": 1650735105
    },
    {
        "content": "<p>For <span class=\"user-mention\" data-user-id=\"492402\">@Timothy</span> I recommend this free book (if he hasn't already read it):</p>\n<ul>\n<li>Brendan Fong and David Spivak, <em><a href=\"http://math.mit.edu/~dspivak/teaching/sp18/7Sketches.pdf\">Seven Sketches in Compositionality: An Invitation to Applied Category Theory</a></em>.   Also see the <a href=\"http://math.mit.edu/~dspivak/teaching/sp18/\">website with videos</a> and my <a href=\"http://www.azimuthproject.org/azimuth/show/Applied+Category+Theory\">online course based on this book</a>.</li>\n</ul>",
        "id": 279937064,
        "sender_full_name": "John Baez",
        "timestamp": 1650735428
    },
    {
        "content": "<p>There are also lots of other useful books, including those by Mac Lane, <a href=\"http://www.math.jhu.edu/~eriehl/context.pdf\">Riehl</a> and <a href=\"https://arxiv.org/abs/1612.09375\">Leinster</a>.   The latter two are free online - legally, that is.</p>",
        "id": 279937216,
        "sender_full_name": "John Baez",
        "timestamp": 1650735624
    }
]