[
    {
        "content": "<p>I have been developing a foundation for science using CT.  The two prototypical disciplines that I like to think about are as far apart as you can imagine, but in this foundation, they look about the same.  My work is very much like Spivak's work, which I have been heavily influenced by, but I come at it from a different angle.</p>\n<p><a href=\"https://www.researchgate.net/publication/322766016_Experiments_and_Theories_A_Fundamental_Model\">Here is my first paper</a> on the subject where I make a bold claim that we can \"mechanically\" link theories with experiments.</p>\n<p>In there, you see how I have come at this from the perspective of a physicist.  The example is cosmology.</p>\n<p><a href=\"https://drive.google.com/file/d/16HNJ4EPEfAsMTf4fSwI-UCugGdJATzRR/view?usp=drivesdk\">In this new paper</a>, which is just getting started, I look at my other favourite subject to think about, culture and its experiments, namely Archaeology.  I will add to this paper over the summer.  Right now, you should just be able to tell that the foundation is versatile enough to make the subjects of astronomy and it's theory, cosmology look very similar to archaeology, and it's theory, Anthropology.</p>\n<p>Please feel free to critique this work and I thank you in advance for doing that.</p>\n<p>I am trying to figure out the Eilenberg-Moore category for the theory of culture and I am thinking of algebras on the monad of multisets.    I keep wanting to use majority vote for the structure map of the category of algebras.  This is leading me to restrict my attention to Multisets that have one set element that has a highest multiplicity.  This kind of structure map would support ideas like how elements of a culture should be dominant.  It reflects democracy, via voting, and how a culture might break down if mixtures of cultural artifacts don't have a majority element.  Language is the best example, since we expect that speakers should be multiset like <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mn>1000</mn><mi mathvariant=\"normal\">∣</mi><mi>E</mi><mi>n</mi><mi>g</mi><mi>l</mi><mi>i</mi><mi>s</mi><mi>h</mi><mo stretchy=\"false\">⟩</mo><mo>+</mo><mn>500</mn><mi mathvariant=\"normal\">∣</mi><mi>F</mi><mi>r</mi><mi>e</mi><mi>n</mi><mi>c</mi><mi>h</mi><mo stretchy=\"false\">⟩</mo></mrow><annotation encoding=\"application/x-tex\">1000 \\vert English \\rangle + 500 \\vert French \\rangle</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">1000∣</span><span class=\"mord mathnormal\" style=\"margin-right:0.05764em;\">E</span><span class=\"mord mathnormal\">n</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">g</span><span class=\"mord mathnormal\" style=\"margin-right:0.01968em;\">l</span><span class=\"mord mathnormal\">i</span><span class=\"mord mathnormal\">s</span><span class=\"mord mathnormal\">h</span><span class=\"mclose\">⟩</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">500∣</span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\">re</span><span class=\"mord mathnormal\">n</span><span class=\"mord mathnormal\">c</span><span class=\"mord mathnormal\">h</span><span class=\"mclose\">⟩</span></span></span></span>.</p>\n<p>This seems to be necessary for the EM category.  This leads to unimodal distributions for an EM category based on the distribution monad, and I have no idea if that works.  The data category, into which we need to find a functor from the EM category is going to have to be the Kleisli category of the standard distribution monad because the archaeological digs have to be able to come up with multimodal distributions.  I'm stuck here for now.</p>",
        "id": 440776453,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1716787883
    }
]