[
    {
        "content": "<p>There hasn't been much attempt to use this channel as a community forum. Possibly \"community\" posts like this ought to be on a different channel than the usual ones talking about technical questions. Anyway, I just wrote something on Twitter that I'd like to also copy here in the hope of starting a <del>fight</del> intelligent conversation. Copy of that thread follows:</p>\n<p>A lot of applied category theorists are in for a bit of a shock when they encounter actual real world problems</p>\n<p>Real world problems tend to contain nasty complicating factors that can’t be handled in a nice way - but all different to each other</p>\n<p>Open games are pretty broad in the kind of problems they could in principle be applied to, but even so, problems that they can actually be applied to with only reasonable amounts of hackery are like gold dust. Nasty complicating factors are the norm, not the exception</p>\n<p>Converting your fully worked out ACT idea into an actual functioning application is at least as hard as working that idea out in theory - and for me at least as fun too - and it requires an almost completely disjoint skill set as a researcher</p>\n<p>This had better be considered just as much part of the field of applied category theory if it’s not going to be a failure. So far there’s been a negligible amount of representation of this half at ACT events. We had industry talks but they do generalities, we need serious details</p>\n<p>Most applied category theorists are humble enough to admit that categorical methods can’t do everything. But if you stop at that point, then you never actually solve problems. You need to accept the limits of categorical methods, then keep going anyway with other methods</p>",
        "id": 227774911,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614263275
    },
    {
        "content": "<p>Isn't the remaining hackery for someone else to do implicitly though, as with all theoretical CS? The quantum information people don't worry too much about how qubits are physically realised; the programming languages people don't make production-ready software libraries, only tech demos (if even then); the verification people come up with nice new techniques but it would be a far cry for them to be implemented in state-of-the-art model checkers by the same people. Unless I'm misunderstanding what you mean. Should the A in ACT be taken so literally?</p>",
        "id": 227777321,
        "sender_full_name": "Nick Hu",
        "timestamp": 1614264170
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227777321\">said</a>:</p>\n<blockquote>\n<p>The quantum information people don't worry too much about how qubits are physically realised</p>\n</blockquote>\n<p>I don't think this is the case... although there's enough CQM people on this channel who know better than either of us</p>",
        "id": 227777626,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614264292
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227777321\">said</a>:</p>\n<blockquote>\n<p>Isn't the remaining hackery for someone else to do implicitly though</p>\n</blockquote>\n<p>Obviously every individual researcher works on whatever they want, in the end. But it's my opinion that if too many people do this then ACT will be a failure</p>",
        "id": 227777864,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614264371
    },
    {
        "content": "<p>The problem is that these two \"halves\" can't be done disjointly. You need massive amounts of communication both ways, which is very hard. It's easier when one person can do both</p>",
        "id": 227778347,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614264567
    },
    {
        "content": "<p>I'd worry that in particular because ACT is so obviously cross-field, the application part is better suited to a domain specialist than a category theorist who knows a bit of application. Like the difference between knowing lots of PL theory versus software engineering - the skillsets might be related but they aren't the same, and when you look at most software written by academics that fact is amplified</p>",
        "id": 227778392,
        "sender_full_name": "Nick Hu",
        "timestamp": 1614264587
    },
    {
        "content": "<p>I guess it depends what one means by ‘applied’. Is the theory of PDEs ‘applied analysis’ or does one have to go even further to numerical analysis of PDEs for it to really be ‘applied’?</p>",
        "id": 227782937,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614266238
    },
    {
        "content": "<p>One perspective is that the goal of applied category theory is not to make useful applications, but instead to clarify and understand the basic principles which underly various applied subjects.</p>",
        "id": 227784894,
        "sender_full_name": "Jade Master",
        "timestamp": 1614266893
    },
    {
        "content": "<p>The perspective <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> mentions above is my perspective on this. I think it's irresponsible to promise that category theory is going to make the day to day work in a given field easier.</p>",
        "id": 227787223,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614267779
    },
    {
        "content": "<p>If there are gains in that direction they're probably going to be the \"point of view is worth 60 IQ points\" kind.</p>",
        "id": 227787412,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614267844
    },
    {
        "content": "<p>... and I don't think we can really promise that, although it seems to happen reasonably often.</p>",
        "id": 227787467,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614267864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276037\">Jade Master</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227784894\">said</a>:</p>\n<blockquote>\n<p>One perspective is that the goal of applied category theory is not to make useful applications, but instead to clarify and understand the basic principles which underly various applied subjects.</p>\n</blockquote>\n<p>I like this perspective, but it's a hard sell to those who think their subject of interest was doing just fine before.  This might be easier to explain with the following:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227777321\">said</a>:</p>\n<blockquote>\n<p>Isn't the remaining hackery for someone else to do implicitly though</p>\n</blockquote>\n<p>This only works if this someone else exists. If we are trying to bring new methods/povs to a field that isn't already interested in CT, then chances are that this \"someone else\" doesn't exist unless we first demonstrate the value  of our tools (in ways the practicioners can themselves appreciate).</p>",
        "id": 227787973,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614268064
    },
    {
        "content": "<p>Well there won’t be direct applications immediately but anything which clarifies basic principles should inevitably lead to new developments.</p>",
        "id": 227788086,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614268091
    },
    {
        "content": "<p>Well, given that there are fields where people tried to write categorically in the past and then such approaches fizzled down (or more currently, people are writing with a categorical pov but face no takers), I'd say that the theorists having an impression that something has been clarified doesn't inevitably lead to anything.</p>",
        "id": 227788636,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614268274
    },
    {
        "content": "<p>At the very least you need to convince a practicioner that something has been clarified</p>",
        "id": 227789025,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614268390
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227789025\">said</a>:</p>\n<blockquote>\n<p>At the very least you need to convince a practicioner that something has been clarified</p>\n</blockquote>\n<p>I think this is really the core issue. Sometimes categorifying something just makes it more complicated.</p>",
        "id": 227789175,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614268448
    },
    {
        "content": "<p>I think that we need to \"turn the handle\", yes, but when we are done turning the handle we need to look really hard at what comes out of our machinery. Is it actually telling us anything in this case? What exactly? How can we make it <em>simple</em>?</p>",
        "id": 227789400,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614268533
    },
    {
        "content": "<p>But whenever any family of concepts is unified under some abstract framework, there is front loading of work</p>",
        "id": 227789567,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614268589
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227789567\">said</a>:</p>\n<blockquote>\n<p>But whenever any family of concepts is unified under some abstract framework, there is front loading of work</p>\n</blockquote>\n<p>What I'm saying is that sometimes we frontload the wrong work.</p>",
        "id": 227789692,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614268641
    },
    {
        "content": "<p>The cash out only comes when that abstract framework is understood. Then one can go and apply it to various previously disconnected things.</p>",
        "id": 227789706,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614268647
    },
    {
        "content": "<p>Allow me to clarify: I think pure mathematics is a valuable activity.</p>",
        "id": 227789858,
        "sender_full_name": "Chad Nester",
        "timestamp": 1614268697
    },
    {
        "content": "<p>I agree there is value in this (that's why I'm in CT), but those who don't buy this need to see some cashing out happening first before they learn a field they perceive as esoteric &amp; useless</p>",
        "id": 227790029,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614268762
    },
    {
        "content": "<p>Like there's the saying about horses and water, but we gotta at least lead them to water and not just gesture in the direction</p>",
        "id": 227790069,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614268775
    },
    {
        "content": "<p>Maybe these kinds of developments are not for those older specialists anyway. Perhaps the benefit will be that newcomers will build intuition directly with the new ways.</p>",
        "id": 227790328,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614268842
    },
    {
        "content": "<p>New ways of thinking often require a kind of naivety which you won’t really find in experts.</p>",
        "id": 227790697,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614268945
    },
    {
        "content": "<p>That's indeed one very important mechanism and shouldn't be discounted. That said, given that the revolution doesn't inevitably follow once  a paper (or even a book) has appeared discussing both CT and some field X, one shouldn't count on this being automatic.</p>",
        "id": 227791089,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614269074
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227774911\">said</a>:</p>\n<blockquote>\n<p>Anyway, I just wrote something on Twitter that I'd like to also copy here in the hope of starting a <del>fight</del> intelligent conversation</p>\n</blockquote>\n<p>Mission accomplished <img alt=\":grothendieck:\" class=\"emoji\" src=\"https://zulip-avatars.s3.amazonaws.com/21317/emoji/images/19128.jpg\" title=\"grothendieck\"></p>",
        "id": 227791616,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614269243
    },
    {
        "content": "<p>So it actually looks like I'm more optimistic than most. Or maybe optimistic isn't the right word... I'm more <em>aggressive</em> than most at trying to get a bigger result. Ultimately what it comes down to is that I <em>enjoy</em> doing the other kind of research</p>",
        "id": 227791856,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614269342
    },
    {
        "content": "<p>To me (and this is also entirely subjective and it's definitely not my intention to hate on anyone), <em>doing</em> ACT in the sense of formulating some problem domain as a category is super enjoyable as a process, but \"clarification\" as an end result is kinda boring</p>",
        "id": 227792794,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614269686
    },
    {
        "content": "<p>I guess a good test case for whether clarity was actually achieved was whether you can do with ease something that was difficult to do before</p>",
        "id": 227792953,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614269748
    },
    {
        "content": "<p>an easy case is streamlining known results/methods, a harder case is doing something flat-out new</p>",
        "id": 227793061,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614269775
    },
    {
        "content": "<p>Arguably by then you've gone beyond \"mere\" clarifying, because you have a <em>method</em></p>",
        "id": 227793147,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614269810
    },
    {
        "content": "<p>It probably comes down to whether the \"something\" that went from difficult to easy is something that it's <em>useful</em> to be able to do more easily (and the exactly meaning of \"useful\" is probably a big point of debate just by itself)</p>",
        "id": 227793268,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614269863
    },
    {
        "content": "<p>To the people who think ACT should just be theory, what would you want to call the work of people who figure out how to use it explicitly for domain applications?  \"Applied ACT\"?  \"ACT for X\"?</p>\n<p>I also think that these people underestimate the years of contact required with people who understand category theory in order to apply CT to a domain in a way that makes sense and is helpful.  How will these people get these years of contact if they are not considered part of the ACT community?</p>",
        "id": 227793696,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614270007
    },
    {
        "content": "<p>This looks like the question that I should have asked!</p>",
        "id": 227794002,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614270125
    },
    {
        "content": "<p>As a group we don't talk explicitly enough about the basic fact that interdisciplinary research of all kinds is <em>really really hard</em></p>",
        "id": 227794263,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614270176
    },
    {
        "content": "<p>The name \"applied applied category theory\" does get thrown around sometimes, which I think is a <em>terrible</em> name for multiple reasons</p>",
        "id": 227794640,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614270255
    },
    {
        "content": "<p>I don't like carefully defining the borders between fields, e.g. defining the difference between \"category theory\" and \"applied category theory\", or \"applied applied category theory\".  I've never understood why people are so interested in defining fields of study.   I guess there are practical reasons for doing it, but some people seem to actually <em>enjoy</em> it, or <em>need</em> it for their mental equilibrium.</p>\n<p>I'm always trying to soften the borders between fields, in order to increase communication between people.   The \"ACT community\" is a useful construct if it helps people meet, learn new ideas and work together to solve problems.  It becomes a less useful construct when it starts walling itself off, e.g. by saying \"ACT is not about X\".</p>",
        "id": 227794735,
        "sender_full_name": "John Baez",
        "timestamp": 1614270304
    },
    {
        "content": "<p>Yeah I think I've met some people who were skeptical of ACT because they were worried that making it into its own thing would lead to people exclusively talking to each other rather than working with the wider world</p>",
        "id": 227795359,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614270520
    },
    {
        "content": "<p>The real question isn't to arbitrarily name and delineate subfields. It's the one that <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> said: how to be more welcoming as a field towards the people who are spending most of their time engaging with the messy details of an application and only a bit of it doing category theory, at a time when most (but not all) people who call themselves ACTists are not doing that</p>",
        "id": 227795433,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614270549
    },
    {
        "content": "<p>This is a very interesting conversation. I think my perspective is that the 'A' in 'ACT' is really misleading. The relation 'applied to' is not a function, and it's not even acyclic. You can 'apply' a concept ten times before really arriving to something you might consider 'concrete'.<br>\nSo in this broad sense (which is what I sorta always thought myself, I now realize), ACT is <em>using categorical language in someone else's backyard</em>. That backyard can be a theoretical field itself, and a lot of very nice work is happening along this lines (see work on Petri nets, topos theory for quantum mechanics, categorical probability theory, etc.)<br>\nSo Jules I think your call is justified, but I won't look scoldingly (which you probably didn't imply) on people who don't care about going all the way to 'touchdown' and get their hands dirty.<br>\nAlso, as said above, I think it's rather naive to imagine categorical methods will ever be <em>directly</em> applied to a concrete problem, in the sense that very little math is ever directly applied in this sense. CT provides great scaffolding for thought, which pays dividends in applications. I look forward to have CT taught to young scientists, engineers, and whatnot because that's how the models they're going to study should be formulated, not because they're going to take limits of functors 'in the wild'. This is the same reason we teach people the language of sets, or complex numbers, or even Arabic numerals: they're useful language to talk about useful stuff.</p>",
        "id": 227796322,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614270880
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227795433\">said</a>:</p>\n<blockquote>\n<p>The real question isn't to arbitrarily name and delineate subfields. It's the one that <span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> said: how to be more welcoming as a field towards the people who are spending most of their time engaging with the messy details of an application and only a bit of it doing category theory, at a time when most (but not all) people who call themselves ACTists are not doing that</p>\n</blockquote>\n<p>Are we <em>unwelcoming</em> right now? My guess is that there's simply not a lot of categorical literate people out there which are doing something else.</p>",
        "id": 227796583,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614270992
    },
    {
        "content": "<p>I think the best way to see our work applied and have people tell us concrete stories about dirty problems in ACT20xx is to teach CT to people who are going to work somewhere else. Biologists, chemists, physicists, engineers, economists.</p>",
        "id": 227796853,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614271090
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227796583\">said</a>:</p>\n<blockquote>\n<p>Are we <em>unwelcoming</em> right now? My guess is that there's simply not a lot of categorical literate people out there which are doing something else.</p>\n</blockquote>\n<p>I don't think so if you say it as directly as that (although it's not our place to judge!)</p>",
        "id": 227796856,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614271091
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227796856\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227796583\">said</a>:</p>\n<blockquote>\n<p>Are we <em>unwelcoming</em> right now? My guess is that there's simply not a lot of categorical literate people out there which are doing something else.</p>\n</blockquote>\n<p>I don't think so if you say it as directly as that (although it's not our place to judge!)</p>\n</blockquote>\n<p>Right, it looks a bit too harsh indeed <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> What I wanted to say is more peacefully expressed in the second message.</p>",
        "id": 227797093,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614271196
    },
    {
        "content": "<p>But, look for example at the accepted talks at the ACT conferences. The vast majority are on the theoretical side, from my perspective. For sure the main reason is just that there isn't much research even happening on the more-applied side. But I do worry that, for example, there could have been talks rejected on grounds like being \"not sufficiently categorical\". (I don't have any idea whether this has actually happened)</p>",
        "id": 227797174,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614271208
    },
    {
        "content": "<p>If that's case, I'd be disappointed too, yes</p>",
        "id": 227797256,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614271237
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227795433\">said</a>:</p>\n<blockquote>\n<p>The real question isn't to arbitrarily name and delineate subfields. It's the one that <span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> said: how to be more welcoming as a field towards the people who are spending most of their time engaging with the messy details of an application and only a bit of it doing category theory, at a time when most (but not all) people who call themselves ACTists are not doing that</p>\n</blockquote>\n<p>I agree that we should be welcoming to people who really want to get into the messy details of applications, but I'm curious why you think \"most (but not all) people who call themselves ACTists are not doing that\".   I kinda wish you'd name names here instead of broadly complaining about \"most (but not all)\" of us.  But that might turn up the temperature of the conversation too high.  </p>\n<p>So, maybe you could just say more about <em>how</em> ACTists should be more welcoming and why they (we?) are not.   </p>\n<p>For example, is talking a lot about fancy math \"not welcoming\"?   I can see why it might be off-putting, but I'm afraid I'm never gonna stop doing  <em>that</em>.</p>",
        "id": 227797416,
        "sender_full_name": "John Baez",
        "timestamp": 1614271317
    },
    {
        "content": "<p>I guess if I had an answer to the \"how\" I would have just said it at the start</p>",
        "id": 227797590,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614271390
    },
    {
        "content": "<p>Doing CT workshops for non-CT people could be a way to welcome people, although a tendentious one</p>",
        "id": 227797918,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1614271533
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227797174\">said</a>:</p>\n<blockquote>\n<p>But, look for example at the accepted talks at the ACT conferences. The vast majority are on the theoretical side, from my perspective. For sure the main reason is just that there isn't much research even happening on the more-applied side. But I do worry that, for example, there could have been talks rejected on grounds like being \"not sufficiently categorical\". (I don't have any idea whether this has actually happened)</p>\n</blockquote>\n<p>I don't think you should worry about this too much.   From what I saw in ACT2019 and ACT2020, the few talks that were rejected were mainly from people who were either utterly crazy or using category theory to do not much at all.   I don't recall rejected talks that, say, solved an interesting practical problem using a whole bunch of tricks including a little category theory.</p>",
        "id": 227798101,
        "sender_full_name": "John Baez",
        "timestamp": 1614271585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227797590\">said</a>:</p>\n<blockquote>\n<p>I guess if I had an answer to the \"how\" I would have just said it at the start</p>\n</blockquote>\n<p>Well, then just say in which way you think some unnamed people are being unwelcoming.</p>",
        "id": 227798300,
        "sender_full_name": "John Baez",
        "timestamp": 1614271667
    },
    {
        "content": "<p>I think this is almost the same as saying how they could be more welcoming: <em>see that thing you're doing?  stop doing that!</em></p>",
        "id": 227798430,
        "sender_full_name": "John Baez",
        "timestamp": 1614271707
    },
    {
        "content": "<p>You're worried that someone is being unwelcoming, but you're not saying why you think this.</p>",
        "id": 227798683,
        "sender_full_name": "John Baez",
        "timestamp": 1614271806
    },
    {
        "content": "<p>Or maybe this \"unwelcoming\" business was not your main point, in which case maybe I should drop it.</p>",
        "id": 227798829,
        "sender_full_name": "John Baez",
        "timestamp": 1614271866
    },
    {
        "content": "<p>I completely agree with everything you said about how hard it is to actually go from category theory to something very concrete and practical.  I think typically there needs to be a long chain of people talking to other people, not one person doing it all, or even two (a category theorist and a \"practitioner\").</p>",
        "id": 227799082,
        "sender_full_name": "John Baez",
        "timestamp": 1614271959
    },
    {
        "content": "<p>I thought the main point was a call for doing more convincing applications</p>",
        "id": 227799089,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614271963
    },
    {
        "content": "<p>Here's the concrete recommendation in the OP:</p>\n<blockquote>\n<p>This had better be considered just as much part of the field of applied category theory if it’s not going to be a failure. So far there’s been a negligible amount of representation of this half at ACT events. We had industry talks but they do generalities, we need serious details</p>\n</blockquote>",
        "id": 227799096,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614271966
    },
    {
        "content": "<p>So</p>\n<p>1: consider \"applied ACT\" part of ACT.</p>\n<p>2: represent this part of ACT at conferences</p>",
        "id": 227799243,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614272032
    },
    {
        "content": "<p>I think the \"unwelcoming\" thing is just one speculation as to why 2 isn't happening</p>",
        "id": 227799434,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614272094
    },
    {
        "content": "<ol>\n<li>\n<p>Who is actually doing this \"applied ACT\" and what are they doing?</p>\n</li>\n<li>\n<p>Once we know, the ACT conferences would be glad to have talks by such people.</p>\n</li>\n</ol>",
        "id": 227799537,
        "sender_full_name": "John Baez",
        "timestamp": 1614272128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>, why do you think we don't know?  Because there is nobody doing it or some other reason?  If because there is nobody doing it, then why is nobody doing it?</p>",
        "id": 227799761,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614272206
    },
    {
        "content": "<p>Jules is the one who seems to think there's some \"applied ACT\" work hiding in the hills out there, which the ACT conferences have neglected.</p>",
        "id": 227799887,
        "sender_full_name": "John Baez",
        "timestamp": 1614272256
    },
    {
        "content": "<p>So then you think we don't know because there is nobody doing it?</p>",
        "id": 227799942,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614272280
    },
    {
        "content": "<p>Well, I'll go this far: if something doesn't exist, that would explain why we don't know about it.</p>",
        "id": 227800117,
        "sender_full_name": "John Baez",
        "timestamp": 1614272339
    },
    {
        "content": "<p>Well it would be the beginning of an explanation.  The explanation then would have to go on to say why something doesn't exist.</p>",
        "id": 227800211,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614272374
    },
    {
        "content": "<p>I've always considered \"ACT\" its own thing distinct of \"applied category theory\", because to me it seems to be about various flavours of monoidal category theory and their gadgets. Are the people who are doing categorical semantics or coalgebra not doing 'applied' category theory? I think they are, and they seem to have their own distinct communities.</p>",
        "id": 227800798,
        "sender_full_name": "Nick Hu",
        "timestamp": 1614272583
    },
    {
        "content": "<p>I think the question about the precise boundaries of the \"field\" ACT disappears if you change the word to what I think it really is. ACT is a research community. If people doing different stuff are involved in conversations, they're obviously in the community.</p>",
        "id": 227801148,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614272703
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> - I've been helping organize all the ACT conferences so far, and I think all the organizers are really eager to have \"really applied\" talks, and I think there have been a few such talks - I could list some if I go over the old conference programs to refresh my memory.  But there haven't been many.  I think that's because ACT as a field is very new... </p>\n<p>except for category theory as applied to theoretical computer science, which has its own conference series, full of talks... </p>\n<p>and category theory applied to mathematical physics, which has its  own conference series, full of talks...</p>\n<p>and category theory applied to quantum computation,  which has its  own conference series, full of talks...</p>\n<p>Perhaps ACT is sort of all the applications of category theory that haven't worked very well yet!</p>",
        "id": 227801485,
        "sender_full_name": "John Baez",
        "timestamp": 1614272824
    },
    {
        "content": "<p>I know this has been discussed before at past organizational meetings, but I'll bring it up again. Maybe the ACT conferences should specifically make room for talks that are not actually about research which utilized CT in some way, but are actually talks from domain people about their domain, and about they ways they think maybe somehow CT could possibly get in the game. I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.</p>",
        "id": 227801544,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614272847
    },
    {
        "content": "<p>\"I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.\"  I don't think this is necessarily the best way to understand what ACT is from on outside perspective.  It would be easy to see a bunch of ACT talks and get the impression that this is just another formalism of the same sort that someone is used to.  It wouldn't necessarily convey that it is an entire way of thinking.  I think a better way for someone outside the field to understand what it is so that they could talk about \"ways they think maybe somehow CT could possibly get in the game\" would be to read something like the <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.1249.pdf\">NIST report</a> which explains what benefits ACT can bring to a field from a high-level perspective.  Hopefully more such material can be written</p>",
        "id": 227802359,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614273144
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227787973\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227777321\">said</a>:</p>\n<blockquote>\n<p>Isn't the remaining hackery for someone else to do implicitly though</p>\n</blockquote>\n<p>This only works if this someone else exists. If we are trying to bring new methods/povs to a field that isn't already interested in CT, then chances are that this \"someone else\" doesn't exist unless we first demonstrate the value  of our tools (in ways the practitioners can themselves appreciate).</p>\n</blockquote>\n<p>I was having a conversation with <span class=\"user-mention\" data-user-id=\"306459\">@Joshua Wrigley</span> and <span class=\"user-mention\" data-user-id=\"284376\">@Riccardo Zanfa</span> about this earlier today. A researcher doing some research and publishing it with aspirational excuses of the form \"this could be applied in domain X to solve problem Y!\" are worthless unless the same researcher either goes some way towards solving problem Y or they manage to convince some researchers in domain X to take the time to absorb and apply their work. Otherwise the inertial barrier of entry for researchers in domain X to understanding the new theory will outweigh the speculative benefits that theory could bring. I reckon a lot of potentially valuable work falls into obscurity in this way.</p>",
        "id": 227802879,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1614273350
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227794640\">said</a>:</p>\n<blockquote>\n<p>The name \"applied applied category theory\" does get thrown around sometimes, which I think is a <em>terrible</em> name for multiple reasons</p>\n</blockquote>\n<p>Have you considered studying the <em>reasons</em> it's a bad name? This could be the beginning of the field of \"applied applied category theory theory\"! <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 227803141,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1614273456
    },
    {
        "content": "<p>Here's something everyone can do:  consider a continuum from the most applied to the most theoretical.  Consider your location on this continuum.  Now be a liaison between those to your left and those to your right.</p>",
        "id": 227803256,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614273499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> , to answer you question with my personal experience, every time I tried to do something really applied and tried to spin it in the ACT community I have been either rejected or turned down. Is it possible that my work was bad? For sure, but in general I think that the overwhelming majority of people in ACT doesn't want to see all the nitty-gritty details that pop up in a real application. I think this is due to two reasons:</p>\n<ul>\n<li>It really requires to go out of one's comfort zone, like seriously. And many people don't like that.</li>\n<li>If the only applications in your fields are toy models, meeting an acceptable standard of research is easier.</li>\n</ul>\n<p>My personal approach now is to publish any result that is really applied to journals in those fields, and bypassing the ACT community altogether.</p>",
        "id": 227803456,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273588
    },
    {
        "content": "<p>Also, the industry talks are honestly a bit of a joke. I had the distinct feeling that the only reason why we have them around is that we want to be able to say that we collaborate with industry. Very few people seem actually interested to understand what does it take to turn an idea into something viable and sellable. Which is fine I guess, to each their own research domain.</p>",
        "id": 227803648,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273667
    },
    {
        "content": "<blockquote>\n<p>My personal approach now is to publish any result that is really applied to journals in those fields, and bypassing the ACT community altogether.</p>\n</blockquote>\n<p>This seems like the best approach, because then your work will be seen by the people to whom it should matter the most (assuming you are interested in concrete applications).</p>",
        "id": 227803725,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614273695
    },
    {
        "content": "<p>Well, I consider it a disgrace and a huge defeat for this community, but in practice it is the only one that works.</p>",
        "id": 227803818,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273726
    },
    {
        "content": "<p>I said it multiple times, but, for instance, in my experience the best way to have a publicaton rejected from the ACT conference is to actually include some real code in your paper, instead of just saying that \"this can be turned into code.\" <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 227803952,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273789
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227803818\">said</a>:</p>\n<blockquote>\n<p>Well, I consider it a disgrace and a huge defeat for this community, but in practice it is the only one that works.</p>\n</blockquote>\n<p>But otherwise, are you expecting ACT proceedings/conferences to involve literally every field to which category theory might be applied? That doesn't seem feasible.</p>",
        "id": 227804004,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614273813
    },
    {
        "content": "<p>No, my expectation is that when real applications start to be developed from an ACT subfield, that subfield goes its own way, with its own conference venues etc.</p>",
        "id": 227804161,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273867
    },
    {
        "content": "<p>At that point, the ACT \"main conference/venue and such\" will serve the purpose of keeping everyone updated about what's happening in each subfield</p>",
        "id": 227804266,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273910
    },
    {
        "content": "<p>In that case, what's the issue with having to publish in the venues of the target field rather than in ACT? Like shouldn't that be the end-game anyway, and ACT is there to help with that process?</p>",
        "id": 227804372,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614273956
    },
    {
        "content": "<p>No, because in real life you end up in a limbo: Your stuff is too detailed/applied for act, and still not useful enough for applications.</p>",
        "id": 227804496,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614273992
    },
    {
        "content": "<p>So you get nowhere to do, and the research you can do is just toy models.</p>",
        "id": 227804536,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274008
    },
    {
        "content": "<p>I would have thought the ACT community would be focused on developing (abstract and concrete) tools that are useful for applying category theory to various domains. But the research produced using such tools would be relevant specifically to the communities in the domains themselves.</p>",
        "id": 227804565,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614274020
    },
    {
        "content": "<p>Meaning there are two aspects of research: making it easier to apply category theory, and actually applying category theory.</p>",
        "id": 227804649,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614274061
    },
    {
        "content": "<p>If I'm a researcher interested in domain X, I don't see that I would necessarily care so much about applications of CT to domain Y (other than being happy that ACT was useful to domain Y). But I would be interested in the techniques used in that research that could be generally applied.</p>",
        "id": 227804826,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614274127
    },
    {
        "content": "<p>This is the problem that any interdisciplinary researcher faces, it is not specific to ACT.  An individual solution is to write two versions of every paper, for each of the two fields you are between. An societal solution would involve laying off some of the pressure on researchers, as interdisciplinary work takes longer to come to fruition per unit effort, and also takes longer for people in just one of the fields you are between to understand</p>",
        "id": 227804882,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614274151
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227804826\">said</a>:</p>\n<blockquote>\n<p>If I'm a researcher interested in domain X, I don't see that I would necessarily care so much about applications of CT to domain Y (other than being happy that ACT was useful to domain Y). But I would be interested in the techniques used in that research that could be generally applied.</p>\n</blockquote>\n<p>Again, this is very far from the reality of things. Let me give you a very simple example. There are quite a lot of people doing research in artificial intelligence using categorical methods here. 90% of this research is nowhere near to be publishable in a specialized AI venue. Why? Well, they care about data, complexity studies, how your model outperforms other models etc. They do not care too much about having a conceptual breakthrough until your conceptual breakthrough is provable via some standard testing.</p>",
        "id": 227805174,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274260
    },
    {
        "content": "<p>The result is that there is a very well define time in your career, that can last months, or even years, where basically no one wants the stuff you do.</p>",
        "id": 227805236,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274284
    },
    {
        "content": "<p>Not only this is not nice, I think this is bad for science as a whole. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 227805274,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274305
    },
    {
        "content": "<p>It's the same thing with cryptography, and a lot of other stuff. The point is that if you say \"category theory can make things better in this field\" then it should be the responsibility of applied category theorists to persist until this claim results convincing to outsiders.</p>",
        "id": 227805483,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274380
    },
    {
        "content": "<p>Instead, the approach of the community seems to be \"well, for us a toy model can do, and then good luck convincing everyone else\"</p>",
        "id": 227805563,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274414
    },
    {
        "content": "<p>This was also the situation categorical quamtum mechanics was in for years. But they persisted, the community fostered real applications of CQM, and only now, after -&gt; many &lt;- years we see talks about ZX calculus and such presented at quantum machine learning venues and whatnot. This wouldn't have been possible -&gt; at all &lt;- if QPL wasn't as open and welcoming as it has been up to now.</p>",
        "id": 227805851,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274505
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227805483\">said</a>:</p>\n<blockquote>\n<p>The point is that if you say \"category theory can make things better in this field\" then it should be the responsibility of applied category theorists to persist until this claim results convincing to outsiders.</p>\n</blockquote>\n<p>I can't speak for what did or didn't get accepted at ACT (there's two conflicting descriptions of it in the thread already), but I think the thread so far is full of people agreeing with this.</p>",
        "id": 227805978,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614274551
    },
    {
        "content": "<p>But your point about needing a safe haven until you get actually applicable is good</p>",
        "id": 227806138,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614274601
    },
    {
        "content": "<p>Well, I know it is. I have been unbelievably depressed for most of 2019-2020 also for this reason. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 227806220,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274631
    },
    {
        "content": "<p>Yes, this is the kind of thing I meant by \"developing (abstract and concrete) tools that are useful for applying category theory to various domains\". That is, the work that is not ready to be applied directly to the domain, but preparatory research to that end.</p>",
        "id": 227806278,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614274656
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227801544\">said</a>:</p>\n<blockquote>\n<p>I know this has been discussed before at past organizational meetings, but I'll bring it up again. Maybe the ACT conferences should specifically make room for talks that are not actually about research which utilized CT in some way, but are actually talks from domain people about their domain, and about they ways they think maybe somehow CT could possibly get in the game. I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.</p>\n</blockquote>\n<p>I think trying to foster interactions like this is a great idea.  The big annual ACT conference is probably not the best time to do it: everyone is busy listening to dozens of talks, and - if it happens in person - trying to meet and talk to all their old friends.   So, everyone is too distracted to really focus on a brand new domain of knowledge.   I think it might work better to have a specialized workshop on \"Category Theory and X\", with a smaller number of people, including an expert on X who gives lectures mainly on X, and category theorists interested in X - who ideally already know a bit about X.   If it lasted for a week and focused on this one subject, people might get some good ideas.</p>",
        "id": 227806327,
        "sender_full_name": "John Baez",
        "timestamp": 1614274678
    },
    {
        "content": "<p>(BTW I was able to cope with my depression by deciding that I do not give a flying fuck about applications, I just started doing Petri nets again xD)</p>",
        "id": 227806357,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span> do you have issues with specific people or with the \"community\" as a whole?  If you have issues with specific people have you reached out to them?  If you have reached out to them were you able to successfully communicate your issues to them?</p>",
        "id": 227806738,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614274821
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227806357\">said</a>:</p>\n<blockquote>\n<p>(BTW I was able to cope with my depression by deciding that I do not give a flying fuck about applications, I just started doing Petri nets again xD)</p>\n</blockquote>\n<p>Isn't that why we pick category theory in the first place? <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 227806741,
        "sender_full_name": "Nick Hu",
        "timestamp": 1614274821
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227806738\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> do you have issues with specific people or with the \"community\" as a whole?  If you have issues with specific people have you reached out to them?  If you have reached out to them were you able to successfully communicate your issues to them?</p>\n</blockquote>\n<p>No, I don't have issues with specific people. I just came to realize that real applications are unwelcomed here, and that me working in that direction and trying to publish said applications in our venues was the perfect recipe to feel like a failed researcher</p>",
        "id": 227806958,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274916
    },
    {
        "content": "<p>So I always smile a bit when I read this kind of discussions, because my perception about what is the state of affairs is very clear xD</p>",
        "id": 227807102,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614274957
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280859\">Nick Hu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227806741\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227806357\">said</a>:</p>\n<blockquote>\n<p>(BTW I was able to cope with my depression by deciding that I do not give a flying fuck about applications, I just started doing Petri nets again xD)</p>\n</blockquote>\n<p>Isn't that why we pick category theory in the first place? <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n</blockquote>\n<p>No I'm one of those freaks that really wanted to take the \"A\" in \"ACT\" seriously xD</p>",
        "id": 227807238,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1614275002
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227802359\">said</a>:</p>\n<blockquote>\n<p>\"I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.\"  I don't think this is necessarily the best way to understand what ACT is from on outside perspective.  It would be easy to see a bunch of ACT talks and get the impression that this is just another formalism of the same sort that someone is used to.  It wouldn't necessarily convey that it is an entire way of thinking.  I think a better way for someone outside the field to understand what it is so that they could talk about \"ways they think maybe somehow CT could possibly get in the game\" would be to read something like the <a href=\"https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.1249.pdf\">NIST report</a> which explains what benefits ACT can bring to a field from a high-level perspective.  Hopefully more such material can be written</p>\n</blockquote>\n<p>I wasn't thinking of it being strictly for the benefit of the speaker learning CT. I was thinking it could be a way of going out of our way to include domain specialists. These talks could be by invitation as well.</p>",
        "id": 227807609,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614275125
    },
    {
        "content": "<p>I wasn't claiming otherwise.  I was just replying to \"I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.\"  I think that if the speaker's only exposure to ACT is technical ACT talks, they won't be able to speak very well on \"ways they think maybe somehow CT could possibly get in the game\" in their field.</p>",
        "id": 227807861,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614275212
    },
    {
        "content": "<p>Hmmm there are people doing CT btw in other fields but hide it. As in they use categorical results but don't explicitly call out this community (including Ames that everyone knows, Tabuada, Topcu from my field). I have always wondered why that is.</p>",
        "id": 227808453,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1614275451
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227807861\">said</a>:</p>\n<blockquote>\n<p>I wasn't claiming otherwise.  I was just replying to \"I'm thinking the speaker is someone who may have heard some talks from ACT people, but they don't strictly \"know\" any category theory themselves.\"  I think that if the speaker's only exposure to ACT is technical ACT talks, they won't be able to speak very well on \"ways they think maybe somehow CT could possibly get in the game\" in their field.</p>\n</blockquote>\n<p>Oh, I see now. Ok, well it doesn't matter as much how they came across CT. I was just imagining one possibility for such a person. I like John's suggestion though. Invite a few domain people who may be interested in CT, Invite CTists interested in domain. Talk to each other for a week.</p>",
        "id": 227809256,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614275837
    },
    {
        "content": "<p>Here's another suggestion.  Maybe we should have a couple invited longer talks at the annual ACT conference describing \"case studies\" of more-or-less <em>successfully completed</em> applications of category theory.  I think they'd need to be long to explain:</p>\n<p>a) the problem being solved, which is some problem outside category theory and thus not well-understood by most of the audience,<br>\nb) how they tried to apply category theory to it,<br>\nc) what challenges came up - what Jules called the \"messy details\",<br>\nd) how these challenges got solved,<br>\ne) what's left to do,<br>\nf) any general lessons learned.</p>\n<p>They might have to be invited, because they'd be different from the other talks.  And the people giving them might have to be coached a little, since it's quite hard to give a good talk like this.   It's easy to sink into too much detail, or not give enough detail, etc.</p>",
        "id": 227814959,
        "sender_full_name": "John Baez",
        "timestamp": 1614278224
    },
    {
        "content": "<p>Sounds like a keynote talk</p>",
        "id": 227815161,
        "sender_full_name": "Nick Hu",
        "timestamp": 1614278301
    },
    {
        "content": "<p>I definitely agree that the lofty rhetoric about category theory and applied category theory does not make the math were doing more accessible to the experts in the subjects we want to reach out to. If they heard us talking about it being a grand language for unifying science technology and math then I bet they just shut off and think \"that's not what I do\"</p>",
        "id": 227815394,
        "sender_full_name": "Jade Master",
        "timestamp": 1614278404
    },
    {
        "content": "<p>I now realize Jules was trying to give a talk sort of like this at the ACT@UCR seminar:</p>\n<ul>\n<li>Jules Hedges, <a href=\"https://math.ucr.edu/home/baez/ACT@UCR/#hedges\">Open games: the long road to practical applications </a>.</li>\n</ul>\n<p>At the time I was a bit frustrated because I was trying to understand some things about open games (which I've never understood very well), and Jules was not really wanting to explain that stuff in much detail.   I see now he was really trying to explain this \"long road to practical applications\" business.  </p>\n<p>If we had some talks at the ACT conference that were explicitly \"case studies\", then we could warn the audience ahead of time that the point of the talk was about the <em>development process</em>, not the details of the math or what it's being applied to.</p>",
        "id": 227815742,
        "sender_full_name": "John Baez",
        "timestamp": 1614278544
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227814959\">said</a>:</p>\n<blockquote>\n<p>Here's another suggestion.  Maybe we should have a couple invited longer talks at the annual ACT conference describing \"case studies\" of more-or-less <em>successfully completed</em> applications of category theory.  I think they'd need to be long to explain:</p>\n<p>a) the problem being solved, which is some problem outside category theory and thus not well-understood by most of the audience,<br>\nb) how they tried to apply category theory to it,<br>\nc) what challenges came up - what Jules called the \"messy details\",<br>\nd) how these challenges got solved,<br>\ne) what's left to do,<br>\nf) any general lessons learned.</p>\n<p>They might have to be invited, because they'd be different from the other talks.  And the people giving them might have to be coached a little, since it's quite hard to give a good talk like this.   It's easy to sink into too much detail, or not give enough detail, etc.</p>\n</blockquote>\n<p>This idea I <em>really</em> like. Institutionally of course it's up to the individual organisers. If it was me it's a no brainer: I'd get someone from Cambridge Quantum Computing to do an hour long talk that begins with interacting bialgebras, and ends with actual running code on an actual quantum computer</p>",
        "id": 227815769,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614278556
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227815742\">said</a>:</p>\n<blockquote>\n<p>I now realize Jules was trying to give a talk sort of like this at the ACT@UCR seminar:</p>\n<ul>\n<li>Jules Hedges, <a href=\"https://math.ucr.edu/home/baez/ACT@UCR/#hedges\">Open games: the long road to practical applications </a>.</li>\n</ul>\n<p>At the time I was a bit frustrated because I was trying to understand some things about open games (which I've never understood very well), and Jules was not really wanting to explain that stuff in much detail.   I see now he was really trying to explain this \"long road to practical applications\" business.  </p>\n<p>If we had some talks at the ACT conference that were explicitly \"case studies\", then we could warn the audience ahead of time that the point of the talk was about the <em>development process</em>, not the details of the math or what it's being applied to.</p>\n</blockquote>\n<p>Yep. And I announced my intention to give exactly that talk on the last day of ACT the year before, in 2019. I've been thinking this stuff for a while now...</p>",
        "id": 227815899,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614278621
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227815311\">said</a>:</p>\n<blockquote>\n<p>Right, this is what I was imagining in my original suggestion, basically.</p>\n</blockquote>\n<p>I thought you were suggesting that an expert in subject X talk about \"the ways they think maybe somehow CT could possibly get in the game\".... i.e. sort of a solicitation for help.  I'm suggesting <em>that</em> sort of thing would work better in a separate week-long workshop devoted to \"Categories in X\".  I'm suggesting that at the big ACT conference we could hear a story about a successful project and how it succeeded.</p>",
        "id": 227816173,
        "sender_full_name": "John Baez",
        "timestamp": 1614278754
    },
    {
        "content": "<p>I deleted that because I realized it was very different from my suggestion.</p>",
        "id": 227816246,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614278775
    },
    {
        "content": "<p>I look up very explicitly to the folks doing ZX calculus at CQC as a model of research that I want to replicate with open games</p>",
        "id": 227816265,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614278784
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227816246\">said</a>:</p>\n<blockquote>\n<p>I deleted that because I realized it was very different from my suggestion.</p>\n</blockquote>\n<p>Okay.  I'll keep my remark because it may help some people come up with ideas about different kinds of talks.</p>",
        "id": 227816342,
        "sender_full_name": "John Baez",
        "timestamp": 1614278827
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227816265\">said</a>:</p>\n<blockquote>\n<p>I look up very explicitly to the folks doing ZX calculus at CQC as a model of research that I want to replicate with open games</p>\n</blockquote>\n<p>Yes.  So one interesting thing is that the ZX calculus, by virtue of being rather successful, has become technical enough that not many people outside that field want to hear lots of talks about it.    At least, not the same talks that the experts want to hear!</p>",
        "id": 227816584,
        "sender_full_name": "John Baez",
        "timestamp": 1614278926
    },
    {
        "content": "<p>So if open games are similarly successful, a similar thing will probably happen with those.</p>\n<p>But I think non-experts could still enjoy \"case studies\" talks about both these topics as long as it was clear that the talk was <em>not</em> explaining <em>the subject</em>, just how the subject developed.</p>",
        "id": 227816689,
        "sender_full_name": "John Baez",
        "timestamp": 1614278968
    },
    {
        "content": "<p>So maybe that should be the next one of these such talks. Get a CQC person to give a big picture talk about this to a general ACT audience.</p>",
        "id": 227816759,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1614278999
    },
    {
        "content": "<p>So, I'm a ZX-calculus researcher and I can tell you why it became succesful in my opinion: we are (mostly) not really interested in the category theory side of it</p>",
        "id": 227816888,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279031
    },
    {
        "content": "<p>The language is specialized and intuitive enough that you don't have to drag category theory to it</p>",
        "id": 227816963,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279061
    },
    {
        "content": "<p>In the terminology I use, category theory for ZX calculus is \"in the basement\"</p>",
        "id": 227817005,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279075
    },
    {
        "content": "<p>Sure, it is a compact closed PROP, but it doesn't really matter</p>",
        "id": 227817016,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279082
    },
    {
        "content": "<p>I don't think it's successful <em>because</em> category theory is not so important.  I think it's successful because it gets the job done.</p>",
        "id": 227817051,
        "sender_full_name": "John Baez",
        "timestamp": 1614279099
    },
    {
        "content": "<p>Or maybe there's some general law saying that as long as the math is actually interesting to mathematicians, it's not being applied yet?</p>",
        "id": 227817146,
        "sender_full_name": "John Baez",
        "timestamp": 1614279130
    },
    {
        "content": "<p>Like, this paper for instance: <a href=\"https://arxiv.org/abs/1902.03178\">https://arxiv.org/abs/1902.03178</a><br>\nYou won't find any category theory in there, but as far as I can tell it contains the first results that were truly new to the quantum computing community, produced using the ZX-calculus\\</p>",
        "id": 227817159,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279133
    },
    {
        "content": "<p>And this paper wouldn't be accepted at ACT I can imagine</p>",
        "id": 227817223,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279159
    },
    {
        "content": "<p>And ZX does sit on top of some stuff that's definitely straight category theory, like saying some functor to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mrow><mi mathvariant=\"bold\">H</mi><mi mathvariant=\"bold\">i</mi><mi mathvariant=\"bold\">l</mi><mi mathvariant=\"bold\">b</mi></mrow><mi mathvariant=\"double-struck\">C</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\mathbf{Hilb}_\\mathbb C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.84444em;vertical-align:-0.15em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbf\">H</span><span class=\"mord mathbf\">i</span><span class=\"mord mathbf\">l</span><span class=\"mord mathbf\">b</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.33222299999999994em;\"><span style=\"top:-2.5500000000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathbb mtight\">C</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> is fully faithful</p>",
        "id": 227817235,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279165
    },
    {
        "content": "<p>Even though it is sort-of applied category theory</p>",
        "id": 227817236,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279166
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227817235\">said</a>:</p>\n<blockquote>\n<p>And ZX does sit on top of some stuff that's definitely straight category theory, like saying some functor to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mrow><mi mathvariant=\"bold\">H</mi><mi mathvariant=\"bold\">i</mi><mi mathvariant=\"bold\">l</mi><mi mathvariant=\"bold\">b</mi></mrow><mi mathvariant=\"double-struck\">C</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\mathbf{Hilb}_\\mathbb C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.84444em;vertical-align:-0.15em;\"></span><span class=\"mord\"><span class=\"mord\"><span class=\"mord mathbf\">H</span><span class=\"mord mathbf\">i</span><span class=\"mord mathbf\">l</span><span class=\"mord mathbf\">b</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.33222299999999994em;\"><span style=\"top:-2.5500000000000003em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathbb mtight\">C</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> is fully faithful</p>\n</blockquote>\n<p>Using that language is how you get rejected from mainstream quantum journals :)</p>",
        "id": 227817288,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279189
    },
    {
        "content": "<p>Right, you don't have to say it, but if it wasn't there then ZX calculus would collapse into a big heap of junk I guess</p>",
        "id": 227817334,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279216
    },
    {
        "content": "<p>I really don't like all these speculations about papers that wouldn't be accepted at ACT, unless they come along with some evidence.  Since I'm helping run ACT, I can actually try to fix problems if I know for sure that they exist.   If I just hear vague speculations, I can't do much.</p>",
        "id": 227817349,
        "sender_full_name": "John Baez",
        "timestamp": 1614279223
    },
    {
        "content": "<p>I don't want people to be scared off from submitting good papers to ACT2021!</p>",
        "id": 227817466,
        "sender_full_name": "John Baez",
        "timestamp": 1614279257
    },
    {
        "content": "<p>Sorry, you're right. I was more thinking that it would feel kinda weird to me to have that paper be accepted at ACT. It would feel out-of-place IMO</p>",
        "id": 227817502,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279277
    },
    {
        "content": "<p>But isn't the main reason that there's a much <em>better</em> place to submit it, for example QPL?</p>",
        "id": 227817684,
        "sender_full_name": "John Baez",
        "timestamp": 1614279324
    },
    {
        "content": "<p>That might be</p>",
        "id": 227817700,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279334
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227816963\">said</a>:</p>\n<blockquote>\n<p>The language is specialized and intuitive enough that you don't have to drag category theory to it</p>\n</blockquote>\n<p>Sure, after the framework has been discovered you can purge/hide most of the CT, but it was historically important to come up with the tool in the first place, no?</p>",
        "id": 227817722,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614279346
    },
    {
        "content": "<p>Yes, definitely</p>",
        "id": 227817747,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279355
    },
    {
        "content": "<p>Of course, at one point, this paper would have been out of place at QPL, but QPL shifted to more practical oriented stuff in the last few yeaers</p>",
        "id": 227817753,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279359
    },
    {
        "content": "<p>A better analogy would probably be to the early years of QPL when it was accepting all the weird misfit stuff...</p>",
        "id": 227817837,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279382
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227817349\">said</a>:</p>\n<blockquote>\n<p>I really don't like all these speculations about papers that wouldn't be accepted at ACT, unless they come along with some evidence.  Since I'm helping run ACT, I can actually try to fix problems if I know for sure that they exist.   If I just hear vague speculations, I can't do much.</p>\n</blockquote>\n<p>Fabrizio may have evidence........</p>",
        "id": 227817872,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279402
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227817722\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227816963\">said</a>:</p>\n<blockquote>\n<p>The language is specialized and intuitive enough that you don't have to drag category theory to it</p>\n</blockquote>\n<p>Sure, after the framework has been discovered you can purge/hide most of the CT, but it was historically important to come up with the tool in the first place, no?</p>\n</blockquote>\n<p>So I asked Bob about this, and he said they weren't thinking about \"composing PROPs\" at all when they first came up with it. Their motivation was MBQC, so something applied</p>",
        "id": 227817874,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279403
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227817722\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227816963\">said</a>:</p>\n<blockquote>\n<p>The language is specialized and intuitive enough that you don't have to drag category theory to it</p>\n</blockquote>\n<p>Sure, after the framework has been discovered you can purge/hide most of the CT, but it was historically important to come up with the tool in the first place, no?</p>\n</blockquote>\n<p>Algebraic geometers learned that they could sweep Grothendieck's ideas on topos theory under the rug and ignore them.  That was probably a mistake in the long run, but it worked okay for a few decades.</p>",
        "id": 227817952,
        "sender_full_name": "John Baez",
        "timestamp": 1614279433
    },
    {
        "content": "<p>Right, but a few years before ZX calculus Bob wrote \"A categorical semantics of quantum protocols\" and a bunch of other papers full of words like \"compact closed category\"</p>",
        "id": 227817965,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279437
    },
    {
        "content": "<p>So we had a talk at Oxford where Bob was reminiscing about the olden days, and he mentioned that he needed to do that stuff to get accepted at LICS</p>",
        "id": 227818062,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279482
    },
    {
        "content": "<p>He felt that if he presented it in the intuitive manner that he thought about it, then it never would have been accepted</p>",
        "id": 227818143,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279501
    },
    {
        "content": "<p>I wouldn't be surprised if Samsons viewpoint wasn't exactly the same</p>",
        "id": 227818191,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1614279521
    },
    {
        "content": "<p><span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 227818215,
        "sender_full_name": "John Baez",
        "timestamp": 1614279529
    },
    {
        "content": "<p>And ever since his \"kindergarten quantum mechanics\" he doesn't care about formal mathematics anymore (his words)</p>",
        "id": 227818223,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279531
    },
    {
        "content": "<p>I don't think Bob is typical...</p>",
        "id": 227818307,
        "sender_full_name": "John Baez",
        "timestamp": 1614279560
    },
    {
        "content": "<p>Fair enough. Although he does have a habit of hiring PhD students who fall down the rabbit hole of the formal theory of diagrams</p>",
        "id": 227818313,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279561
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227818307\">said</a>:</p>\n<blockquote>\n<p>I don't think Bob is typical...</p>\n</blockquote>\n<p>That might be an understatement :P</p>",
        "id": 227818361,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279578
    },
    {
        "content": "<p>I am a very understated sort of guy.</p>",
        "id": 227818415,
        "sender_full_name": "John Baez",
        "timestamp": 1614279597
    },
    {
        "content": "<p>So the way I kinda see it, is that ZX was very much in the theoretical CS side of things, and people cared a lot about formalities and completeness and such. Some people applied it to MBQC, but only to do the clarifying, not really to do anything new. Only in the last few years we have sort of dropped those shackles and decided to go all in on trying to do actual new stuff. The necessary underlying formal developments have been there for a long time already, but nobody bothered trying to make it work for applied new stuff</p>",
        "id": 227818821,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279726
    },
    {
        "content": "<p>I've had two LICS rejecta...and one LICS success which was entirely written by my then PhD student who was keen on learning how to write like that.</p>",
        "id": 227818883,
        "sender_full_name": "Conor McBride",
        "timestamp": 1614279750
    },
    {
        "content": "<p>That is not to say that, for instance, completeness is not important or interesting, but it is a very insular thing if you don't use it for new stuff that people outside the community would care about</p>",
        "id": 227818954,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614279786
    },
    {
        "content": "<p>I do <em>plan</em> exactly the same thing for open games. It's absolutely possible to hide 100% of the category theory \"in the basement\", with string diagrams (or some other equivalent syntax) acting as a firewall between the users and the category theory</p>",
        "id": 227819374,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614279937
    },
    {
        "content": "<p>It would also be absolutely possible to present even the foundations of open games while never using category theory, even implicitly. Doing it with categories happens to match the way that I prefer to think. Sometimes I wonder about the parallel universe where open games were discovered via a different presentation</p>",
        "id": 227819617,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280026
    },
    {
        "content": "<p>I guess the analogy there is front-end vs back-end code :)</p>",
        "id": 227819623,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614280028
    },
    {
        "content": "<p>For ZX there's a second benefit to forgetting categories besides being more gentle to end users: it turns out to be a really good idea to view ZX diagrams as graphs, and hit them with heavy duty graph algorithms</p>",
        "id": 227820090,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280213
    },
    {
        "content": "<p>That is a good point</p>",
        "id": 227820161,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614280245
    },
    {
        "content": "<p>There's a bunch of papers around explaining what's \"really\" happening, but I guess when it comes to actually writing code it's helpful to pull an existing fast implementation of graph rewriting off the shelf</p>",
        "id": 227820223,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280271
    },
    {
        "content": "<p>Yeah, in PyZX we certainly don't have a PROP class floating around</p>",
        "id": 227820309,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614280299
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227815769\">said</a>:</p>\n<blockquote>\n<p>This idea I <em>really</em> like. Institutionally of course it's up to the individual organisers. If it was me it's a no brainer: I'd get someone from Cambridge Quantum Computing to do an hour long talk that begins with interacting bialgebras, and ends with actual running code on an actual quantum computer</p>\n</blockquote>\n<p>It's almost too late for ACT2021, since it's being organized right as we speak, but I'll suggest it to Jamie Vicary and Kohei Kishida, who seem to be the most active of the organizers.   (I'm just on the \"advisory board\", along with Bob Coecke and David Spivak.)</p>",
        "id": 227820321,
        "sender_full_name": "John Baez",
        "timestamp": 1614280303
    },
    {
        "content": "<p>The name that springs to my mind would be Ross Duncan, one of the 2 co-inventors of ZX calculus, since he's been at CQC for quite a bit longer than Bob who just joined them recently</p>",
        "id": 227820512,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280371
    },
    {
        "content": "<p>Okay, I'll fire off an email now.</p>",
        "id": 227820865,
        "sender_full_name": "John Baez",
        "timestamp": 1614280511
    },
    {
        "content": "<p>Another (less good) possibility that just came to mind is Simon Marlow. We had a guest lecture by him one year for the functional programming course at Queen Mary. He's responsible for the fact that Facebook's real-time spam filter is written in Haskell and runs in a custom <code>FacebookSpamFilterMonad</code></p>",
        "id": 227821340,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280697
    },
    {
        "content": "<p>I don't remember the details, this was in like 2013, but he did a great talk on what functional programming in general and monads in particular buy you when you need to process 20 bajillion Facebook posts per nanosecond in real time</p>",
        "id": 227821500,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280766
    },
    {
        "content": "<p>We were just debating whether we'd allow Facebook as a sponsor - not because it's likely to happen, just as an example of something that would piss people off.</p>",
        "id": 227821526,
        "sender_full_name": "John Baez",
        "timestamp": 1614280780
    },
    {
        "content": "<p>Hah. Yeah, that's a debate that's definitely worth having. It's just not this debate</p>",
        "id": 227821668,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614280818
    },
    {
        "content": "<p>We could also have an invited talk from someone at BAE Systems about how they used category theory to help Saudi Arabia bomb civilians in Yemen.   <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 227822214,
        "sender_full_name": "John Baez",
        "timestamp": 1614281024
    },
    {
        "content": "<p>Just kiddin', just kiddin' - that joke should annoy <em>everyone</em>.</p>",
        "id": 227822581,
        "sender_full_name": "John Baez",
        "timestamp": 1614281136
    },
    {
        "content": "<p>Quantum computing wins because it hasn't been used for evil yet. (It certainly will in the future, of course, unless the whole idea turns out not to work unexpectedly)</p>",
        "id": 227822752,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614281189
    },
    {
        "content": "<p>Yes, I guess the safest applications of category theory are the ones that haven't <em>quite</em> succeeded yet.   <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 227823145,
        "sender_full_name": "John Baez",
        "timestamp": 1614281319
    },
    {
        "content": "<p>Btw, on a meta-level this discussion is a good example of what ACT could do: start with an abstract observation that some problem needs to be fixed, and end up with a concrete solution that can be implemented (John sending an email to Ross)</p>",
        "id": 227823328,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614281392
    },
    {
        "content": "<p>Wait until compositional game theory gets let loose in the world..........</p>",
        "id": 227823504,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614281426
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227823504\">said</a>:</p>\n<blockquote>\n<p>Wait until compositional game theory gets let loose in the world..........</p>\n</blockquote>\n<p>We are waiting Jules (we should talk)</p>",
        "id": 227823895,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1614281546
    },
    {
        "content": "<p>In fact I already far surpassed my goal of starting this thread just from the fact that the thread is so lively. Getting my choice of conference keynote as a result of cross-posting a twitter thread on a chatroom is.... kind of outrageous really</p>",
        "id": 227824248,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614281656
    },
    {
        "content": "<p>The Unreasonable Effectiveness of Twitter-crossposting in getting Conference Keynotes?</p>",
        "id": 227825030,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614281939
    },
    {
        "content": "<p>More like The Unreasonable Effectiveness of Talking to Someone on the Steering Committee of a Conference About That Conference.</p>\n<p>But don't count on getting your choice of conference keynote.... it may be too late already, the people actually running the conference may not like this idea, etc.</p>",
        "id": 227825301,
        "sender_full_name": "John Baez",
        "timestamp": 1614282022
    },
    {
        "content": "<p>Need to make a disclaimer here re <span class=\"user-mention\" data-user-id=\"296293\">@John van de Wetering</span> :) since 2005 I didn't care about \"symbolic\" category theory anymore, since string diagrams do the job anyway.  In quantum foundations people now think that: string diagrams = category theory.  E.g. in the Resource Theory paper with Fritz and Spekkens, we define SMC just as diagrams.  The 2004 CQM LiCS paper has the most horrible proof of teleportation ever, using diagram chasing with commuters and other natural transformations all over the place...wtf?  (that paper made my career btw)</p>",
        "id": 227848321,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614291215
    },
    {
        "content": "<p>Sorry for misrepresenting your viewpoint Bob :)</p>",
        "id": 227848477,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614291261
    },
    {
        "content": "<p>There is a very pragmatic side to this.  The association with CT made CQM unsellable to physicists, so we had to work really hard for many years (&gt;10) to actually get them to show some respect.  ZX is now explicitly playing the game of complete disconnection, hence its success.  Should we deny that CT was behind it?  Of course not.  Except for a while, we really needed to.</p>",
        "id": 227928870,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614346995
    },
    {
        "content": "<p>Do you think the concerns regarding CT that the phycists had were founded at all, or were they simply an adverse response to unfamiliar language and/or bias against CT as a whole?</p>",
        "id": 227929713,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1614347392
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/227929713\">said</a>:</p>\n<blockquote>\n<p>Do you think the concerns regarding CT that the phycists had were founded at all, or were they simply an adverse response to unfamiliar language and/or bias against CT as a whole?</p>\n</blockquote>\n<p>Unfamiliar language mostly I think, and the \"we know better\" every physicist kind of has, about whatever field. :)</p>",
        "id": 227930940,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614347980
    },
    {
        "content": "<p>I'm going to throw in my 2 cents' worth.</p>\n<p>Certainly one issue is that a lot of 'pure' category theorists are very scary people. Some of them on the personal level, but even the ones who are very nice people are very scary on a professional level. The tendency of some of these people to see a piece of math and say \"Oh, that's easy, that's just the application of the Babbleflung theorem to generalized Unboabs tensored with Quoftas\" is the extreme opposite of helpful and welcoming.  So if pure category theorists are going to be hanging around, many of the others will simply not deign to show up. So the community needs to forcefully reject bad behaviour (even if done by absolutely brilliant mathematicians), as well as never ever use phrases like \"Oh, that's easy\" (or any synonyms thereof), even if they think it (and are, in some sense, right).</p>\n<p>Second, because the ACT people seem to have arisen from CT, they seem to be completely blind to the fact that ACT has been going on for &gt; 45 years!  To name just two pioneers: Joseph Goguen and Rod Burstall. The algebraic specification community has been a hotbed of category theory for decades. There's a whole textbook from 2005 <a href=\"https://www.springer.com/gp/book/9783540209096\">Categories for Software Engineering</a> full of ACT.  If 'ACT as a field' cannot recognize that it is already a very old field, it is doomed!  Using spans and cospans as connectors in diagrams representing systems? Super old hat stuff, if only you look in the right places, such as this PhD thesis from 1995 <a href=\"https://apps.dtic.mil/dtic/tr/fulltext/u2/a297528.pdf\">Formal Foundations for the Specification of Software Architecture</a>. [Not that there isn't a lot that can be improved on some of that clunky old stuff...]  There's also the graph rewriting community which happily uses double-pushouts - happily here <a href=\"https://ncatlab.org/nlab/show/span+rewriting\">the nlab</a> acknowledges the existence of this, and that it goes back to 1973. And those are merely the ones that I know of, I am sure the actual list is considerably longer.  To me, ACT has already existed for a very long time.</p>\n<p>The whole endeavour is also hampered by the opaqueness of most books on category theory. There are some exceptions (Conceptual Mathematics as one example), but most do not state some very simple intuitions, such as:</p>\n<ul>\n<li>categories embody the idea of 'typed composition'</li>\n<li>functors are just homomorphisms, which themselves are just 'functions that preserve structure'</li>\n<li>natural transformations are just homomorphisms (of functors)</li>\n</ul>\n<p>and so on.  These ideas are known to most category theorists, but apparently only even mentioned in hushed tones and never written down. So one is left to painstakingly reconstruct the intuitive understanding from the dry definitions. Of course, it doesn't help that so many of the examples given in textbooks are misleading (i.e. too based on historically important examples, instead of highlighting the conceptually important parts, with a preponderance of examples being set-theoretic in nature).  All sorts of concepts in category theory are actually quite simple once they get stripped of their historical baggage and re-expressed with fewer assumptions (example: multicategories are simpler when expressed over an index set rather than over the natural numbers; informally, they're both about the same, but if you try to be precise, the implicit combinatorics of the version based on natural numbers is a complete nightmare. There's a reason most texts don't bother to ever write down the full details of associativity!  And it is, in fact, quite simple to do so, if you don't assume natural-number indexing).</p>",
        "id": 228065600,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614440738
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span> wow you should write a CT textbook!</p>",
        "id": 228067348,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614442677
    },
    {
        "content": "<p>Thanks for the flattery <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> but unfortunately I am a slow writer. Writing a textbook, on my own, is not going to happen, at least not before retirement. Though I have wondered if it could be done, using some of the methods of the past: a few student scribes write down material from a series of lectures, put into decent enough shape, and then polished as a group effort. [With writing credit given to all.]  Plus my intuitive understanding of CT still has some ways to go before I could fill even a small textbook.</p>",
        "id": 228067671,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614443017
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228065600\">said</a>:</p>\n<blockquote>\n<p>I'm going to throw in my 2 cents' worth.</p>\n<p>Certainly one issue is that a lot of 'pure' category theorists are very scary people. Some of them on the personal level, but even the ones who are very nice people are very scary on a professional level. The tendency of some of these people to see a piece of math and say \"Oh, that's easy, that's just the application of the Babbleflung theorem to generalized Unboabs tensored with Quoftas\" is the extreme opposite of helpful and welcoming.  So if pure category theorists are going to be hanging around, many of the others will simply not deign to show up. So the community needs to forcefully reject bad behaviour (even if done by absolutely brilliant mathematicians), as well as never ever use phrases like \"Oh, that's easy\" (or any synonyms thereof), even if they think it (and are, in some sense, right).</p>\n<p>Second, because the ACT people seem to have arisen from CT, they seem to be completely blind to the fact that ACT has been going on for &gt; 45 years!  To name just two pioneers: Joseph Goguen and Rod Burstall. The algebraic specification community has been a hotbed of category theory for decades. There's a whole textbook from 2005 <a href=\"https://www.springer.com/gp/book/9783540209096\">Categories for Software Engineering</a> full of ACT.  If 'ACT as a field' cannot recognize that it is already a very old field, it is doomed!  Using spans and cospans as connectors in diagrams representing systems? Super old hat stuff, if only you look in the right places, such as this PhD thesis from 1995 <a href=\"https://apps.dtic.mil/dtic/tr/fulltext/u2/a297528.pdf\">Formal Foundations for the Specification of Software Architecture</a>. [Not that there isn't a lot that can be improved on some of that clunky old stuff...]  There's also the graph rewriting community which happily uses double-pushouts - happily here <a href=\"https://ncatlab.org/nlab/show/span+rewriting\">the nlab</a> acknowledges the existence of this, and that it goes back to 1973. And those are merely the ones that I know of, I am sure the actual list is considerably longer.  To me, ACT has already existed for a very long time.</p>\n<p>The whole endeavour is also hampered by the opaqueness of most books on category theory. There are some exceptions (Conceptual Mathematics as one example), but most do not state some very simple intuitions, such as:</p>\n<ul>\n<li>categories embody the idea of 'typed composition'</li>\n<li>functors are just homomorphisms, which themselves are just 'functions that preserve structure'</li>\n<li>natural transformations are just homomorphisms (of functors)</li>\n</ul>\n<p>and so on.  These ideas are known to most category theorists, but apparently only even mentioned in hushed tones and never written down. So one is left to painstakingly reconstruct the intuitive understanding from the dry definitions. Of course, it doesn't help that so many of the examples given in textbooks are misleading (i.e. too based on historically important examples, instead of highlighting the conceptually important parts, with a preponderance of examples being set-theoretic in nature).  All sorts of concepts in category theory are actually quite simple once they get stripped of their historical baggage and re-expressed with fewer assumptions (example: multicategories are simpler when expressed over an index set rather than over the natural numbers; informally, they're both about the same, but if you try to be precise, the implicit combinatorics of the version based on natural numbers is a complete nightmare. There's a reason most texts don't bother to ever write down the full details of associativity!  And it is, in fact, quite simple to do so, if you don't assume natural-number indexing).</p>\n</blockquote>\n<p>As people like <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> and <span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> know, for me a main motivation for the ACT conference series and Compositionality journal was to provide and alternative to the scary CT community, although meanwhile that seems to have turned a bit less scary as well.  Now, the category theory in CS community is also packed with jargon that made it impossible to penetrate.  So I see ACT as a community where an effort is made to explain things to each other, and be a bit nicer to each other.  I actually don't think that many here came out of the traditional CT community.</p>",
        "id": 228067792,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614443154
    },
    {
        "content": "<p>Please don't get me wrong: I think both the ACT Conference and Compositionality are great!  I'm just injecting an additional outsider's view into things, for people's consideration.</p>",
        "id": 228067982,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614443388
    },
    {
        "content": "<p>We're lucky to have quite a high concentration of people who are really good science communicators, like Bob and David and Tai. I have a lot of respect for them because I know from trying that good science communication is <em>really hard</em>. Writing Bourbaki style is way easier, for example</p>",
        "id": 228068557,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614443977
    },
    {
        "content": "<blockquote>\n<p>Second, because the ACT people seem to have arisen from CT, they seem to be completely blind to the fact that ACT has been going on for &gt; 45 years! To name just two pioneers: Joseph Goguen and Rod Burstall.</p>\n</blockquote>\n<p>I \"arose\" - that makes me sound like some sort of swam creature - not from CT but from mathematical physics, so I've struggled for decades to learn category theory, and I know essentially nothing about computer science. </p>\n<p>I keep trying to learn bits of computer science here and there, especially since some of my students are interested in it - like <span class=\"user-mention\" data-user-id=\"276048\">@Mike Stay</span>, who taught me the lambda calculus, and <span class=\"user-mention\" data-user-id=\"275899\">@Christian Williams</span> , who is now working with Mike on type theory.   But I don't think I'll ever know much about it.   I never program and don't want to.   I've read Goguen's <a href=\"https://ncatlab.org/nlab/show/A+Categorical+Manifesto\">A categorical manifesto</a>, since the title is irresistible and it's pretty short and fun.  I've heard of Burstall but don't know anything about him.  </p>\n<p>Because I've spent much more time studying category theory, I find it much easier to understand category theorists than computer scientists.   What category theorists say feels natural to me: even if I don't understand all the details, I can often guess what they're trying to do.  Computer science, on the other hand, is much more mysterious.   But I don't bother <em>saying</em> this, because I don't <em>expect</em> to understand it: why should I?   </p>\n<p>When I first helped launch the ACT conference series in ACT2018, I pushed for it to exclude categorical computer science, categorical quantum mechanics, or applications of category theory to string theory and topological quantum field theory - because those were relatively old, well-established fields with their own conferences.  I envisaged ACT as being about the <em>other</em> stuff, the <em>new</em> stuff.  </p>\n<p>By the time ACT2019 came along, Tom Leinster had forcefully talked me out of this idea.  I realized, thanks largely to him, that ACT should be all-embracing.     </p>\n<p>I think it's great that we have people of many kinds talking here.  But I hope everyone realizes that their expertise is a mysterious black box to many other people here.   It's not just category theorists who are hard to understand!</p>",
        "id": 228071386,
        "sender_full_name": "John Baez",
        "timestamp": 1614446967
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228068557\">said</a>:</p>\n<blockquote>\n<p>We're lucky to have quite a high concentration of people who are really good science communicators, like Bob and David and Tai. I have a lot of respect for them because I know from trying that good science communication is <em>really hard</em>. Writing Bourbaki style is way easier, for example</p>\n</blockquote>\n<p>Funny you didn't mention the inventor of scientific blogging.  But yeah, he is indeed pretty crap at it.</p>",
        "id": 228074454,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614450351
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> the days of being able to learn everything are long, long past. Even though I have an odd background (my PhD is in complex dynamics, with Douady and Hubbard being my co-supervisors, but I spent just as much time learning combinatorics and analysis of algorithms from Phillippe Flajolet and Bruno Salvy at INRIA, then many years doing symbolic computation / system building at Maplesoft, doing more software engineering than anything else, before re-joining academia as a computer scientist who is increasingly interested in meta-programming and programming language design, on top of mechanized mathematics. Oh, and a side gig applying cognitive psychology models to game design.), I too refuse to learn certain topics. There is only so much time.   I know I'm missing out on beautiful stuff in areas I've sworn off of, so I can sympathize with your choice to largely stay out of CS.</p>\n<p>Amusingly, quantum used to be one of those domains that I swore I'd never learn. But Amr Sabry got me totally hooked on the categorical approach to reversible computation, because of his approach from the fundamentals (i.e. asking the question \"what does <em>conservation of information</em> really mean for computations?\"). Of course, the jump to quantum from there is trivial so, despite my best intentions, I now know quite a bit more about quantum computing than I ever expected.</p>",
        "id": 228075287,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614451262
    },
    {
        "content": "<p>At least twice I've gone to workshops/conferences and been floored by folks I never heard of doing 'way-more-applied' category theory than I knew existed: once was in Luxembourg at a workshop on \"Dynamics, Thermodynamics and Information Processing in Chemical Networks\" where I learned about <a href=\"https://cheminf.imada.sdu.dk/mod/index.html\">https://cheminf.imada.sdu.dk/mod/index.html</a> and the other was at a model transformation Dagstuhl workshop on \"Multidirectional Transformations and Synchronisations\" where I basically learned about the existence of the graph-transformation and model transformation community/communities. I was kind of shocked these hadn't been on my radar, but I mean that is research, different neighboring communities, gotta interact. I think the point is that for me, going to adjacent conferences/workshops and talking about ACT was always a bit intimidating bc I didn't know their history and 'how baby' the stuff I was presenting appeared to them, nor did I feel I really represented the 'category theory' part of ACT, but it was one of the most important parts of my development as a researcher and led to the most new connections/ideas/perspectives.</p>",
        "id": 228075367,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1614451331
    },
    {
        "content": "<p>Some mechanism encouraging young 'ACT researchers' to present/participate in domain workshops/conferences would be dope. Maybe with a reciprocation from the domain workshop. Foreign research domain exchange program.</p>",
        "id": 228075647,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1614451684
    },
    {
        "content": "<p>I also remember, I think it was <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>, talking about setting the 'temperature' of conversations. Like an expectation about what 'level' you'll try to keep the discussion. Low temp convos are focused, down in the deets, not much jumping around. High temp ones can be more all over the place. Drawing on the temp/time analogy, I think setting an expectation about an interaction with domain folks based on time could be helpful. Yea it takes years to learn deeply about a domain or about CT, let alone to identify and tackle an interesting problem that involves a  bit of both, but there is def value in shorter interactions: over a few days at a workshop, a few hours on a forum, once a month via a group zoom for a while. I always thought of kind of serving a 'speed-dating' app for domain people and folks wanting to do more 'applied category theory.' Like that is part of knowing the community, knowing what types of problems/questions/discussions to bring up with which people. Helping domain people find the 'right' flavour of applied category theorist to kick it with and vice-versa.</p>",
        "id": 228076021,
        "sender_full_name": "Blake Pollard",
        "timestamp": 1614452150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228067671\">said</a>:</p>\n<blockquote>\n<p>Thanks for the flattery <span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> but unfortunately I am a slow writer. Writing a textbook, on my own, is not going to happen, at least not before retirement. Though I have wondered if it could be done, using some of the methods of the past: a few student scribes write down material from a series of lectures, put into decent enough shape, and then polished as a group effort. [With writing credit given to all.]  Plus my intuitive understanding of CT still has some ways to go before I could fill even a small textbook.</p>\n</blockquote>\n<p>I like thinking about protocols such as that for efficient production of pedagogical material.  Here's a very simple protocol, involving a teacher and a student.  Teacher explains something to student.  Student writes up an explanation of it.  Teacher edits student's write-up.  The student will be able to sympathize well with other people in their position, learning the material for the first time, so their write-up will be intelligible to such people, and the act of writing it will also help their own learning.  The teacher though, will have to edit it at the end in order to remove misconceptions which can happen when someone is first learning something.</p>",
        "id": 228078459,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614454759
    },
    {
        "content": "<p>That's an interesting loop, <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>, but it can be tiring for the teacher: more work than writing a book on one's own.  I gave a course on classical mechanics, my student Derek Wise wrote great hand-written notes, then a grad student at another school jumped in and LaTeXed them up.  Great!  But this student added his own observations and jokes, almost none of which I agree with.  So now I'm going to spend a long time trying to polish the book further, and get it back to my conception of things.</p>",
        "id": 228079646,
        "sender_full_name": "John Baez",
        "timestamp": 1614456306
    },
    {
        "content": "<p>Jacques Carette:</p>\n<blockquote>\n<p>the days of being able to learn everything are long, long past. </p>\n</blockquote>\n<p>Yes.  I never wanted to learn <em>everything</em>.  At some stage I wanted to learn everything <em>interesting</em>, which cuts the job down by about 2 orders of magnitude.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> But even this is hopeless, especially because things tend to get more interesting when you know more about them.</p>",
        "id": 228079758,
        "sender_full_name": "John Baez",
        "timestamp": 1614456435
    },
    {
        "content": "<blockquote>\n<p>I spent just as much time learning combinatorics and analysis of algorithms from Phillippe Flajolet and Bruno Salvy at INRIA [....]</p>\n</blockquote>\n<p>That's cool!   This blog series of mine:</p>\n<ul>\n<li><a href=\"https://math.ucr.edu/home/baez/permutations/\">Random permutations</a></li>\n</ul>\n<p>is heavily inspired by Phillipe Flajolet and Robert Sedgewick's book *<a href=\"http://algo.inria.fr/flajolet/Publications/book.pdf\">Analytic Combinatorics</a>, which is actually very connected to Andre Joyal's theory of species, nicely formulated using category theory.</p>",
        "id": 228079885,
        "sender_full_name": "John Baez",
        "timestamp": 1614456590
    },
    {
        "content": "<blockquote>\n<p>I can sympathize with your choice to largely stay out of CS.</p>\n</blockquote>\n<p>Thanks.  But I'm still curious sometimes about what the hell you guys are talking about.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 228079954,
        "sender_full_name": "John Baez",
        "timestamp": 1614456624
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228079646\">said</a>:</p>\n<blockquote>\n<p>That's an interesting loop, <span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span>, but it can be tiring for the teacher: more work than writing a book on one's own.  I gave a course on classical mechanics, my student Derek Wise wrote great hand-written notes, then a grad student at another school jumped in and LaTeXed them up.  Great!  But this student added his own observations and jokes, almost none of which I agree with.  So now I'm going to spend a long time trying to polish the book further, and get it back to my conception of things.</p>\n</blockquote>\n<p>Glad to see a real-life example!  Sure, it can be more work than writing a book on one's own, but I think that if it was done right, it could be much less work!  In the example you gave, the participants didn't consciously decide to do a process for producing pedagogical material and agree on the terms of the process at the beginning, rather it just sort of \"fell into place\".  I think that if people did this sort of process intentionally it could be optimized for efficiency.  And I don't think that efficiency is an end in itself, but there is a dearth of good pedagogical material and producing it more efficiently would cause more to be produced.</p>",
        "id": 228080838,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614457465
    },
    {
        "content": "<blockquote>\n<p>Sure, it can be more work than writing a book on one's own, but I think that if it was done right, it could be much less work! </p>\n</blockquote>\n<p>In my case there was much less work because someone else translated a bunch of notes into LaTeX... and now some more work because I have to deal with this.   On the whole it was <em>less</em> work.  But you're right, this collaboration was not planned, it just happened.  It would have worked better if the grad student had simply contacted me before converting the notes into LaTeX!</p>",
        "id": 228081969,
        "sender_full_name": "John Baez",
        "timestamp": 1614458605
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228065600\">said</a>:</p>\n<blockquote>\n<p>The whole endeavour is also hampered by the opaqueness of most books on category theory. There are some exceptions (Conceptual Mathematics as one example), but most do not state some very simple intuitions, such as:</p>\n<ul>\n<li>categories embody the idea of 'typed composition'</li>\n<li>functors are just homomorphisms, which themselves are just 'functions that preserve structure'</li>\n<li>natural transformations are just homomorphisms (of functors)</li>\n</ul>\n</blockquote>\n<p>I'm not sure what you're getting at here.  I just had a look at some books on category theory.  The section on functors in MacLane's \"Categories for the working mathematician\" begins with the sentence \"A <em>functor</em> is a morphism of categories\".  Similarly, Leinster's \"Basic category theory\" starts the section on functors with \"One of the lessons of category theory is that whenever we meet a new type of mathematical object, we should always ask whether there is a sensible notion of ‘map’ between such objects. We can ask this about categories themselves. The answer is yes, and a map between categories is called a functor.\"  In fact, I can't imagine introducing functors without saying that they are the obvious structure-preserving morphisms between categories.</p>\n<p>In general I think it is important to realize that \"opaque\" and \"simpler\" are relative concepts.  What is opaque for you may be simpler for someone else, and vice versa.</p>",
        "id": 228088431,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1614466376
    },
    {
        "content": "<blockquote>\n<p>In general I think it is important to realize that \"opaque\" and \"simpler\" are relative concepts. What is opaque for you may be simpler for someone else, and vice versa.</p>\n</blockquote>\n<p>I was trying to say that too, in a very friendly way.   I complain a lot about the opaqueness of other people's writing - to myself.  But I don't think it helps a lot to complain about it publicly.   Instead I try to explain things as soon as I learn them - and explain them the way I wish someone had explained them to me.   </p>\n<p>When learning a subject I think it's important to explain it to other people <em>soon</em>, because later on a bunch of things become obvious and it's hard to remember what was hard to understand.   It's also good to explain things <em>later</em>, since then you can zip past all that obvious stuff and focus on deeper issues.</p>",
        "id": 228088878,
        "sender_full_name": "John Baez",
        "timestamp": 1614466915
    },
    {
        "content": "<p>Category theory is a \"least common denominator\" subject for a whole lot of people, which surely makes it really hard or even impossible to write a textbook that could please everyone who might want to read it. Mac Lane surely isn't a bad book, but he definitely has an audience in mind: pure mathematicians, probably with a leaning towards algebra. So it's not a surprise that computer scientists find it a bit hard to read. Luckily by now we have a bunch of good introductions written for different audiences. The only thing is making sure the right reader finds the right book</p>",
        "id": 228089257,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614467294
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228088431\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228065600\">said</a>:</p>\n<blockquote>\n<p>The whole endeavour is also hampered by the opaqueness of most books on category theory. There are some exceptions (Conceptual Mathematics as one example), but most do not state some very simple intuitions, such as:</p>\n<ul>\n<li>categories embody the idea of 'typed composition'</li>\n<li>functors are just homomorphisms, which themselves are just 'functions that preserve structure'</li>\n<li>natural transformations are just homomorphisms (of functors)</li>\n</ul>\n</blockquote>\n<p>I'm not sure what you're getting at here.  I just had a look at some books on category theory.  The section on functors in MacLane's \"Categories for the working mathematician\" begins with the sentence \"A <em>functor</em> is a morphism of categories\".  Similarly, Leinster's \"Basic category theory\" starts the section on functors with \"One of the lessons of category theory is that whenever we meet a new type of mathematical object, we should always ask whether there is a sensible notion of ‘map’ between such objects. We can ask this about categories themselves. The answer is yes, and a map between categories is called a functor.\"  In fact, I can't imagine introducing functors without saying that they are the obvious structure-preserving morphisms between categories.</p>\n<p>In general I think it is important to realize that \"opaque\" and \"simpler\" are relative concepts.  What is opaque for you may be simpler for someone else, and vice versa.</p>\n</blockquote>\n<p>For much of categorical quantum mechanics etc, starting with categories, functors, and especially natural transformations already kills the audience.  None of that is needed.  That's the problem for non-mathematicians with category theory.  Adjunctions also don't come into the game, nor limits.  So it's a very different thing, really.  The nr1 definition is symmetric monoidal category, and you don't need all the above stuff to explain what it is (contra what MacLane does).  When I was still a kid, we wrote this: <a href=\"https://arxiv.org/abs/0905.3010\">https://arxiv.org/abs/0905.3010</a></p>",
        "id": 228089337,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614467405
    },
    {
        "content": "<p>I thought you <em>are</em> still a kid.</p>",
        "id": 228089457,
        "sender_full_name": "John Baez",
        "timestamp": 1614467548
    },
    {
        "content": "<p>These days I am allowed to drink alcohol.</p>",
        "id": 228089482,
        "sender_full_name": "Bob Coecke",
        "timestamp": 1614467588
    },
    {
        "content": "<p>Right now we have a thread on Applied CT as a field and a thread on CT applied to fields lol</p>",
        "id": 228089503,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614467637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> The audience, of course, matters a lot. I was thinking of introductory textbooks that go very slow and try hard to give lots of intuition -- I rather like Simmons' book for that.  Think of the audience as 3rd year CS and Physics students at second-tier universities as what to aim for. </p>\n<p>The definition of Functor can be systematically derived from that of Category. I have indeed seen many textbooks that say, quite clearly, that a Functor is a Category homomorphism. I have not seen a single one that then goes through the steps to derive what that means - instead, the \"answer\" is just plopped there as a definition.  For some audiences, the act of deriving the details will be much more enlightening that just giving the answer. </p>\n<p>Functor is straightforward. Doing the same to get natural transformations and, even more so, modifications, requires considerably more work. Doing all the steps for natural transformation is extremely useful as, for very many people that I've encountered (myself included), the raw definition seems to 'come out of thin air'. </p>\n<p>The audience matters enormously. For example, at the stage where I was in my learning of CT and type theory, your proto-textbook <a href=\"https://mikeshulman.github.io/catlog/catlog.pdf\">Categorical logic from a categorical point of view</a> was brilliant and spot on. As soon as it's finished, I will purchase a 'real' copy.</p>",
        "id": 228134896,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614523809
    },
    {
        "content": "<p>Thanks for the flattery <span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span> (-:O  Indeed, the audience matters enormously; that's essentially the same point that John and I were making.  Rather than deriding \"most books\" on category theory as \"opaque\", it sounds like your point is rather that you want more books on category theory addressed to a particular audience.</p>",
        "id": 228135266,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1614524243
    },
    {
        "content": "<p>It also sounds like the problem with extant books is not that they do not <em>state</em> the intuitions you mentioned, as you first said, but that they don't <em>explain</em> those intuitions in a way accessible to an audience that doesn't already understand what notions like \"homomorphism\" mean.  Which is quite different from category theorists keeping the intuitions a secret.</p>",
        "id": 228135344,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1614524348
    },
    {
        "content": "<p>Yes, I will accept that criticism as having properly landed: I did not express what I meant adequately, and ended up in error deriding textbooks that didn't deserve it.</p>",
        "id": 228135367,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614524384
    },
    {
        "content": "<p>Note that understanding homomorphism, even from a universal algebra point of view, will only help so much. There is already a (very small) leap to make for Functor, but a larger one for Natural Transformation, and a huge one for modification.</p>\n<p>I am trying to write software to do such 'higher order universal algebra' automatically. This has taught me a lot. In particular, I would modify the usual aphorism about teaching as follows:</p>\n<ol>\n<li>If you want to really understand something, teach it</li>\n<li>If you want to really <strong>really</strong> understand something, teach it to a computer.</li>\n</ol>",
        "id": 228135699,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614524732
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 228136023,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1614525023
    },
    {
        "content": "<p>I'm curious how you are thinking of explaining natural transformations as homomorphisms.  The way I would think of doing it is to specialize to natural transformations between functors with codomain Set, in which case such a functor is clearly a family of structured sets and the ordinary notion of homomorphism between families of structured sets yields a natural transformation.  Then one could generalize to natural transformations with other codomains.</p>",
        "id": 228136093,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1614525107
    },
    {
        "content": "<p>So long as someone has internalised the notion of a comma category, the definition of a natural transformation as a section of the domain and codomain projections works well.</p>",
        "id": 228136283,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614525302
    },
    {
        "content": "<p>Or even just as a functor to an arrow category. But these definitions are more like homotopies than traditional homomorphisms.</p>",
        "id": 228136381,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614525411
    },
    {
        "content": "<p>In the end though, it doesn’t really matter how well one phrases a definition. It’s the examples which will actually get people to understand.</p>",
        "id": 228136719,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1614525796
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228136719\">said</a>:</p>\n<blockquote>\n<p>In the end though, it doesn’t really matter how well one phrases a definition. It’s the examples which will actually get people to understand.</p>\n</blockquote>\n<p>Amen. As someone who is not super well versed in category theory, the number of category theory papers I've seen with basically no examples of the main structures they are talking about is staggering.</p>",
        "id": 228139043,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614528225
    },
    {
        "content": "<p>My take on it is extremely tainted by type theory and trying to automate everything. So be prepared for a weird ride, mathematically speaking.</p>\n<p>I see a Functor as a parametrized theory. Often, I see that as a marked context, where you have two categories in an initial segment, with the parts of Functor in the rest. The marked context is invariant, so the context-to-context mapping must be the identity. [The same reasoning works for defining homomorphisms of R-modules, where you want to split the initial segment that axiomatizes 'ring' off.] Then you have to map the rest. Name our two Functors <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi></mrow><annotation encoding=\"application/x-tex\">F</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">G</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">G</span></span></span></span>. Well, the first data in a Functor <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>C</mi><mo>→</mo><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">C \\rightarrow D</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span> is an object map.   Let us reason point-wise (and this is already an interesting 'design' decision'). If <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi></mrow><annotation encoding=\"application/x-tex\">X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span></span></span></span> is an object of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span></span></span></span>, then somehow <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">F(X)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mclose\">)</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">G(X)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mclose\">)</span></span></span></span> ought to be related, basically because <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi></mrow><annotation encoding=\"application/x-tex\">X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span></span></span></span> is definitionally equal to itself. So we posit a function, call it <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>η</mi></mrow><annotation encoding=\"application/x-tex\">\\eta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span></span></span></span>, from <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">F(X)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mclose\">)</span></span></span></span> to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">G(X)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mclose\">)</span></span></span></span>.  As <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>X</mi></mrow><annotation encoding=\"application/x-tex\">X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span></span></span></span> was arbitrary, we actually get a whole family of functions.</p>\n<p>Now things get interesting. <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>η</mi></mrow><annotation encoding=\"application/x-tex\">\\eta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span></span></span></span> should also have an action on morphisms. Repeating the previous reasoning, given <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>:</mo><mi>X</mi><mo>→</mo><mi>Y</mi></mrow><annotation encoding=\"application/x-tex\">f : X \\rightarrow Y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">Y</span></span></span></span>, we need to map <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">F f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span> to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">G f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span>.  But that would be a 2-morphism (and not even a 2-cell), and we're doing 1-category theory, so we simply drop that.</p>\n<p>But we can't have just any old family. If we look at the diagram we'd have drawn for figuring out <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>η</mi><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">\\eta f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span>, one sees that we get a potential commutation: <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>Y</mi></msub><mo>∘</mo><mi>F</mi><mi>f</mi><mo>=</mo><mi>G</mi><mi>f</mi><mo>∘</mo><msub><mi>η</mi><mi>X</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_{Y} \\circ F f = G f \\circ \\eta_{X}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.63889em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.22222em;\">Y</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>. That diagram should indeed commute, for our family <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>η</mi></mrow><annotation encoding=\"application/x-tex\">\\eta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span></span></span></span> to be coherent. How to express that this comes out of \"preserves structure\", I don't know. </p>\n<p>Note that if we went to 2-category theory,  the obvious mapping of components does <strong>not</strong> give 'the' definition of lax natural transformation!  That's because usual CT is globular, and the mechanical definition of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span></span></span></span> would be from <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mi>f</mi><mo>:</mo><mi>F</mi><mi>X</mi><mo>→</mo><mi>F</mi><mi>Y</mi></mrow><annotation encoding=\"application/x-tex\">F f : F X \\rightarrow F Y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">Y</span></span></span></span> to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi><mi>f</mi><mo>:</mo><mi>G</mi><mi>X</mi><mo>→</mo><mi>G</mi><mi>Y</mi></mrow><annotation encoding=\"application/x-tex\">G f : G X \\rightarrow G Y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">Y</span></span></span></span>. So 'globularity' forces things to be different here. Which is \"expected\", in the sense that at dimension 2, different choices of geometry show up.</p>\n<p>So natural transformations in 1-category theory are really truncated homomorphisms of Functors.</p>",
        "id": 228140391,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614529571
    },
    {
        "content": "<p>(Hmm, I wonder if this part of the conversation should be split off into a different thread.)</p>",
        "id": 228140531,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614529788
    },
    {
        "content": "<p>You could also think of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span></span></span></span> as <em>being</em> the commutation <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>Y</mi></msub><mo>∘</mo><mi>F</mi><mi>f</mi><mo>=</mo><mi>G</mi><mi>f</mi><mo>∘</mo><msub><mi>η</mi><mi>X</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_Y\\circ Ff=Gf\\circ \\eta_X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.63889em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.22222em;\">Y</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>. You could think that there are no 2-cells in 1-category theory, but another point of view is that all 2-cells are equalities.</p>",
        "id": 228140824,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614530060
    },
    {
        "content": "<p>It's hard not to notice that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>X</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> can also be seen as 'coming from' <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mrow><mi mathvariant=\"sans-serif\">i</mi><msub><mi mathvariant=\"sans-serif\">d</mi><mi mathvariant=\"sans-serif\">X</mi></msub></mrow></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_{\\mathsf{id_X}}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68642em;vertical-align:-0.25586em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.33610799999999985em;\"><span style=\"top:-2.55em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathsf mtight\">i</span><span class=\"mord mtight\"><span class=\"mord mathsf mtight\">d</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3448em;\"><span style=\"top:-2.3487714285714287em;margin-left:0em;margin-right:0.07142857142857144em;\"><span class=\"pstrut\" style=\"height:2.5em;\"></span><span class=\"sizing reset-size3 size1 mtight\"><span class=\"mord mathsf mtight\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15122857142857138em;\"><span></span></span></span></span></span></span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.25586em;\"><span></span></span></span></span></span></span></span></span></span>, if we indeed had <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub><mo>:</mo><mi>F</mi><mi>f</mi><mo>→</mo><mi>G</mi><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">\\eta_f : F f \\rightarrow G f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span>.</p>",
        "id": 228140884,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614530147
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> Completely agreed, that is a useful point of view. If you then split the equalities as oriented rewrites, you go up a dimension (i.e. bicategory theory).</p>",
        "id": 228140999,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614530273
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296322\">Jacques Carette</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/228140884\">said</a>:</p>\n<blockquote>\n<p>It's hard not to notice that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>X</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span> can also be seen as 'coming from' <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mrow><mi mathvariant=\"sans-serif\">i</mi><msub><mi mathvariant=\"sans-serif\">d</mi><mi mathvariant=\"sans-serif\">X</mi></msub></mrow></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_{\\mathsf{id_X}}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68642em;vertical-align:-0.25586em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.33610799999999985em;\"><span style=\"top:-2.55em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathsf mtight\">i</span><span class=\"mord mtight\"><span class=\"mord mathsf mtight\">d</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3448em;\"><span style=\"top:-2.3487714285714287em;margin-left:0em;margin-right:0.07142857142857144em;\"><span class=\"pstrut\" style=\"height:2.5em;\"></span><span class=\"sizing reset-size3 size1 mtight\"><span class=\"mord mathsf mtight\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15122857142857138em;\"><span></span></span></span></span></span></span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.25586em;\"><span></span></span></span></span></span></span></span></span></span>, if we indeed had <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub><mo>:</mo><mi>F</mi><mi>f</mi><mo>→</mo><mi>G</mi><mi>f</mi></mrow><annotation encoding=\"application/x-tex\">\\eta_f : F f \\rightarrow G f</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span></span></span></span>.</p>\n</blockquote>\n<p>Yes, this leads to a point of view where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>η</mi></mrow><annotation encoding=\"application/x-tex\">\\eta</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span></span></span></span> is really <em>just</em> an action on morphisms: for each <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>:</mo><mi>c</mi><mo>→</mo><mi>d</mi></mrow><annotation encoding=\"application/x-tex\">f:c\\to d</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">c</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">d</span></span></span></span>, you get <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub><mo>:</mo><mi>F</mi><mi>c</mi><mo>→</mo><mi>G</mi><mi>d</mi></mrow><annotation encoding=\"application/x-tex\">\\eta_f:Fc\\to Gd</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\">c</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\">d</span></span></span></span> such that for each <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>x</mi><mo>:</mo><msup><mi>c</mi><mo lspace=\"0em\" mathvariant=\"normal\" rspace=\"0em\">′</mo></msup><mo>→</mo><mi>c</mi></mrow><annotation encoding=\"application/x-tex\">x:c'\\to c</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.751892em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">c</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.751892em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">′</span></span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">c</span></span></span></span>, you get <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub><mo>∘</mo><mi>F</mi><mi>x</mi><mo>=</mo><msub><mi>η</mi><mrow><mi>f</mi><mo>∘</mo><mi>x</mi></mrow></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_f\\circ Fx=\\eta_{f\\circ x}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.730558em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\">x</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span><span class=\"mbin mtight\">∘</span><span class=\"mord mathnormal mtight\">x</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span></span></span></span> and for each <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>y</mi><mo>:</mo><mi>d</mi><mo>→</mo><msup><mi>d</mi><mo lspace=\"0em\" mathvariant=\"normal\" rspace=\"0em\">′</mo></msup></mrow><annotation encoding=\"application/x-tex\">y:d\\to d'</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord mathnormal\">d</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.751892em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\">d</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.751892em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\">′</span></span></span></span></span></span></span></span></span></span></span></span>, you get <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi><mi>y</mi><mo>∘</mo><msub><mi>η</mi><mi>f</mi></msub><mo>=</mo><msub><mi>η</mi><mrow><mi>y</mi><mo>∘</mo><mi>f</mi></mrow></msub></mrow><annotation encoding=\"application/x-tex\">Gy\\circ \\eta_f=\\eta_{y\\circ f}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8777699999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">y</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.03588em;\">y</span><span class=\"mbin mtight\">∘</span><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span></span></span></span>.</p>\n<p>Put briefly, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>Hom</mtext><mo stretchy=\"false\">(</mo><mi>F</mi><mo separator=\"true\">,</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\text{Hom}(F,G)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord text\"><span class=\"mord\">Hom</span></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mclose\">)</span></span></span></span> is the limit of the diagram <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∫</mo><mtext>Hom</mtext><mo stretchy=\"false\">(</mo><mo>−</mo><mo separator=\"true\">,</mo><mo>−</mo><mo stretchy=\"false\">)</mo><mover><mo stretchy=\"true\">→</mo><mpadded lspace=\"0.3em\" width=\"+0.6em\"><mi mathvariant=\"normal\">Π</mi></mpadded></mover><msup><mi>C</mi><mtext>op</mtext></msup><mo>×</mo><mi>C</mi><mover><mo stretchy=\"true\">→</mo><mpadded lspace=\"0.3em\" width=\"+0.6em\"><mrow><msup><mi>F</mi><mtext>op</mtext></msup><mo>×</mo><mi>G</mi></mrow></mpadded></mover><mtext>Set</mtext></mrow><annotation encoding=\"application/x-tex\">\\int \\text{Hom}(-,-)\\xrightarrow{\\Pi} C^\\text{op}\\times C\\xrightarrow{F^\\text{op}\\times G} \\text{Set}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.406451em;vertical-align:-0.30612em;\"></span><span class=\"mop op-symbol small-op\" style=\"margin-right:0.19445em;position:relative;top:-0.0005599999999999772em;\">∫</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord text\"><span class=\"mord\">Hom</span></span><span class=\"mopen\">(</span><span class=\"mord\">−</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">−</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel x-arrow\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:1.100331em;\"><span style=\"top:-3.322em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight x-arrow-pad\"><span class=\"mord mtight\"><span class=\"mord mtight\">Π</span></span></span></span><span class=\"svg-align\" style=\"top:-2.689em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"hide-tail\" style=\"height:0.522em;min-width:1.469em;\"><svg height=\"0.522em\" preserveAspectRatio=\"xMaxYMin slice\" viewBox=\"0 0 400000 522\" width=\"400em\"><path d=\"M0 241v40h399891c-47.3 35.3-84 78-110 128 -16.7 32-27.7 63.7-33 95 0 1.3-.2 2.7-.5 4-.3 1.3-.5 2.3-.5 3 0 7.3 6.7 11 20  11 8 0 13.2-.8 15.5-2.5 2.3-1.7 4.2-5.5 5.5-11.5 2-13.3 5.7-27 11-41 14.7-44.7  39-84.5 73-119.5s73.7-60.2 119-75.5c6-2 9-5.7 9-11s-3-9-9-11c-45.3-15.3-85 -40.5-119-75.5s-58.3-74.8-73-119.5c-4.7-14-8.3-27.3-11-40-1.3-6.7-3.2-10.8-5.5 -12.5-2.3-1.7-7.5-2.5-15.5-2.5-14 0-21 3.7-21 11 0 2 2 10.3 6 25 20.7 83.3 67  151.7 139 205zm0 0v40h399900v-40z\"></path></svg></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.010999999999999899em;\"><span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.76666em;vertical-align:-0.08333em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.664392em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord text mtight\"><span class=\"mord mtight\">op</span></span></span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">×</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1.14998em;vertical-align:-0.010999999999999899em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel x-arrow\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:1.13898em;\"><span style=\"top:-3.322em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight x-arrow-pad\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.13889em;\">F</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.7385428571428572em;\"><span style=\"top:-2.931em;margin-right:0.07142857142857144em;\"><span class=\"pstrut\" style=\"height:2.5em;\"></span><span class=\"sizing reset-size3 size1 mtight\"><span class=\"mord text mtight\"><span class=\"mord mtight\">op</span></span></span></span></span></span></span></span></span><span class=\"mbin mtight\">×</span><span class=\"mord mathnormal mtight\">G</span></span></span></span><span class=\"svg-align\" style=\"top:-2.689em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"hide-tail\" style=\"height:0.522em;min-width:1.469em;\"><svg height=\"0.522em\" preserveAspectRatio=\"xMaxYMin slice\" viewBox=\"0 0 400000 522\" width=\"400em\"><path d=\"M0 241v40h399891c-47.3 35.3-84 78-110 128 -16.7 32-27.7 63.7-33 95 0 1.3-.2 2.7-.5 4-.3 1.3-.5 2.3-.5 3 0 7.3 6.7 11 20  11 8 0 13.2-.8 15.5-2.5 2.3-1.7 4.2-5.5 5.5-11.5 2-13.3 5.7-27 11-41 14.7-44.7  39-84.5 73-119.5s73.7-60.2 119-75.5c6-2 9-5.7 9-11s-3-9-9-11c-45.3-15.3-85 -40.5-119-75.5s-58.3-74.8-73-119.5c-4.7-14-8.3-27.3-11-40-1.3-6.7-3.2-10.8-5.5 -12.5-2.3-1.7-7.5-2.5-15.5-2.5-14 0-21 3.7-21 11 0 2 2 10.3 6 25 20.7 83.3 67  151.7 139 205zm0 0v40h399900v-40z\"></path></svg></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.010999999999999899em;\"><span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord text\"><span class=\"mord\">Set</span></span></span></span></span>, where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∫</mo><mtext>Hom</mtext><mo stretchy=\"false\">(</mo><mo>−</mo><mo separator=\"true\">,</mo><mo>−</mo><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\int\\text{Hom}(-,-)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1.11112em;vertical-align:-0.30612em;\"></span><span class=\"mop op-symbol small-op\" style=\"margin-right:0.19445em;position:relative;top:-0.0005599999999999772em;\">∫</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord text\"><span class=\"mord\">Hom</span></span><span class=\"mopen\">(</span><span class=\"mord\">−</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">−</span><span class=\"mclose\">)</span></span></span></span> is the twisted arrow category and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">Π</mi></mrow><annotation encoding=\"application/x-tex\">\\Pi</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord\">Π</span></span></span></span> is the canonical projection.  Idk if this is too fast, I can give more detail if anybody wants.</p>",
        "id": 228141370,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614530671
    },
    {
        "content": "<p>BTW, to convert between this and the standard notion of natural transformation, let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>X</mi></msub><mo>=</mo><msub><mi>η</mi><msub><mtext>id</mtext><mi>X</mi></msub></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_X=\\eta_{\\text{id}_X}</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.680865em;vertical-align:-0.250305em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.33610799999999996em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mtight\"><span class=\"mord text mtight\"><span class=\"mord mtight\">id</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3448em;\"><span style=\"top:-2.3567071428571427em;margin-right:0.07142857142857144em;\"><span class=\"pstrut\" style=\"height:2.5em;\"></span><span class=\"sizing reset-size3 size1 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.14329285714285717em;\"><span></span></span></span></span></span></span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.250305em;\"><span></span></span></span></span></span></span></span></span></span> (as you intuited) and for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>:</mo><mi>X</mi><mo>→</mo><mi>Y</mi></mrow><annotation encoding=\"application/x-tex\">f:X\\to Y</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">X</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.22222em;\">Y</span></span></span></span>, let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msub><mi>η</mi><mi>f</mi></msub><mo>=</mo><msub><mi>η</mi><mi>Y</mi></msub><mo>∘</mo><mi>F</mi><mi>f</mi><mo>=</mo><mi>G</mi><mi>f</mi><mo>∘</mo><msub><mi>η</mi><mi>X</mi></msub></mrow><annotation encoding=\"application/x-tex\">\\eta_f = \\eta_Y\\circ Ff = Gf\\circ \\eta_X</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.716668em;vertical-align:-0.286108em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.3361079999999999em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.10764em;\">f</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.286108em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.63889em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.22222em;\">Y</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mord mathnormal\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∘</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">η</span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.32833099999999993em;\"><span style=\"top:-2.5500000000000003em;margin-left:-0.03588em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.07847em;\">X</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.15em;\"><span></span></span></span></span></span></span></span></span></span>.</p>",
        "id": 228141665,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1614531008
    },
    {
        "content": "<blockquote>\n<p>I see a Functor as a parametrized theory.  Often, I see that as a marked context, where you have two categories in an initial segment, with the parts of Functor in the rest. The marked context is invariant, so the context-to-context mapping must be the identity.</p>\n</blockquote>\n<p>If someone had tried to explain a functor to me like this I would have run away in terror.  I don't know what any of these phrases mean: \"parametrized theory\", \"marked context\", \"categories in an initial segment\", \"invariant marked context\", \"context-to-context mapping\".    Each one of them seems - to me - much more complicated and intimidating than the concept of \"functor\".</p>\n<p>So, it goes to show that category theory is so flexible that people can have radically different intuitions about what it's \"really about\".</p>",
        "id": 228143131,
        "sender_full_name": "John Baez",
        "timestamp": 1614532495
    },
    {
        "content": "<p>Sorry if I was not precise: I did not mean to explain 'Functor' via all of these things! A Functor is <em>just</em> a homomorphism of categories.</p>\n<p>What I was explaining is how to derive a natural transformation's definition as an instance of a construction over presentations of Generalized Algebraic Theories (in the sense of Cartmell). In other words, I was trying to explain 'generalized homomorphism' as an explicit construction.  So I first needed to encode Functor in that setting - thus all the mumbo jumbo.  Universal Algebra has just as much mumbo jumbo needed to define signatures and algebras, and from there, constructions over these.</p>",
        "id": 228143773,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614533116
    },
    {
        "content": "<p>Okay, sorry.  I  slipped.  I should have said \"if someone had tried to define a natural transformation this way...\"</p>",
        "id": 228144016,
        "sender_full_name": "John Baez",
        "timestamp": 1614533284
    },
    {
        "content": "<p>Funny thought... one day when I'm a grumpy old guy sitting in the back row of ACT 30, I'm going to bring an air horn and fire it once per utterance of the word \"just\" in the room &lt;s/&gt;</p>",
        "id": 228144051,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1614533340
    },
    {
        "content": "<p>That's just rude.</p>",
        "id": 228144086,
        "sender_full_name": "John Baez",
        "timestamp": 1614533369
    },
    {
        "content": "<p>BLAAP!!!</p>",
        "id": 228144106,
        "sender_full_name": "John Baez",
        "timestamp": 1614533392
    },
    {
        "content": "<p>Isn't that almost the definition of 'grumpy old guy'?</p>",
        "id": 228144148,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614533407
    },
    {
        "content": "<p>But anyway, <span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span> , yes, I can see the idea of trying to define a functor in the language of universal algebra (or maybe some generalization of it) so one can see natural transformations as homomorphisms between functors.</p>",
        "id": 228144175,
        "sender_full_name": "John Baez",
        "timestamp": 1614533451
    },
    {
        "content": "<p>I don't think that's crazy.</p>",
        "id": 228144200,
        "sender_full_name": "John Baez",
        "timestamp": 1614533473
    },
    {
        "content": "<p>It does turn out to be rather less straightforward than it first seems.</p>",
        "id": 228144279,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614533568
    },
    {
        "content": "<p>I usually try to motivate naturality squares using ideas like this: if it were possible to <em>flawlessly</em> translate from English to German, you could have a map from \"questions to English\" to \"answers in English\", and a map from \"questions in German\" to \"answers in German\".... and then for any question in English,</p>\n<p>answering it in English and translating the answer to German</p>\n<p>should agree with</p>\n<p>translating it into German and answering it in German.</p>",
        "id": 228144607,
        "sender_full_name": "John Baez",
        "timestamp": 1614533807
    },
    {
        "content": "<p>In physics the same sort of naturality square shows up when we say a theory of physics is \"generally covariant\", or \"coordinate-independent\".</p>",
        "id": 228144636,
        "sender_full_name": "John Baez",
        "timestamp": 1614533841
    },
    {
        "content": "<p>We can answer a question in one coordinate system and then change coordinates, or change coordinates first and then answer the question, and the result is the same.</p>",
        "id": 228144652,
        "sender_full_name": "John Baez",
        "timestamp": 1614533876
    },
    {
        "content": "<p>That message on 'coordinates' resonates a lot with me. I did a lot of work on creating a programming language for probabilistic programming <a href=\"https://github.com/hakaru-dev/hakaru\">Hakaru</a> where this shows up in the following sense: given a presentation of a measure (as a program), <strong>conditioning</strong> corresponds exactly to a change of variables in which the quantity we want to condition by becomes a straight line. [Yes, for the lens lovers, there is indeed a relation.] Then you can integrate things out.  In practice, this involves a lot of real algebraic geometry (Marc Moreno Maza's <a href=\"http://www.regularchains.org/\">Regular Chains</a> work was indispensible here).  This even deals correctly with conditioning out on measure 0 events - when it works. </p>\n<p>You (<span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> ) might be amused that holonomic functions, as taught to me again by Philippe Flajolet, have a staring role in Hakaru: they are used to give normal forms to the representation of most of the probability distributions that show up in practice, and to give an algorithmic handle on conjugate priors.</p>",
        "id": 228145379,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1614534578
    },
    {
        "content": "<p>Quoting from an <a href=\"https://www.quantamagazine.org/tadashi-tokieda-collects-math-and-physics-surprises-20181127\">interview</a> with Tadashi Tokieda:</p>\n<blockquote>\n<p>I ask them, what do you think constitutes a practical application? It’s very surprising. Roughly speaking, people converge within five to 10 minutes onto two categories of practical applications. One is, if you manage to make several million dollars instantly. The other is, if you manage to kill millions of people instantly. Many people are actually kind of shocked by their own answers.</p>\n</blockquote>",
        "id": 235678866,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619098845
    },
    {
        "content": "<p>Yeah, this is something I've thought about a bunch</p>",
        "id": 235717557,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1619112871
    },
    {
        "content": "<p>One I made earlier: <a href=\"https://twitter.com/_julesh_/status/1185596885026967553?s=20\">https://twitter.com/_julesh_/status/1185596885026967553?s=20</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/_julesh_/status/1185596885026967553?s=20\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/972424350736486401/RyVTQIgf_normal.jpg\"></a><p>I suspect there's quite a lot of people out there who believe, deep down, that \"applied mathematics\" means \"mathematics that can be used to extract money from poor people\"</p><span>- julesh (@_julesh_)</span></div></div>",
        "id": 235717573,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1619112878
    },
    {
        "content": "<p>A relevant Bertrand Russell quote: </p>\n<blockquote>\n<p>In universities, mathematics is taught mainly to men who are going to teach mathematics to men who are going to teach mathematics to ...  Sometimes, it is true, there is an escape from this treadmill.  Archimedes used mathematics to kill Romans, Galileo to improve the Grand Duke of Tuscany’s artillery, modern physicists (grown more ambitious) to exterminate the human race.  It is usually on this account that the study of mathematics is commended to the general public as worthy of State support.</p>\n</blockquote>",
        "id": 235717942,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1619113000
    },
    {
        "content": "<p>Within academia, \"applied math\" means \"math that can be applied to getting big grants\".   Many mathematicians study applications of math, but only the ones who can get big grants are called applied mathematicians.</p>",
        "id": 235717945,
        "sender_full_name": "John Baez",
        "timestamp": 1619113001
    },
    {
        "content": "<blockquote>\n<p>In universities, mathematics is taught mainly to men who are going to teach mathematics to men who are going to teach mathematics to ... Sometimes, it is true, there is an escape from this treadmill. </p>\n</blockquote>\n<p>Women!</p>",
        "id": 235717983,
        "sender_full_name": "John Baez",
        "timestamp": 1619113016
    },
    {
        "content": "<p>Yeah that part of the quote certainly didn't age well</p>",
        "id": 235718023,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1619113032
    },
    {
        "content": "<p>My experience is that traditionally, \"applied mathematics\" means modeling with differential equations, whereas nowadays many of us are working to liberate it from that.  I know plenty of people who call themselves applied mathematicians but don't get big grants.  And depending on your definition of \"big\" I know some very pure mathematicians who've gotten big grants.</p>",
        "id": 235719444,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1619113579
    },
    {
        "content": "<p>I didn't say all applied mathematicians get big grants; they're in subjects that <em>can</em> get big grants.  \"Big\" means, say, over a million bucks.   In our department any applied mathematician who doesn't regularly get at least $100,000 grants is looked at as not being successful yet: we hire young applied mathematicians who haven't gotten grants like that, but we're hoping they will.</p>\n<p>Another sign of being applied is that you can get grants in the US from government agencies other than the NSF.</p>\n<p>HoTT may turn out to be applied mathematics, since it got a  $7.5 million grant from the US Air Force Office of Scientific Research.     In 2017, an <a href=\"https://web.archive.org/web/20190331154935/https://www.arl.army.mil/www/pages/8/W911NF-17-S-0002%20ARO-Core-BAA-Amendment-03.PDF\">Army Research Office Broad Agency Announcement for Fundamental Research</a> wrote:</p>\n<blockquote>\n<p>Modeling frameworks are desired that are able to eschew the usual computational simplification assumptions and realistically capture … complexities of real world environments and phenomena, while still maintaining some degree of computational tractability. Of specific interest are causal and predictive modeling frameworks, hybrid model frameworks that capture both causal and predictive features, statistical modeling frameworks, and abstract categorical models (cf. Homotopy Type Theory).</p>\n</blockquote>\n<p>and later:</p>\n<blockquote>\n<p>Homotopy Type Theory and its applications are such an area that is of significant interest in military applications.</p>\n</blockquote>\n<p>Lots of \"big data\" mathematics has nothing to do with differential equations - though yes, traditionally a lot of applied math used differential equations.   </p>\n<p>In 1986 at MIT the applied math department contained fluid dynamics, combinatorics, and two rogue particle physicists: Kerson Huang and Dan Friedman.   I don't know what that department is like now.</p>",
        "id": 235720647,
        "sender_full_name": "John Baez",
        "timestamp": 1619114029
    },
    {
        "content": "<p>I think it is not all so bleak, personally. The coin of “dual use” does have a peaceful side. </p>\n<p>Sometimes the peaceful side is mass surveillance, but other times we get better logistics (which is <em>agressively</em> dual use).</p>",
        "id": 235728792,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619117238
    },
    {
        "content": "<p>For me \"applied mathematics\" means doing mathematics by keeping a look on a very practical (as in real life) problem one wants to solve. This may seem trivial, but A LOT of people that think they are doing applied maths make some assumptions that are absolutely unreasonable from a practical point of view. In the end, you have a nice mathematical model, but it has no real application. Everyone working hard to make sure this doesn't happen deserves the name \"applied mathematician\" in my opinion</p>",
        "id": 235728975,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619117310
    },
    {
        "content": "<p>What if my real-life problem is that I want to understand, say, inverse semigroups, because I think they are super cool and want to force them on my friends?</p>",
        "id": 235729222,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619117419
    },
    {
        "content": "<p>I’m only being mildly facetious. I think “real life” is in many ways like a “true Scotsman”.</p>",
        "id": 235729476,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619117540
    },
    {
        "content": "<p>... maybe the real applications are the friends we make along the way.</p>",
        "id": 235736087,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619120366
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235728975\">said</a>:</p>\n<blockquote>\n<p>For me \"applied mathematics\" means doing mathematics by keeping a look on a very practical (as in real life) problem one wants to solve. This may seem trivial, but A LOT of people that think they are doing applied maths make some assumptions that are absolutely unreasonable from a practical point of view. In the end, you have a nice mathematical model, but it has no real application. Everyone working hard to make sure this doesn't happen deserves the name \"applied mathematician\" in my opinion</p>\n</blockquote>\n<p>I'm not sure the distinction between pure and applied is this clear. Sure, the standard you espouse is a laudable one, but what often happens in applied math falls under \"let's solve some related toy problems that are close to the (currently too hard) unsimplified problems\". Of course, if you solve an unrealistic toy problem you don't get to claim victory over the real problems, but work like this can eventually  help the work of those unwilling to assume the difficulties away.</p>",
        "id": 235736840,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1619120702
    },
    {
        "content": "<p>I would add that all models are wrong. We seem to be doing okay anyway.</p>",
        "id": 235737748,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619121054
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235729476\">said</a>:</p>\n<blockquote>\n<p>I’m only being mildly facetious. I think “real life” is in many ways like a “true Scotsman”.</p>\n</blockquote>\n<p>Then you have your answer. I am not a Wittgensteinian and I despise analytic philosophy, so I don't tend to play these word-games. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 235740631,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619122330
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277285\">Martti Karvonen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235736840\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235728975\">said</a>:</p>\n<blockquote>\n<p>For me \"applied mathematics\" means doing mathematics by keeping a look on a very practical (as in real life) problem one wants to solve. This may seem trivial, but A LOT of people that think they are doing applied maths make some assumptions that are absolutely unreasonable from a practical point of view. In the end, you have a nice mathematical model, but it has no real application. Everyone working hard to make sure this doesn't happen deserves the name \"applied mathematician\" in my opinion</p>\n</blockquote>\n<p>I'm not sure the distinction between pure and applied is this clear. Sure, the standard you espouse is a laudable one, but what often happens in applied math falls under \"let's solve some related toy problems that are close to the (currently too hard) unsimplified problems\". Of course, if you solve an unrealistic toy problem you don't get to claim victory over the real problems, but work like this can eventually  help the work of those unwilling to assume the difficulties away.</p>\n</blockquote>\n<p>The key difference is that there are people that solve a toy problem and are happy, and people that solve a toy problem and use this as motivation to do more</p>",
        "id": 235740692,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619122374
    },
    {
        "content": "<p>I've definitely met a lot of research that was concerned with toy models that CLEARLY in the mind of the authors weren't really a way to step up to the real issues</p>",
        "id": 235740769,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619122427
    },
    {
        "content": "<p>In that case your mindset can be described as \"playing with applications\" at best, not as an applied mathematician. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 235740833,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619122453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235740631\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235729476\">said</a>:</p>\n<blockquote>\n<p>I’m only being mildly facetious. I think “real life” is in many ways like a “true Scotsman”.</p>\n</blockquote>\n<p>Then you have your answer. I am not a Wittgensteinian and I despise analytic philosophy, so I don't tend to play these word-games. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>\n<p>Also, as you can see I am embracing a stricly applied definition. I want a working criterium to categorize things, and I don't care if it doesn't work 10% of the time. I still have a 90% effective definition and I prefer this to spending a lot of time to formalize really precisely something that is intuitively understandable because of ad-hoc corner cases <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 235741069,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619122577
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235740833\">said</a>:</p>\n<blockquote>\n<p>In that case your mindset can be described as \"playing with applications\" at best, not as an applied mathematician. :)</p>\n</blockquote>\n<p>I agree that there's a difference in mindsets, but it probably helps the applied applied people that there's people specializing in \"playing with applications\", even if such people deep down don't care about the applications. I'd also classify such work as applied math (as opposed to pure math) as the motivations for problems more or less track the applications and not only the internal developments of the theory. Now, at times drawing up a distinction like yours might be important (e.g. if you want to figure out if someone you're working with actually wants to solve the practical problem at hand or merely solve similar problems for whatever reason), but overall I wouldn't want to prop up such distinctions too much: it's bit of a spectrum and people can and do move along it.</p>",
        "id": 235741732,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1619122925
    },
    {
        "content": "<p>Well to that matter I never understood the purpose of these applications discussions</p>",
        "id": 235744369,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619124175
    },
    {
        "content": "<p>But people seem to like them very much here, they spawn every so often</p>",
        "id": 235744400,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1619124190
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235729222\">said</a>:</p>\n<blockquote>\n<p>What if my real-life problem is that I want to understand, say, inverse semigroups, because I think they are super cool and want to force them on my friends?</p>\n<p>I’m only being mildly facetious. I think “real life” is in many ways like a “true Scotsman”.</p>\n</blockquote>\n<p>I don't believe in \"real life\", but I think it makes some sense to distinguish between applications of math that are of interest <em>outside</em> mathematics, versus applications <em>within</em> mathematics.  </p>\n<p>For example, category theory was born due to its applications within mathematics, so I use \"applied category theory\" to cover applications of category theory that are (or could be) of interest outside mathematics.</p>",
        "id": 235771258,
        "sender_full_name": "John Baez",
        "timestamp": 1619139177
    },
    {
        "content": "<p>I don't restrict \"applied category theory\" to mean category theory used to make products like software.   When I'm using category theory to study classical mechanics I call it applied category theory. </p>\n<p>But someone else might disagree.  And then we'd have to fight to the death.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 235771475,
        "sender_full_name": "John Baez",
        "timestamp": 1619139362
    },
    {
        "content": "<p>I think that's a good way to slice it up.</p>",
        "id": 235800675,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619163849
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/235744369\">said</a>:</p>\n<blockquote>\n<p>Well to that matter I never understood the purpose of these applications discussions</p>\n</blockquote>\n<p>Perhaps we are engaged in a \"pure\" discussion of applications <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 235800892,
        "sender_full_name": "Chad Nester",
        "timestamp": 1619163985
    },
    {
        "content": "<p>Mathematics is so interconnected and interdependent and the applicability of any one concept (within mathematics or to science) is so unpredictable that the traditional pure/applied distinction seems more like a convenient way to talk about funding (and maybe to denigrate certain subjects, eg combinatorics, as not ‘pure’ enough)</p>",
        "id": 235803927,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619165753
    },
    {
        "content": "<p>Is application transitive? Or do you have to be right at the intersection with science to be considered applied?</p>",
        "id": 235804095,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619165868
    },
    {
        "content": "<p>In this thread I talk about a paper that's very-applied category theory: <a href=\"https://twitter.com/_julesh_/status/1478725018720903175?s=21\">https://twitter.com/_julesh_/status/1478725018720903175?s=21</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/_julesh_/status/1478725018720903175?s=21\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/1c38dae13d7d4fd46ab247a777814c65ce052ca7/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f3937323432343335303733363438363430312f52795654514967665f6e6f726d616c2e6a7067\"></a><p>My collaborator Philipp Zahn (with Nicolas Eschenbaum and Filip Mellgren) just released a new paper, “Robust algorithmic collusion”: <a href=\"https://t.co/Ga8UHwWfrR\">https://arxiv.org/abs/2201.00345</a>\n\ntl;dr 1. Learning collusion is a bit more subtle and less certain than recently suggested\n2. Open games go brr\n\n[thread] <a href=\"https://t.co/NXzX5fTcLd\">https://twitter.com/_julesh_/status/1478725018720903175/photo/1</a></p><span>- julesh supports UCU action (@_julesh_)</span><div class=\"twitter-image\"><a href=\"https://t.co/NXzX5fTcLd\"><img src=\"https://uploads.zulipusercontent.net/e6264a35358a76166a3bb95b0d8ccaaac9936440/68747470733a2f2f7062732e7477696d672e636f6d2f6d656469612f464956386b514957594149367634672e6a70673a7468756d62\"></a></div></div></div><p>As I say in the thread, the paper intentionally makes zero references to category theory. It's all hidden deep inside the code</p>",
        "id": 266942627,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1641393549
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT.20as.20a.20field/near/266942627\">said</a>:</p>\n<blockquote>\n<p>As I say in the thread, the paper intentionally makes zero references to category theory. It's all hidden deep inside the code</p>\n</blockquote>\n<p>Thanks for pointing this out. Curious to know if you have any other examples.</p>",
        "id": 269924886,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1643538439
    }
]