[
    {
        "content": "<p>The technical problems with nLab have brought back to the front of my mind the old question of whether we ought to have a separate wiki for ACT. I was pushing that idea pretty hard about 3 years ago, but the consensus back then was \"just contribute to the nLab\"</p>",
        "id": 281144799,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651665750
    },
    {
        "content": "<p>I have the feeling that in ACT we have sleepwalked over a few years into a situation where it's not as easy to get into the field as we originally intended. I think we have a situation where we have excellent entry level resources (like 7 Sketches) and pretty good research papers, but a gap in between where knowledge spread between multiple research papers is not being consolidated very well. This is the role that the nLab generally plays</p>",
        "id": 281145055,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651665936
    },
    {
        "content": "<p>I still like the version I proposed back in the day which is a dual purpose ACT wiki + pedagogical wiki, with general category theory articles pitched at a <em>much</em> lower level than the nLab</p>",
        "id": 281145212,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651666041
    },
    {
        "content": "<p>The kind of place where you can send an engineer, or an economist or whatever, and they can just browse and learn stuff</p>",
        "id": 281145377,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651666162
    },
    {
        "content": "<p>I think my answer is the same of 3 years ago: nlab exists because there is just one person that writes pages at a maniacal pace. If we have someone in the ACT community willing to do the same by all means this will work. Otherwise reaching the critical mass for a wiki to be useful will be very hard.</p>",
        "id": 281145408,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1651666187
    },
    {
        "content": "<p>Wikipedia seems to tolerate a high level of technicality even for mathematical articles. Why not contribute there?</p>",
        "id": 281145542,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1651666261
    },
    {
        "content": "<p>Full Disclosure: I am super lazy and most likely would not contribute too much (or at all) to writing for such wiki. I am giving for granted many people would do the same, both for lack of will and time. So if you want to push this idea forward I suggest start looking for heroes willing to put a lot of time into it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 281145586,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1651666285
    },
    {
        "content": "<p>Right, that's the <em>real</em> bottleneck is the realisation that the main nLab contributors are literal superhumans</p>",
        "id": 281145683,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651666340
    },
    {
        "content": "<p>The problem with this idea is that someone has to do the work. Why not spend that time writing papers (or a book)?</p>",
        "id": 281146705,
        "sender_full_name": "Chad Nester",
        "timestamp": 1651666951
    },
    {
        "content": "<p>I think that is the thought process most people go through, but it's not like the primary contributors of the nLab don't write many papers.</p>",
        "id": 281146810,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651667020
    },
    {
        "content": "<p>If you're willing to do it yourself that's great and maybe people will chip in, but expecting it to magically materialize from the community is wishful thinking</p>",
        "id": 281146889,
        "sender_full_name": "Chad Nester",
        "timestamp": 1651667045
    },
    {
        "content": "<p>Indeed, I realise this... I got a permanent job since last time so I don't have to publish constantly, but to make up for it there's a <em>lot</em> of other stupid stuff that eats most of my time</p>",
        "id": 281146970,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651667105
    },
    {
        "content": "<p>My feeling is that it might be worth an attempt if it's really easy for someone to get the tech running, so failure is cheap. If it's a nightmare to set up the tech (eg getting TikZ support is the kind of thing that could be tricky), then most likely not worth it</p>",
        "id": 281148043,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651667743
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/ACT.20wiki.3F/near/281146810\">said</a>:</p>\n<blockquote>\n<p>I think that is the thought process most people go through, but it's not like the primary contributors of the nLab don't write many papers.</p>\n</blockquote>\n<p>nlab evolved out of Urs' personal notes. There are people that have the need of writing everything they learn down in clear form. These people are the best suited for contributing to wikis because, essentially, they would write stuff down anyway</p>",
        "id": 281148377,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1651667907
    },
    {
        "content": "<p>I believe that the majority of people are messier tho, so for them doing so would be an extra effort, to which <span class=\"user-mention\" data-user-id=\"276114\">@Chad Nester</span> reasoning applies.</p>",
        "id": 281148442,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1651667943
    },
    {
        "content": "<p>I was considering starting a new web-first repository of notes but (1) my day job is programming and heaven forbid I program in my free time too (2) I don't have time to do research either. But I notice that people refer to my old notes and it's getting embarrassing how many typos and mistakes there are and I keep thinking I should rewrite them...</p>",
        "id": 281149519,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1651668470
    },
    {
        "content": "<p>One of the biggest drawbacks in my view to having a separate ACT wiki is the necessary overlap it would have with nLab. Should we accept the fact that we'll have duplicate pages? Is it unethical to copy paste between them? Should different people separately develop pages on the same topic, doubling the energy put into exposition? I bet there's an obvious answer to this I'm just not thinking of.</p>",
        "id": 281149959,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651668716
    },
    {
        "content": "<p>To be clear, I'm generally positive of the notion of an ACT wiki, this is just one thing that I worry about.</p>",
        "id": 281150166,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651668814
    },
    {
        "content": "<p>Personally my suggestion is that significant overlap with the nLab should be avoided, and material that belongs on nLab should obviously continue going there</p>",
        "id": 281150569,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651669011
    },
    {
        "content": "<p>Is the primary reason you want a separate wiki that you want the material to be at a more introductory level?</p>",
        "id": 281151424,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1651669348
    },
    {
        "content": "<p>For ACT content no, but there are different things that separate it from the nLab, such as code snippets in as many programming languages as possible, and a high tolerance for material that isn't (or isn't yet) category theory</p>",
        "id": 281152239,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651669711
    },
    {
        "content": "<p>It's a separate question whether an ACT wiki should have a dual purpose as a pedagogical (not-applied) category theory resource. That stuff has a more compelling argument to be on the nLab or Wikipedia (I can easily imagine lots of nLab articles titled like \"non-technical introduction to X\"), although with nLab the risk is that you send your new engineer friend to a pedagogical article, they click on the wrong link and then run away screaming and never talk to you again</p>",
        "id": 281152478,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651669820
    },
    {
        "content": "<p>My view is that Wikipedia, being a general-audience encyclopedia, should not be anywhere near as technical as it is now for some articles... or at least, include more general-audience exposition.</p>",
        "id": 281152611,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1651669879
    },
    {
        "content": "<p>Wikipedia is also in its own way equally as intimidating as the nLab. They do tend to delete first and ask questions later</p>",
        "id": 281153025,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651670094
    },
    {
        "content": "<p>The nLab already has a pretty high tolerance for material that isn't category theory, e.g., <a href=\"https://ncatlab.org/nlab/show/locally%20compact%20and%20sigma-compact%20spaces%20are%20paracompact\">[[locally compact and sigma-compact spaces are paracompact]]</a></p>",
        "id": 281153320,
        "sender_full_name": "Reid Barton",
        "timestamp": 1651670217
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/ACT.20wiki.3F/near/281146705\">said</a>:</p>\n<blockquote>\n<p>The problem with this idea is that someone has to do the work. Why not spend that time writing papers (or a book)?</p>\n</blockquote>\n<p>People who actually set up wikis or contribute a lot to them aren't the people who worry a lot about this.   </p>\n<p>Urs Schreiber writes plenty of books <em>and also</em> tons of articles on the nLab - check out his 2 new <a href=\"https://ncatlab.org/nlab/show/Urs+Schreiber#publications\">textbooks</a> on homological algebra and stable homotopy theory.   Mike Shulman writes plenty of papers and contributes a lot to the nLab.   I write plenty of papers and contribute to the nLab and explain math and physics on Twitter for fun.  I also set up a wiki but it sort of fizzled out for various reasons.  I spent about 2 years writing a lot of articles on that wiki.   It didn't stop me from doing other things.</p>\n<p>But you can't <em>get someone else</em> to be energetic like this!    Energy arises from a combination of passion and self-discipline.   People who write a lot tend to center their lives on this activity.</p>",
        "id": 281173485,
        "sender_full_name": "John Baez",
        "timestamp": 1651678747
    },
    {
        "content": "<p>I believe no amount of chatting about whether it would be good to have a wiki will make a wiki appear... unless a couple of extremely energetic people decide to do it.   </p>\n<p>So this conversation reminds me a bit of people chatting about Olympic sports like pole-vaulting.   \"It would be good to have someone start pole-vaulting...\"</p>",
        "id": 281174885,
        "sender_full_name": "John Baez",
        "timestamp": 1651679330
    },
    {
        "content": "<p>In my case I <em>might</em> have the capacity to do a bunch of writing, depending on how things go, but I have roughly as much chance of setting up a wiki as a caveman has to operate a smartphone</p>",
        "id": 281184070,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651682920
    },
    {
        "content": "<p>If you are really good at writing a lot, just write a lot and people will set up a wiki for you.</p>",
        "id": 281188679,
        "sender_full_name": "John Baez",
        "timestamp": 1651684693
    },
    {
        "content": "<p>But it doesn't work like this: \"please set up a wiki and then maybe I'll write a lot\".</p>",
        "id": 281188793,
        "sender_full_name": "John Baez",
        "timestamp": 1651684745
    },
    {
        "content": "<p>Or: maybe someone will do it, but then you've got an obligation hanging over you.</p>",
        "id": 281188974,
        "sender_full_name": "John Baez",
        "timestamp": 1651684810
    },
    {
        "content": "<p>Could we start invading the Azimuth Wiki turning it into an ACT wiki? Even just as a test to see if there's enough wiki-energy in ACT.</p>",
        "id": 281189048,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651684840
    },
    {
        "content": "<p>Sure, that would be great.  It''s possible right now the certificate has expired, and I've been too lazy to fix that, but I've been meaning to fix it.  Go here:</p>\n<p><a href=\"https://www.azimuthproject.org/azimuth/show/HomePage\">https://www.azimuthproject.org/azimuth/show/HomePage</a></p>\n<p>don't worry about the warning, and start writing articles!</p>",
        "id": 281189310,
        "sender_full_name": "John Baez",
        "timestamp": 1651684968
    },
    {
        "content": "<p>Let me try to figure out how to pay for the certificate - the guy who was doing that quit.</p>",
        "id": 281189381,
        "sender_full_name": "John Baez",
        "timestamp": 1651684998
    },
    {
        "content": "<p>Cool! Let's see how this goes..........</p>",
        "id": 281280804,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1651747156
    },
    {
        "content": "<p>I just remembered that someone had actually made an ACT wiki, but it didn't pick up steam for some reason:<br>\n<a href=\"https://wiki.functorialwiki.org/act/show/HomePage\">https://wiki.functorialwiki.org/act/show/HomePage</a></p>",
        "id": 281292471,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651754281
    },
    {
        "content": "<p>It seems like David Tanzer and I were the only ones working on it.</p>",
        "id": 281292600,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1651754341
    },
    {
        "content": "<p>Someone must be paying for the SSL certificate and web hosting.  Maybe David Tanzer???  You/we need to know these things if you/we are going to develop a wiki and take it seriously.</p>\n<p>It looks to be using Instiki, the same wiki software the nLab used to use, and my Azimuth wiki uses.</p>",
        "id": 281321096,
        "sender_full_name": "John Baez",
        "timestamp": 1651767010
    },
    {
        "content": "<p>I use certbot directly rom the EFF for my certificates and don't need to pay for anything.But maybe your hosting situation is different.</p>",
        "id": 281389015,
        "sender_full_name": "Simonas Tutlys",
        "timestamp": 1651812191
    }
]