[
    {
        "content": "<p>Due to the coronavirus outbreak, many universities are moving activities online. This is a great opportunity to open up ACT2020 to a broader audience, with speakers from around the world.</p>\n<p>The conference will take place July 6-10 online, coordinated by organizers in Boston USA. Each day there will be around six hours of live talks, which will be a bit more spaced out than usual to accommodate the different time zones of our speakers. All the talks will be both live streamed and recorded on YouTube. We will also have chat rooms and video chats in which participants can discuss various themes in applied category theory.</p>\n<p>We will give more details as they become available and post updates on our official webpage:</p>\n<p><a href=\"http://act2020.mit.edu\" target=\"_blank\" title=\"http://act2020.mit.edu\">http://act2020.mit.edu</a></p>\n<p>Since there is no need to book travel, we were able to postpone the acceptance notification, and hence the submission deadline. If you would like to speak, please prepare an abstract or a conference paper according to the instructions here:</p>\n<p><a href=\"http://act2020.mit.edu/#papers\" target=\"_blank\" title=\"http://act2020.mit.edu/#papers\">http://act2020.mit.edu/#papers</a></p>\n<p>Important dates (all in 2020)</p>\n<p>• Submission of contributed papers: May 16<br>\n• Acceptance/Rejection notification: June 07<br>\n• Tutorial day: July 5<br>\n• Main conference: July 6-10</p>\n<p>Registration will now be free; please register for the conference ahead of time here:</p>\n<p><a href=\"http://act2020.mit.edu/#registration\" target=\"_blank\" title=\"http://act2020.mit.edu/#registration\">http://act2020.mit.edu/#registration</a></p>\n<p>We will send registering participants links to the live stream, the recordings, and the chat rooms, and we’ll use the list to inform participants of any changes.</p>\n<p>All the best,<br>\nThe ACT committee</p>\n<p>Here are the local organizers:</p>\n<p>• Destiny Chen (administration)<br>\n• Brendan Fong<br>\n• David Jaz Myers (logistics)<br>\n• Paolo Perrone (publicity)<br>\n• David Spivak</p>\n<p>Here is the committee running the school:</p>\n<p>• Carmen Constantin<br>\n• Eliana Lorch<br>\n• Paolo Perrone</p>\n<p>Here is the steering committee:</p>\n<p>• John Baez<br>\n• Bob Coecke<br>\n• David Spivak<br>\n• Christina Vasilakopoulou</p>\n<p>Here is the program committee:</p>\n<p>• Mathieu Anel, CMU<br>\n• John Baez, University of California, Riverside<br>\n• Richard Blute, University of Ottawa<br>\n• Tai-Danae Bradley, City University of New York<br>\n• Andrea Censi, ETC Zurich<br>\n• Bob Coecke, University of Oxford<br>\n• Valeria de Paiva, Samsung Research America and University of Birmingham<br>\n• Ross Duncan, University of Strathclyde<br>\n• Eric Finster, University of Birmingham<br>\n• Brendan Fong, Massachusetts Institute of Technology<br>\n• Tobias Fritz, Perimeter Institute for Theoretical Physics<br>\n• Richard Garner, Macquarie University<br>\n• Fabrizio Romano Genovese, Statebox<br>\n• Amar Hadzihasanovic, IRIF, Université de Paris<br>\n• Helle Hvid Hansen, Delft University of Technology<br>\n• Jules Hedges, Max Planck Institute for Mathematics in the Sciences<br>\n• Kathryn Hess Bellwald, Ecole Polytechnique Fédérale de Lausanne<br>\n• Chris Heunen, The University of Edinburgh<br>\n• Joachim Kock, UAB<br>\n• Tom Leinster, The University of Edinburgh<br>\n• Martha Lewis, University of Amsterdam<br>\n• Daniel R. Licata, Wesleyan University<br>\n• David Jaz Myers, Johns Hopkins University<br>\n• Paolo Perrone, MIT<br>\n• Vaughan Pratt, Stanford University<br>\n• Peter Selinger, Dalhousie University<br>\n• Michael Shulman, University of San Diego<br>\n• <em>David I. Spivak, MIT (co-chair)</em><br>\n• Walter Tholen, York University<br>\n• Todd Trimble, Western Connecticut State University<br>\n• <em>Jamie Vicary, University of Birmingham (co-chair)</em><br>\n• Maaike Zwart, University of Oxford</p>",
        "id": 191542692,
        "sender_full_name": "John Baez",
        "timestamp": 1585000877
    },
    {
        "content": "<p>Thread for everyone to talk about what they'll be presenting at ACT2020</p>",
        "id": 200045108,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591567930
    },
    {
        "content": "<p>I'll be talking about Petri nets with catalysts: <a href=\"https://compositionality-journal.org/papers/compositionality-1-4/\">https://compositionality-journal.org/papers/compositionality-1-4/</a></p>",
        "id": 200045212,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591568102
    },
    {
        "content": "<p>The basic idea is that if your Petri net has a \"catalyst\", then the category of executions is actually a disjoint union of a bunch of subcategories, each corresponding to the possibilities for a given amount of catalyst.</p>",
        "id": 200045296,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591568229
    },
    {
        "content": "<p>These subcategories inherit a premonoidal structure from the bigger category's monoidal structure, and you can modify the string diagrams to fit that setting to keep track of where the catalysts are being used.</p>",
        "id": 200045439,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591568429
    },
    {
        "content": "<p>This to me occupies a sort of corner case of the monoidal Grothendieck construction, since there we have a theorem that says that if you have a monoidal (op)fibration and the base category is (co)cartesian, you can transfer monoidal structures between the fibres and the total category.</p>",
        "id": 200045510,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591568565
    },
    {
        "content": "<p>But in this case we don't have a cartesian base, so the monoidal structure of the total category breaks on it's way to the fibres.</p>",
        "id": 200045536,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591568637
    },
    {
        "content": "<p>My paper got rejected, but I think in particular one reviewer didn't understand anything about it. So I'm going to explain what we did anyway.<br>\nWe started with finite state machines, and wanted to turn them into ZK-SNARKs. A ZK-SNARK is a type of zero knowledge proof. That is, it is a way to prove that I know or did something (e.g. I performed a computation) without revealing anything about it. We want to do this so that we can deploy an execution trace of a given FSM on the blockchain without revealing at all what the FSM does.<br>\nZK-SNARK theory is difficult and non-compositional, but you can turn a boolean circuit into a zk-SNARK with already existing software, such as libsnark. So we bypassed the non-compositional part by looking at ways to compositionally turn a FSM into a boolean circuit.<br>\nWe proceeded as follows: First, we noticed that the execution traces of a FSM are just the morphisms in the free category generated by its underlying graph. That is, every morphism in this category represents a possible path of the FSM.<br>\nWe found a way to compositionally assemble circuits verifying that a given sequence of morphisms in a free category composes to a morphism. That is, if I give you <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>f</mi><mo>:</mo><mi>A</mi><mo>→</mo><mi>B</mi></mrow><annotation encoding=\"application/x-tex\">f: A \\to B</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.10764em;\">f</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>g</mi><mo>:</mo><mi>C</mi><mo>→</mo><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">g: C \\to D</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.625em;vertical-align:-0.19444em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.03588em;\">g</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.07153em;\">C</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.02778em;\">D</span></span></span></span> then the circuit will return \"ok\" iff <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>B</mi><mo>=</mo><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">B = C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.07153em;\">C</span></span></span></span>.<br>\nWe then generalized to circuits that can accept both a graph specification and a sequence of morphisms. These return \"ok\" only if the sequence of morphisms defines a valid path in the free category defined by the specification provided to the circuit.</p>\n<p>Since what we need is actually a circuit implementation to pass to libsnark, we had to work in a bicategorical setting. That is, we couldn't identify extensionally equal circuits because, albeit doing the same thing, these would be different implementations, and libsnark would treat them differently. I think the major contribution of our work is that we weren't using category theory to study boolean circuits, but category theory to compositionally asseble circuits for a real world application. In particular we were working to actually implement this thing in a formally verified way using idris-ct, our formally verified category theory library.<br>\nAlso, this outlined another possible approach to categorical cryptography: Instead of trying to describe/study cryptography compositionally, just use categories to compositionally map structures into cryptographic primitives, and let mainstream cryptography take care of the rest from there.</p>\n<p>We presented this paper in a talk at DEVCON V in Osaka, and you can find it here: <a href=\"https://arxiv.org/abs/1909.02893\">https://arxiv.org/abs/1909.02893</a></p>",
        "id": 200046539,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591570262
    },
    {
        "content": "<p>I'll be talking about this paper:</p>\n<ul>\n<li>John Baez and Kenny Courser, <a href=\"https://arxiv.org/abs/1710.11343\">Coarse-graining open Markov processes</a>.</li>\n</ul>\n<p>It studies the relation between <em>black-boxing</em> an open Markov process and <em>coarse-graining</em> it, i.e. simplifying it by lumping a bunch of states into one.   We do this using a double category where the horizontal morphsms are open Markov processes and coarse-grainings are 2-cells (squares).</p>\n<p>There's some neat stuff required to make everything work.    In addition to double categories we need a reasonable amount of linear algebra, which interacts with the category theory in a neat way.   For example, to get everything to work we need to use a van Kampen cube, which is a funny (but fairly widespread) mixture of pushouts and pullbacks.</p>",
        "id": 200050276,
        "sender_full_name": "John Baez",
        "timestamp": 1591577258
    },
    {
        "content": "<p>Either me or Philipp Zahn will be doing a tool demo for open games with some application to (probably) auction theory (code is <a href=\"https://github.com/jules-hedges/open-games-hs\">https://github.com/jules-hedges/open-games-hs</a>)</p>",
        "id": 200091247,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591620090
    },
    {
        "content": "<p>I'll also be presenting this extended abstract (which I talked about somewhere on here at some point), \"Non-compositionality in categorical systems theory\" <a href=\"https://obsoletewallstreet.files.wordpress.com/2020/05/categorical-systems-theory-3.pdf\">https://obsoletewallstreet.files.wordpress.com/2020/05/categorical-systems-theory-3.pdf</a></p>",
        "id": 200091396,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1591620160
    },
    {
        "content": "<p>I've just been told by <span class=\"user-mention\" data-user-id=\"284297\">@Lachlan McPheat</span> that he (or perhaps one of his coauthors) will be presenting their recent paper on <em>Categorical Vector Space Semantics for Lambek Calculus with a Relevant Modality</em>. I'll encourage him to post on here with an overview of what that's about <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 200096907,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591622885
    },
    {
        "content": "<p>I'll be presenting the first paper that John and I wrote <a href=\"https://www.cambridge.org/core/journals/mathematical-structures-in-computer-science/article/open-petri-nets/4D1BC7F05BE8CB0C83C65F7CDF70AF2F\">Open Petri Nets</a>. It's been a few years since we wrote this and I'm really happy to see how the ideas have matured and the motivations have shifted. It has been selected for a longer talk, so I intend on really getting into it (as well as getting into the motivation).</p>\n<p>This paper is about applying operational semantics to open Petri nets. In particular, there is a symmetric monoidal (double) category where the morphisms are open Petri nets and the composition is gluing. Each Petri net has an associated category whose morphisms represent executions of your Petri net. The construction of this category can be viewed as a symmetric monoidal (double) functor from the (double) category of open Petri nets. Because composition is gluing, this provides a compositional theory for computing the process of your Petri net. This operational semantics can be deflated further to give a <strong>reachability semantics</strong> for open Petri nets. The reachability semantics sends an open Petri net to the reachability relation on its inputs and outputs. However, this semantics is only laxly functorial.</p>",
        "id": 200127496,
        "sender_full_name": "Jade Master",
        "timestamp": 1591635911
    },
    {
        "content": "<p>Hi everybody: I submitted a form to register for the tutorial day and still haven't gotten any kind of confirmation or rejection or anything - I assumed that the June 07 deadline <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> posted was referring to both paper submissions and tutorial day stuff, but now I'm beginning to wonder whether that's the case. Does anyone know if I should be expecting some kind of confirmation, or will I just get emails shortly before to participate?</p>",
        "id": 200406019,
        "sender_full_name": "Bobby T",
        "timestamp": 1591790118
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"279564\">Bobby T</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT2020/near/200406019\">said</a>:</p>\n<blockquote>\n<p>Hi everybody: I submitted a form to register for the tutorial day and still haven't gotten any kind of confirmation or rejection or anything - I assumed that the June 07 deadline <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> posted was referring to both paper submissions and tutorial day stuff, but now I'm beginning to wonder whether that's the case. Does anyone know if I should be expecting some kind of confirmation, or will I just get emails shortly before to participate?</p>\n</blockquote>\n<p>Paper submissions are completely different from tutorial day.   I'll ask the people who run the tutorial day what people should expect.  There was limited seating back before COVID-19 struck, but now tutorial day is happening online, so plans have changed.</p>",
        "id": 200456541,
        "sender_full_name": "John Baez",
        "timestamp": 1591813552
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> and co. are still in the process of re-organizing how tutors will contribute to the tutorial day. It's hoped (based on discussion this evening/morning depending on time zones) that it will be as inclusive as possible, and so even if it's short notice - the tutorial day is next month - I expect that more people will be able to contribute in some form to make the event more accessible. I expect he will post an update here when decisions are made.</p>",
        "id": 200462380,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591816177
    },
    {
        "content": "<p>Alright, excellent, thank you both - I'll keep an eye out for updates!</p>",
        "id": 200774706,
        "sender_full_name": "Bobby T",
        "timestamp": 1592066751
    },
    {
        "content": "<p>Here is an update on the ACT2020 tutorial day.  </p>\n<blockquote>\n<p>Applied category theory offers a rigorous mathematical language and toolset for relating different concepts from across math, science, and technology. For example, category theory finds common patterns between geometry (shapes), algebra (equations), numbers, logic, probability, etc. Applied category theory (ACT) looks for how those very same patterns extend outward to data, programs, processes, physics, linguistics, and so on—things we see in the real world. The field is currently growing, as new applications and common patterns are being found all the time. When you understand these ideas, more of your intuitions about the world can be made rigorous and thus be communicated at a larger scale. This in turn gives our community a chance to solve larger and more complex scientific, technological, and maybe even societal problems. </p>\n<p>This year's international applied category theory conference ACT2020 is having a tutorial day, meant to introduce newcomers to applied category theory. Tutorial day will take place on July 5 and will include a few main topics that will be taught semi-traditionally (via presentation, exercises, and discussion) over Zoom, as well as mentors who will be available throughout the day to work with smaller groups and/or individuals. We invite you to sign up [here](Text for students:<br>\nApplied category theory offers a rigorous mathematical language and toolset for relating different concepts from across math, science, and technology. For example, category theory finds common patterns between geometry (shapes), algebra (equations), numbers, logic, probability, etc. Applied category theory (ACT) looks for how those very same patterns extend outward to data, programs, processes, physics, linguistics, and so on—things we see in the real world. The field is currently growing, as new applications and common patterns are being found all the time. When you understand these ideas, more of your intuitions about the world can be made rigorous and thus be communicated at a larger scale. This in turn gives our community a chance to solve larger and more complex scientific, technological, and maybe even societal problems. </p>\n<p>This year's international applied category theory conference ACT2020 is having a tutorial day, meant to introduce newcomers to applied category theory. Tutorial day will take place on July 5 and will include a few main topics that will be taught semi-traditionally (via presentation, exercises, and discussion) over Zoom, as well as mentors who will be available throughout the day to work with smaller groups and/or individuals. We invite you to <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScUg8cvR28Sr2zxlWMGgeWsDXbz_o4C5SnkbqeAizc7HglcOA/viewform?usp=sf_link\">sign up here</a> if you're interested, so we can keep you posted. Hope to see you there!</p>\n<p>The four courses will be roughly as follows:</p>\n</blockquote>\n<ul>\n<li>David Spivak: categorical databases for introducing sets, functions, categories, and functors</li>\n<li>Fabrizio Genovese: string diagrams as a graphical language for category theory</li>\n<li>Emily Riehl: the Yoneda lemma in the context of matrices</li>\n<li>Paolo Perrone: monads and comonads</li>\n</ul>\n<p>I think this means they're still just trying to get as many students as possible.</p>",
        "id": 201187081,
        "sender_full_name": "John Baez",
        "timestamp": 1592420979
    },
    {
        "content": "<p>Let's revive this thread now that the conference is around the corner!</p>\n<p>I will be talking about a project tentatively titled: </p>\n<ul>\n<li><a href=\"https://www.dropbox.com/s/765ukbwtdgm23oe/blackwell_act.pdf\">Distribution functors, second-order stochastic dominance and the Blackwell--Sherman--Stein Theorem in Categorical Probability</a></li>\n</ul>\n<p>It is a work in collaboration with Tobias Fritz, Paolo Perrone, and Eigil Rischel; in which we study what can one do with Markov categories that have <em>distribution objects</em>, which one can think of as spaces of measures. With this kind of structure, we can prove abstract versions of results such as:</p>\n<ol>\n<li>\n<p>The equivalence between the existence of partial evaluations between two measures and the second-order stochastic dominance relation of the two measures. The latter is a common way to compare measures in terms of how \"spread out\" they are and the former is the lowest level of the <a href=\"https://ncatlab.org/nlab/show/bar+construction\">bar construction</a>.</p>\n</li>\n<li>\n<p>Blackwell-Sherman-Stein Theorem. This result characterizes the \"informativeness\" order relation of statistical models in terms of the existence of a post-processing that simulates one from the other. In particular, it shows that this relation is isomorphic to the second-order stochastic dominance relation of measures over the <em>space of posterior distributions over the tested hypotheses</em> that a Bayesian agent would assign having performed the statistical experiment. That is, a statistical experiment is more informative iff the posteriors are more spread out (so that doing the experiment allows one to distinguish between the hypotheses better), in a precise sense that we can now make use of in any suitable Markov category.</p>\n</li>\n</ol>\n<p>Apart from generalizing some known results from mathematical statistics, we also advance the theoretical understanding of Markov categories relevant to these concepts. Specifically, we elucidate the relation between Markov categories and monoidal monads - showing under what conditions can we think of a Markov category as the Kleisli category of a probability monad (and vice versa).</p>\n<div class=\"message_inline_ref\"><a href=\"https://www.dropbox.com/s/765ukbwtdgm23oe/blackwell_act.pdf\" title=\"blackwell_act.pdf\"><img src=\"https://www.dropbox.com/static/images/spectrum-icons/generated/content/content-pdf-large.png\"></a><div><div class=\"message_inline_image_title\">blackwell_act.pdf</div><desc class=\"message_inline_image_desc\"></desc></div></div>",
        "id": 202755375,
        "sender_full_name": "Tomáš Gonda",
        "timestamp": 1593732644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"302756\">@Tomáš Gonda</span> are you aware of the dedicated <a class=\"stream\" data-stream-id=\"243068\" href=\"/#narrow/stream/243068-ACT-2020\">#ACT 2020</a> stream? It has a dedicated topic for each talk, so it will be much easier to keep track of conversations there.<br>\nI'll take this opportunity to suggest that <span class=\"user-mention\" data-user-id=\"*\">@everyone</span> interested subscribe to the stream <a class=\"stream\" data-stream-id=\"243068\" href=\"/#narrow/stream/243068-ACT-2020\">#ACT 2020</a>, since not everyone was subscribed automatically.</p>",
        "id": 202790639,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1593773396
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"302756\">Tomáš Gonda</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/ACT2020/near/202755375\">said</a>:</p>\n<blockquote>\n<p>...<br>\nI will be talking about a project tentatively titled: </p>\n<ul>\n<li><a href=\"https://www.dropbox.com/s/765ukbwtdgm23oe/blackwell_act.pdf\">Distribution functors, second-order stochastic dominance and the Blackwell--Sherman--Stein Theorem in Categorical Probability</a><br>\n...</li>\n</ul>\n</blockquote>\n<p><a href=\"#narrow/stream/243068-ACT-2020/topic/July.206.3A.20Tobias.20Fritz.20et.20al.2E's.20talk\">Here is the dedicated thread</a>, by the way.</p>",
        "id": 202811558,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1593787912
    }
]