[
    {
        "content": "<p>I was reading this article this morning: <a href=\"https://www.defensenews.com/breaking-news/2020/09/15/the-us-air-force-has-built-and-flown-a-mysterious-full-scale-prototype-of-its-future-fighter-jet/\">https://www.defensenews.com/breaking-news/2020/09/15/the-us-air-force-has-built-and-flown-a-mysterious-full-scale-prototype-of-its-future-fighter-jet/</a><br>\nI was really impressed with this claim:</p>\n<p>The importance, Roper said, is that just a year after the service completed an analysis of alternatives, the Air Force has proven it can use cutting-edge advanced manufacturing techniques to build and test a virtual version of its next fighter — and then move to constructing a full-scale prototype and flying it with mission systems onboard.</p>\n<p>“This is not just something that you can apply to things that are simple systems” like Boeing’s T-7 Red Hawk trainer jet, the first Air Force aircraft to be built using the “holy trinity” of digital engineering, agile software development and open architecture, Roper said. </p>\n<p>“We’re going after the most complicated systems that have ever been built, and checked all the boxes with this digital technology. In fact, [we’ve] not just checked the boxes, [we’ve] demonstrated something that’s truly magical.”</p>\n<p>The reason why I was surprised is that I thought this is what ACT is going after, more or less, and I didn't think it existed yet, at least to such a degree (assuming the claims are true). What do you think?</p>",
        "id": 210963424,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1600842692
    },
    {
        "content": "<p>(Sorry for the bad formatting, I'm on mobile)</p>",
        "id": 210963647,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1600842917
    },
    {
        "content": "<p>I don't know what kinds of techniques they used, but defense acquisitions is pretty messed up from an engineering process point of view, so you could definitely make 10X improvements by just having strong leadership and changing the incentives. You wouldn't need ACT to get 10X improvement, but you would probably need ACT to get 100X or 1000X improvements in process.</p>\n<blockquote>\n<p>“I can’t make both ends of the life cycle go away; industry has to make a profit somewhere,” Roper said. “And I’m arguing in the paper that if you get to choose what color of money you use for future air superiority, make it research, development and production because it’s the sharp point of the spear, not the geriatric side that consumes so much of our resources today.”</p>\n</blockquote>\n<p>if the AF program managers take this attitude, that spending money on R&amp;D is more effective than spending it on sustainment and retrofitting, then it makes sense that they could build a new plane 10X faster.</p>",
        "id": 210997683,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1600865942
    },
    {
        "content": "<p>This is very interesting. Maybe it's total bs military-industrial complex propaganda. Or maybe they really have done something magic, I'm totally open to that possibility</p>",
        "id": 210998362,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1600866241
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Are.20we.20already.20obsolete.3F/near/210963424\">said</a>:</p>\n<blockquote>\n<p>built using the “holy trinity” of digital engineering, agile software development and open architecture</p>\n</blockquote>\n<p>My usual thing when explaining ACT to everybody else is basically \"take the approximate methodology and successes of the software industry and try to apply it to things that aren't software\". The actual technical content of category theory is in service of that. So to me this is the most interesting line</p>",
        "id": 210998879,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1600866445
    },
    {
        "content": "<p>(In particular ACT neighbours functional programming, but I always use analogies with OOP rather than FP)</p>",
        "id": 210998945,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1600866478
    },
    {
        "content": "<p>Yeah I think that FP is \"the application of CT to the study of programming languages\" in FP you model programs as Homs in a category and denotational semantics are functors into Set. ACT is, to me, \"the application of CT to <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi><mi>c</mi><mi>i</mi><mi>e</mi><mi>n</mi><mi>c</mi><mi>e</mi><mo>∖</mo><mi>P</mi><mi>L</mi></mrow><annotation encoding=\"application/x-tex\">Science\\setminus PL</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05764em;\">S</span><span class=\"mord mathnormal\">c</span><span class=\"mord mathnormal\">i</span><span class=\"mord mathnormal\">e</span><span class=\"mord mathnormal\">n</span><span class=\"mord mathnormal\">c</span><span class=\"mord mathnormal\">e</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">∖</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">P</span><span class=\"mord mathnormal\">L</span></span></span></span>\". Since CT is all about finding the right abstractions to make the math easy (ie. once you understand the definitions, the theorems are obvious), ACT should be about finding the right abstractions to make science easy. For example, monoidal categories are the right abstraction for modeling processes, and hypergraph categories are the right abstraction for modeling systems.</p>",
        "id": 211019293,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1600874766
    },
    {
        "content": "<p>It seems that the magic wand for them was to br able to simulate the whole plane before construction (I believe this is the meaning of the expression 'digital engineering'). Then I don't know what open architecture is. Maybe a principle in software engineering? Thereby they managed to decompose the task by having the right approach to the overall software development task.</p>",
        "id": 211027732,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1600878388
    },
    {
        "content": "<p>I think that open architecture means something like avoiding vendor lock in and using generic parts instead of specialized ones whenever possible.</p>",
        "id": 211029019,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1600878978
    }
]