[
    {
        "content": "<p>Are there any resources that anyone knows of to do political science using the tools of category theory?</p>\n<p>Being able to put one's political beliefs into a coherent whole sounds, well, really useful.</p>\n<p>Or is the field so new it's practically empty?</p>",
        "id": 355019765,
        "sender_full_name": "Keith Elliott Peterson",
        "timestamp": 1682999209
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"389450\">Keith Elliott Peterson</span> <a href=\"#narrow/stream/229156-practice.3A-applied-ct/topic/Cats.20applied.20to.20political.20science/near/355019765\">said</a>:</p>\n<blockquote>\n<p>Are there any resources that anyone knows of to do political science using the tools of category theory?</p>\n<p>Being able to put one's political beliefs into a coherent whole sounds, well, really useful.</p>\n<p>Or is the field so new it's practically empty?</p>\n</blockquote>\n<p>Adjacent to polisci:</p>\n<p><a href=\"https://arxiv.org/abs/2005.12798\">https://arxiv.org/abs/2005.12798</a></p>\n<p><em>We introduce a novel class of Laplacians and diffusion dynamics on discourse sheaves as a model for network dynamics, with application to opinion dynamics on social networks. These sheaves are algebraic data structures tethered to a network (or more general space) that can represent various modes of communication, including selective opinion modulation and lying. After introducing the sheaf model, we develop a sheaf Laplacian in this context and show how to evolve both opinions and communications with diffusion dynamics over the network. Issues of controllability, reachability, bounded confidence, and harmonic extension are addressed using this framework.</em></p>\n<p>On another adjacent note, I have been mulling the idea of using sheaf-theoretical constructs + LLMs to model the consistency of various networked statements/webpages/etc. The idea is to prompt a LLM to rate this, knowing it will be unreliable, but leveraging a degree of stochasticity and repetition as mitigators. Capturing and/or forming hyperlinks, we can then talk about local sections and do sheafy things (perhaps not cohomology per se) to, e.g., identify disinformation at scale.</p>",
        "id": 355131072,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1683029676
    },
    {
        "content": "<p>I haven't seen anything about category theory in political science... just economics and game theory.</p>",
        "id": 355189357,
        "sender_full_name": "John Baez",
        "timestamp": 1683041808
    },
    {
        "content": "<p>Abramsky's <a href=\"https://arxiv.org/abs/1401.4585\">\"Arrow's Theorem by Arrow Theory\"</a> might be relevant.</p>",
        "id": 355281348,
        "sender_full_name": "Alex Gryzlov",
        "timestamp": 1683068725
    },
    {
        "content": "<p>To the extent that homological data analysis counts, it's conceivable somebody have done statistical work in polsci using those tools</p>",
        "id": 355408631,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1683114135
    },
    {
        "content": "<p><a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0283361\">https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0283361</a> is open games attempting to get a foot across the boundary from econ to polsci</p>",
        "id": 355408863,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1683114202
    },
    {
        "content": "<p>Aurora Apolito writes about \"cybernetic communism\" in a way that doesn't use or mention categories, but I'm <em>fairly</em> sure there's a lot secretly hiding in the back (I happen to know that she knows a bunch of category theory and just doesn't mention it, probably because of the target audience)</p>",
        "id": 355409691,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1683114407
    },
    {
        "content": "<p>At the very least, Aurora Apolito sounds like the person to ask this question!</p>\n<p><a href=\"https://c4ss.org/content/54261\">https://c4ss.org/content/54261</a></p>\n<p>I hadn't known her, or that this is a pen name.</p>",
        "id": 355527201,
        "sender_full_name": "John Baez",
        "timestamp": 1683126200
    },
    {
        "content": "<p>The <a href=\"https://www.theoreticalpractice.com/\">STP group</a>, doing work in political philosophy, does take inspiration from category theory</p>",
        "id": 355863241,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1683226769
    }
]