[
    {
        "content": "<p>Hello.   I have a mathematics background, but now I work in the software industry.  Based on my earlier pass through Seven Sketches and my current attempts to make it through Fong's 2016 thesis, I <em>suspect</em> our software and/or product deployment would benefit from something out of the idea of open systems and hypergraph categories (and/or string diagrams).  Unfortunately, (probably because I have not studied it long enough) I cannot see where the rubber meets the road with this stuff yet.  It's all \"that looks really neat but what decisions can I do differently knowing that?\" at this point.</p>\n<p>In this thread, it would be really nice to have replies something like: \"Today at work I framed our system in terms of (some method from Applied Category Theory (preferably one from the literature I mentioned above)) and discovered (some problem) \" and after that hopefully something like \"using (some idea from applied category theory) suggested the way to update the system.\"</p>\n<p>Perhaps that last paragraph makes it clear that I do not even understand what form \"solutions\" from applied category will take. I speculate that it could be of the form of some sort of static analysis of systems, or possibly also computation of suggested solutions (based on my reading of Fong's chapter on electric circuits which hints at systems described by generalized Lagrangian formalisms.)  Any help understanding what one can expect to get out of framing problems with open systems would be very helpful!</p>",
        "id": 420718686,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1707507443
    },
    {
        "content": "<p>You might check out our software for epidemiological modeling designed using Fong's ideas on decorated cospans.  It's not \"industry\" - but it could be, since it's a practical product: it just so happens that governments more than companies spend money modeling the spread of disease for public health purposes.   This talk might help explain it:</p>\n<ul>\n<li><a href=\"https://math.ucr.edu/home/baez/epidemiology_categories/\">Categories in epidemiology</a>.</li>\n</ul>\n<p>and then this paper written for non-mathematicians:</p>\n<ul>\n<li>John Baez, Xiaoyan Li, Sophie Libkind, Nathaniel D. Osgood and Eric Redekopp, <a href=\"https://arxiv.org/abs/2211.01290\">A categorical framework for modeling with stock and flow diagrams</a>, to appear in <em>Mathematics for Public Health</em>, Springer. </li>\n</ul>\n<p>and then, if you want, this paper with all the hardcore math:</p>\n<ul>\n<li>John Baez, Xiaoyan Li, Sophie Libkind, Nathaniel Osgood and Evan Patterson, <a href=\"https://arxiv.org/abs/2205.08373\">Compositional modeling with stock and flow diagrams</a>, <em>Proceedings Fifth International Conference on Applied Category Theory</em>, <em>EPTCS</em> <strong>380</strong> (2022), 77-96.</li>\n</ul>",
        "id": 420818717,
        "sender_full_name": "John Baez",
        "timestamp": 1707586724
    },
    {
        "content": "<p>One lesson from all this is that the AlgebraicJulia project really helps translate ideas for software involving category theory into actual working software.   But you still need to have the ideas!</p>",
        "id": 420819459,
        "sender_full_name": "John Baez",
        "timestamp": 1707587364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Thanks for the leads, John! I'll queue these in my reading list.</p>\n<p>Does the epidemiological application seem like it would translate to something like \"management of interoperating systems\"?  That's sort of the ecosystem I'm in right now.   I'm hoping to find tools  to evaluate performance and refine design of interoperating processes.  I'm don't think epidemiology is my cup of tea but if you say there's something there I'll try it.</p>\n<p>I'm hoping there's something here concerning ability to keep control over flow between systems, and to catch race conditions in the system before they cause problems. I imagine there are rewards to be reaped that I am not even anticipating.  If you can think of any \"hooks\" in these publications that I can grab onto to get going on this sort of thing, I'd appreciate the pointers!</p>",
        "id": 420841341,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1707607985
    },
    {
        "content": "<p>Epidemiology is just one application of these ideas; they're quite general.   So don't read this stuff thinking  it's ultimately about epidemiology.    It's about stocks and flows.  My talk explains what that means.</p>",
        "id": 420865410,
        "sender_full_name": "John Baez",
        "timestamp": 1707633012
    },
    {
        "content": "<p>Besides the epidemiology project at Topos, other people you should talk to who have experience of the rubber hitting the road are</p>\n<ul>\n<li>people at Quantinuum (a big group) who use ZX calculus and other methods of categorical quantum mechanics at industrial scale</li>\n<li>people at Connexus (a small group) who use categorical algebra for databases stuff (that's a terrible description, I don't understand it very well)</li>\n<li>people at 20squares (a small group that includes me) who use compositional game theory for applied microeconomics and mechanism design</li>\n</ul>",
        "id": 420912489,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1707677141
    },
    {
        "content": "<p>We at Conexus AI do data migration, data integration, pretty typical industry stuff, but we do it using category theory instead of relational algebra.  Profunctors instead of SQL, lifting problems instead of horn clause logic, theorem proving instead of 'guess and check', etc.  We don't use open systems but do have a list of like two dozen common industry use cases if you'd like to check them out.</p>",
        "id": 420919900,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1707683833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span>  <span class=\"user-mention\" data-user-id=\"281326\">@Ryan Wisnesky</span> Thank you both for the info. I will definitely reach out as I (maddeningly slowly) learn more.</p>",
        "id": 420921760,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1707685530
    },
    {
        "content": "<p>Hi, I am also a software engineer with mathematical background (still learning about CT/ACT). </p>\n<p>Not sure if it counts as a relevant example, but, at my company, we are developing a DSL for <a href=\"https://lca-as-code.com\">life-cycle analysis modeling</a>. Roughly speaking, LCA is a standardized set of methods and practices to assess the environmental impacts of a product. The goal is to bring software engineering practices to the LCA field through code reuse (aka composable models), version control, testing, etc. We are currently testing it with European cloud providers to model the environmental impacts of the usage of their services.</p>\n<p>I drew inspiration and intuition from what the ACT community has provided (especially, Catlab.jl, Stock and Flow). Behind the scene, the models are living in something close to parametrized linear relations. I wanted to properly put the math on paper, but my background knowledge is still too feeble for that. (eventually, I'll figure it out I guess).</p>",
        "id": 421218602,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1707821317
    },
    {
        "content": "<p>That sounds cool, Peva.  Do you have any intiuitons telling you that bringing category theory more explicitly into your project could be helpful?</p>",
        "id": 421324552,
        "sender_full_name": "John Baez",
        "timestamp": 1707857927
    },
    {
        "content": "<p>Yes, sure! </p>\n<p>Why I think category theory would be helpful? </p>\n<p>My main concern with the dsl design is making sure that the language features we introduce will not claw back at me. The graal would be a formal semantics, but it is quite out of my league (my original background is distributed algorithms, not really programming language theory).</p>\n<p>Now, why category theory? </p>\n<p>It turns out people in LCA do really work with (informal) string diagrams. An example here (the circular footprint formula)</p>\n<p><a href=\"/user_uploads/21317/Wqis7eKryjL7DG24MnthSZZC/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/Wqis7eKryjL7DG24MnthSZZC/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/Wqis7eKryjL7DG24MnthSZZC/image.png\"></a></div><p>What happens then is people manually \"compile\" this diagram to  a formula, e.g., like that</p>\n<p><a href=\"/user_uploads/21317/s42LB8xrYp3cFw1dSwl3rR5T/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/s42LB8xrYp3cFw1dSwl3rR5T/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/s42LB8xrYp3cFw1dSwl3rR5T/image.png\"></a></div><p>which is then translated into excel sheets: this approach does not scale well. </p>\n<p>So CT/ACT seems to be the right candidate to enable people to work with executable  string diagrams, so they don't worry about the \"compilation\" stuff, and can reliably scale things up. The motivation seems to be the same as the one from your work on epidemiology modelling: users should focus on what they care about and not worry about writing down the differential equations.</p>\n<p>ps: I do remember that I promised you (John) a more detailed account but I could not figure out how to model some aspects of the dsl and did not want to bother you with half-baked material. But now that I know it's ok to publish posts on the zulip server, I can simply post my questions under another topic so people interested can reply.</p>",
        "id": 421467767,
        "sender_full_name": "Peva Blanchard",
        "timestamp": 1707923860
    },
    {
        "content": "<p>Thanks for the example!    I think it should be possible to use ideas from applied category theory, many already implemented in AlgebraicJulia, to handle this problem.   A few points:</p>\n<p>1) I don't know if AlgebraicJulia provides a graphical user interface for manipulating diagrams suited to your needs; I think you should ask <span class=\"user-mention\" data-user-id=\"280755\">@Owen Lynch</span> about that, because he's been working on something called <a href=\"https://algebraicjulia.github.io/Semagrams.jl/\">Semagrams</a> which might do what you need.   For our epidemiology project we've developed a separate web-based interface called ModelCollab, specialized for working with stock and flow diagrams.</p>\n<p>2) I would be cautious about calling these diagrams 'string diagrams', because string diagrams are just one of the many kinds of diagrams we need in this game: for example our epidemiological models use two other kinds: 'stock and flow diagrams' and 'Petri nets with rates'.   They're different, and we've developed different software for them.  You'll need to formalize your particular kind of diagrams (or fit them in as a special case of some already studied kind), developing their syntax (e.g. treating them as morphisms in a structured cospan category) and semantics (how you interpret them as giving equations).   This looks pretty easy to me,  if your example is representative.  Then someone smarter than me could actually program it in to AlgebraicJulia.</p>\n<p>3) Turning to the semantics, what do you want to do with the equations once you have them?   Presumably more than just look at them.   Solve them, presumably?   What do you typically know and what do you want to solve for?  Does it vary a lot?</p>",
        "id": 421496236,
        "sender_full_name": "John Baez",
        "timestamp": 1707931751
    },
    {
        "content": "<p>4) Since I started working on applied category theory in order to develop <a href=\"https://johncarlosbaez.wordpress.com/2013/02/15/prospects-for-a-green-mathematics/\">green mathematics</a>, life cycle analysis sounds like a good thing and I'd like to help a little.</p>",
        "id": 421497011,
        "sender_full_name": "John Baez",
        "timestamp": 1707932025
    }
]