[
    {
        "content": "<p>I'm looking forward to working with Azimuth and want to know which CT based math is needed for effective social change. I'm just looking to have a positive impact, I don't need fancy, just effective. Thanks.</p>",
        "id": 196096636,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588502677
    },
    {
        "content": "<p>Although I haven't worked directly with Azimuth (maybe I should!) this is a major part of how I think, I think carefully about the least <em>time</em> route between me and doing something useful. This has a bunch of knock on effects on my mathematical philosophy, like trying to only using categories when they add immediate value and resisting the urge to \"categorify all the things\"</p>",
        "id": 196098167,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1588504912
    },
    {
        "content": "<p>If it wasn't for the imminent planetary collapse I might spend more time worrying about foundations, for example</p>",
        "id": 196098242,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1588504970
    },
    {
        "content": "<p>I think anyone whose main goal is \"effective social change\" or dealing with climate change should probably ignore category theory.  I've been focused on a different set of people: mathematicians who can't help but do category theory because they love it so much, but still want to be somewhat useful.   (This includes me.)</p>",
        "id": 196124813,
        "sender_full_name": "John Baez",
        "timestamp": 1588542072
    },
    {
        "content": "<p>As a social activist I am concerned about all the plans for our future that are without love and beauty. So I am partial to practitioners of CT because I also relate to it's beauty. <br>\nI do think that it is difficult to do good mathematics without exposure to CT. <br>\nI'm a system's engineer from the Seventies, but CT is the best platform I currently am aware of for being able to scientifically synthesize what is happening, whether in pure physics or on our planet.</p>",
        "id": 196131226,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588553225
    },
    {
        "content": "<p>what makes you think so?</p>",
        "id": 196131635,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588553988
    },
    {
        "content": "<p>I should add computer science can be helpful. For me important scientific breakthroughs are the the proof that the </p>\n<ul>\n<li>US is an oligarchy </li>\n<li>A dozen mega-corporations control a large portion of the Earth's wealth</li>\n<li>Gerrymandering can now be proved in a court of law</li>\n</ul>\n<p>But hey, CT is also significant for CS. Also AI and ML are now largely dynamics, and CT has made inroads to the understanding of chaos not available otherwise.</p>",
        "id": 196133035,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588556268
    },
    {
        "content": "<p>i don't think any of that has much to do with category theory?</p>",
        "id": 196133081,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588556318
    },
    {
        "content": "<p>im also not sure ive heard of CT being applied to chaos—what are you referring to?</p>",
        "id": 196133097,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588556352
    },
    {
        "content": "<p>OK, any alternatives you can think of for wrapping your brain around physics, math and multiple engineering related disciplines?<br>\nI'm hunting down chaos &amp; CT references. It is at least several theorems.</p>",
        "id": 196133267,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588556635
    },
    {
        "content": "<p>i mean, i've heard that category theory is useful for physics, although i know little about those uses myself</p>",
        "id": 196133318,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588556729
    },
    {
        "content": "<p>but i was also asking what you meant about it being the best platform</p>",
        "id": 196133320,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588556750
    },
    {
        "content": "<p>Best platform? Maybe only platform? I've been a researcher for fifty years and several times a day I get a wonderful tingly feeling studying CT as my mind is blown. I feel like I'm back in grade school learning math. The feeling is delicious.</p>",
        "id": 196133502,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588557029
    },
    {
        "content": "<p>well, that sounds more like what john was talking about than it being a good tool :p</p>",
        "id": 196133675,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588557356
    },
    {
        "content": "<p>Got a better tool you can refer me to?  <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 196133740,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588557445
    },
    {
        "content": "<p>differential geometry has seen more fruitful application so far, as far as i know</p>",
        "id": 196133758,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588557473
    },
    {
        "content": "<p>in terms of application to physics and engineering</p>",
        "id": 196133801,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588557491
    },
    {
        "content": "<p>If you're interested in social sciences, most institutions and businesses have multiple layers of rich compositional structure. Modelling those categorically could be fun - some (potentially nonsensical) questions include</p>\n<ul>\n<li>What sorts of institutions transform poorly under a \"functor\" of technological, regulatory, or societal change? </li>\n<li>Are there less alienating/hierarchical means of structuring labor into value than our current world? When are these operations \"stable\"?</li>\n</ul>",
        "id": 196135746,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588560895
    },
    {
        "content": "<p>I'd guess compositional game theory/open games would be the place to start making that rigorous but <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 196135809,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588561054
    },
    {
        "content": "<p>Much political reality is based on neuroanatomy  and not game theory as such.</p>",
        "id": 196135955,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588561352
    },
    {
        "content": "<p>The ways in which corporations are structured internally and interact with one another is, though. Most people (for better or worse) are much more impacted by who they work for than who they vote for.</p>",
        "id": 196136085,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588561585
    },
    {
        "content": "<p>i don't think most institutions or businesses really do have compositional structure</p>",
        "id": 196136766,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588562723
    },
    {
        "content": "<p>they have <em>hierarchical</em> structure, but compositional ≠ hierarchical</p>",
        "id": 196136769,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588562735
    },
    {
        "content": "<p>Sorry I haven't thought about this very deeply at all, but in what sense do hierarchies not compose?</p>",
        "id": 196136975,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588563095
    },
    {
        "content": "<p>compositionality is about the whole being the sum of the parts</p>",
        "id": 196137084,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588563249
    },
    {
        "content": "<p>being able to compose things, but also, being able to reason about the composed thing by reasoning about the things it is composed of</p>",
        "id": 196137104,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588563299
    },
    {
        "content": "<p>mh. I was thinking along the lines of general trees, potentially with some interesting coordination happening at non-leaf nodes - are you thinking about hierarchies as having more of a rigidly segmented structure?</p>",
        "id": 196137545,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588564061
    },
    {
        "content": "<p>not really—if anything, that would bring hierarchical <em>closer</em> to compositional, wouldn't it?</p>",
        "id": 196137608,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588564143
    },
    {
        "content": "<p>Well if each \"layer\" of each hierarchy had a unique role then there would be no obvious way to combine two hierarchies with different numbers of layers</p>",
        "id": 196137695,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588564277
    },
    {
        "content": "<p>vs if they're just trees I can easily plug the root of one tree into another</p>",
        "id": 196137796,
        "sender_full_name": "Christoph Sachse",
        "timestamp": 1588564412
    },
    {
        "content": "<p>The standard mathematical toolkit of an average physicist is calculus, linear algebra, and probability theory/statistics, roughly in that order. Differential geometry is used as well, but work is done in local coordinates so much that the full structure of it is only an afterthought (Lie theory in particle physics is an exception, but at this point, we're talking about a small selection of physicists). Topology in condensed matter is another. Anyway, my point is that category theory is rarely actively used. However, there has been some serious progress when different fields come together in physics. One of my favorite examples is when Dirac realized the connection between classical mechanics (Poisson bracket) and quantum mechanics (commutator). Another that comes to mind is renormalization, which started out as an idea in statistical mechanics and was brought to quantum field theory. The interactions between computer science have also led to many discoveries, and this is growing recently. Personally, I feel that this is one place where category theory is most useful: a category-theorist might be able to see connections more easily between vastly different subjects whose similarities would otherwise be obfuscated by seemingly different mathematical structures at the level of objects. Once such discoveries are made, one might be able to use tools, which were once thought to be specialized, to solve important problems. And in the process of doing this, one might ask new questions to push things forward, etc.</p>",
        "id": 196142056,
        "sender_full_name": "Arthur Parzygnat",
        "timestamp": 1588570255
    },
    {
        "content": "<p>that's exactly the kind of thing i want to be able to do with category theory :)</p>",
        "id": 196142111,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588570403
    },
    {
        "content": "<p>well, it's <em>one</em> major thing, at least...</p>",
        "id": 196142119,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588570436
    },
    {
        "content": "<p>I'm with <span class=\"user-mention\" data-user-id=\"276867\">@Daniel Geisler</span> here, I'm optimistic that category theory can (and already is) useful for putting complex systems theory on a decent foundation, and in that sense it will have a major role to play in studying the urgent questions (or rather it <em>would</em> if only it had been ready 2 or 3 decades earlier). Specifically, it tells you what is the \"right\" architecture for making software for doing systems theory. In this sense I expect category theory to play an (important) support role. At some point you'll still need to solve a bunch of PDEs numerically, and that's fine</p>",
        "id": 196161804,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1588586758
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276867\">Daniel Geisler</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196133035\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196133035\">said</a>:</p>\n<blockquote>\n<p>I should add computer science can be helpful. For me important scientific breakthroughs are the the proof that the </p>\n<ul>\n<li>US is an oligarchy </li>\n<li>A dozen mega-corporations control a large portion of the Earth's wealth</li>\n<li>Gerrymandering can now be proved in a court of law</li>\n</ul>\n<p>But hey, CT is also significant for CS. Also AI and ML are now largely dynamics, and CT has made inroads to the understanding of chaos not available otherwise.</p>\n</blockquote>\n<p>This <em>almost</em> sounds crazy, but I don't think it's crazy (just a bit optimistic). My stretch goal is to \"\"\"\"prove\"\"\"\" that averting global collapse without massive government intervention/regulation is impossible</p>",
        "id": 196162285,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1588587026
    },
    {
        "content": "<p>Crucially the word \"proof\" in both what I wrote and what I quoted does <em>not</em> refer to mathematical proof, or even particularly to legal proof (beyond reasonable doubt), but something much vaguer like \"social proof\", ie. enough to convince some critical mass of people. In that sense it's more about science communication than about science</p>",
        "id": 196162682,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1588587276
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196137084\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196137084\">said</a>:</p>\n<blockquote>\n<p>compositionality is about the whole being the sum of the parts</p>\n</blockquote>\n<p>This is not true. The whole can be much more than the sum of the parts, as in quantum entanglement, and this is exactly why we want monoidal, non cartesian categories around. The point is not that the total is the sum of its parts, the point is that you know how parts interact to the point of being able to predict and manage any emerging behavior.</p>",
        "id": 196164206,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588588453
    },
    {
        "content": "<p>As such, compositionality is more a problem of the models that a problem of reality. I agree, many business structures are not compositionnal, but what it means is that we still haven't found a satisfactory way to model how business structures interact in a way that makes them fully describable</p>",
        "id": 196164277,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1588588517
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196161804\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/CT.20technology.20needed.20for.20Azimuth/near/196161804\">said</a>:</p>\n<blockquote>\n<p>I'm with <span class=\"user-mention silent\" data-user-id=\"276867\">Daniel Geisler</span> here, I'm optimistic that category theory can (and already is) useful for putting complex systems theory on a decent foundation, and in that sense it will have a major role to play in studying the urgent questions (or rather it <em>would</em> if only it had been ready 2 or 3 decades earlier).</p>\n</blockquote>\n<p>I should make sure my position is clear.  My last comment on this thread was a bit negative and could be misinterpreted.</p>\n<p>I'm very optimistic about the benefits of category theory in the long run, especially when it comes to understanding open systems and complex systems.  I'm not so optimistic that there will <em>be</em> a long run.   More precisely: I think our current form of civilization is running up against limits that could cause some sort of collapse in a few decades.   Anyone wanting to have an effect on this should probably take direct action, not build abstract theoretical frameworks that will take a few decades to be translated into concrete results. </p>\n<p>But I doubt humans will go extinct, and I hope that no matter what happens, some useful insights will be preserved.   So, another attitude one could take is that one is helping to design the <em>next</em> civilization.</p>",
        "id": 196198827,
        "sender_full_name": "John Baez",
        "timestamp": 1588606808
    },
    {
        "content": "<p>oof</p>",
        "id": 196273395,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588661961
    },
    {
        "content": "<p>yeah</p>",
        "id": 196273398,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588661965
    },
    {
        "content": "<p>sometimes i think about that stuff and wonder why i bother trying to devise cool new ways to prove that programs do particular things</p>",
        "id": 196273410,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588661990
    },
    {
        "content": "<p>who's gonna be using em</p>",
        "id": 196273417,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662001
    },
    {
        "content": "<p>In the end people will choose not to \"drive the car off the road.\" Dang, I'll be here for several more decades raising hell.</p>",
        "id": 196273846,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588662412
    },
    {
        "content": "<p>it's not like driving the car off the road, though</p>",
        "id": 196273881,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662461
    },
    {
        "content": "<p>the consequences come well after the action</p>",
        "id": 196273891,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662466
    },
    {
        "content": "<p>Coronavirus shows they don't</p>",
        "id": 196273957,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588662513
    },
    {
        "content": "<p>i'm not sure what you mean by \"they don't\" there</p>",
        "id": 196274010,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662564
    },
    {
        "content": "<p>oh, consequences don't come well after action?</p>",
        "id": 196274031,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662596
    },
    {
        "content": "<p>i mean maybe with coronavirus that's true, but it's true for climate change</p>",
        "id": 196274075,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662610
    },
    {
        "content": "<p>and people are definitely driving the car off the road with coronavirus here in the usa, so it's not really helping your argument <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span></p>",
        "id": 196274091,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588662630
    },
    {
        "content": "<p><a href=\"https://www.youtube.com/watch?v=xLy2SaSQAtA\" title=\"https://www.youtube.com/watch?v=xLy2SaSQAtA\">https://www.youtube.com/watch?v=xLy2SaSQAtA</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"xLy2SaSQAtA\" href=\"https://www.youtube.com/watch?v=xLy2SaSQAtA\" title=\"https://www.youtube.com/watch?v=xLy2SaSQAtA\"><img src=\"https://i.ytimg.com/vi/xLy2SaSQAtA/default.jpg\"></a></div>",
        "id": 196274128,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588662679
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276072\">@sarahzrf</span> I don't know where you live, but in northern California fire took out a good chunk of Santa Rosa where I lived. We are having abnormal amounts of fires on the West coast. And the fires in Australia have been epic. All attributed to the changes from global warming. <br>\nI believe we are evolving through a process of self-organization. Things get more and more chaotic, then self-organization kicks in and a harmonious simplicity is attained.</p>",
        "id": 196274860,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588663383
    },
    {
        "content": "<p>maybe <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 196274997,
        "sender_full_name": "sarahzrf",
        "timestamp": 1588663490
    },
    {
        "content": "<p>Then there are the technologies of AI, genetic engineering and nanotechnology to help out. Of course they need to be managed with wisdom.</p>",
        "id": 196275312,
        "sender_full_name": "Daniel Geisler",
        "timestamp": 1588663761
    },
    {
        "content": "<p>Talking about Coronavirus, the world and technology I wrote a blog post recently <a href=\"https://blog.usejournal.com/co-immunology-and-the-web-43379b46688e\" title=\"https://blog.usejournal.com/co-immunology-and-the-web-43379b46688e\">Co-Immunology and the Web</a>. This does not mention CT, but it's in the background as RDF on which Linked Data publishing is founded can be seen as a Grothendieck Construction from a functorial database (<a href=\"https://arxiv.org/abs/1009.1166\" title=\"https://arxiv.org/abs/1009.1166\">see</a>).</p>",
        "id": 196276612,
        "sender_full_name": "Henry Story",
        "timestamp": 1588664981
    }
]