[
    {
        "content": "<p>Dear Fellow Category Theorists,</p>\n<p>I’m working on a program that reconstructs the algebraic structure of physical quantities (like mass, angle, and eventually Hilbert spaces) starting from <em>primitive symbolic measurements</em>, using monads and their compositions. The aim is to remove the lingering \"black art\" in physics — where assumptions such as “mass is a real number” or “states live in a Hilbert space” are adopted pragmatically, without justification from first principles.</p>\n<p>Instead of treating real-valued quantities as givens, I start with primitive observations — e.g., multisets like <code>{\"grain\", \"grain\", \"grain\"}</code> — and then construct, via monad maps and Eilenberg–Moore algebras, the structures that justify operations like averaging. A key result is that quantities like mass only <em>must</em> be real numbers if the monadic structure (e.g., multiset → distribution) is available. If it isn’t, then real-valued assumptions are unjustified.</p>\n<p>This work draws inspiration from Lucien Hardy’s operational approach, but differs in being strictly categorical: measurement operations, data symmetries, and derived quantities are all built compositionally from categorical primitives, with no appeal to background physics.</p>\n<p>The broader goal is to provide a foundational framework for physics — especially quantum gravity — that is epistemologically transparent and structurally sound, by unpacking all the assumed algebraic baggage of physics through categorical semantics.</p>\n<p>If you’re interested in monads, monad composition, enriched category theory, or categorical approaches to physics, I’d love to collaborate or even just exchange ideas. I’m especially looking for insight into:</p>\n<ul>\n<li>\n<p>Monad composition as a formal model of experimental processes</p>\n</li>\n<li>\n<p>The semantics of measurement data in terms of free algebras and EM categories</p>\n</li>\n<li>\n<p>Reconstructing inner products and Hilbert spaces from symbolic data symmetries</p>\n</li>\n</ul>\n<p>Let me know if you’d like a copy of the 3-pager or one-pager summaries I’ve written up, or if you’d be open to a conversation. I’d be excited to hear your thoughts.</p>\n<p>Warmly,</p>\n<p>Ben Sprott<br>\n<a href=\"mailto:bensprott@gmail.com\">bensprott@gmail.com</a></p>\n<p>Here is a deeper outline:</p>\n<p>Reconstructing Physical Quantities from Primitive Data via Monads — Invitation to Collaborate</p>\n<p>Motivation: Replacing Black Magic with Structure</p>\n<p>Much of modern physics is built upon pragmatic assumptions that worked but were never derived from first principles. Quantities like mass, angle, or energy are treated as real numbers. Hilbert spaces, probabilities, and operators are just assumed. This \"black art\" of layering structure onto experimental results without justification has worked surprisingly well — but it has led to a patchwork theory ill-suited for deep unification (for example, in quantum gravity).</p>\n<p>I believe we can do better by reconstructing these structures categorically from symbolic data, using monads and their composition. Instead of taking real numbers and Hilbert spaces as primitive, we can derive them from functorial and algebraic structure over raw measurements.</p>\n<p>Step 1: From Raw Measurement to Algebra</p>\n<p>Consider the primitive data of an experiment:</p>\n<ul>\n<li>\n<p>Observation: \"3 grains in a pan\" is recorded as something like a ket symbol for 3 grains</p>\n</li>\n<li>\n<p>Another: \"angle to star A\" is recorded as a symbol like 43 degrees</p>\n</li>\n</ul>\n<p>We record these as multisets of symbols, modeled as elements of the multiset monad M(X), where X is a set of raw measurement labels.</p>\n<p>We then construct a monad map from M to D, where D is the distribution monad. This is not assumed — it’s explicitly built by normalizing multiplicities. It is functorial, monad-compatible, and compatible with expectation via Eilenberg-Moore algebras.</p>\n<p>Only if this structure exists do physical quantities gain an averaging operation — meaning the familiar real-valued behavior of quantities like mass or angle becomes justified rather than assumed.</p>\n<p>Monad Composition and Cardinality</p>\n<p>A subtle additional assumption in measurement is cardinality. For instance, going from \"3 grains\" to the number 3 requires interpreting a multiset as a set of objects with cardinality. This is a nontrivial move.</p>\n<p>I model this explicitly via a second monad C for cardinality, making the overall structure M tensor C — that is, multisets over cardinalities, where C is a monad modeling the process of counting or abstracting numerical extent from symbolic data. This removes a key source of pragmatic sleight-of-hand and makes cardinality itself an effectful construction.</p>\n<p>Toward Foundations of Quantum Gravity</p>\n<p>Every text on quantum gravity makes background assumptions like: energy is a real number, length is a real number, and states live in Hilbert space. But these are carryovers from incompatible legacy formalisms — general relativity and quantum mechanics.</p>\n<p>Instead of combining two broken tools, I argue we should rederive all structure from compositional measurement semantics. This approach starts with no real numbers or Hilbert spaces, builds structure only when justified via data symmetry, treats algebraic properties as effects of monad composition, and seeks a foundational formulation compatible with both quantum and gravitational regimes.</p>\n<p>Invitation</p>\n<p>This project is rooted in categorical semantics, but I would love to have input from others experienced in:</p>\n<ul>\n<li>\n<p>Monad composition and Eilenberg-Moore semantics</p>\n</li>\n<li>\n<p>Modeling measurement and experimental processes categorically</p>\n</li>\n<li>\n<p>Reconstructing algebraic and topological structure from symbolic data</p>\n</li>\n</ul>",
        "id": 532364892,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1754075728
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/wtYZ9QIikNnwMO_wTm8xdfvP/cardinality_fossils.tex\">cardinality_fossils.tex</a></p>\n<p>This is an attempt to give a rigorous definition of Barbour's fossils without pragmatic assumptions.</p>",
        "id": 533026253,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1754457234
    },
    {
        "content": "<p>I would encourage you to think how you _actually define_ the functor by choosing, for every set, 1) a representative set of that size and 2) a fixed bijection between that set any every other set of that size. To do i the context of ZFC you are actually well-ordering every set in existence simultaneously, with the smallest ordering possible on that size (this is because in ZFC step 1 is done for you, but not step 2). If you aren't in ZFC but an arbitrary category modelling set theory, then you are doing both steps without the help of 'canonical' representatives of cardinalities.</p>\n<p>In particular, this assumes a global choice axiom. Even if you are thinking only about finite sets, then by choosing say the standard ordinal number n as representative, this amounts to choosing in advance a _counting_ of every finite set you want to consider, namely an order on its elements (first element, second element,....). This I think has philosophical commitments.</p>",
        "id": 533026878,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1754457760
    },
    {
        "content": "<p>In <em>Lost in Math</em>, Sabine Hossenfelder diagnoses a profound crisis in modern physics: a drift away from empirical grounding and conceptual clarity, toward speculative constructions guided more by aesthetic sensibilities than by necessity. She argues that physicists increasingly pursue models that are “beautiful,” “natural,” or “elegant,” often without testable predictions or foundational justifications. What she exposes is not merely a methodological lapse, but a deeper failure of epistemic discipline — a willingness to assume the very mathematical structures we should be explaining.</p>\n<p>The work I am pursuing responds directly to that failure, by asking: what structural features of mathematics and measurement truly arise from observable configurations, without being presupposed? Where most of physics begins with real numbers, spacetime, or Hilbert spaces, I begin with the raw data of the world: finite sets of distinguishable physical entities — such as grains in a pan. From these, using categorical tools like the cardinality monad, I extract the concept of number not as an assumed primitive, but as a <em>fossilized image</em> of configuration, functorially derived from the act of collapsing identity. This is not abstraction for its own sake, but structure that emerges as a consequence of the data itself — and whose side effects can be interpreted as records of apparent time and measurement.</p>\n<p>This approach does not rely on aesthetic judgment. It does not assume number, nor space, nor temporal evolution. Instead, it reconstructs these concepts as natural images under functorial transformations. In particular, the cardinality monad provides a concrete realization of what Julian Barbour called “fossils” — configurations that appear to encode temporal history. But unlike Barbour, who left the notion undefined, this work gives fossils categorical substance: they are the structured side effects of losing identity under functorial collapse. What results is a physics that begins not in mystified abstraction, but in the compositional semantics of observation itself.</p>\n<p>If <em>Lost in Math</em> is a call to rebuild physics on firmer conceptual ground, this work takes up that call at the most fundamental level. It does not beautify the edifice; it excavates its foundations. It treats the transition from raw configuration to perceived number as a structured computation — not an assumption, but an effect. In doing so, it opens a path toward a physics that does not need to be beautiful to be justified — a physics that earns its structure by deriving it from the only thing we can be sure of: the configurations we observe.</p>",
        "id": 533029576,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1754459944
    },
    {
        "content": "<p>How are you choosing a bijection S -&gt; {1,2,...,n} for every finite set?</p>",
        "id": 533035068,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1754462849
    }
]