[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276026\">Philip Zucker</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193669147\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193669147\">said</a>:</p>\n<blockquote>\n<p>I do find this explicit discussion of the kinds of people helpful for understanding and don't think it is just for the purpose of finding our boxes. It is very often that I'm extremely confused by papers, presentations, and discussions around category theory (and mathematical topics in general).  If I'm honest, I often have to fight down the belief that what I see as confusing, jargon filled, and overly complicated explanations of beautiful ideas as the result of malignancy on the part of the authors. This is almost certainly not the case. It probably mostly a difference of aesthetical desires, background, and abilities.</p>\n</blockquote>\n<p>Okay, if this classification of people helps you understand what they're doing maybe it's good. </p>\n<p>I think mathematics is beautifully lucid and clear, and category theory doubly so.  But most mathematicians are very bad at explaining things because they forget (or don't care) what it was like to not understand what they are writing about: they are writing about <em>how they currently understand things</em>.  They write the sentences you should think once you understand the subject, not the sentences you need to see to understand the subject.  </p>\n<p>Mathematicians mainly explain things when they talk to each other one-on-one.   Some of us are trying to shake this up by doing a bunch of blogging... and setting up discussion sites like this one.</p>",
        "id": 193670660,
        "sender_full_name": "John Baez",
        "timestamp": 1586626243
    },
    {
        "content": "<p>\"They write the sentences you should think once you understand the subject, not the sentences you need to see to understand the subject.\" -- maybe it's just me, but this sounds like the exact opposite of how I think papers should ideally be written....</p>",
        "id": 193673942,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586631016
    },
    {
        "content": "<p>That's because you're a person.    Mathematicians are not mainly trying to talk to people.  They're trying to talk to God the Mathematician.</p>",
        "id": 193674264,
        "sender_full_name": "John Baez",
        "timestamp": 1586631428
    },
    {
        "content": "<p>And they're hoping God will give them a pat on the back and say \"yes, that's exactly how I think about it\".</p>",
        "id": 193674279,
        "sender_full_name": "John Baez",
        "timestamp": 1586631478
    },
    {
        "content": "<p>So the best way to read math papers is to take a brief look at them, try to figure out what they're saying... but as soon as it gets really hard go away, learn the terms you don't know, talk to people, ask questions, and think about the subject.   Maybe do some calculations. Then go back, try again... and so on.  Eventually the whole paper will seem really clear, except for parts here and there, which you can enjoy mulling over.</p>",
        "id": 193674475,
        "sender_full_name": "John Baez",
        "timestamp": 1586631705
    },
    {
        "content": "<p>Of course you should be doing this to dozens of papers simultaneously.</p>",
        "id": 193674543,
        "sender_full_name": "John Baez",
        "timestamp": 1586631826
    },
    {
        "content": "<p>I'm not saying this is ideal, but it's how things are: most math papers are not written for people who don't already understand them.  So if you want to learn significant amounts of math, you have to adapt yourself to this fact.</p>",
        "id": 193674666,
        "sender_full_name": "John Baez",
        "timestamp": 1586631986
    },
    {
        "content": "<p>This is an odd perspective to me. Why do they publish them if they're not for people? Why not just write it and put it in a drawer? God can see in drawers.</p>",
        "id": 193675063,
        "sender_full_name": "Philip Zucker",
        "timestamp": 1586632582
    },
    {
        "content": "<p>You can't get tenure putting papers in drawers - you have to publish them.</p>",
        "id": 193675223,
        "sender_full_name": "John Baez",
        "timestamp": 1586632854
    },
    {
        "content": "<p>Besides, they don't actually <em>know</em> they're not writing for people.</p>",
        "id": 193675245,
        "sender_full_name": "John Baez",
        "timestamp": 1586632895
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193674279\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193674279\">said</a>:</p>\n<blockquote>\n<p>And they're hoping God will give them a pat on the back and say \"yes, that's exactly how I think about it\".</p>\n</blockquote>\n<p>I think that is an ambitious and noble aspiration :-)</p>\n<p>Sometimes one only hopes for the pat on the back from some prophet or guru. And sometimes one gives a talk hoping to get a nod from some expert sitting in the front row. Maybe one even hopes that other people in the audience will notice the nod. OK, that's a bit pessimistic and depressing to think about. What is probably more relevant to explain the technicality of talks is that after we struggle years with some technical point, we are induced to think it is a super-important point everybody should know about. (While the audience is reading the news on their laptops, or texting their friend in row 3 with some funny remark.)</p>",
        "id": 193675268,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1586632923
    },
    {
        "content": "<p>It doesn't seem tractable to require that every paper includes all the background material required to understand it.</p>",
        "id": 193676045,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586633948
    },
    {
        "content": "<p>This isn't really unique to mathematics, either.</p>",
        "id": 193676118,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586634021
    },
    {
        "content": "<p>No, that wouldn't be reasonable, or even possible. I think the problem is the culture of \"throwing away the scaffolding\", aka not including the thought processes that led the authors to the final result. I think that's pretty much a disaster</p>",
        "id": 193676137,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586634056
    },
    {
        "content": "<p>It's worked fine for a few; the main problem is that it limits the audience.</p>",
        "id": 193676153,
        "sender_full_name": "John Baez",
        "timestamp": 1586634091
    },
    {
        "content": "<p>And thus limits the impact!</p>",
        "id": 193676169,
        "sender_full_name": "John Baez",
        "timestamp": 1586634103
    },
    {
        "content": "<p>The worst thing is not including the motivation. I don't believe that anybody ever did any research without motivation, but it's pretty common for papers to include no motivation at all, especially old category theory papers</p>",
        "id": 193676217,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586634133
    },
    {
        "content": "<p>By the way, my remarks about mathematicians writing for God was an exaggeration; <span class=\"user-mention\" data-user-id=\"276625\">@Joachim Kock</span> understood what I was getting at and it explained it more clearly (though perhaps a bit less amusingly).</p>",
        "id": 193676231,
        "sender_full_name": "John Baez",
        "timestamp": 1586634165
    },
    {
        "content": "<p>\"They write the sentences you should think once you understand the subject, not the sentences you need to see to understand the subject.\"</p>\n<p>I think there is a lot going on here and many reasons why it is so hard to write mathematics well. First, there is what has been called the \"curse of knowledge\": the idea that the longer and better you know something, the harder it is to imagine someone else not knowing it. It takes sustained deliberate effort while writing to imagine the subject not as it appears to you, but as it will appear to the reader. Unlike in teaching, you do not have the benefit of immediate feedback. You just have your image of the intended reader. And if there are multiple profiles of intended reader, as often in ACT, then compromises will inevitably have to be made.</p>\n<p>The curse of knowledge applies to all technical writing, but mathematical writing has special challenges due to its strict standard of exactness and rigor compared to other fields. This standard is why math attains a level of clarity and correctness not usually seen elsewhere, but it also means that extra care must be taken to avoid overly formalistic writing. We have all seen papers that look like they were written for a proof assistant. Good mathematical writing conveys motivation and intuition. On the other hand, it does not become overly impressionistic, poetical, or glib. It does not trivialize genuine technical difficulties. Nor does it patronize the reader by suggesting that the piece is written for children, as I have occasionally seen. This is a difficult balance to strike.</p>\n<p>John's comment about talking to God the Mathematician is phrased in a cheeky way, but there is an element of this in mathematical culture. I think that every mathematician, in their heart, wishes to believe their work is timeless. This conceit is possible because mathematical truths do seem to be timeless, even if what mathematicians consider to be interesting, important, or beautiful has changed enormously over time. Thus, when writing, there is an inclination to express things in the most perfect way possible, rather than the most intelligible. Never mind that tomorrow you may think of a still more \"perfect\" way to express it!</p>\n<p>And in all this I haven't even touched on the problems of incentives facing academics, but I should stop now.</p>",
        "id": 193679515,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1586639155
    },
    {
        "content": "<blockquote>\n<p>Nor does it patronize the reader by suggesting that the piece is written for children, as I have occasionally seen.</p>\n</blockquote>\n<p>I'm interested in hearing more about this.</p>",
        "id": 193689325,
        "sender_full_name": "Jeremy",
        "timestamp": 1586656561
    },
    {
        "content": "<p>Sometimes I see authors suggest that their work, especially their expository work, is \"for children\" or \"for dummies\". Occasionally this is said explicitly, more often it is just implied. While I assume that the authors usually have good intentions, and are just trying to advertise their work as friendly, I am not a fan of this attitude. Besides being condescending, it suggests that the material should be experienced as easy or simple, which depending on the background of the reader, it may or may not be. It also runs the risk of trivializing ideas that are not trivial.</p>\n<p>IMO, the attitude that the writer should take to the reader is something like: \"I have gone to the trouble to understand something worth knowing. I will now present it to you as clearly as I can, so that you do not have go to the same trouble. I hope that, in the future, our roles will be reversed and you will show me something you have learned.\" Note that this is a relationship between equals, not of an adult lecturing a child.</p>",
        "id": 193690629,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1586659164
    },
    {
        "content": "<p>Maybe this is an application of the \"show, don't tell\" principle of writing fiction. When writing math, just try to make your ideas as clear and accessible as you can, without beating your reader over the head with how clear and accessible it is all supposed to be.</p>",
        "id": 193690725,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1586659365
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193674264\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193674264\">said</a>:</p>\n<blockquote>\n<p>That's because you're a person.    Mathematicians are not mainly trying to talk to people.  They're trying to talk to God the Mathematician.</p>\n</blockquote>\n<p>I'd say the \"God the Mathematician\" here is <a href=\"https://en.wikipedia.org/wiki/Nicolas_Bourbaki\" title=\"https://en.wikipedia.org/wiki/Nicolas_Bourbaki\">Bourbaki</a>. Mathematicians didn't always write like this, and the popularisation of the Bourbaki style is, I think, the main factor. </p>\n<p>One rare example of a mathematician who wrote beautifully is the late <a href=\"https://en.wikipedia.org/wiki/Michael_Atiyah\" title=\"https://en.wikipedia.org/wiki/Michael_Atiyah\">Sir Michael Atiyah</a>. I think he understood well the curse of knowledge and the effect it has on writers, and he told his students not to read papers, but to come talk to him (source: one of his students). His papers are well-motivated and read like a dream: just look up any of his early works.</p>\n<p>The only drawback is the \"Pokemon theorem\" phenomenon: you'd be happily reading paragraph after paragraph, when suddenly \"a wild theorem appears\", and then you'd realise that you've read through the actual proof of said theorem. That is part of the Bourbaki conditioning though: the backtracking is a good price to pay for the pleasantly-written prose.</p>",
        "id": 193692217,
        "sender_full_name": "(=_=)",
        "timestamp": 1586662765
    },
    {
        "content": "<p>one time i read this entire thing <a href=\"https://www.dpmms.cam.ac.uk/~ardm/hbslmag2.pdf\" title=\"https://www.dpmms.cam.ac.uk/~ardm/hbslmag2.pdf\">https://www.dpmms.cam.ac.uk/~ardm/hbslmag2.pdf</a></p>",
        "id": 193692735,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586663823
    },
    {
        "content": "<p>somehow</p>",
        "id": 193692737,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586663827
    },
    {
        "content": "<p>actually wait maybe i jumped thru it</p>",
        "id": 193692740,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586663852
    },
    {
        "content": "<p>but in any case, <em>wow</em> there's some bad stuff in there</p>",
        "id": 193692741,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586663865
    },
    {
        "content": "<p>When can we move to the post-post-Gödelian age?</p>",
        "id": 193692892,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586664176
    },
    {
        "content": "<p>once we get enough mathematicians who are good at Posting</p>",
        "id": 193692902,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586664230
    },
    {
        "content": "<p>I'd like to learn more about this, since I like large numbers:</p>\n<blockquote>\n<p>To conceptualise the formalism becomes even more hopeless in later editions of Bourbaki, where the ordered pair (x, y) is introduced by Kuratowski's definition, not as a primitive, and the term for 1 takes an impressive 2409875496393137472149767527877436912979508338752092897 symbols [29]</p>\n</blockquote>\n<p>where footnote [29] says</p>\n<blockquote>\n<p>[29]  according to a program written by Solovay in Allegro Common Lisp.</p>\n</blockquote>",
        "id": 193698729,
        "sender_full_name": "John Baez",
        "timestamp": 1586675634
    },
    {
        "content": "<p>I have trouble seeing how the term for 1 could take so many symbols.  Did Bourbaki follow Russell and Whitehead, and define 1 to be the proper class of all one-element sets?  Even then it seems like it wouldn't be such a mammoth expression.</p>",
        "id": 193698790,
        "sender_full_name": "John Baez",
        "timestamp": 1586675699
    },
    {
        "content": "<p>As a high school student, I'm wondering: How do people generally learn how to write good papers? Is it through trial and error (feedback)? Maybe there exist classes for it.</p>",
        "id": 193698865,
        "sender_full_name": "Jeremy",
        "timestamp": 1586675822
    },
    {
        "content": "<p>maybe they mean 1 the real number</p>",
        "id": 193699282,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676637
    },
    {
        "content": "<p>There are basically no classes for mathematicians on how to write papers well, and this is one reason most of them don't (in my opinion).  Classes do often teach how to write a clear and correct proof, but this is just a first step toward learning how to write mathematics well.   </p>\n<p>Often mathematicians learn some things about writing from their thesis advisor, who is supposed to correct and improve their papers and thesis.</p>",
        "id": 193699285,
        "sender_full_name": "John Baez",
        "timestamp": 1586676650
    },
    {
        "content": "<p>oh wait</p>",
        "id": 193699291,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676685
    },
    {
        "content": "<p>well they just noted that there's combinatorial explosions because of duplicated terms in the definition of ∃</p>",
        "id": 193699303,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676705
    },
    {
        "content": "<p>Yeah, the real number 1 could be weighted down by extra junk.  I'll have to read about \"duplicated terms in the definition of ∃\".</p>",
        "id": 193699306,
        "sender_full_name": "John Baez",
        "timestamp": 1586676718
    },
    {
        "content": "<p>log2 of that is only 180.653</p>",
        "id": 193699344,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676743
    },
    {
        "content": "<p>so if the expanded 100% formal definition involves 180 nested ∃s, then...</p>",
        "id": 193699347,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676762
    },
    {
        "content": "<p>the duplicated terms thing is at the beginning of the paragraph you quoted from!</p>",
        "id": 193699351,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676786
    },
    {
        "content": "<p>actually wait it's even worse than what i wrote</p>",
        "id": 193699355,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676807
    },
    {
        "content": "<p>if x occurs a bunch of times then you have a worse-than-multiplication-by-2 explosion</p>",
        "id": 193699357,
        "sender_full_name": "sarahzrf",
        "timestamp": 1586676819
    },
    {
        "content": "<p>Mathias has a <a href=\"https://www.dpmms.cam.ac.uk/~ardm/inefff.pdf\" title=\"https://www.dpmms.cam.ac.uk/~ardm/inefff.pdf\">paper</a> devoted to the number 1 in Bourbaki.<br>\nI randomly met him at a seminar in Oxford in February. He introduced himself as an anti-Bourbakist, later he asked for a piece of paper, wrote a number on it and told me to look it up on the internet. It was the number in the title (4,523,659,424,929).</p>",
        "id": 193704169,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1586685155
    },
    {
        "content": "<p>Would folks be interested in a stream on the practice of academia, encompassing topics such as this one, the discussion on naming that I was recently involved in over on the <a class=\"stream\" data-stream-id=\"230087\" href=\"/#narrow/stream/230087-theory.3A-topos-theory\">#theory: topos theory</a> stream, and the practical social/personal aspects of doing category theory? I want to weigh in on this, but I missed the original boat because it's in a stream I'm not subscribed to <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 193710597,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586693458
    },
    {
        "content": "<p>Sure. We can call it \"#offtopic: grousing about academia\" <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 193712685,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586697105
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276480\">Reid Barton</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193712685\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193712685\">said</a>:</p>\n<blockquote>\n<p>Sure. We can call it \"#offtopic: grousing about academia\" <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>\n</blockquote>\n<p>I approve this message. <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 193712748,
        "sender_full_name": "(=_=)",
        "timestamp": 1586697192
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282511\">Jeremy</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193698865\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193698865\">said</a>:</p>\n<blockquote>\n<p>As a high school student, I'm wondering: How do people generally learn how to write good papers? Is it through trial and error (feedback)? Maybe there exist classes for it.</p>\n</blockquote>\n<p>Like John said, there are no classes for it... until recently, but these are classes \"for all\" run by people who specialise in communications studies and whatnot, which means some advice is actively bad for STEM fields and especially mathematics. (Stunning example #1: \"Avoid using symbols\". <em>Hello</em>, 16th century!)</p>\n<p>So mostly it's through trial and error. (Same goes for learning how to teach as well. <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span>) Many people and university departments have written about how to write good papers, and there have been books written about this subject, so fire up your favourite search engine and have a look.</p>",
        "id": 193712871,
        "sender_full_name": "(=_=)",
        "timestamp": 1586697432
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276072\">sarahzrf</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193692741\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193692741\">said</a>:</p>\n<blockquote>\n<p>but in any case, <em>wow</em> there's some bad stuff in there</p>\n</blockquote>\n<p>Care to elaborate? Mathias is a set theorist and has locked horns with MacLane before, so...</p>",
        "id": 193712923,
        "sender_full_name": "(=_=)",
        "timestamp": 1586697555
    },
    {
        "content": "<p>On a more serious note, it would probably be better to focus on a more constructive topic, say \"mathematical communication\"</p>",
        "id": 193712925,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586697578
    },
    {
        "content": "<p>I have created the <a class=\"stream\" data-stream-id=\"233322\" href=\"/#narrow/stream/233322-practice.3A-communication\">#practice: communication</a> stream, with name chosen to keep the discussion closer to this one than to \"grousing about academia\" <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 193715166,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586701383
    },
    {
        "content": "<p>I think general \"grousing about academia\" would have been better, so we can all have a good moan about journals, Elsevier, peer review, university bureaucracy etc etc etc etc. Category theory was always very far ahead of the curve, TAC is honestly such a cool journal.... they were doing the right thing decades before it was cool... and now we have Compositionality too</p>",
        "id": 193715595,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1586702155
    },
    {
        "content": "<p>No one's stopping you from opening that discussion there! It seems relevant; journals are our gateway for formal communications within the community, after all. I just didn't want the stream to bear an inherently argumentative name.</p>",
        "id": 193715758,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586702475
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282511\">Jeremy</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193698865\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193698865\">said</a>:</p>\n<blockquote>\n<p>As a high school student, I'm wondering: How do people generally learn how to write good papers? Is it through trial and error (feedback)? Maybe there exist classes for it.</p>\n</blockquote>\n<p>On the CS side, there is something called the \"Programming Languages Mentoring Workshop\" that is regularly scheduled at major conferences. Here's a representative sample of talks: <a href=\"https://www.youtube.com/playlist?list=PLyrlk8Xaylp7Me_jLzVOl8coxRurUPFUC\" title=\"https://www.youtube.com/playlist?list=PLyrlk8Xaylp7Me_jLzVOl8coxRurUPFUC\">https://www.youtube.com/playlist?list=PLyrlk8Xaylp7Me_jLzVOl8coxRurUPFUC</a> (you can find plenty of others by googling \"PLMW youtube\"). It has senior people explaining the basics of their own research and also topics  like \"how I write a good paper\" \"how I give an engaging talk\" \"how my partner and i navigated the two body problem in academia\". \"Proper math\" has a fairly different notion of a good paper and talk, so the advice doesn't translate directly, but it is perhaps something of a good example for other disciplines to follow...</p>",
        "id": 193718729,
        "sender_full_name": "Gershom",
        "timestamp": 1586707345
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193699285\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193699285\">said</a>:</p>\n<blockquote>\n<p>There are basically no classes for mathematicians on how to write papers well, and this is one reason most of them don't (in my opinion).  Classes do often teach how to write a clear and correct proof, but this is just a first step toward learning how to write mathematics well.   </p>\n<p>Often mathematicians learn some things about writing from their thesis advisor, who is supposed to correct and improve their papers and thesis.</p>\n</blockquote>\n<p>There are some decent papers on writing mathematics, though. I've always thought the <a href=\"https://entropiesschool.sciencesconf.org/data/How_to_Write_Mathematics.pdf\" title=\"https://entropiesschool.sciencesconf.org/data/How_to_Write_Mathematics.pdf\">one by Halmos</a> was sound. I don't agree with every last thing he says, but I certainly agree with most of it. </p>\n<p>There's also a good talk by Serre, <a href=\"https://www.youtube.com/watch?v=ECQyFzzBHlo\" title=\"https://www.youtube.com/watch?v=ECQyFzzBHlo\">How to write mathematics badly</a>, a format which gets the points across just as effectively.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ECQyFzzBHlo\" href=\"https://www.youtube.com/watch?v=ECQyFzzBHlo\" title=\"https://www.youtube.com/watch?v=ECQyFzzBHlo\"><img src=\"https://i.ytimg.com/vi/ECQyFzzBHlo/default.jpg\"></a></div>",
        "id": 193730171,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1586725675
    },
    {
        "content": "<p>I mainly meant that mathematicians tend to expound things in a way that reflects the understanding of someone who has thought about a subject for a long time, rather than a way that eases the learning process.   The beginner's misunderstandings and confusions are not addressed; instead mathematicians aim for the beauty of a perfect crystal.</p>",
        "id": 193730229,
        "sender_full_name": "John Baez",
        "timestamp": 1586725757
    },
    {
        "content": "<p>Yes, you can definitely find resources for learning how to write math well if you seek them out!  Here's a free book about it:</p>\n<ul>\n<li>Steven Krantz, <em><a href=\"https://arxiv.org/abs/1612.04888\" title=\"https://arxiv.org/abs/1612.04888\">A Primer on Mathematical Writing</a></em>.</li>\n</ul>\n<p>But those who most need these resources are often the ones least motivated to seek them out.</p>",
        "id": 193730563,
        "sender_full_name": "John Baez",
        "timestamp": 1586726307
    },
    {
        "content": "<p>There are various reasons why mathematicians do this.  One is that it's a lot easier to write a logical exposition than to figure out how to explain things well (which requires deciding <em>to whom</em>).    Another is that most mathematicians want to impress mathematicians who know <em>more</em> than them, not so much help those who know <em>less</em>.</p>",
        "id": 193731056,
        "sender_full_name": "John Baez",
        "timestamp": 1586727092
    },
    {
        "content": "<p>By the way, I blogged about why Bourbaki's 1954 definition of the number 1 would take 4,523,659,424,929 symbols to write out, and why their improved 1970 definition would take 2409875496393137472149767527877436912979508338752092897 symbols:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2020/04/13/bigness-part-1/\" title=\"https://johncarlosbaez.wordpress.com/2020/04/13/bigness-part-1/\">Bigness (part 1)</a>.</li>\n</ul>",
        "id": 193742661,
        "sender_full_name": "John Baez",
        "timestamp": 1586748481
    },
    {
        "content": "<p>Is building the axiom of choice into the definition of ∃ a bad idea? <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 193745318,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586753537
    },
    {
        "content": "<p>No, building the axiom of choice into the definition of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∀</mi></mrow><annotation encoding=\"application/x-tex\">\\forall</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord\">∀</span></span></span></span> is worse. <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61d\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></p>",
        "id": 193745927,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1586754712
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\">said</a>:</p>\n<blockquote>\n<p>One is that it's a lot easier to write a logical exposition than to figure out how to explain things well (which requires deciding <em>to whom</em>).</p>\n</blockquote>\n<p>I think it's fair to say that writing an exposition à la Bourbaki is a lot easier than writing an exposition that explains things well, because there are more examples of the former than the latter. Reading Atiyah's early papers was a breath of fresh air, because I had begun to think that that style of writing was incompatible with mathematics.</p>\n<blockquote>\n<p>Another is that most mathematicians want to impress mathematicians who know <em>more</em> than them, not so much help those who know <em>less</em>.</p>\n</blockquote>\n<p>That's an approach that's been discounted in CS, because exposition is seen as a commentary on code, which has a reputation for being hard to understand, even by people who know \"more\". </p>\n<p>In fact, Donald Knuth, who surely knows \"more\" than many programmers, was the one who introduced this concept as <a href=\"https://en.wikipedia.org/wiki/Literate_programming\" title=\"https://en.wikipedia.org/wiki/Literate_programming\">\"literate programming\"</a> in 1984. It's really caught on in recent years, with <a href=\"https://en.wikipedia.org/wiki/Project_Jupyter#Jupyter_Notebook\" title=\"https://en.wikipedia.org/wiki/Project_Jupyter#Jupyter_Notebook\">Jupyter notebooks</a>, iJulia, and literate Haskell being notable examples. One example of this rise: <a href=\"https://www.kaggle.com/\" title=\"https://www.kaggle.com/\">Kaggle</a>, the online machine learning and data science competition community, encourages participants to use Jupyter notebooks, and this seems to have popularised Jupyter in the machine learning community.</p>",
        "id": 193746641,
        "sender_full_name": "(=_=)",
        "timestamp": 1586756033
    },
    {
        "content": "<p>The axiom of choice was built into Bourbaki's definition of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∀</mi></mrow><annotation encoding=\"application/x-tex\">\\forall</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord\">∀</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">∃</mi></mrow><annotation encoding=\"application/x-tex\">\\exists</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.69444em;vertical-align:0em;\"></span><span class=\"mord\">∃</span></span></span></span>.  The problem with this is that then you can't ask what happens if you <em>don't</em> assume the axiom of choice.  You miss out on a lot of good math this way.</p>\n<p>On the other hand, my former student Toby Bartels pointed out some <a href=\"https://johncarlosbaez.wordpress.com/2020/04/13/bigness-part-1/#comment-160744\" title=\"https://johncarlosbaez.wordpress.com/2020/04/13/bigness-part-1/#comment-160744\">good aspects</a> of what Bourbaki did.</p>",
        "id": 193747755,
        "sender_full_name": "John Baez",
        "timestamp": 1586757990
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193666016\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193666016\">said</a>:</p>\n<blockquote>\n<p>(There's also category theory applied to category theory, which I call \"Australian rules\")</p>\n</blockquote>\n<p>Can we <em>please</em> leave <a href=\"https://en.wikipedia.org/wiki/Australian_rules_football\" title=\"https://en.wikipedia.org/wiki/Australian_rules_football\">sports</a> out of this? <span aria-label=\"thank you\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"thank you\">:thank_you:</span> <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 193748216,
        "sender_full_name": "(=_=)",
        "timestamp": 1586758846
    },
    {
        "content": "<p>Choice is a theorem when you use the traditional 'propositions as types' interpretation of it. The reason is that it is baked into the existential quantifier. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> To prove an existential statement, you must exhibit a chosen value to witness the existential, so there is no choice going on in the 'axiom'. Of course, Bourbaki wouldn't be enforcing the first obligation.</p>",
        "id": 193780399,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586790040
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\">said</a>:</p>\n<blockquote>\n<p>One is that it's a lot easier to write a logical exposition than to figure out how to explain things well (which requires deciding <em>to whom</em>).</p>\n</blockquote>\n<p>I think it's fair to say that writing an exposition à la Bourbaki is a lot easier than writing an exposition that explains things well, </p>\n</blockquote>\n<p>I'm not too comfortable making Bourbaki a whipping boy here. Have you read much Bourbaki, Rongmin? I can't claim to be well versed in Bourbaki, but I've read some of it, and some things are beautifully done. Plus, it's a matter of historical fact that writing exposition &agrave; la Bourbaki was <em>not</em> easy. At all. A great deal of care was put into some of it. </p>\n<p>There would be plenty to criticize in their foundations (and it's been well argued that those foundations get pretty well ignored in the later volumes).</p>",
        "id": 193780562,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1586790146
    },
    {
        "content": "<p>There are ways you can state a more refined axiom of choice that isn't a theorem (you need the right constructions, though). The reason it fails is a bit tricky, though.</p>",
        "id": 193781001,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586790417
    },
    {
        "content": "<p>I guess depending on how you explain the necessary constructions, the explanation would be almost the same as the one for Bourbaki.</p>",
        "id": 193782815,
        "sender_full_name": "Dan Doel",
        "timestamp": 1586791429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193780562\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193780562\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\">said</a>:</p>\n<blockquote>\n<p>One is that it's a lot easier to write a logical exposition than to figure out how to explain things well (which requires deciding <em>to whom</em>).</p>\n</blockquote>\n<p>I think it's fair to say that writing an exposition à la Bourbaki is a lot easier than writing an exposition that explains things well, because there are more examples of the former than the latter. Reading Atiyah's early papers was a breath of fresh air, because I had begun to think that that style of writing was incompatible with mathematics.</p>\n</blockquote>\n<p>I'm not too comfortable making Bourbaki a whipping boy here. Have you read much Bourbaki, Rongmin?</p>\n</blockquote>\n<p>Enough not to be sanguine about the effect it has had on mathematical writing.</p>\n<blockquote>\n<p>Plus, it's a matter of historical fact that writing exposition &agrave; la Bourbaki was <em>not</em> easy. At all. A great deal of care was put into some of it. </p>\n</blockquote>\n<p>That bit you've decided to quote was ironic and explained by the rest you've decided to chop off. Writing Bourbaki-style is easier <em>now</em> than explaining things well, because (1) people expect it (2) there are way more examples of Bourbaki-style writing. But I've experienced first-hand how hard it is to write Bourbaki-style, <em>as compared to</em> actually writing it in a way that explains things well. Like how Atiyah wrote, for example.</p>\n<blockquote>\n<p>There would be plenty to criticize in their foundations (and it's been well argued that those foundations get pretty well ignored in the later volumes).</p>\n</blockquote>\n<p>Bourbaki also inspired the <a href=\"https://en.wikipedia.org/wiki/New_Math\" title=\"https://en.wikipedia.org/wiki/New_Math\">New Math</a> in the US, which helped put an entire generation off of maths. Tom Lehrer even wrote a <a href=\"https://www.youtube.com/watch?v=W6OaYPVueW4\" title=\"https://www.youtube.com/watch?v=W6OaYPVueW4\">little song</a> about it. It's hilarious.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"W6OaYPVueW4\" href=\"https://www.youtube.com/watch?v=W6OaYPVueW4\" title=\"https://www.youtube.com/watch?v=W6OaYPVueW4\"><img src=\"https://i.ytimg.com/vi/W6OaYPVueW4/default.jpg\"></a></div>",
        "id": 193784948,
        "sender_full_name": "(=_=)",
        "timestamp": 1586792638
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193784948\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193784948\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193780562\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193780562\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193746641\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/2.20cultures.20of.20ACT/near/193731056\">said</a>:</p>\n<blockquote>\n<p>One is that it's a lot easier to write a logical exposition than to figure out how to explain things well (which requires deciding <em>to whom</em>).</p>\n</blockquote>\n<p>I think it's fair to say that writing an exposition à la Bourbaki is a lot easier than writing an exposition that explains things well, because there are more examples of the former than the latter. Reading Atiyah's early papers was a breath of fresh air, because I had begun to think that that style of writing was incompatible with mathematics.</p>\n</blockquote>\n<p>I'm not too comfortable making Bourbaki a whipping boy here. Have you read much Bourbaki, Rongmin?</p>\n</blockquote>\n<p>Enough not to be sanguine about the effect it has had on mathematical writing.</p>\n<blockquote>\n<p>Plus, it's a matter of historical fact that writing exposition &agrave; la Bourbaki was <em>not</em> easy. At all. A great deal of care was put into some of it. </p>\n</blockquote>\n<p>That bit you've decided to quote was ironic and explained by the rest you've decided to chop off. Writing Bourbaki-style is easier <em>now</em> than explaining things well, because (1) people expect it (2) there are way more examples of Bourbaki-style writing. But I've experienced first-hand how hard it is to write Bourbaki-style, <em>as compared to</em> actually writing it in a way that explains things well. Like how Atiyah wrote, for example.</p>\n<blockquote>\n<p>There would be plenty to criticize in their foundations (and it's been well argued that those foundations get pretty well ignored in the later volumes).</p>\n</blockquote>\n<p>Bourbaki also inspired the <a href=\"https://en.wikipedia.org/wiki/New_Math\" title=\"https://en.wikipedia.org/wiki/New_Math\">New Math</a> in the US, which helped put an entire generation off of maths. Tom Lehrer even wrote a <a href=\"https://www.youtube.com/watch?v=W6OaYPVueW4\" title=\"https://www.youtube.com/watch?v=W6OaYPVueW4\">little song</a> about it. It's hilarious.</p>\n</blockquote>\n<p>I grew up with New Math -- JB too I think. (And yes, I know the Lehrer piece.) </p>\n<p>I wouldn't blame poor old Bourbaki too much for that movement! I'm not sure how influential Bourbaki himself was on US educators -- I'd expect the influence would have been stronger in France, via Dieudonn&eacute;. There's a little on that <a href=\"https://news.cnrs.fr/articles/bourbaki-and-the-foundations-of-modern-mathematics\" title=\"https://news.cnrs.fr/articles/bourbaki-and-the-foundations-of-modern-mathematics\">here</a>. As you may know, much of the push for New Math in the US was driven by the politics of the Space Race, and the race to get kids educated. But this is getting a little off-topic. </p>\n<p>Nor would I necessarily blame him that much for alleged influence on writing styles. By \"Bourbaki-style\", do you have something in mind other than traditional definition-theorem-proof style?  For me, what is more distinctively Bourbakist is an urge to be encyclopedic, but I wouldn't consider that an especially common trait of \"bad writing\" (however we're understanding that term in this discussion). As for definition-theorem-proof: people were already writing that way! </p>\n<p>It seems to me we might be speaking at cross-purposes. What I was trying to say is that in many respects, Bourbaki took <em>enormous</em> care in the presentation of such topics as Lie groups and Lie algebras, commutative algebra, and others, and wound up explaining some things <em>very</em> well. (For the right audience of course -- not beginners.) I think we can all agree, however, that Bourbaki was austere. I can understand how that might be off-putting. </p>\n<p>I also think we can agree that it's worth trying out a variety of styles. </p>\n<blockquote>\n<p>Writing Bourbaki-style is easier <em>now</em> than explaining things well, because (1) people expect it (2) there are way more examples of Bourbaki-style writing. But I've experienced first-hand how hard it is to write Bourbaki-style, <em>as compared to</em> actually writing it in a way that explains things well.</p>\n</blockquote>\n<p>Wait -- writing Bourbaki-style is <em>easier</em> now, and yet you've experienced first-hand how <em>hard</em> it is to write Bourbaki-style, as compared to writing in a way that explains it well?  That sounds pretty confusing. (And I'm also not sure what you mean by \"first-hand\" -- are you referring to your own writing?) </p>\n<p>I've never heard anyone claim that explaining things well is easy  -- in fact I think JB was saying the opposite, that most people don't explain things well because it's much harder, and take a lazy way out.</p>",
        "id": 193811160,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1586806262
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193811160\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193811160\">said</a>:</p>\n<blockquote>\n<p>I wouldn't blame poor old Bourbaki too much for that movement!</p>\n</blockquote>\n<p>I said the movement was <em>inspired</em> by Bourbaki. </p>\n<blockquote>\n<p>For me, what is more distinctively Bourbakist is an urge to be encyclopedic, but I wouldn't consider that an especially common trait of \"bad writing\" (however we're understanding that term in this discussion). As for definition-theorem-proof: people were already writing that way! </p>\n</blockquote>\n<p>I think one common thread here was a \"logical\" manner of exposition. A good pedagogical style tends to build up from the specific to the general; a \"logical\" style goes in the opposite direction. Many CS papers start with a specific problem and then build up to general constructs and related work; many maths papers start with the latter, and you often get the feeling that there was no specific problem that motivated the work.</p>\n<p>A modern example of what I'd think of as Bourbakist is --- pardon me for saying this --- the nPOV. It fully embraces the encyclopedic and \"total generalisation\" tendency of Bourbaki, and I think you're probably aware that many find the nLab forbidding as a result. It's not that we should abandon the nPOV: it's certainly a nice exercise and provides more information, but that should be done after the concept has sunk in, not at the beginning of an entry.</p>\n<blockquote>\n<p>I think we can all agree, however, that Bourbaki was austere. I can understand how that might be off-putting. <br>\nI also think we can agree that it's worth trying out a variety of styles. </p>\n</blockquote>\n<p>The austerity is probably what people here have meant by \"lack of motivation\". I wouldn't consider John's style to be very Bourbakist, for example, because he puts in a lot of motivation. But there's still the definition-theorem-proof structure: it's just that you have a lot more commentary on what's being defined, proposed and proved.</p>\n<blockquote>\n<p>Wait -- writing Bourbaki-style is <em>easier</em> now, and yet you've experienced first-hand how <em>hard</em> it is to write Bourbaki-style, as compared to writing in a way that explains it well?</p>\n<p>I've never heard anyone claim that explaining things well is easy  -- in fact I think JB was saying the opposite, that most people don't explain things well because it's much harder, and take a lazy way out.</p>\n</blockquote>\n<p>That's what I meant by \"easier\": it's the easy way out, especially since most people are accustomed to encountering it, so that there are plenty of examples of the Bourbaki style.</p>\n<p>I think I may have equivocated on what \"explaining things well\" meant for me. For me, it's just as much about the linguistic style of the writing as the pedagogical quality of the organisation of the material. The latter is something that's not easy to do well in any style, but I find it easier to write in a linguistic style that's closer to John's or Atiyah's than the more austere Bourbaki style.</p>",
        "id": 193865331,
        "sender_full_name": "(=_=)",
        "timestamp": 1586853437
    },
    {
        "content": "<p>(I can't get this threading and quoting to format right for me. So at the risk of annoying Rongmin, I've had to chop out some context I would have preserved. Don't know what I'm doing wrong. But I've spent too long trying to fix this, I'm giving up trying to do it the way I wanted. </p>\n<blockquote>\n<p>I said the movement was <em>inspired</em> by Bourbaki. </p>\n</blockquote>\n<p>Yes, I know you did, and it's not the first time I've heard that kind of thing said. But as far as US New Math goes, I think \"inspired by Bourbaki\" is an exaggeration. (The nearest I can come is that Piagetian theory might have had some influence in US education circles, and Piaget may have felt some affinity for Bourbaki structuralism. And even that is a something of a guess.) If you have solid sources documenting the direct influence of Bourbaki on US New Math, I'd like to hear it. </p>\n<p>(I remember dimly what some of that New Math was like growing up. I remember maybe a little doing unions and intersections. There was also stuff about changing base, like how to do write a decimal in base 4 or something. I think I learned the words \"commutative\" and \"distributive\". But it wasn't anything like hard-core axiomatics. There was plenty of arithmetic drill too. What I experienced doesn't feel that abnormal to me.) </p>\n<p><a href=\"https://web.math.rochester.edu/people/faculty/rarm/the_new_math.html\" title=\"https://web.math.rochester.edu/people/faculty/rarm/the_new_math.html\">This</a> seems to be a decent and interesting resource on the history of US New Math. I haven't gone through all of it, but so far I haven't run across any mention of Bourbaki. </p>\n<p>In France I think the situation was different. </p>\n<blockquote>\n<p>I think one common thread here was a \"logical\" manner of exposition. A good pedagogical style tends to build up from the specific to the general; a \"logical\" style goes in the opposite direction. Many CS papers start with a specific problem and then build up to general constructs and related work; many maths papers start with the latter, and you often get the feeling that there was no specific problem that motivated the work.</p>\n</blockquote>\n<p>Different strokes. I resist making blanket pronouncements on good pedagogical style. For me personally, it's much more of a mix. Sometimes I like working from examples to generalities; in other instances I've found it distracting trying to learn from specific to general. </p>\n<blockquote>\n<p>A modern example of what I'd think of as Bourbakist is --- pardon me for saying this --- the nPOV. It fully embraces the encyclopedic and \"total generalisation\" tendency of Bourbaki, and I think you're probably aware that many find the nLab forbidding as a result. It's not that we should abandon the nPOV: it's certainly a nice exercise and provides more information, but that should be done after the concept has sunk in, not at the beginning of an entry.</p>\n</blockquote>\n<p>Yes, I am aware of and in fact sympathetic to how forbidding some nLab entries look. (And it's okay to say it.) But I don't agree it \"fully embraces the encyclopedic and \"total generalisation\" tendency of Bourbaki\", because for one, that implies a uniformity to the nLab that simply doesn't exist. It's much more haphazard and unplanned and ramshackle than that. That there are sometimes tendencies in these directions  -- certainly. </p>\n<p>There are a lot of onlookers, and so I won't venture my full feelings about the nLab here. There are problems, but it's quite extraordinary all the same (\"nice exercise\" sounds like damning with faint praise). </p>\n<p>I agree that a lot of \"Idea sections\" are hard (really hard) to read. I hope that can change over time. </p>\n<blockquote>\n<p>The austerity is probably what people here have meant by \"lack of motivation\". I wouldn't consider John's style to be very Bourbakist, for example, because he puts in a lot of motivation. But there's still the definition-theorem-proof structure: it's just that you have a lot more commentary on what's being defined, proposed and proved.</p>\n</blockquote>\n<p>John has tried a lot of different expository styles, some quite far from definition-theorem-proof (I'm sure you know this). But whatever mode he's in, he's always pretty far from being anything like Bourbaki -- an understatement indeed! </p>\n<p>But I responded to this thread because I didn't like how Bourbaki was seemingly portrayed as someone whose style is opposed to \"explaining things well\". I thought that unfair, for reasons given in my initial response. But I seem to be having trouble making my point. I'm not sure why. </p>\n<p>I've seen a lot of Bourbaki-bashing and I think some of it is really over the top, really sniping and ugly in fact. Arnol'd's diatribes, for instance, I have almost no stomach for. The harm that it's been alleged to cause is, I think, overdone (outside of France, anyway -- I don't know about inside). </p>\n<p>Generally I think of the birth of Bourbaki as taking place within an axiomatic spirit which was already predominant in the German research centers. Then too I find a certain nobility of aspiration in his project as a whole, alongside some quite considerable and loving care in its treatment of certain topics. When you think of some of the great French mathematicians who were in good measure imbued with the spirit, I think one might come to feel awe. </p>\n<p>So maybe he's a little pass&eacute; in some respects, fine. And maybe let's rethink some of his excesses -- also fine. </p>\n<blockquote>\n<p>That's what I meant by \"easier\": it's the easy way out, especially since most people are accustomed to encountering it, so that there are plenty of examples of the Bourbaki style.</p>\n</blockquote>\n<p>\"Examples of the Bourbaki style\". Listen, all I'm trying to point out is the great polish and care that went into so much of the Bourbaki texts, at least on those subjects that he was passionate about. Anything but taking an easy way out!  </p>\n<p>Again, it sounds to me that what you mean is that you find that <em>typical</em> papers written in definition-theorem-proof style are generally lacking in the pedagogical graces. I'm not arguing against that. But this phrase \"Bourbaki style\" seems to me such a crude shorthand, insensitive to the reality of who he was, and to the fact he did some things very well. A little too casually dismissive to my ears. </p>\n<blockquote>\n<p>I think I may have equivocated on what \"explaining things well\" meant for me. For me, it's just as much about the linguistic style of the writing as the pedagogical quality of the organisation of the material. The latter is something that's not easy to do well in any style, but I find it easier to write in a linguistic style that's closer to John's or Atiyah's than the more austere Bourbaki style.</p>\n</blockquote>\n<p>It sounded as if you were upholding your own writing as an exemplar of \"explaining things well\" -- it still sounds to me a little like that, and therefore a little, I dunno, weird-sounding? (Hate to have to put it like that, and anyway I don't know your mathematical writing -- maybe it's terrific.) I'm sorry if I've misunderstood. </p>\n<p>Anyway, I think I've said my piece, and I should probably now bow out. There are many interesting conversations going on, more interesting than this one.</p>",
        "id": 193984855,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1586926247
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\">said</a>:</p>\n<blockquote>\n<p>I can't get this threading and quoting to format right for me.</p>\n</blockquote>\n<p>You can replace the <code>'''quote</code> and <code>'''</code> with <code>&gt;</code> in front of what you want to quote, e.g.:</p>\n<div class=\"codehilite\"><pre><span></span>&gt; Something I want to quote\n</pre></div>\n\n\n<p>will produce</p>\n<blockquote>\n<p>Something I want to quote</p>\n</blockquote>\n<p>and</p>\n<div class=\"codehilite\"><pre><span></span>&gt;&gt; Something they quoted\n\n&gt; Something I quoted\n</pre></div>\n\n\n<p>gives</p>\n<blockquote>\n<blockquote>\n<p>Something they quoted</p>\n</blockquote>\n<p>Something I quoted</p>\n</blockquote>",
        "id": 193987540,
        "sender_full_name": "(=_=)",
        "timestamp": 1586930291
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\">said</a>:</p>\n<blockquote>\n<p>But as far as US New Math goes, I think \"inspired by Bourbaki\" is an exaggeration. (The nearest I can come is that Piagetian theory might have had some influence in US education circles, and Piaget may have felt some affinity for Bourbaki structuralism. And even that is a something of a guess.) If you have solid sources documenting the direct influence of Bourbaki on US New Math, I'd like to hear it.</p>\n</blockquote>\n<p>For \"inspired by Bourbaki\", I refer you to </p>\n<ul>\n<li>Chapter 10, <em>New Math in the Classroom</em>, of Maurice Mashaal's 2006 book, <em><a href=\"https://bookstore.ams.org/bourbaki/\" title=\"https://bookstore.ams.org/bourbaki/\">Bourbaki: a Secret Society of Mathematicians</a></em>.</li>\n<li>This <a href=\"https://www.npr.org/templates/story/story.php?storyId=6503411\" title=\"https://www.npr.org/templates/story/story.php?storyId=6503411\">interview</a> of Amir Aczel on NPR.</li>\n<li>The infamous slogan of the Bourbakist Dieudonné --- \"À bas Euclide!\" --- at the 1959 Royaumont conference. This <a href=\"https://hsm.stackexchange.com/questions/2578/did-dieudonn%C3%A9-say-euclid-must-go-or-down-with-euclid-death-to-triangles\" title=\"https://hsm.stackexchange.com/questions/2578/did-dieudonn%C3%A9-say-euclid-must-go-or-down-with-euclid-death-to-triangles\">thread</a> leads to a <a href=\"http://www.ssrdm.ch/mathecole/wa_files/Mathecole_90.pdf\" title=\"http://www.ssrdm.ch/mathecole/wa_files/Mathecole_90.pdf\">report</a> on Royaumont, which includes a transcript of Dieudonné's words.</li>\n<li>The reform of tertiary mathematical education advocated by Bourbaki in France, which may have inspired educators to do the same at the secondary level.</li>\n</ul>\n<p>(Edit: In this <a href=\"https://web.math.rochester.edu/people/faculty/rarm/chron.html\" title=\"https://web.math.rochester.edu/people/faculty/rarm/chron.html\">chronology</a> listed in the <a href=\"https://web.math.rochester.edu/people/faculty/rarm/the_new_math.html\" title=\"https://web.math.rochester.edu/people/faculty/rarm/the_new_math.html\">website</a> you linked to, the 1959 Royaumont conference was described:</p>\n<blockquote>\n<p>1959 An OEEC conference of mathematicians and educators (Marshall Stone, Chairman) takes place at Royaumont, in France. Jean Dieudonné's keynote address, famously characterized by his line, \"Euclid Must Go!\", urged vector space methods instead of the current synthetic system, and the tone of his talk favored more logic and abstrac­tion in school math in general. The conference was also attended by Begle and other Americans.  The history of \"new math\" in Europe from this point on resembles that in the USA, but is not an imitation of it, and was not uniform across Europe any more than it was across the U.S.A.</p>\n</blockquote>\n<p>Begle, as the chronology reveals, headed the School Mathematics Study Group (SMSG), which was responsible for the New Math in the US.)</p>\n<p>I was careful to suggest that New Math was \"inspired\" by Bourbaki, and had never suggested that there was any \"direct influence\" of Bourbaki. Maurice Mashaal acknowledged that any direct influence is a hard claim to assess, particularly as some Bourbakists, like Leray and Dieudonné, came out later against the New Math reforms.</p>",
        "id": 193988383,
        "sender_full_name": "(=_=)",
        "timestamp": 1586931380
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/193984855\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>I think I may have equivocated on what \"explaining things well\" meant for me. For me, it's just as much about the linguistic style of the writing as the pedagogical quality of the organisation of the material. The latter is something that's not easy to do well in any style, but I find it easier to write in a linguistic style that's closer to John's or Atiyah's than the more austere Bourbaki style.</p>\n</blockquote>\n<p>It sounded as if you were upholding your own writing as an exemplar of \"explaining things well\" </p>\n</blockquote>\n<p>It sounds as if you were being deliberately obtuse. I was upholding the styles of John and Sir Michael as models I'd like to emulate. I agree that it's time we give this conversation a rest.</p>",
        "id": 193988771,
        "sender_full_name": "(=_=)",
        "timestamp": 1586931819
    },
    {
        "content": "<p>Thanks for the formatting tips, and for the references. I'll have a look. </p>\n<p>(I had seen the NPR transcript -- that' not really the kind of documentation I had in mind; it's too thin. And I know about down with Euclid and down with triangles and all that. The book by Mashaal looks like the one with the most promise, but I'm not sure I'd pay money for it.) </p>\n<blockquote>\n<p>It sounds as if you were being deliberately obtuse. I was upholding the styles of John and Sir Michael as models I'd like to emulate.</p>\n</blockquote>\n<p>Then that's what you should have said, as opposed to what you did say, which was this: </p>\n<blockquote>\n<p>But I've experienced first-hand how hard it is to write Bourbaki-style, as compared to actually writing it in a way that explains things well.</p>\n</blockquote>\n<p>When you say you've experienced first hand how it's comparatively easier to write in a way that explains things well, to me that really, really sounds like you're referring to your own writing. I had asked in a follow-up to make sure (\"And I'm also not sure what you mean by \"first-hand\" -- are you referring to your own writing?\"), but you didn't respond to that. </p>\n<p>I may be obtuse (I always allow for that possibility, but I'm never deliberately so, thank you very much). But I submit that on this occasion, you did not explain things well.</p>",
        "id": 194036287,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1586959936
    },
    {
        "content": "<p>Let me douse this conversation with cold water: <span aria-label=\"water drop\" class=\"emoji emoji-1f4a7\" role=\"img\" title=\"water drop\">:water_drop:</span>.</p>",
        "id": 194238220,
        "sender_full_name": "John Baez",
        "timestamp": 1586990951
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/194036287\" title=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/mathematical.20writing/near/194036287\">said</a>:</p>\n<blockquote>\n<p>The book by Mashaal looks like the one with the most promise, but I'm not sure I'd pay money for it.) </p>\n</blockquote>\n<p>You can read that particular chapter by searching on Google Books.</p>\n<blockquote>\n<p>When you say you've experienced first hand how it's comparatively easier to write in a way that explains things well, to me that really, really sounds like you're referring to your own writing. I had asked in a follow-up to make sure (\"And I'm also not sure what you mean by \"first-hand\" -- are you referring to your own writing?\"), but you didn't respond to that. </p>\n</blockquote>\n<p>I didn't respond to that because this was never about my own writing: I mentioned it in passing only to indicate that I'm speaking from personal experience.</p>\n<p>Similarly, my opinion had always been about the popularisation, and subsequent widespread expectation imposed on new authors, of the <em>style</em> that the group of mathematicians known as Bourbaki had used, and not at all about the Bourbaki group and their works.</p>\n<p>On that note, and John's dousing of cold water, let's end this conversation.</p>",
        "id": 194327777,
        "sender_full_name": "(=_=)",
        "timestamp": 1587052981
    },
    {
        "content": "<p>Nope, just seeking clarification. Bye</p>",
        "id": 194337717,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1587057308
    }
]