[
    {
        "content": "<p>In trying to apply math to the ecological crisis, I'm wanting to study questions like \"what is a thriving ecosystem?\" and \"what is a robust network?\"  I think our current approach to economics and life in general is based on a really poor understanding of questions like these.</p>\n<p>I'm hoping the general theory of networks (e.g. <a href=\"https://johncarlosbaez.wordpress.com/2020/08/15/open-systems-a-double-categorical-perspective-part-1/\">structured cospans</a>) will play a role here, but only a supporting role: I need to learn a lot and then come up with some new ideas.</p>\n<p>I'm starting out right now by reading a lot and - just to get started on some relevant math - working a bit on evolutionary game theory.   That's why I'm trying to straighten out <a href=\"https://johncarlosbaez.wordpress.com/2020/09/29/fishers-fundamental-theorem-part-2/\">Fisher's fundamental theorem</a>.   </p>\n<p>I think an easy next step would be to cook up a category where the morphisms are \"open\" evolutionary games.  We can think of these as \"pieces of ecosystems\", which we can stick together to form bigger ecosystems with more organisms interacting in more ways.</p>",
        "id": 212458738,
        "sender_full_name": "John Baez",
        "timestamp": 1602005004
    },
    {
        "content": "<p>Cool idea. First of all, do you have a definition in mind for \"closed evolutionary game\"?</p>",
        "id": 212467026,
        "sender_full_name": "Jade Master",
        "timestamp": 1602009161
    },
    {
        "content": "<p>Yes, there are a number of standard concepts of \"evolutionary game\".   The simplest one involves 2-player games and a payoff matrix; I explained it here:</p>\n<ul>\n<li><a href=\"https://math.ucr.edu/home/baez/information/information_geometry_13.html\">Information geometry (part 13)</a>.</li>\n</ul>\n<p>I think I may work with a more general definition, but this case has to be included.</p>",
        "id": 212472487,
        "sender_full_name": "John Baez",
        "timestamp": 1602011895
    }
]