[
    {
        "content": "<p>Yeah, there are many stories among these lines. I think these are all factors contributing to the denotation of phd life as \"horrible\"</p>",
        "id": 200247754,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591717100
    },
    {
        "content": "<p>It's literally something. One is getting paid (HOPEFULLY) to know more about some stuff one really likes and cares about. If this is lived as a horrible experience then we have a big problem to solve <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 200247908,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591717171
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Really.20applied.20ACT/near/200248986\">said</a>:</p>\n<blockquote>\n<p>Hell is our own creation, I think.</p>\n</blockquote>\n<p>I don't think that's true. Almost every bad PhD experience that I've been told about has resulted from a failure of mentorship on the part of the PhD supervisor(s). In the narrowing heights of academia, it's not surprising that without proper guidance and support along the path people tend to struggle.</p>",
        "id": 200250148,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591718027
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Really.20applied.20ACT/near/200250148\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Really.20applied.20ACT/near/200248986\">said</a>:</p>\n<blockquote>\n<p>Hell is our own creation, I think.</p>\n</blockquote>\n<p>I don't think that's true. [...]</p>\n</blockquote>\n<p>The \"hell\" I was referring to was the ACT guidelines and the chaos that ensued. The PhD experience is terrible and I have a lot to say about that too.</p>",
        "id": 200250470,
        "sender_full_name": "(=_=)",
        "timestamp": 1591718139
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/Really.20applied.20ACT/near/200250148\">said</a>:</p>\n<blockquote>\n<p>Almost every bad PhD experience that I've been told about has resulted from a failure of mentorship on the part of the PhD supervisor(s). </p>\n</blockquote>\n<p>I agree. And failures of mentorship begets more failures.</p>",
        "id": 200250669,
        "sender_full_name": "(=_=)",
        "timestamp": 1591718214
    },
    {
        "content": "<p>My PhD experience has been wonderful actually, it's what happened later that really beated me off. But then again, my PhD supervisors were Bob and Dan, I was immensely lucky in this respect.</p>",
        "id": 200250746,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591718247
    },
    {
        "content": "<p>Okay, let's get folks in on this. What's it like to do a PhD in applied* category theory? How could it be better?<br>\n(*the \"applied\" restriction is only to stay on topic for the stream; all inputs welcome)</p>",
        "id": 200251170,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591718397
    },
    {
        "content": "<p>Perhaps you can nonetheless contribute what you wanted to say about the PhD experience more generally?</p>",
        "id": 200252079,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591718683
    },
    {
        "content": "<p>I'm right near the end of doing a phd in act, but I'm not sure how to answer the question.</p>",
        "id": 200252811,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591718967
    },
    {
        "content": "<p>I think the essentials for a nice phd experience are:</p>\n<ul>\n<li>Nice supervisors. By nice I mean \"friendly\" and \"supportive\", not just good at what they do.</li>\n<li>Nice environment. By nice I mean \"collaborative\". In my research group I could discuss about ideas with everyone without fearing that someone would steal them. Actually my very first paper happened while chatting with Stefano Gogioso in the department kitchen. And he said \"this idea is nice! Let's write a paper about this!\" and I was like \"A what? Where do I begin from?\". So this kind of environment is really useful.</li>\n<li>Conferences to publish into. This ties in with the discussion in <a class=\"stream-topic\" data-stream-id=\"229156\" href=\"/#narrow/stream/229156-practice.3A-applied-ct/topic/Really.20applied.20ACT\">#practice: applied ct &gt; Really applied ACT</a> . If the conferences in your field are too high bar you'll feel useless. Conferences like QPL helped me a lot in feeling \"rewarded\" for my research.</li>\n</ul>\n<p>All these things help you to not feel too much pressured in your PhD life. I had all the time to party and to get involved in my college activities, for instance. This involved getting into office tremendously hungover sometimes but overall was very beneficial for my psychological wellbeing.</p>",
        "id": 200252929,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591719003
    },
    {
        "content": "<p>Then I would say \"good\" on all three points for my experience.</p>",
        "id": 200253132,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591719091
    },
    {
        "content": "<p>As \"collaborative\" I also consider \"inclusive\". I am not part of a minority, so this is something that is obviously difficult to assess for me. But it goes without saying that the research environment should feel safe and inclusive for anyone working in it.</p>",
        "id": 200253611,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591719251
    },
    {
        "content": "<p>Yes, my experience as a cishet white dude being \"good\" isn't saying much.</p>",
        "id": 200253794,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591719351
    },
    {
        "content": "<p>The one way I experience a form of oppression is actually a point I would say I actually did have a rough time. I come from a very poor family. Money issues were super rough for me. Before covid, I constantly debated submitting to conferences etc because I knew there was very little chance I would be able to afford the plane ticket and staying in a hotel for 1 or 2 weeks. I guess many people get funding from their advisors. For some time I did, but paying up front was still a burden. For a majority of my time, I did not get funding. I've given up several critical experiences because I simply couldn't afford to go. I skipped a summer school at the Fields institute, I didn't submit anything to CT or ACT last year, just to name a few.</p>",
        "id": 200254618,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591719691
    },
    {
        "content": "<p>I'm yet to meet a grad student in America who was being paid enough to get by, that sounds so frustrating. Do you think it's a matter of undervaluing of students? It seems paradoxical that universities in America are portrayed (in films, say) as these wealthy establishments, and yet that they fail to adequately provide for their students in that way.</p>",
        "id": 200255984,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591720187
    },
    {
        "content": "<blockquote>\n<p>Do you think it's a matter of undervaluing of students?</p>\n</blockquote>\n<p>I'm at a loss for the words to express how much of an understatement this is to me.</p>",
        "id": 200285197,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591734336
    },
    {
        "content": "<p>Yes, I can relate with this. I myself wasn't a funded student. My situation wasn't that bad because my family could still provide for me, but it still felt increadibly frustrating. Also, sometimes I felt like it was a Joke: Bob gave me priority for a scholarhip but not being British someone else got precedence. Also, coming from a country that considers culture as basically a bad thing, there wasn't any government scholarship I could access to. I managed to solve the situation by working in the CompSci department for a bit (thanks again to Bob) and by finishing my PhD in two years (thus avoiding paying taxes for my 3rd year)</p>",
        "id": 200294433,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591738838
    },
    {
        "content": "<p>In any case, I think that financial hardship is probably one of the biggest - if not the biggest - burdens for students (and people) overall</p>",
        "id": 200294524,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591738895
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200255984\">said</a>:</p>\n<blockquote>\n<p>It seems paradoxical that universities in America are portrayed (in films, say) as these wealthy establishments, and yet that they fail to adequately provide for their students in that way.</p>\n</blockquote>\n<p>Don't forget that a rich old private institution like Harvard, Yale or Princeton is completely different than a state school like U.C. Riverside.  There's a lot more to say about this, but Joe is at U. C. Riverside.</p>",
        "id": 200296808,
        "sender_full_name": "John Baez",
        "timestamp": 1591740135
    },
    {
        "content": "<p>Once I read that Harvard could abolish tuition fees and give free meals/accomodation to all of its students, and still close their yearly balance with big gains. They don't do it just because they don't want to.</p>",
        "id": 200297286,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591740456
    },
    {
        "content": "<p>Harvard's current policy for undergrads is \"if your family's income is less than $65,000, you'll pay nothing\".</p>",
        "id": 200297385,
        "sender_full_name": "John Baez",
        "timestamp": 1591740508
    },
    {
        "content": "<p>Something similar is true for Princeton, Stanford and others.</p>",
        "id": 200297409,
        "sender_full_name": "John Baez",
        "timestamp": 1591740531
    },
    {
        "content": "<p>That's good to hear. The thing I'm referring to is a few years old. Could it be that they changed their policy because they were pressured to do so in recent times?</p>",
        "id": 200297482,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591740587
    },
    {
        "content": "<p>I see this from 2013: </p>\n<blockquote>\n<p>Harvard University recently announced a renewed effort to attract applications from qualified low-income and middle-income students across the country. </p>\n<p>To address this problem, Harvard’s message is fairly simple. Few realize that Harvard’s financial aid programs pay 100 percent of tuition, fees, room, and board for students from families earning less than $65,000 a year. Families with incomes from $65,000 to $150,000 pay between zero and 10 percent of their income. This means that, for 90 percent of families earning less than $150,000, a Harvard education is competitive with or less expensive than a public university in a student’s home state. Harvard stresses that most of the students qualifying for financial aid (about 60 percent of undergraduates) also receive travel allowances to keep them connected with home. Harvard also points out that a quarter of its current students come from families with less than $80,000 in annual income.</p>\n</blockquote>",
        "id": 200297934,
        "sender_full_name": "John Baez",
        "timestamp": 1591740861
    },
    {
        "content": "<p><a href=\"https://nonprofitquarterly.org/harvard-initiative-to-attract-low-income-students-includes-free-tuition/\">https://nonprofitquarterly.org/harvard-initiative-to-attract-low-income-students-includes-free-tuition/</a></p>",
        "id": 200297943,
        "sender_full_name": "John Baez",
        "timestamp": 1591740871
    },
    {
        "content": "<p>So, they started doing this before 2013.   Other rich universities have been gradually following them into this practice, as a kind of competition heats up for really top-notch undergraduate students who aren't so rich.</p>",
        "id": 200298024,
        "sender_full_name": "John Baez",
        "timestamp": 1591740936
    },
    {
        "content": "<p>I lost track of time, but it is likely that the news I read were pre-2013. Again, I am happy to see that things are changing. I also presume this only applies to US citizens, which is overall a reasonable thing I guess</p>",
        "id": 200298108,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591740967
    },
    {
        "content": "<p>I don't know if it only applies to US students.</p>",
        "id": 200298121,
        "sender_full_name": "John Baez",
        "timestamp": 1591740983
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span>'s situation is completely different since 1) he's a grad student, and 2) he's at a rather poor state-run university.</p>",
        "id": 200298182,
        "sender_full_name": "John Baez",
        "timestamp": 1591741031
    },
    {
        "content": "<p>I'd gotten him a research assistantship so he could avoid all teaching assistant duties and get paid to do just research, but he didn't like that for various reasons so he quit.</p>",
        "id": 200298337,
        "sender_full_name": "John Baez",
        "timestamp": 1591741118
    },
    {
        "content": "<p>For sure Oxford (at least for PhDs, and until 2 years ago) has different scholarships if you are British, European or Overseas. These categories are strict, so for instance imagine that you have 10, 3 and 1 scholarhips for British, European and overseas students respectively. They order the students according to evaluations to give a scholarship. Now if you are overseas, and in 4th position, but there is another overseas student before you, you won't get the scholarship, even if Brithish/European students after you will</p>",
        "id": 200298569,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741259
    },
    {
        "content": "<p>Harvard can do whatever it wants, and I see that free tuitions are for international students too:</p>\n<blockquote>\n<p>If your family's income is less than $65,000, you'll pay nothing. Families who earn more than $150,000 may still qualify for financial aid. For more than ninety percent of American families, Harvard costs less a public university. All students receive the same aid regardless of nationality or citizenship.</p>\n</blockquote>",
        "id": 200298700,
        "sender_full_name": "John Baez",
        "timestamp": 1591741345
    },
    {
        "content": "<p>Of course they get to decide how many international students they want to accept.</p>",
        "id": 200298731,
        "sender_full_name": "John Baez",
        "timestamp": 1591741370
    },
    {
        "content": "<p>They've recently gotten in lots of trouble for making it harder for students of Asian background to get in than whites.</p>",
        "id": 200298787,
        "sender_full_name": "John Baez",
        "timestamp": 1591741423
    },
    {
        "content": "<p><span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>",
        "id": 200298812,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741441
    },
    {
        "content": "<p>I'm probably mainly talking about US-born students here.</p>",
        "id": 200298863,
        "sender_full_name": "John Baez",
        "timestamp": 1591741454
    },
    {
        "content": "<p>I think this case went to the Supreme Court.</p>",
        "id": 200298883,
        "sender_full_name": "John Baez",
        "timestamp": 1591741475
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200298863\">said</a>:</p>\n<blockquote>\n<p>I'm probably mainly talking about US-born students here.</p>\n</blockquote>\n<p>Oh, I thought you meant overseas students coming from Asian countries</p>",
        "id": 200298950,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741536
    },
    {
        "content": "<p>They may <em>also</em> discriminate against <em>them</em>, but they would have more trouble pressing a legal case.</p>",
        "id": 200299157,
        "sender_full_name": "John Baez",
        "timestamp": 1591741681
    },
    {
        "content": "<p>When my thesis advisor went to grad school he couldn't get into Harvard because they didn't accept Jews.</p>",
        "id": 200299229,
        "sender_full_name": "John Baez",
        "timestamp": 1591741712
    },
    {
        "content": "<p>It's increadible to think that this was the norm just a few decades ago</p>",
        "id": 200299298,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741764
    },
    {
        "content": "<p>Even more increadible to think that in this respect the US was way better than many places in Europe</p>",
        "id": 200299320,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741784
    },
    {
        "content": "<p>So it's really like \"we are racist, but at least we don't deport people\", which is overall increadible when you think that all in all this was only 70 years ago or so.</p>",
        "id": 200299410,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591741826
    },
    {
        "content": "<p>Yup!</p>",
        "id": 200299478,
        "sender_full_name": "John Baez",
        "timestamp": 1591741886
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200298883\">said</a>:</p>\n<blockquote>\n<p>I think this case went to the Supreme Court.</p>\n</blockquote>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Students_for_Fair_Admissions_v._Harvard\">case against Harvard</a> is working its way through the courts, and will probably eventually get to the Supreme Court. I think almost everybody agrees that Harvard and similar institutions discriminate against Asian Americans in undergraduate admissions and everybody knows why they do this.</p>",
        "id": 200303292,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1591744625
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200285197\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Do you think it's a matter of undervaluing of students?</p>\n</blockquote>\n<p>I'm at a loss for the words to express how much of an understatement this is to me.</p>\n</blockquote>\n<p>I'm deeply sorry. This is a privilege I'm not in the habit of checking, and it shows.</p>",
        "id": 200392431,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591779744
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200296808\">said</a>:</p>\n<blockquote>\n<p>Don't forget that a rich old private institution like Harvard, Yale or Princeton is completely different than a state school like U.C. Riverside.  There's a lot more to say about this, but Joe is at U. C. Riverside.</p>\n</blockquote>\n<p>The conversation moved on to focus on Harvard, but I don't expect that to provide a representative ((applied) category theory) grad student experience, nor a good target for realising our aspirations about how a good version of that experience might be achieved in a wider capacity. Would you mind expanding on the \"lot more\" you have to say, <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>?<br>\n(on a side note I am amused to find out that the tutor for the Category Theory course at Harvard in 2018 was someone who shares my first name)</p>",
        "id": 200393332,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591780470
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200393332\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200296808\">said</a>:</p>\n<blockquote>\n<p>Don't forget that a rich old private institution like Harvard, Yale or Princeton is completely different than a state school like U.C. Riverside.  There's a lot more to say about this, but Joe is at U. C. Riverside.</p>\n</blockquote>\n<p>The conversation moved on to focus on Harvard, but I don't expect that to provide a representative ((applied) category theory) grad student experience, nor a good target for realising our aspirations about how a good version of that experience might be achieved in a wider capacity.</p>\n</blockquote>\n<p>Right.  I brought up those rich famous old schools because people may get their image of U.S. universities from those schools.  They're very unrepresentative.</p>\n<blockquote>\n<p>Would you mind expanding on the \"lot more\" you have to say, <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span>?</p>\n</blockquote>\n<p>Oh boy, I don't know where to start.  I said there was a lot to say, not that there was a lot I had to say.   I think you should ask <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span>, who is a student at U.C. Riverside.  He has a better knowledge of what it's like to be a student here.</p>",
        "id": 200456146,
        "sender_full_name": "John Baez",
        "timestamp": 1591813368
    },
    {
        "content": "<p>Alright, I shall ask <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span>. What are things like at U.C.Riverside? You've mentioned a few general points, but when you tell people about your PhD experience, what do you say? What has made a lasting impact on you, good or bad? And what can we, as a community who wants to support and include people at all levels, do to contribute positively to that experience, now or in the future?<br>\nThat's a lot of big questions, so no pressure to tackle all of them. I'll also leave this open to anyone who wants to contribute; I may move it to <a class=\"stream\" data-stream-id=\"241990\" href=\"/#narrow/stream/241990-general.3A-values\">#general: values</a> if it gets broader, but for now the experience of doing category theory as a student seems on topic for this stream.</p>",
        "id": 200461168,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591815677
    },
    {
        "content": "<p>I can chime in a little bit (okay, now that I've written it, maybe it's not so \"little\" of a bit after all.  <em>Mea culpa!</em>) with my grad student experience at UC Riverside, which concluded a few years ago.  My office was basically my home away from home, despite the A/C being set a bit too low for my comfort.</p>\n<p>While the culture seems fairly inclusive, my time there was not devoid of drama.  I tried to avoid the drama as much as possible, so I can't really say much aside from it seeming to be fairly infrequent.  The most involved I got was when I got called in as a potential witness to an incident that I was too socially oblivious to notice – I had to be told there was drama and that it had escalated.  There was only one other awkward incident I can recall.  That awkward incident took place during my first year, when I heard a rumor about some... impropriety that one of my cohort was supposedly involved in.  That classmate didn't care much for the location and left UC Riverside after one year.  The desert climate is not for everybody.</p>\n<p>One of the things I really appreciated was the system that had been set up for grad students who were nearly done to mentor first- and second-year grad students.  A lot of opportunities were disseminated through large meetings, but others were circulated more impactfully through the grad student network.  Horizontally through a cohort, and vertically through the mentorships.<br>\nThere is also a fairly strong rapport between the grad students and the postdoc professors (VAPs).  There are frequent venues for grad students, VAPs, and tenured/tenure-track professors to engage in both mathematical and social interaction, making it feel like a big family.  When it came time to pick an advisor, I did not have any want for professors I felt I could work well with.</p>\n<p>As I mentioned, my office was basically my home away from home – I spent many late nights working on stuff and studying, so I got to know some of the janitorial staff, too.  While I couldn't communicate much of the mathematics I was working on with them, I was able to practice communicating general outlines and talk about other kinds of life stuff.  Different skin and different primary languages, but still family.</p>\n<p>One of the values I saw on display at UC Riverside is a commitment to the local community.  I was able to participate in many outreach opportunities to students at secondary schools, for instance, and I was able to do a bit of mentoring of undergraduate students, which incidentally included Joe Moeller at the time.  I'm not sure how much impact I had, but it was gratifying to see him as a grad student shortly after that.<br>\nAs Joe noted, there are travel grants available for students to attend conferences, but you have to pay the expenses up front and get compensated up to the per-conference and per-year caps.  I was able to take advantage of this to go to Oxford to present at QPL, and the reimbursement process was fairly easy.  It's not an ideal travel funding situation for low-income grad students, but I don't know what an ideal travel funding solution would be.  If the funds were provided up-front, I don't think they would be as easy to obtain.</p>\n<p>Another financial consideration that I had was a bit more unusual.  Because I had started taking courses towards a Master's Degree elsewhere before taking some time off and restarting at UC Riverside, I had too many graduate level credits to qualify for some of the scholarships I investigated during my first year.  The financial aid package I got was enough to cover most of my expenses, but I still had to take student loans to finish up.  The financial aide package had a GPA requirement that gave some room for having a bad quarter, but not if the bad quarter was the first quarter.  That added some stress near the beginning, which went away over time as I built up a buffer on my GPA.</p>\n<p>A somewhat off-topic, but amusing (I think) anecdote is that I managed to get an F in one of my core classes as a grad student.  I re-took the class and got an A, but the professor that gave me the F is the one that ended up hooding me at my graduation.</p>\n<p>So I certainly struggled through some aspects of the Ph.D. program at UC Riverside.  Let's just say I'm thankful I had second chances on each of my written quals.  I was able to see the written qual system get streamlined a bit while I was still there (but after I had finished all of them - oh well).  While there is some prep support for the written quals, it did not seem like there was much support afterwards when failing some of them.  I tried to fill that gap where I could once I passed all my written quals, as an example that it's possible to have a rocky start but still make it through successfully, given a bit of tenacity.</p>\n<p>It would be interesting to see if there are significant differences in the experiences of current or recent female graduate students at UC Riverside.  I hold my brothers and sisters in equal regard, but there may be some institutional biases that are not obvious from looking at the experiences of just one person.</p>",
        "id": 200502658,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1591845942
    },
    {
        "content": "<p>Thanks for sharing that, <span class=\"user-mention\" data-user-id=\"309257\">@Jason Erbele</span>. It sounds like there are a lot more hoops that you have to jump through as a grad student in the US than I'm being subjected to in Italy, which is very interesting. The expense reimbursement system sounds similar, though.<br>\nI wonder if a possible solution would be for the school to book travel and/or accommodation on the behalf of students who need that. While setting up that system would involve a significant network-building effort on the part of university staff internationally (and that effort could take years), I don't think that it's unfeasible, since the likely result will be a net gain for universities and a better relationship with students. It's one of those things where the only real obstacle is the inertia of entrenched bureaucracy. Or maybe I'm being too idealistic?</p>",
        "id": 200526564,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591871064
    },
    {
        "content": "<p>Oxford offered a similar service for travel booking. They could book flights and accomodation for you</p>",
        "id": 200527690,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1591871924
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276424\">Rongmin Lu</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200308954\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200252929\">said</a>:</p>\n<blockquote>\n<p>I think the essentials for a nice phd experience are:</p>\n<ul>\n<li>Nice supervisors. [...]</li>\n<li>Nice environment. [...]</li>\n<li>Conferences to publish into. [...]</li>\n</ul>\n</blockquote>\n<p>It's a nice list. The question for most people thinking of doing a PhD, though, is how to ascertain that the environment they're entering can fulfil those criteria. There may not necessarily be an opportunity to choose, but if there's a choice, what clues should they look for that'd indicate that the essentials you've listed are there?</p>\n</blockquote>\n<p>I'd say a good place to start for any person wanting to do a PhD at a certain institution/department, is to ask some PhD students that are currently working there how they feel about PhD life there. Although there might be some self-selection in that if you were to ask current PhD students, then you are not asking people who quit being PhD students due to the environment being hostile or the supervisor being incompetent.</p>",
        "id": 200531534,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1591874878
    },
    {
        "content": "<p>I was thinking more of sending PhD students at the department an email instead of actually visiting the department. I assume that most departments will have a list of their PhD students listed on the website, most likely with an email address so this should be an option for everyone regarding geographical location</p>",
        "id": 200561135,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1591889723
    },
    {
        "content": "<p>That being said, I actually didn't do this before starting my own PhD, since I never thought of it back then, and luckily the department I ended up at was wonderful</p>",
        "id": 200561359,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1591889806
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200461168\">said</a>:</p>\n<blockquote>\n<p>Alright, I shall ask <span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span>. What are things like at U.C.Riverside? You've mentioned a few general points, but when you tell people about your PhD experience, what do you say? What has made a lasting impact on you, good or bad? And what can we, as a community who wants to support and include people at all levels, do to contribute positively to that experience, now or in the future?<br>\nThat's a lot of big questions, so no pressure to tackle all of them. I'll also leave this open to anyone who wants to contribute; I may move it to <a class=\"stream\" data-stream-id=\"241990\" href=\"/#narrow/stream/241990-general.3A-values\">#general: values</a> if it gets broader, but for now the experience of doing category theory as a student seems on topic for this stream.</p>\n</blockquote>\n<p>I don't really know how to answer the question, especially after Jason gave such a thorough answer for certain aspects.</p>",
        "id": 200561409,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591889826
    },
    {
        "content": "<p>I think it should/could be part of the education of Master students: \"How to spot good places for you to do a PhD\"</p>",
        "id": 200561436,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1591889839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200561436\">said</a>:</p>\n<blockquote>\n<p>I think it should/could be part of the education of Master students: \"How to spot good places for you to do a PhD\"</p>\n</blockquote>\n<p>and for Bachelor's as well, in the case of the US at least</p>",
        "id": 200561588,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1591889900
    },
    {
        "content": "<p>At the math department at U.C. Riverside, and I believe many other graduate programs at US universities, people who get accepted to the graduate program are invited to a \"preview day\" where they can visit the department.</p>",
        "id": 200562923,
        "sender_full_name": "John Baez",
        "timestamp": 1591890456
    },
    {
        "content": "<p>We pay for people to fly over here and visit.</p>",
        "id": 200562946,
        "sender_full_name": "John Baez",
        "timestamp": 1591890470
    },
    {
        "content": "<p>This is the chance for you to talk to grad students in our department and find out what's good about it and what's bad about it.  Also, to find out who are the good thesis advisors and who are the bad ones.</p>",
        "id": 200563148,
        "sender_full_name": "John Baez",
        "timestamp": 1591890545
    },
    {
        "content": "<p>It's important to go out to dinner with the grad students and ask them questions after they've had a few beers - they're more likely to give honest answers then.</p>",
        "id": 200563229,
        "sender_full_name": "John Baez",
        "timestamp": 1591890584
    },
    {
        "content": "<p>The professors are less likely to admit any defects of the department, because we're trying to get people to come here.</p>",
        "id": 200563368,
        "sender_full_name": "John Baez",
        "timestamp": 1591890631
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"296293\">John van de Wetering</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200561135\">said</a>:</p>\n<blockquote>\n<p>I was thinking more of sending PhD students at the department an email instead of actually visiting the department. </p>\n</blockquote>\n<p>I would be very open to receiving this kind of enquiry, but when I tried something similar myself I was in contact with someone too shy to give me much insight.<br>\nI should also point out that the entry to graduate education in the UK and Europe is somewhat different to how it is in America. As I saw it, in order to even consider a graduate education in category theory, I had to first find a particular person or a particular research group to work in: there are few enough PhD places going around that if your subject isn't the target of a particular funding initiative, universities are typically restricted to giving out at most one scholarship per supervisor, and so you had better be the top choice of someone in order to have them advocating for you...<br>\nIf I had found myself in an established research group, I might have had some leeway about who precisely would end up supervising my thesis, but as things stand I work in a small department where the only person doing topos theory is my advisor, and where the remainder of the (small) cohort do numerical analysis or more applied areas. I got lucky; my relationship with my advisor has been a generally good one, but the relevant point is that there were no students preceding me who could have given me useful information to help me determine whether it would be a good fit for me.</p>",
        "id": 200659673,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591962066
    },
    {
        "content": "<p>That's another way Zulip could be useful. People won't be so foolhardy as to publicly air their experiences here, but it gives us contact with the people that might privately be able to give insight into their experiences with a particular person or at a particular institution.</p>",
        "id": 200659831,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1591962242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200659673\">said</a>:</p>\n<blockquote>\n<p>I should also point out that the entry to graduate education in the UK and Europe is somewhat different to how it is in America. As I saw it, in order to even consider a graduate education in category theory, I had to first find a particular person or a particular research group to work in: there are few enough PhD places going around that if your subject isn't the target of a particular funding initiative, universities are typically restricted to giving out at most one scholarship per supervisor, and so you had better be the top choice of someone in order to have them advocating for you...</p>\n</blockquote>\n<p>Are you talking about the US here, or UK/Europe?</p>\n<p>One thing about the US is that there are almost no professors taking grad students who call themselves category theorists.   There are more people who call themselves homotopy theorists, or homotopy type theorists.</p>",
        "id": 200719989,
        "sender_full_name": "John Baez",
        "timestamp": 1591993212
    },
    {
        "content": "<p>I was talking about my experiences in the UK/Europe. I should also note that at the time I was applying, I was averse to reaching out to people in computer science departments, since I thought (and I suppose still think) of myself as a pure mathematician, and couldn't imagine myself fitting into computer science. That left me with a very limited number of people in the UK whom I could ask, which is how I ended up looking further afield to Europe.</p>",
        "id": 200769917,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1592059807
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Did you mean to say there are more professors taking grad students in the U.S. who call themselves homotopy type theorists than there are who call themselves category theorists?  That seems a little dubious to me.</p>",
        "id": 200783821,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1592079604
    },
    {
        "content": "<p>I think the inequality is meant to be of the form <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>A</mi><mo>≤</mo><mi>B</mi><mo>+</mo><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">A \\le B + C</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8193em;vertical-align:-0.13597em;\"></span><span class=\"mord mathdefault\">A</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">≤</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.76666em;vertical-align:-0.08333em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.05017em;\">B</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222222222222222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathdefault\" style=\"margin-right:0.07153em;\">C</span></span></span></span>.</p>",
        "id": 200786331,
        "sender_full_name": "Reid Barton",
        "timestamp": 1592083530
    },
    {
        "content": "<p>Which US professors call themselves category theorists these days?  I do sometimes, just because I feel someone should.   Do you or Emily Riehl do it?  I know Julie Bergner stoutly disavows it, calling herself a homotopy theorist.   If there are more self-proclaimed category theorists out there - professors in the US, that is - I'd like to know about it.</p>",
        "id": 200787712,
        "sender_full_name": "John Baez",
        "timestamp": 1592085782
    },
    {
        "content": "<p>Of course there's Lawvere, but I don't think he's taking students anymore.</p>",
        "id": 200787779,
        "sender_full_name": "John Baez",
        "timestamp": 1592085846
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200294524\">said</a>:</p>\n<blockquote>\n<p>In any case, I think that financial hardship is probably one of the biggest - if not the biggest - burdens for students (and people) overall</p>\n</blockquote>\n<p>I think this isn't discussed nearly enough. I've been a PhD student in North America, as well as an MSc student for an extended period of time. I am currently a PhD student in Estonia. The difference is like night and day. It's difficult to put into words the effect that financial insecurity has on your entire life. My experience in North America (For reference, Calgary and Ottawa) was exploitative and miserable, and I left it with substantial student debt. In Estonia, I have been able to <em>save money</em> -- imagine!</p>",
        "id": 202402718,
        "sender_full_name": "Chad Nester",
        "timestamp": 1593501886
    },
    {
        "content": "<p>So I've been telling people who ask me about this to <em>run</em>, not walk, away from the North American system, even if they can't find a program right away. Further, if I'm able to continue in academia, I don't think I would want a position at a university there, because I don't see how I could in good conscience accept PhD students without substantial external funding (i.e., most of them).</p>",
        "id": 202402842,
        "sender_full_name": "Chad Nester",
        "timestamp": 1593502021
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202402718\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200294524\">said</a>:</p>\n<blockquote>\n<p>In any case, I think that financial hardship is probably one of the biggest - if not the biggest - burdens for students (and people) overall</p>\n</blockquote>\n<p>I think this isn't discussed nearly enough. I've been a PhD student in North America, as well as an MSc student for an extended period of time. I am currently a PhD student in Estonia. The difference is like night and day. It's difficult to put into words the effect that financial insecurity has on your entire life. My experience in North America (For reference, Calgary and Ottawa) was exploitative and miserable, and I left it with substantial student debt. In Estonia, I have been able to <em>save money</em> -- imagine!</p>\n</blockquote>\n<p>That's the reason why I decided not to study in Canada.  Years of austerity made being a PhD student unappealing.</p>",
        "id": 202408870,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1593506711
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202402842\">said</a>:</p>\n<blockquote>\n<p>So I've been telling people who ask me about this to <em>run</em>, not walk, away from the North American system, even if they can't find a program right away.</p>\n</blockquote>\n<p>This is good to know. I'm always hesitant to suggest to everyone in the USA to escape to Europe (and it never occurred to me that Canada would be equally bad), because <em>obviously</em> crazy Europeans would say that. And it's enough culture shock just moving part way across Europe, <em>and</em> there's extra headaches for people coming from outside the EU</p>",
        "id": 202410839,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1593508037
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202402842\">said</a>:</p>\n<blockquote>\n<p>So I've been telling people who ask me about this to <em>run</em>, not walk, away from the North American system, even if they can't find a program right away. Further, if I'm able to continue in academia, I don't think I would want a position at a university there, because I don't see how I could in good conscience accept PhD students without substantial external funding (i.e., most of them).</p>\n</blockquote>\n<p>What do y'all think the cumulative effect of that difference has been or will be?</p>",
        "id": 202419323,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593514092
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202419323\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202402842\">said</a>:</p>\n<blockquote>\n<p>So I've been telling people who ask me about this to <em>run</em>, not walk, away from the North American system, even if they can't find a program right away. Further, if I'm able to continue in academia, I don't think I would want a position at a university there, because I don't see how I could in good conscience accept PhD students without substantial external funding (i.e., most of them).</p>\n</blockquote>\n<p>What do y'all think the cumulative effect of that difference has been or will be?</p>\n</blockquote>\n<p>On the people or on the system?</p>",
        "id": 202419590,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593514327
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202419590\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"297945\">Bob Haugen</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202419323\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276114\">Chad Nester</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202402842\">said</a>:</p>\n<blockquote>\n<p>So I've been telling people who ask me about this to <em>run</em>, not walk, away from the North American system, even if they can't find a program right away. Further, if I'm able to continue in academia, I don't think I would want a position at a university there, because I don't see how I could in good conscience accept PhD students without substantial external funding (i.e., most of them).</p>\n</blockquote>\n<p>What do y'all think the cumulative effect of that difference has been or will be?</p>\n</blockquote>\n<p>On the people or on the system?</p>\n</blockquote>\n<div class=\"codehilite\"><pre><span></span><code>The relative fitness of the different national social-cultural-economic systems.\n</code></pre></div>",
        "id": 202422912,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593516850
    },
    {
        "content": "<p>Well, for us in Europe the idea of \"student debt\" it's just unconceivable</p>",
        "id": 202429719,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593521390
    },
    {
        "content": "<p>Education here is generally considered an inalienable right, not an investment.</p>",
        "id": 202429801,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593521414
    },
    {
        "content": "<p>And I think most of my EU colleagues would share my view that student debt is just ethically appalling (I'm sure many of the non-EU people on here would agree too, actually)</p>",
        "id": 202429921,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593521497
    },
    {
        "content": "<p>I mean in IT people protest a lot because university is not totally free unless your income is really low. Many people believe it should be free for everyone. Still, I don't think this gives EU a real advantage in terms of getting the best students:<br>\nFirst, even if you come here to study you need to cover your living expenses most often than not (uni may be free but rent is not)<br>\nSecond, and most importantly, one realizes how bad a situation is only when exposed to comparison. As for healthcare, I think many north American people are simply not aware of what \"real welfare\" is. I myself was very critical, say, of IT healthcare until I went living abroad. Then I realized that a lot of things I gave for granted are actually the exception and not the rule. E.g. in IT if you get ill all care is free. Living abroad I found out this is not the case in many countries (e.g. you have to pay for surgery, hospitalization, etc). And this shocked me quite a bit. As of now, I'd never eschange my IT healthcare with something else.</p>",
        "id": 202430441,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1593521770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202430441\">said</a>:</p>\n<blockquote>\n<p>... one realizes how bad a situation is only when exposed to comparison. </p>\n</blockquote>\n<p>My youngest son lived in London for awhile last year and had a health problem and was amazed at how much better the care was, and it was free, compared to Chicago in the US where he lives.</p>",
        "id": 202431869,
        "sender_full_name": "Bob Haugen",
        "timestamp": 1593522537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275901\">Jules Hedges</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202410839\">said</a>:</p>\n<blockquote>\n<p>I'm always hesitant to suggest to everyone in the USA to escape to Europe (and it never occurred to me that Canada would be equally bad), because <em>obviously</em> crazy Europeans would say that. </p>\n</blockquote>\n<p>I'm not hesitant.  I keep telling all my grad students to look for jobs in Europe - in part just to get away from the madness that is the USA in this particular stretch of history, and in part to experience a dfferent and in many ways better civilization.</p>",
        "id": 202478250,
        "sender_full_name": "John Baez",
        "timestamp": 1593542704
    },
    {
        "content": "<p>Unfortunately they tend to be too tightly bound to their friends, lovers and relatives in the US to want to leave.</p>",
        "id": 202478339,
        "sender_full_name": "John Baez",
        "timestamp": 1593542757
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/202478339\">said</a>:</p>\n<blockquote>\n<p>Unfortunately they tend to be too tightly bound to their friends, lovers and relatives in the US to want to leave.</p>\n</blockquote>\n<p>I wonder if post-covid, it won't be possible to live the peripatetic academic lifestyle.  Even though you have to leave your friends and family, the nice thing about acedemia is that, even as a grad student you can get paid to travel the world.</p>",
        "id": 202479010,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1593543097
    },
    {
        "content": "<p><em>During</em> COVID the peripatetic lifestyle is out.   <em>Post</em>-COVID we may have a world-wide recession, which will make it harder for many people to get jobs, and harder to get money too.... but I don't think we're seeing the end of the era of frequent air travel, even though that would be very good for the planet and I hope it happens eventually.</p>",
        "id": 202492772,
        "sender_full_name": "John Baez",
        "timestamp": 1593550105
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/200787712\">said</a>:</p>\n<blockquote>\n<p>Which US professors call themselves category theorists these days?  I do sometimes, just because I feel someone should.   Do you or Emily Riehl do it?  I know Julie Bergner stoutly disavows it, calling herself a homotopy theorist.   If there are more self-proclaimed category theorists out there - professors in the US, that is - I'd like to know about it.</p>\n</blockquote>\n<p>I certainly call myself a category theorist (in addition to a homotopy type theorist), although I can't take PhD students since we don't have a PhD program.  I don't know about <span class=\"user-mention\" data-user-id=\"277432\">@Emily Riehl</span>, but her <a href=\"http://www.math.jhu.edu/~eriehl/\">web site</a> says she is \"working on a variety of topics in category theory related to homotopy theory\" with emphasis on the category theory.  It's true that especially in the US, there are a lot more people who <em>ought</em> to call themselves category theorists (in addition to something else like homotopy theory or algebraic geometry) than there are who probably <em>would</em>.  But I have equal or more difficulty thinking of US professors taking graduate students who call themselves homotopy type theorists.</p>",
        "id": 202589693,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1593620291
    },
    {
        "content": "<p>At the risk of displaying lots of naivete and ignorance, is it really common, even in the US, to accumulate <em>debt</em> from a PhD program in mathematics?  I know that <em>undergraduates</em> generally accumulate ridiculous amounts of debt, and that graduate students aren't exactly well-paid, but my impression was that PhD students in mathematics usually receive teaching or TA jobs that pay approximately enough to live on as well as remit their nominal \"tuition\".  That was certainly my own experience 10-20 years ago, and I don't recall it seeming at all unusual at the time.  Or are we talking about fields other than mathematics?</p>",
        "id": 202590226,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1593620598
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> and <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> I consider myself to be a higher category theorist primarily, and an aspiring homotopy type theorist. At present I spend considerably more time thinking about higher category theory than homotopy type theory, but I expect that balance to shift some much, especially now that so many of my students (<span class=\"user-mention\" data-user-id=\"315499\">@tslil</span>, David Jaz Myers, Anthony Agwu) are interested in homotopy type theory. I agree with <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>'s implicit point that it would be better if there were more experts in homotopy type theory in the US who were in a position to take PhD students. But since there aren't enough, I'm trying to do my best to advise students in that direction as a novice. (Frankly, my students don't seem to need a ton of guidance, so this works out.)</p>",
        "id": 202595662,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1593623112
    },
    {
        "content": "<p>Nick Gurski is also indisputably a category theorist, now at Case Western.</p>",
        "id": 202602350,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1593626506
    },
    {
        "content": "<p>On the subject of PhD stipends, my understanding is that they correlate pretty strongly with the wealth of the institution. At the rich private schools-- such as the University of Chicago, where <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>, Nick Gurski, and I all studied, or at Johns Hopkins--the expectation is that they will provide a living wage with reasonable working conditions (at least for mathematicians; the situation isn't always so rosy in the humanities). Unlike in Europe, PhD students are required to do a fair amount of teaching to \"earn\" their stipends, but since the graduate student positions are funded in part by the ludicrous tuition paid by our undergraduates, there tend to be more PhD places, and these aren't tied to a specific grant held by the thesis advisor (again in mathematics; it's different in CS or in the sciences). </p>\n<p>I'm less familiar with the working conditions at less-wealthy institutions but my impression is that it can be challenging to finance a PhD. If some of you felt comfortable sharing more about your experiences, I'd be grateful to learn more about this. And even at the wealthier schools, a PhD stipend doesn't go very far if, say, you have family members you are trying to support.</p>",
        "id": 202604682,
        "sender_full_name": "Emily Riehl",
        "timestamp": 1593627544
    },
    {
        "content": "<p>If you read this, <span class=\"user-mention\" data-user-id=\"277432\">@Emily Riehl</span> - who are the \"category theorists\" in the US who can take grad students?  Sometimes I think it's just you and me and Nick Gurski and maybe <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>?    I guess I could also count Steve Awodey, but does he consider himself a category theorist these days or a homotopy type theorist?  (Maybe more importantly: could a student of his learn a lot of category theory and \"become a category theorist\"?)   I am probably forgetting other people.   I want to know because kids ask me about these things.</p>\n<p>(I'm not sure how Mike is taking students since I don't think the University of San Diego has a grad program, but I think he recently came out with a paper with a student.)</p>",
        "id": 202605373,
        "sender_full_name": "John Baez",
        "timestamp": 1593627860
    },
    {
        "content": "<p>I'm not sure what Steve would call himself these days, or whether he's still open to taking students working on category theory without any type theory.</p>",
        "id": 202609506,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1593629940
    },
    {
        "content": "<p>I can't advise PhD students myself, because as you say we don't have a graduate program in mathematics.  I am happy to work with graduate students at other universities to help them \"become category theorists\" (or homotopy type theorists), and occasionally I can even suggest thesis topic ideas.  But they do need an actual advisor at another institution who can meet with them regularly and understand something of what they're doing.</p>",
        "id": 202609839,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1593630086
    },
    {
        "content": "<p>I would like to chime in here to ask some questions.  This thread here contains a lot of information I'm very interested in, because right now I'm trying to figure out some plan(s) for my PhD!</p>\n<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> , I'd been thinking about applying to US universities for grad school because it seemed like there's a lot of people in the US doing cool stuff in ACT and Category Theory more generally (and also because, given that my background is Physics, not Math, focusing on taking a lot of math classes during the first year or two sounds nice to my ears). However, based on the questions you are asking I think perhaps I misjudged the situation in that respect: there might be a bigger community of people around Category Theory but the actual opportunities for doing a PhD in Category Theory in the US wouldn't be so many. Is that so?</p>",
        "id": 203530775,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594399637
    },
    {
        "content": "<p>(Of course, there are many other extremely relevant criteria by which to judge the prospect of moving to the US for a PhD, especially given the current times, some of which have also been mentioned in the thread. Thanks everyone for sharing!)</p>",
        "id": 203530949,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594399726
    },
    {
        "content": "<p>Gabriel Coren wrote:</p>\n<blockquote>\n<p>[...] there might be a bigger community of people around Category Theory but the actual opportunities for doing a PhD in Category Theory in the US wouldn't be so many. Is that so?</p>\n</blockquote>\n<p>You may know better than me!    Who are the professors in the US that you'd be interested in working with?    (I'm not taking new students, so don't say me.)   </p>\n<p>By the way, I don't think a \"PhD in category theory\" is a wise idea if you're trying to maximize your chance of getting good jobs either in academia or industry.   It would probably be better to get a PhD in something else - but something that uses a lot of category theory.  Then you can label yourself as an expert in that \"something else\".</p>\n<p>If you're interested in applied category theory this should not be very hard to do.</p>",
        "id": 203558123,
        "sender_full_name": "John Baez",
        "timestamp": 1594415400
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203558123\">said</a>:</p>\n<blockquote>\n<p>You may know better than me!    Who are the professors in the US that you'd be interested in working with?    (I'm not taking new students, so don't say me.)   </p>\n</blockquote>\n<p>I don't really have that much information yet, honestly, so I don't think I know better than you do on this matter <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> About people in the US, I mostly knew about you, about Emily and about all the ACT people at MIT, but I guess I didn't really check if they could take grad students or not. I don't really know how that works in the US. Also perhaps you meant something different from what I understood originally, as I suspect \"people who do ACT\" might not be a subset of \"category theorists\" under your definition.</p>\n<p>I don't have a clear idea of what I want to do (but who does?) I've only recently come to the conclusion that category theory and related topics are what I'm most consistently interested in. Also, a bit distressingly after 6 years of studying Physics, I don't think I care that much about Physics. I will definitely consider your advice, though, on doing a PhD in \"something else\" while getting to learn a lot of category theory. I guess I should think about how to make the most of my Physics background, even though I'm not currently very happy with it.</p>",
        "id": 203663122,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594591127
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278867\">Gabriel Goren</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203663122\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203558123\">said</a>:</p>\n<blockquote>\n<p>You may know better than me!    Who are the professors in the US that you'd be interested in working with?    </p>\n</blockquote>\n<p>I don't really have that much information yet, honestly, so I don't think I know better than you do on this matter <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> About people in the US, I mostly knew about you, about Emily and about all the ACT people at MIT, but I guess I didn't really check if they could take grad students or not. </p>\n</blockquote>",
        "id": 203667321,
        "sender_full_name": "John Baez",
        "timestamp": 1594598411
    },
    {
        "content": "<p>Yes, there's Emily Riehl, there's me, and there's \"all the ACT people at MIT\", which is a somewhat grandiose way of saying David Spivak and his postdocs.   Spivak is not allowed by MIT to take grad students, and he's planning to leave MIT soon and set up the Topos Institute.   I'm not taking new grad students.    Riehl mainly on infinity-categories, but she's letting her student David Jaz-Myers do applied category theory.  </p>\n<p>Tae-Danae Bradley just got her PhD from the CUNY grad school working with John Terrilla on probability, natural language processing and some category theory - check out <a href=\"https://arxiv.org/abs/2004.05631\">her thesis</a>.</p>\n<p>I think <span class=\"user-mention\" data-user-id=\"285161\">@Oliver Shetler</span> is a grad student at the CUNY grad school too - ask him what his plans are.</p>\n<p><a href=\"https://www.math.upenn.edu/~ghrist/\">Bob Ghrist</a> at Penn State is doing fun things with topological data analysis and sheaves.</p>\n<blockquote>\n<p>I don't have a clear idea of what I want to do (but who does?) </p>\n</blockquote>\n<p>I do.   <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 203667341,
        "sender_full_name": "John Baez",
        "timestamp": 1594598464
    },
    {
        "content": "<blockquote>\n<p>I've only recently come to the conclusion that category theory and related topics are what I'm most consistently interested in. Also, a bit distressingly after 6 years of studying Physics, I don't think I care that much about Physics. </p>\n</blockquote>\n<p>Ouch!  By the way, there's a lot of work going on at the interface of condensed matter physics and category theory, especially modular tensor categories and related structures.  These people don't consider themselves \"applied category theorists\", but they are applying category theory.</p>",
        "id": 203667412,
        "sender_full_name": "John Baez",
        "timestamp": 1594598614
    },
    {
        "content": "<p>Bob Ghrist is at University of Pennsylvania not Penn State <span aria-label=\"yum\" class=\"emoji emoji-1f60b\" role=\"img\" title=\"yum\">:yum:</span> there is also a lot of people in control and general systems theory that are using categorical concepts (including me). So it’s not just math and physics you should be looking for. If you have a good mathematical background AND know physics you are practically the ideal engineering student in some areas. It has the additional benefit of engineering paying better during grad school and it has potentially more options after the fact.</p>",
        "id": 203708554,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594643414
    },
    {
        "content": "<p>But honestly if you are not American I am not sure I would recommend a move to the states now, it's not the most welcoming environment to foreigners and I don't mean people (even though depending where you are...) but more systemic issues you will experience. I can't say it wasn't worth it for me, but I am burned out by this situation personally and I don't think this will change soon unfortunately.</p>",
        "id": 203708793,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594643574
    },
    {
        "content": "<p>Also my general opinion to choosing a phd is the problem you want to work on, the tools will come with the problem. Of course you can chose a problem suited for category theory but starting with the desire to work on category theory and no plan does not seem like a good idea to me.</p>",
        "id": 203709257,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594643898
    },
    {
        "content": "<p>An additional consideration is that phds in the us take much longer than say Europe. So you have to invest double the time in school.</p>",
        "id": 203709338,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594643964
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>: Thank you for the pointers! And about the condensed matter physics stuff, yes, I saw the thread where you were talking about that, I might talk to people around and see if that can rekindle my interest for physics... But I think perhaps I just need some time away from it <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 204034525,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594862840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275902\">@Giorgos Bakirtzis</span> Thank you for your comments! I'm only recently becoming aware that there is interest in Category Theory from the engineering side.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203708554\">said</a>:</p>\n<blockquote>\n<p>there is also a lot of people in control and general systems theory that are using categorical concepts (including me). So it’s not just math and physics you should be looking for</p>\n</blockquote>\n<p>What would \"General Systems Theory\" be in the context of current engineering? I only knew of that term in a more \"philosophical\" sense or in old-school cybernetics stuff such as von Bertalanffy's.</p>",
        "id": 204034867,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594863214
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203708793\">said</a>:</p>\n<blockquote>\n<p>But honestly if you are not American I am not sure I would recommend a move to the states now, it's not the most welcoming environment to foreigners and I don't mean people (even though depending where you are...) but more systemic issues you will experience. I can't say it wasn't worth it for me, but I am burned out by this situation personally and I don't think this will change soon unfortunately.</p>\n</blockquote>\n<p>Yes, I have some non-American friends studying in the US right now and I know the situation isn't particularly fun. This is something I will keep in mind for sure.</p>",
        "id": 204034946,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594863291
    },
    {
        "content": "<p>Adaptive Complex Systems and even Rasmussen and Leveson use general systems theory at least as a guide for new work. It's also often referenced in more theoretical control and has led to a development of some interesting theoretical tools for engineers like contracts. This is probably the trajectory I am thinking, which is not particularly categorical by itself. I believe it can and should be and so do some other people in my cohort but perhaps a little more quietly and cautiously. In any event in private there is a lot of interest.</p>",
        "id": 204035058,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594863384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203709257\">said</a>:</p>\n<blockquote>\n<p>Also my general opinion to choosing a phd is the problem you want to work on, the tools will come with the problem. Of course you can chose a problem suited for category theory but starting with the desire to work on category theory and no plan does not seem like a good idea to me.</p>\n</blockquote>\n<p>I think I don't actually understand this point. It's not the first time I've heard something similar, but... Do I really need to have a concrete problem that <em>I</em> want to solve during a PhD? Isn't it the supervisor's job to provide that?</p>",
        "id": 204035287,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594863660
    },
    {
        "content": "<p>What I do have is a desire to learn lots of stuff plus some questions/problems that I would like to tackle, but I feel like they are too broad, vague or \"big-picture\" for me to actually pretend to base a PhD project around them... Also, they might be too personal; I wouldn't expect them to be be very \"fashionable\"</p>",
        "id": 204035378,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594863736
    },
    {
        "content": "<p>I don't know about elsewhere and I don't particularly know about a math PhD but don't expect any professor to give you a problem to solve not in the least for a PhD caliber, you'll have to work on that by yourself and that's partially what makes a PhD: starting from a vague big picture point and narrowing down. The job of the advisor is often to keep reminding the student to keep narrowing and narrowing. Of course this largely depends on your advisor as well. But generally, having seen many of my peers and friends drop out as anecdotal evidence it was always the ones with no problem but a tool, e.g., I want to use neural nets or deep learning or control etc.</p>",
        "id": 204035623,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1594864012
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/204035058\">said</a>:</p>\n<blockquote>\n<p>Adaptive Complex Systems and even Rasmussen and Leveson use general systems theory at least as a guide for new work. It's also often referenced in more theoretical control and has led to a development of some interesting theoretical tools for engineers like contracts. This is probably the trajectory I am thinking, which is not particularly categorical by itself. I believe it can and should be and so do some other people in my cohort but perhaps a little more quietly and cautiously. In any event in private there is a lot of interest.</p>\n</blockquote>\n<p>I guess you're saying that there is a resurgence of the original \"General Systems Theory\" project in engineering? That sounds exciting! I don't know who Rasmussen and Leveson are, but I might check it out. Also \"Adaptive Complex Systems\" is just another umbrella term as far as I understand, I don't know if you meant something more specific or not.</p>",
        "id": 204035747,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594864175
    },
    {
        "content": "<blockquote>\n<p>But generally, having seen many of my peers and friends drop out as anecdotal evidence it was always the ones with no problem but a tool, e.g., I want to use neural nets or deep learning or control etc.</p>\n</blockquote>\n<p>Having a solution in search of a problem, rather than a question in search of an answer is often a bad idea in research</p>",
        "id": 204037018,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594865475
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278867\">Gabriel Goren</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/204035287\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275902\">Giorgos Bakirtzis</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/203709257\">said</a>:</p>\n<blockquote>\n<p>Also my general opinion to choosing a phd is the problem you want to work on, the tools will come with the problem. Of course you can chose a problem suited for category theory but starting with the desire to work on category theory and no plan does not seem like a good idea to me.</p>\n</blockquote>\n<p>I think I don't actually understand this point. It's not the first time I've heard something similar, but... Do I really need to have a concrete problem that <em>I</em> want to solve during a PhD? Isn't it the supervisor's job to provide that?</p>\n</blockquote>\n<p>Yes it is, and you should take advantage of that!  But maybe Giorgios was saying that the problem - whoever chooses it - should determine the tools, not the other way around.   </p>\n<p>This is probably more true in his field than mine.  In math we often start by getting good at some tools and then figure out problems they can solve.  Not always, though!</p>",
        "id": 204040901,
        "sender_full_name": "John Baez",
        "timestamp": 1594870023
    },
    {
        "content": "<p>Giorgos wrote:</p>\n<blockquote>\n<p>I don't know about elsewhere and I don't particularly know about a math PhD but don't expect any professor to give you a problem to solve not in the least for a PhD caliber...</p>\n</blockquote>\n<p>In math, if your thesis advisor doesn't give you a bunch of problems to work on and give you a lot of help solving them, you should quickly get another professor.  This is what thesis advisors are for! </p>\n<p>It takes a lot of practice finding <em>important</em> yet <em>doable</em> problems in mathematics, and few grad students are able to do that.  Of course some do.  But I always give each of my students an array of problems to work on, most of which I know how to do myself, at least roughly.  They often turn out to be harder than I expected, but then it's my job to work with student to overcome these obstacles.</p>",
        "id": 204046807,
        "sender_full_name": "John Baez",
        "timestamp": 1594877481
    },
    {
        "content": "<p>Ok, yes that makes sense: problems should determine the tools. But perhaps that doesn't mean you have to love your problems more than your tools. Nor that you should know what problems you want to learn how to solve, more than what tools you want to learn how to use</p>",
        "id": 204112261,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594918852
    },
    {
        "content": "<p>Also, what is \"just a tool\" to someone can be a vast source of problems for someone else. That's the kind of distinction that one would typically associate with differences between, say, mathematics and engineering. And the kind of thing that makes Applied Category Theory such a \"weird\" topic, I guess</p>",
        "id": 204112764,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1594919079
    },
    {
        "content": "<p>I think Giorgos was saying that your advisor doesn't give you problems that are already formulated and posed like a homework question. They should set a scope of inquiry and provide guidance and feedback to help you develop into a strong and independent researcher who is capable of looking at a topic and identifying important and doable problems.</p>",
        "id": 204122272,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594923610
    },
    {
        "content": "<p>The story of what you need to bring to the table before starting a PhD is certainly different if you venture in a purer direction. For anyone treating toposes (my own area of study) as a tool, the overhead cost of understanding them is so prohibitively high, even after decades of research and a bunch of textbooks on them, that they're unlikely to get very far if they start off with intentions that are too specific-problem-focused. In some sense the study of topos-theory could be described in <span class=\"user-mention\" data-user-id=\"275927\">@James Fairbanks</span>' terms as a study of \"a solution with <em>some</em> problems, in search of more problems to solve\", since we already know that there are things that toposes are useful for... but the scope of topos theory is so vast that there are plenty of open questions on the seam between interesting and accessible. That includes questions that will certainly open the door to applications sooner or later, even if they aren't applied in themselves.</p>",
        "id": 204122341,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594923650
    },
    {
        "content": "<p>As far as</p>\n<blockquote>\n<p>that doesn't mean you have to love your problems more than your tools.</p>\n</blockquote>\n<p>I don't think you have to love the problems or tools. To be a successful researcher, you have to love learning.</p>",
        "id": 204122356,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594923654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> I definitely am thinking more about the research spectrum of including applied math through engineering. In my understanding, a major goal of the ACT community is to do the pedagogical and research work  to bring abstract math from CT and get it close enough to practical problems that we can change how engineers think about using math in their work. This is one of the reason I think CT4S and 7Sketches are such great contributions, they make it possible for people to see the value of the CT approach without needing to learn a bunch of graduate level math.</p>",
        "id": 204122954,
        "sender_full_name": "James Fairbanks",
        "timestamp": 1594923960
    },
    {
        "content": "<p>Of course! That pedagogical flow extends all the way along the spectrum into pure maths, though: while I'm working on topos theory, my own goals are to advance it to a point where it is more accessible to mathematicians who don't yet consider it relevant to them. Most of them are pure mathematicians for the time being, but even if topos theory only produces theorems that justify intuition that inspires applications in three decades time, I will still have played my own part in that process.</p>",
        "id": 204124488,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1594924639
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275927\">James Fairbanks</span> <a href=\"#narrow/stream/229156-practice.3A-applied.20ct/topic/PhD.20experience/near/204122356\">said</a>:</p>\n<blockquote>\n<p>To be a successful researcher, you have to love learning.</p>\n</blockquote>\n<p>I know people who love learning known stuff, but are no good at research.   This doesn't contradict what you said, since you were giving necessary conditions, not sufficient ones.   To be a successful researcher I think you also have to love discovering new ideas.   And in academia, you also have to love writing up your results.</p>",
        "id": 204140763,
        "sender_full_name": "John Baez",
        "timestamp": 1594932542
    }
]