[
    {
        "content": "<p>I wonder how well polynomial functors may be suited to model the voltage oscillations in a power grid.</p>\n<p>These oscillations are important because they can cause widespread power outages (like recently in Spain). With the replacement of thermal power plants through solar plants grids tend to become more vulnerable to these oscillations, because solar power plants don't have a massive generator with rotating parts whose angular momentum keeps the frequency stable.</p>\n<p>How do the connectivity and topology of the grid affect the oscillations? The dynamics of these oscillations are often modeled with a coupled oscillator model as a set of linear first order differential equations with as many equations as there are power generators and consumers in the system.</p>\n<p>The reason why I hope this could work well is because I want to exploit the monoidal structures on polynomial functors. I suspect they are well suited to describe how larger dynamical systems are wired together out of multiple smaller systems. My goal would be to use polynomial functors to help figure out how to connect different generators and grids together so that the system is most stable to oscillations. </p>\n<p>Do you think this is a promising approach? Has someone already tried working on this? Any suggestions how to get started to work on this problem?</p>\n<p>Some references for the classical problem would be:<br>\n[1] Rogers, G. (1996). Demystifying Power System Oscillations. IEEE Computer Applications in Power, 9(3). <a href=\"https://doi.org/10.1109/67.526851\">https://doi.org/10.1109/67.526851</a><br>\n[2] Rohden, M. , Sorge, A., Witthaut, D and Timme, M (2013). Impact of network topology on synchrony of oscillatory power grids. <a href=\"https://arxiv.org/pdf/1305.1634\">https://arxiv.org/pdf/1305.1634</a><br>\n[3] Rogers, G., Elliott, R. T., Trudnowski, D. J., Wilches-Bernal, F., Osipov, D., Chow, J. H. (2025). Power System Oscillations: An Introduction to Oscillation Analysis and Control. Springer Nature. <a href=\"https://doi.org/10.1007/978-3-031-80581-3\">https://doi.org/10.1007/978-3-031-80581-3</a><br>\n[4] Martínez-Barbeito, M., Gomila, D., Colet, P., Fritzsch, J. and Jacquod, P.<br>\n(2025). Transmission grid stability with large interregional power flows. Phys. Rev. Research 7, 013137. <a href=\"https://doi.org/10.1103/PhysRevResearch.7.013137\">https://doi.org/10.1103/PhysRevResearch.7.013137</a></p>",
        "id": 525799497,
        "sender_full_name": "Florian Schwarz",
        "timestamp": 1750891050
    },
    {
        "content": "<p>*-.mjnhcar3ewq2saWDEFBMH.<br>\n'**.OMNHZCESAQ</p>",
        "id": 525809109,
        "sender_full_name": "Florian Schwarz",
        "timestamp": 1750899647
    }
]