[
    {
        "content": "<p>Would anyone be interested in working with myself and David Spivak to investigate \"the data required to implement universal properties of functorial data migration (limits and co-limits of co-pre-sheaves as well as change-of-basis functors)\" with respect to existing notions of lineage and provenance from database theory?  Basically, to connect <a href=\"https://arxiv.org/abs/1212.5303\">https://arxiv.org/abs/1212.5303</a> and <a href=\"https://courses.cs.washington.edu/courses/cse544/12sp/lectures/lecture18-provenance.pdf\">https://courses.cs.washington.edu/courses/cse544/12sp/lectures/lecture18-provenance.pdf</a> ?  We think there's probably a paper in it and that it would be appropriate for jr grad students on up.</p>",
        "id": 220546243,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1608513136
    },
    {
        "content": "<p>Provenance is a very interesting topic and intuitively related to RDF Quads. I am happy to help along, and keen to use the results of the research. Intuitively provenance moves one to the space of what in philosophy is known as Speech Acts, and as I understand Linear Logic may be a way to encode those.</p>",
        "id": 220567707,
        "sender_full_name": "Henry Story",
        "timestamp": 1608544028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"303931\">@Chao-Hong Chen</span></p>",
        "id": 220633785,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1608586828
    },
    {
        "content": "<p>Btw. the Semantic Web references for Provenance are:</p>\n<ul>\n<li><a href=\"https://www.w3.org/TR/prov-o/\">Prov-Ontology W3C standard</a></li>\n<li><a href=\"https://lucmoreau.wordpress.com/2015/06/19/provenance-reading-list/\">Literature on Provenance</a><br>\nReally intrigued how this ties in with semi-rings. At first sight it is quite difficult to see how these are related.</li>\n</ul>",
        "id": 220740719,
        "sender_full_name": "Henry Story",
        "timestamp": 1608675954
    },
    {
        "content": "<p>To elaborate, when you implement the various constructions of functorial data migration using relational algebra and a key-generator, you have to keep around various tables in order to be able to construct the mediating morphisms required of the universal property.  For example, associated with the relational algebra implementation of the \"pi\" functor (right adjoint to the model reduct functor) is an intermediate table whose schema is a comma category defined in terms of the input schema.  To construct mediating morphisms involves querying this table.   Moreover, we can use the mediating morphism to answer certain kinds of provenance queries.  So, the basic idea behind this research is to understand the information encoded in these temporary tables, and connect it to database theory.</p>",
        "id": 221438448,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1609658248
    }
]