[
    {
        "content": "<ul>\n<li>Heng Zhao, Laurent Thiry, Michel Hassenforder, <a href=\"https://ieeexplore.ieee.org/document/8334478\">Category theory for optimization</a>, 2018 IEEE 12th International Conference on Semantic Computing (ICSC).</li>\n</ul>\n<p>Abstract.  This paper shows how concepts coming from category theory can help to improve the algorithms dealing with large sets of data. Data structures can be modeled by functors that are related by natural transformations usable both to reduce data size or to shift an algorithm applicable to a particular data structure to an equivalent algorithm for another data structure, i.e. results are the same but time required to get it can be different. As an illustration, the paper takes the example of queries on graph databases used by semantic web and big data communities.</p>\n<p>Alas behind a paywall.</p>",
        "id": 202631100,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593642403
    },
    {
        "content": "<p>Even more interested to find references relating to optimization in the classical sense (which I see been touched upon in other topics).</p>",
        "id": 202631699,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593642855
    },
    {
        "content": "<p><a href=\"/user_uploads/21317/JBLUpQntkbnUQ6xmPjyFrZrR/08334478.pdf\">08334478.pdf</a> Here you go</p>",
        "id": 202638048,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1593648507
    },
    {
        "content": "<p>It doesn't seem like much to me but I could merely be unprepared for this paper</p>",
        "id": 202638090,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1593648550
    },
    {
        "content": "<p>Yeah it doesn't look like much.   Sorry if there was a misunderstanding here - I was just sighing about the paywall, not actually asking for a download.   I would remove the link, due to infringement concerns.   Thanks.</p>",
        "id": 202639722,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593650112
    },
    {
        "content": "<p>Onward to more interesting references!</p>",
        "id": 202639727,
        "sender_full_name": "David Tanzer",
        "timestamp": 1593650122
    }
]