[
    {
        "content": "<p>This morning I stumbled upon this paper:</p>\n<ul>\n<li><strong><a href=\"https://link.springer.com/chapter/10.1007/978-3-540-73859-6_14\">Structured Co-spans: An Algebra of Interaction Protocols</a></strong>, José Luiz Fiadeiro &amp; Vincent Schmitt </li>\n</ul>\n<p>It seems to more or less reproduce the same technology of Courser and Baez's structured cospans, but it's from 2007!</p>",
        "id": 312812746,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1669718507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <span class=\"user-mention\" data-user-id=\"276972\">@Kenny</span> were you aware of this?</p>",
        "id": 312812866,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1669718533
    },
    {
        "content": "<p><span aria-label=\"bangbang\" class=\"emoji emoji-203c\" role=\"img\" title=\"bangbang\">:bangbang:</span></p>",
        "id": 312830409,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1669724702
    },
    {
        "content": "<p><a href=\"https://www.ii.uib.no/calco07/program-p/FiadeiroSchmitt2007lncs4624_CR.pdf\">Free link</a></p>",
        "id": 312847533,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1669730051
    },
    {
        "content": "<p>(I now realize this might be read as an attempt to undermine originality/priority claims by John and Kenny. No, this is not my intention.)</p>",
        "id": 312870378,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1669736393
    },
    {
        "content": "<blockquote>\n<p>This morning I stumbled upon this paper:</p>\n<ul>\n<li><strong><a href=\"https://link.springer.com/chapter/10.1007/978-3-540-73859-6_14\">Structured Co-spans: An Algebra of Interaction Protocols</a></strong>, José Luiz Fiadeiro &amp; Vincent Schmitt </li>\n</ul>\n<p>It seems to more or less reproduce the same technology of Courser and Baez's structured cospans, but it's from 2007!</p>\n</blockquote>\n<p>No, of course we were not aware of it, or we would have referred to it.  Someone told me about this paper later, and I should have read it and referred to it in later papers, but I forgot to.   I assumed it was a paper about some vaguely related idea that someone had given the same name.  I'm just seeing now that it's the same idea!</p>\n<p>It's not surprising that someone had the idea of structured cospans before we did (since it's such a simple idea), and it's not surprising that someone called something \"structured cospans\" (since it's a nice name), but it's surprising that someone had the same idea and gave it the same name!</p>",
        "id": 313091350,
        "sender_full_name": "John Baez",
        "timestamp": 1669823778
    },
    {
        "content": "<p>I'll have to make sure to cite it in some future work on structured cospans.</p>",
        "id": 313091620,
        "sender_full_name": "John Baez",
        "timestamp": 1669823857
    },
    {
        "content": "<p>To anyone thinking we might have plagiarized this work, I can only respond that if we had, we would have certainly been smart enough not to call the idea by the exact same name.</p>",
        "id": 313097424,
        "sender_full_name": "John Baez",
        "timestamp": 1669825319
    },
    {
        "content": "<p>I could ramble on about the similarities and differences between their results and ours....</p>",
        "id": 313104977,
        "sender_full_name": "John Baez",
        "timestamp": 1669827271
    },
    {
        "content": "<p>Speaking as someone more in CS than ACT, there's a lot of \"reproduction\" in ACT of CS results - I can give many examples if people are interested - but I think that's part of what makes ACT valuable; if ACT re-discovers something that CS is independently interested in, it is worthy of extra study.   In fact for this reason I urge folks to adopt \"historical\" approaches to ACT research and paper writing and try to do so myself.</p>",
        "id": 313388697,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1669932888
    },
    {
        "content": "<p>I'd like to hear some examples of that.</p>",
        "id": 313388862,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1669932958
    },
    {
        "content": "<p>One example is overlap between David's work on Functorial Data Migration and Robert Rosebrugh's work on Entity Attribute Sketches; they both discovered what we call \"delta\", as well many other issues in dealing with presentations on a computer.  And now we have a great synthesis of both works and our software interoperates with each other!</p>",
        "id": 313389379,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1669933143
    },
    {
        "content": "<p>\"regular categories\" in CT and \"existential horn clauses\" in logic is another overlap, with \"the small object argument\" corresponding to \"the chase algorithm\"</p>",
        "id": 313389625,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1669933210
    },
    {
        "content": "<p>Oh, and Reynold's work on parametric polymorphism and Girard's work on System F is a classic example from the 70s.  I'll stop now</p>",
        "id": 313389843,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1669933288
    },
    {
        "content": "<p>There's a strand of work on software architecture and modular components, as well as some stuff with rewriting, that uses double-pushouts to build things up. That work is full of cospans as 'the' means to connect things up -- and that literature goes back 20 years.</p>",
        "id": 313454409,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1669972157
    },
    {
        "content": "<p>Arguably the idea of using cospans to glue things together goes back to the classical theorem: \"A category C has colimits if and only it has pushouts and an initial object\"</p>",
        "id": 313468021,
        "sender_full_name": "Jade Master",
        "timestamp": 1669976894
    },
    {
        "content": "<p>Two related examples: the polynomial functors people rediscovering containers, and me rediscovering lenses</p>",
        "id": 313474978,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1669979223
    },
    {
        "content": "<p>I think this is basically fine. The literature is a vast ocean, reading other people's literature is extremely hard, and in any case these are objects that admit many different valuable perspectives</p>",
        "id": 313475059,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1669979257
    },
    {
        "content": "<p>You might as well mention that (finitary) containers themselves were a special case of Species, aka the functor category [Bij, Set]. And that the functor categories [Inj, Set] and [Surj, Set] had also found quite a lot of use in various bits of theoretical CS.</p>",
        "id": 313475998,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1669979599
    },
    {
        "content": "<p>I think it's ok to rediscover ideas, it happens all the time since the literature is vast. In this particular case, everything one can reasonably do is making sure that these people from 2007 get cited in upcoming structured cospans work.</p>",
        "id": 313722807,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1670093238
    },
    {
        "content": "<blockquote>\n<p>Reynold's work on parametric polymorphism and Girard's work on System F is a classic example from the 70s.</p>\n</blockquote>\n<p>well, this is one canonical example indeed, but Reynolds work is from the 80's (if a quick googling serves me right, \"In a landmark paper Reynolds (1983) develops a mathematical account of Strachey’s informal concept of parametricity of polymorphic functions.\" says <a href=\"https://www.cs.cmu.edu/~rwh/courses/chtt/pdfs/reynolds.pdf\">Bob Harper</a>), while Girard's thesis is 1972.</p>\n<p>The second canonical example I know of is p-morphisms (van Benthem notation) and bi-simulations Robin Milner's notation for the same kinds of maps.</p>\n<p>But I decided to write because for the <a href=\"https://topos.site/blog/2021/07/introducing-the-mathfoldr-project/\">MathFoldr project</a> I am very interested in collecting more examples. So if you could please send them to me, or list them here with as full references as you can provide, I'd be very grateful! Thanks!</p>",
        "id": 314765322,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1670531399
    }
]