[
    {
        "content": "<p>It was announced on the CT mailing list that Barry Mitchell, originator of the (Freyd-)Mitchell embedding theorem for abelian categories, died back in January. I don't know if anyone here knew him or is familiar with his work more broadly, but it seems worth opening a discussion just in case.</p>",
        "id": 231604149,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1616578149
    },
    {
        "content": "<p>I intersected with him only very briefly, at Rutgers. I believe he may have been retired by the time I arrived; he and/or his partner would show up only very sporadically to any sort of function. I remember his telling some people he was a category theorist and other people (e.g., me) he wasn't; I got the impression he chose on the basis of whichever would more limit his interaction with people. (I got the impression from the few times I met him that he may have suffered from mental or psychological difficulties; I haven't checked the categories list to see what others better informed have to say.) </p>\n<p>His book Theory of Categories was very influential in the mid-60's. The intro has this which I find in many ways poignant: </p>\n<blockquote>\n<p>A number of sophisticated people tend to disparage category theory as consistently as others disparage certain kinds of classical music. When obliged to speak of a category they do so in an apologetic tone, similar to the way some say, “It was a gift – I’ve never even played it” when a record of Chopin Nocturnes is discovered in their possession. For this reason I add to the usual prerequisite that the reader have a fair amount of mathematical sophistication, the further prerequisite that he have no other kind.</p>\n</blockquote>\n<p>Do I remember correctly that Ellis Cooper (a member of this Zulip) did his PhD with him at Dalhousie?</p>",
        "id": 231626134,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1616589755
    },
    {
        "content": "<p><a href=\"http://MathGenealogy.org\">MathGenealogy.org</a> is your friend ... Yes, Ellis Cooper is listed as a student of Barry's. Others include Steven Amgott, Ching-an Cheng, Susan Niefield, and Roman Wong.</p>",
        "id": 231680071,
        "sender_full_name": "Robert Seely",
        "timestamp": 1616608570
    },
    {
        "content": "<p>It was a rhetorical question. I hope <span class=\"user-mention\" data-user-id=\"319799\">@Ellis D. Cooper</span>  can add some reminiscences. </p>\n<p>The Freyd-Mitchell embedding is one of a number of important embedding/completeness theorems; Freyd and Scedrov make such theorems a central theme of their fascinating book Categories, Allegories.</p>",
        "id": 231701312,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1616616937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/Barry.20Mitchell/near/231701312\">said</a>:</p>\n<blockquote>\n<p>It was a rhetorical question. I hope <span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span>  can add some reminiscences. </p>\n<p>The Freyd-Mitchell embedding is one of a number of important embedding/completeness theorems; Freyd and Scedrov make such theorems a central theme of their fascinating book Categories, Allegories.</p>\n</blockquote>\n<p>Yes, Barry was my mentor and thesis supervisor. Also, we became friends. I have photographs of him at social gatherings in Halifax during the Lawvere years there (early 1970s); many years later my son and I drove to visit with him at his (semi-palatial) home in upstate New York. We have extensive video recordings of conversation with him, including reminiscences of his mathematics career, and his love life. I cannot say I loved him, as I did Eilenberg. But Barry had a wicked sense of humor, and spent quite some effort to contrive poems and letters expressing almost Monty-Pythonian silliness. There are many stories I could tell, such as a joint trip to a mathematics conference in San Francisco with my future wife and Dana Latch and other mathematicians, running about the streets of San Francisco to visit pornographic movies just for fun. We must have been a very weird looking group, since Barry towered in height (and intellect) over everyone else. He played his concert piano extremely well. We shopped for food and prepared meals together, setting the table with candles. In my seriously well-worn copy of his 1965 book, \"Theory of Categories,\" he wrote, \"For Christ's sake, Ellis, are all the books you read as out of date as this one? Get with it, laddie. Barry\" July 2005.</p>",
        "id": 231784576,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1616672024
    },
    {
        "content": "<p>Yes, Barry Mitchell was my supervisor at Dalhousie University in 1970-1973. I was not one of the brighter people there, seeing as how Lawvere had assembled a collection of highly prestigious category theorists. Radu Diaconescu was my best friend. Barry and I remained friends for decades thereafter. My son and I drove to his palatial home in upper New York State something like fifteen years ago, and we made video interviews of Barry telling stories and showing photographs he had collected during his youth and later. Our friendship turned into telephone conversations during which on most occasions he was somewhat disabled by his consumption of alcohol (Chivas Regal). He would read me the hilarious poetry he wrote. He had long stopped doing mathematics. He did hurt my feelings, once, when he said, \"You know, you weren't as good [at mathematics] as you thought you were.\" My thesis was based on a conjecture he proposed, that the poincare groupoid of a simplicial set is equivalent to the fundamental groupoid of the geometric realization. Not my idea, so nothing original there. He was indisposed to attend my oral examination, so he was not present when I was asked a question about topology involving the need for an element in each member of a family of open sets. I failed to realize that the answer required the axiom of choice, and said instead, after saying I needed to marshal my thoughts, that  \"I just marshalled the empty set.\" It has taken me about fifty years to feel that I really do deserve my doctorate.</p>",
        "id": 338697220,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1677620413
    }
]