[
    {
        "content": "<p><a href=\"/user_uploads/21317/r6EA3ZE-9NwvDi_m0mcNcdYq/rationality_is_not_constant_in_a_family.jpg\">Sometimes you can't tell whether mathematicians are joking:</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/r6EA3ZE-9NwvDi_m0mcNcdYq/rationality_is_not_constant_in_a_family.jpg\" title=\"Sometimes you can't tell whether mathematicians are joking:\"><img src=\"/user_uploads/21317/r6EA3ZE-9NwvDi_m0mcNcdYq/rationality_is_not_constant_in_a_family.jpg\"></a></div>",
        "id": 361792925,
        "sender_full_name": "John Baez",
        "timestamp": 1685294091
    },
    {
        "content": "<p>This is from a free 300-page book:</p>\n<p>• Jean-Louis Colliot-Thelene and Alexei N. Skorobogatov, <a href=\"https://www.imo.universite-paris-saclay.fr/~jean-louis.colliot-thelene/BGgroup_book.pdf\">The Brauer–Grothendieck group</a></p>\n<p>The Brauer group of a field k classifies all the division algebras over k whose center is just k.   For example if k = ℝ there are just two such division algebras, the reals and the quaternions, and the Brauer group is ℤ/2.    The complex numbers don't count because their center is bigger.  This separates the classification of division algebras from Galois theory, which is about finding bigger fields that contain k.  But the Brauer group is deeply connected to Galois theory!</p>\n<p>This book goes in a direction I don't really appreciate yet, called the Brauer-Manin obstruction. When you're trying to find integer solutions to a bunch of polynomial equations, you can first check to see if they have solutions mod p for every prime p.  This is a necessary but not sufficient condition.  A better version of this idea is: to see if a bunch of polynomial equations have rational solutions, see if they have real solutions and also p-adic solutions for every p.  Again this is necessary but not sufficient... but Hasse showed it's also sufficient if all your polynomials are homogeneous quadratic. This is called the <a href=\"https://en.wikipedia.org/wiki/Hasse_principle\">Hasse principle</a>.</p>\n<p>Does it work for general quadratics too?   </p>\n<p>The Brauer-Manin obstruction helps you see exactly when the Hasse principle fails, and \"how  much\".  </p>\n<p>This book gives a hugely detailed study of the Brauer-Manin obstruction.  If you're like me, you might appreciate the crash course on etale cohomology and stacks.  Or at least the joke buried in the table of contents.</p>",
        "id": 361793215,
        "sender_full_name": "John Baez",
        "timestamp": 1685294209
    }
]