[
    {
        "content": "<p>I see that this is the stream used for similar questions in the past. </p>\n<p>After years and years of neglect I feel I need to put my research statement a bit more up to date. I have been in the rat-race for almost ten years, so the task of laying down a coherent story of my research interests is particularly daunting, and even more because I feel I did many, many different things. </p>\n<p>On top of this, I got carried away, because I am me, and the document ended up being not only a timeline of my scientific production, but also a description of things like my work ethics, my inner motivations, my philosophy in sharing co-authorship, what was in my head when I was working on this or that problem...</p>\n<p>I consider this the only way to provide a faithful description of what my research is about; but I suspect that this is an uncommon way to present oneself. Thus my question:</p>\n<blockquote>\n<p>Is this the \"right\" way in which I am supposed to write a research statement? Is there even a right way to do it? What is a RS meant to be, in the end, inside a tight-knit community as category theory?</p>\n</blockquote>",
        "id": 369828767,
        "sender_full_name": "fosco",
        "timestamp": 1687812065
    },
    {
        "content": "<p>Let me add that I can (sort of) imagine the answer: there is no \"right\" way, whatever delivers, in clear prose and with plenty of references, the gist of my work is a \"good\" research statement; better if it's as concise as possible, provided it does not sacrifices clarity.</p>\n<p>But probably my ideas are fringe? Probably there is another more reasonable way to do it? On top of this, very likely, younger people in a similar situation might profit from an advice other than the one I would give.</p>",
        "id": 369829356,
        "sender_full_name": "fosco",
        "timestamp": 1687812244
    },
    {
        "content": "<p>There is definitely a lot of say about this, since people reading research statements tend to expect certain things from them.  Are you applying to grad school, a postdoc, or some other job?  No matter which, it pays to look at things like this:</p>\n<ul>\n<li><a href=\"https://owl.purdue.edu/owl/general_writing/graduate_school_applications/writing_a_research_statement.html\">Graduate School Applications: Writing a Research Statement</a>.</li>\n</ul>\n<p>There are many such things online.   Everything in this one is widely accepted, I feel - including the 2 page maximum, since people who read research statements usually have to read a lot of them.</p>",
        "id": 369837733,
        "sender_full_name": "John Baez",
        "timestamp": 1687814498
    },
    {
        "content": "<p>By the way, while you say </p>\n<blockquote>\n<p>What is a RS meant to be, in the end, inside a tight-knit community as category theory?</p>\n</blockquote>\n<p>it's quite common (I think) for research statements for category theory jobs to be read by people who are <em>not</em> experts on category theory - perhaps in addition to people who are.   This depends in part on whether the advertisement says they're looking for a category theorist, or something more general.   There will often be a committee of several mathematicians working on different subjects, who read a lot of applications, and who may also show the applications to subject matter experts.   In this case I feel it helps to prove you can talk clearly to people outside your own subject.</p>",
        "id": 369838663,
        "sender_full_name": "John Baez",
        "timestamp": 1687814914
    },
    {
        "content": "<p>I was about to say something like that too: you should think a lot about the audience you're writing for.  E.g. I've been on hiring committees for tenure-track positions here at USD, which is a small teaching-focused school; in a case like that, the odds are that <em>no one</em> reading your research statement will know anything about your research area (and in my experience it's quite rare for applicants to appreciate just how ignorant of their field the audience is).  On the other hand, I've also been essentially a one-person hiring committee for a postdoc position funded by an external grant, and in a case like that you can be pretty sure that the audience knows at least as much about the field as you do.  And there's a lot of room in between those two extremes.</p>",
        "id": 369839880,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687815254
    },
    {
        "content": "<p>Thanks for the advice so far!</p>",
        "id": 369840389,
        "sender_full_name": "fosco",
        "timestamp": 1687815478
    },
    {
        "content": "<p>The strategy I am adopting is to start with an extremely concise description of what I started doing, something that does not interest me any more, and where I don't have any compelling open question any more. This occupies a couple of paragraphs. Then I describe what I did next, and next, and where it was leading me, and the last part is about my last 1-2 years, where I expand in fair detail what I have been doing <em>literally today</em>.</p>",
        "id": 369841189,
        "sender_full_name": "fosco",
        "timestamp": 1687815786
    },
    {
        "content": "<p>It is around 3 pages now. And certainly it's brown noise to anyone who is not a category theorist. But it's a first draft.</p>",
        "id": 369841255,
        "sender_full_name": "fosco",
        "timestamp": 1687815819
    },
    {
        "content": "<p>My immediate reaction is that talking about something you're not interested in any more isn't a good use of space in a research statement.  It's not a college admissions essay where you tell your life story; the point is to convince the reader of the value -- to the field, not to you personally -- of the research you <em>are</em> going to do.</p>",
        "id": 369841534,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687815961
    },
    {
        "content": "<p>Of course if that old stuff is a major part of your fame - like if you'd won a Nobel prize for it, or written a book that everyone knows, called <em>This is the (Co)End</em>, it would be good to at least mention it, with just enough bragging mixed in so even nonexperts can tell that this is a Big Deal.</p>",
        "id": 369842296,
        "sender_full_name": "John Baez",
        "timestamp": 1687816301
    },
    {
        "content": "<p>Yes, that's fair.</p>",
        "id": 369842527,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687816424
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20write.20a.20research.20statement.20properly.3F/near/369841534\">said</a>:</p>\n<blockquote>\n<p>My immediate reaction is that talking about something you're not interested in any more isn't a good use of space in a research statement.  It's not a college admissions essay where you tell your life story; the point is to convince the reader of the value -- to the field, not to you personally -- of the research you <em>are</em> going to do.</p>\n</blockquote>\n<p>I have the same feeling, but after all I did it, and I feel it's useful to convey the idea that if I have a problem in mind, I grind it and get something (a paper, a deliverable of some sort) out of it. Then, I move elsewhere, and to some extent it doesn't matter where exactly, I will grind something else. Few people say this, and instead they center their whole career on <a href=\"https://en.wikipedia.org/wiki/Serial_module\">serial modules</a>. </p>\n<p>I have nothing against atomic specialization, let me be clear. I am just very bad at it.</p>",
        "id": 369843571,
        "sender_full_name": "fosco",
        "timestamp": 1687816881
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20write.20a.20research.20statement.20properly.3F/near/369842296\">said</a>:</p>\n<blockquote>\n<p>Of course if that old stuff is a major part of your fame - like if you'd won a Nobel prize for it, or written a book that everyone knows, called <em>This is the (Co)End</em>, it would be good to at least mention it, with just enough bragging mixed in so even nonexperts can tell that this is a Big Deal.</p>\n</blockquote>\n<p>There's a paragraph about that, but just one.</p>",
        "id": 369843598,
        "sender_full_name": "fosco",
        "timestamp": 1687816899
    },
    {
        "content": "<p>Yes, that's true too.  So maybe my immediate reaction was wrong.  (-:</p>",
        "id": 369843713,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687816940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20write.20a.20research.20statement.20properly.3F/near/369837733\">said</a>:</p>\n<blockquote>\n<p>Everything in this one is widely accepted, I feel - including the 2 page maximum, since people who read research statements usually have to read a lot of them.</p>\n</blockquote>\n<p>Is this \"widely accepted\"  US -specific? I find very often that advice online assumes everyone is from, and intends to never leave, the American system.</p>",
        "id": 369844605,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1687817397
    },
    {
        "content": "<p>There are other countries?  I thought those were just on the news.</p>",
        "id": 369852680,
        "sender_full_name": "John Baez",
        "timestamp": 1687821708
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20write.20a.20research.20statement.20properly.3F/near/369852680\">said</a>:</p>\n<blockquote>\n<p>There are other countries?  I thought those were just on the news.</p>\n</blockquote>\n<p>Famously some ignorants think Georgia is a country, whereas we know it's just a state on the East coast</p>",
        "id": 369955274,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1687853673
    },
    {
        "content": "<p>Certainly, all my own experience is in the US.  But I think \"write to your audience\" is a pretty general rule for any kind of writing, anywhere.  Granted the audiences might be different, since I don't know what \"hiring committees\" tend to be like in other countries.  Does anyone?</p>",
        "id": 370092284,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687877061
    },
    {
        "content": "<p>Mike, let's play a game: you are suddenly thrown into the job market again, and as soon as you overcome the initial bewilderment, you have to write a research statement and put your CV in order, and all that boring chores analogue to clean your basement once  a year.</p>\n<p>What would you say? Would you mention your work on homotopy theory? Would you mention traces? Or would you start directly from your work on HoTT? Or rather, none of the above? </p>\n<p>My feeling is that I did a few rather different things (a tiny fragment of what you did, both in depth and width), but at the same time I did the very same thing over and over. I'd like this to be evident to the people who read about my work.</p>",
        "id": 370132491,
        "sender_full_name": "fosco",
        "timestamp": 1687883849
    },
    {
        "content": "<p>I feel we all care about the work we did, not only because it's the primary way to rank us both in the community and in the job market, and a \"dead\" research line is never <em>really</em> dead, it just lies dormant for a while, until (with strange aeons...) we find something new where we thought there was nothing more to say. It happened to me, I'm sure it happened to other people!</p>",
        "id": 370133425,
        "sender_full_name": "fosco",
        "timestamp": 1687884005
    },
    {
        "content": "<p>This is to say, cutting away the initial part of your career because you moved far from it can be a very good idea (\"why is this candidate mentioning X if they work on Y today?\"),  or a very bad one (\"what's the problem with this candidate? Are they ashamed of having started as logicians and to be working in numerical analysis today?\"). I don't think there is a one-size-fits-all kind of answer here.</p>\n<p>Now I'm curious, is there anyone who has a similar opinion to mine?</p>",
        "id": 370135192,
        "sender_full_name": "fosco",
        "timestamp": 1687884308
    },
    {
        "content": "<p>I think in your hypothetical game, it would depend a lot on what kind of jobs I was applying for.  Applying for jobs after you're already held a tenured position is a rather different proposition from applying for postdocs and initial tenure-track positions, and there would be a lot of considerations and influences for me that wouldn't be very relevant for people in the latter positions.  But in general I see your point that it really depends on what kind of a story you're trying to tell, and who you're trying to tell it to.</p>",
        "id": 370173280,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1687891976
    }
]