[
    {
        "content": "<p>Say that it takes 3-6 months to write a paper. You could just go radio silent for 6 months and then make a splash in the arxiv when you're ready. However I want to take a slightly more active role in promoting my work and advertising myself, I want to continuously get my name out there, just as a professional you have to maintain and cultivate a public appearance. So I'm wondering, do you draw a line (say once a month or so ) and say \"Ok I need to give a seminar talk on this or release an arxiv preprint summarizing what I've been working on\"</p>\n<p>Often it may be threads that you're working on weaving together into a larger story.</p>",
        "id": 362019660,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685387723
    },
    {
        "content": "<p>I think you should submit something each time you have something that is publishable. At the end of the 6 months, you will maybe have new ideas and you will want to wait even more so that you will repel again and again the time when you publish something. When I look at some people who are very influential in their fields, they don't mind about publishing their ideas little by little as they progress. That being said, I'm only in the process to publish my first paper, so I'm far from being an expert in publishing papers. As to me, I still have some reasons not to try publishing papers, thinking my ideas are not interesting, being too lazy to write the papers or waiting to better understand the stuff, that I try to eliminate from my mind.</p>",
        "id": 362023688,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1685389503
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424412\">Patrick Nicodemus</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20publish.20incremental.20progress.20on.20larger.20work/near/362019660\">said</a>:</p>\n<blockquote>\n<p>However I want to take a slightly more active role in promoting my work and advertising myself, I want to continuously get my name out there, just as a professional you have to maintain and cultivate a public appearance. So I'm wondering, do you draw a line (say once a month or so ) and say \"Ok I need to give a seminar talk on this or release an arxiv preprint summarizing what I've been working on\"</p>\n<p>Often it may be threads that you're working on weaving together into a larger story.</p>\n</blockquote>\n<p>It is good that you want to take an active role in promoting your work!</p>",
        "id": 362025061,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1685390148
    },
    {
        "content": "<p>My approach has been to give lots of talks (because I enjoy it), and to use format this to share my progress, then write up the work along the way and submit when it is \"ready\" or there is a conference deadline. This way I can share new ideas with people, get some feedback on the exposition or further lines of research, and have a record (via video recordings / talk slides) of how I am progressing on a project (this is good for personal motivation!).</p>",
        "id": 362025851,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1685390541
    },
    {
        "content": "<p>Yeah, recording a video lecture and uploading it to youtube should only take a few hours, that seems like an easy way to communicate.</p>",
        "id": 362026284,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685390776
    },
    {
        "content": "<p>Do you have (m)any local seminars in which you can talk about your research?</p>",
        "id": 362026548,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1685390891
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276693\">Bryce Clarke</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20publish.20incremental.20progress.20on.20larger.20work/near/362026548\">said</a>:</p>\n<blockquote>\n<p>Do you have (m)any local seminars in which you can talk about your research?</p>\n</blockquote>\n<p>I have not really looked into it! I guess I should. I work at a school as research staff but not in the mathematics department so I don't know the mathematicians well (or at all) and have not really had time so far to go over and sit in on lectures. But it would probably be very beneficial. I have crashed the programming language theory seminars and that has gone well though. ;)</p>",
        "id": 362026918,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685391066
    },
    {
        "content": "<p>(I am interested in the categorical semantics of programming languages but the paper i'm writing is far from PL. It's more homotopical algebra or simplicial homotopy theory or just general category theory.)</p>",
        "id": 362027034,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685391132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424412\">Patrick Nicodemus</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/How.20to.20publish.20incremental.20progress.20on.20larger.20work/near/362019660\">said</a>:</p>\n<blockquote>\n<p>Say that it takes 3-6 months to write a paper. You could just go radio silent for 6 months and then make a splash in the arxiv when you're ready. However I want to take a slightly more active role in promoting my work and advertising myself, I want to continuously get my name out there, just as a professional you have to maintain and cultivate a public appearance. </p>\n</blockquote>\n<p>For your very first paper this is an actual choice: stay quiet or talk about your forthcoming paper.  But from then on, as long as you can write a paper very 3-6 months, you don't need to do either of these things.  Instead, you can talk about your <em>previous</em> papers, while writing your next paper.</p>\n<p>This way people can go to your talks, or have conversations with you, and then read papers about what you just told them about!</p>\n<p>I like to give talks that leave out grungy details and focus on the \"big picture\", which is often more pretty.   I think this is fine as long as I have a paper on the arXiv and can point people to that paper.   Indeed I think people are more willing to read a paper if they've already gotten the basic idea in a simplified form by going to a talk!</p>",
        "id": 362033896,
        "sender_full_name": "John Baez",
        "timestamp": 1685394850
    },
    {
        "content": "<p>By the way, above I am talking about conversations or blog articles or lectures where you explain work you've done.  There's another kind of conversation where you try to get people to help you with what you're doing.  I do this a <em>lot</em>, with my friends, my grad students, on blogs, and here.  I do this to avoid wasting a lot of time figuring out things that other people already know.  </p>\n<p>But I think of this as quite different from explaining finished work.   I don't usually give lectures about work that's still in progress.  I want my talks to be sort of polished, so people invite me to give more talks.  And I want to have a paper that people can look at after going to my talk.</p>",
        "id": 362034402,
        "sender_full_name": "John Baez",
        "timestamp": 1685395140
    },
    {
        "content": "<p>I imagine other people think about these things differently.</p>",
        "id": 362034841,
        "sender_full_name": "John Baez",
        "timestamp": 1685395386
    },
    {
        "content": "<p>I generally agree that it's better to give public talks about finished work, and for the preprint to be available by the time you give the talk.  I do occasionally depart from this for reasons that seem good to me at the time, and at least some of the time I regret it.  But if you ever have the opportunity to give less public talks to a \"friendly\" audience, such as people in a local research group, that can be a good opportunity to talk about work in progress and get feedback on it.  Of course, that's a different goal from promoting yourself publicly.</p>",
        "id": 362040068,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1685398699
    },
    {
        "content": "<p>One of the main reasons I sometimes regret giving talks about work in progress is that nearly always work that isn't finished yet turns out to be more difficult or take longer than I had expected to finish, or I get caught up with some other project and can't work on it for a while, and then I'm in the uncomfortable situation of having made public claims but not backed them up.</p>",
        "id": 362040192,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1685398772
    },
    {
        "content": "<p>Being less clear-headed than Mike, I've also actually <em>said false stuff</em> when giving talks about half-finished work. Maybe none of my audience notices or cares, but it bothers me.</p>",
        "id": 362049982,
        "sender_full_name": "John Baez",
        "timestamp": 1685405133
    },
    {
        "content": "<p>I agree with Mike about the distinction between less public talks with a friendly audience and public lectures (which nowadays may get immortalized on YouTube).  I used to have a seminar with my grad students where <em>all we'd ever do</em> is talk about half-baked results.  We used this as a way to work through ideas.</p>",
        "id": 362050223,
        "sender_full_name": "John Baez",
        "timestamp": 1685405309
    }
]