[
    {
        "content": "<p>Here's a nice new article on Lawvere's struggle to unify mathematics:</p>\n<ul>\n<li>Anders Kock, <a href=\"https://euromathsoc.org/magazine/articles/143\">F. William Lawvere (1937–2023): A lifelong struggle for the unity of mathematics</a>.</li>\n</ul>",
        "id": 370822375,
        "sender_full_name": "John Baez",
        "timestamp": 1688051730
    },
    {
        "content": "<p>Question: Why is it <em>Andreas</em> Kock on the webpage, but <em>Anders</em> Kock in the PDF (and everywhere else I know him). <br>\nIs this a Steve vs Stephen situation, or a typo?</p>",
        "id": 370840103,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1688054778
    },
    {
        "content": "<p>His name is Anders.  I'll at least fix my post here.</p>",
        "id": 370856563,
        "sender_full_name": "John Baez",
        "timestamp": 1688057823
    },
    {
        "content": "<p>But I don't know if it's a typo or something more interesting.</p>",
        "id": 370856701,
        "sender_full_name": "John Baez",
        "timestamp": 1688057847
    },
    {
        "content": "<p>Lawvere:</p>\n<blockquote>\n<p>My last meeting [with Grothendieck] was at the same place in 1989 (Aurelio<br>\nCarboni drove me there from Milano): he was clearly glad to<br>\nsee me but would not speak, the result of a religious vow; he<br>\nwrote on paper that he was also forbidden to discuss math-<br>\nematics, though quickly his mathematical soul triumphed,<br>\nleaving me with some precious mathematical notes.</p>\n</blockquote>\n<p>I wonder if those notes still exist!</p>",
        "id": 370967763,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1688090257
    },
    {
        "content": "<p>Probably somewhere.  There's a longer version and very charming of this story in Lawvere's <a href=\"https://www.acsu.buffalo.edu/~wlawvere/FarewellAurelio.htm\">obituary for Aurelio Carboni</a>:</p>\n<blockquote>\n<p>In 1989 Aurelio proposed to accompany me with his Alfa Romeo to visit Alexander Grothendieck in his stone hut in the middle of a lavender field near Mormoiron in the South of France. I had already visited Grothendieck in 1981 at that stone hut, but this time there was a specific item that needed to be negotiated. Grothendieck had stated that I might be the appropriate person to edit and publish his great work ‘Pursuing Stacks’. But I had very serious questions about how that editing should be done in particular. Aurelio was attentively studying the situation. The discussion was complicated by the fact that Grothendieck was bound by a religious vow of silence, so that he could only communicate by writing (though he had given me a very friendly one-­word greeting: ‘Bill!’) He wrote immediately that he was under a vow not to discuss mathematics. But his mathematical soul soon triumphed and he was writing mathematical statements and questions. (Aurelio observed all this with valiant equanimity.) The 1983 work of Grothendieck under discussion concerned among many other questions the homotopy theory of presheaf toposes. It is a long manuscript, produced by the basic method of typing all night for several weeks. Naturally, mistakes occurred due to fatigue, but the fever to press on had meant that each morning when Alexander noted the previous evening’s errors, he did not delete them, but simply kept them, and added the corrected version before proceeding. I said that as a conscientious editor I would have to delete the erroneous passages and give substantial explanations of my own. Grothendieck insisted that the errors be kept, so that students would have the opportunity to learn that even famous mathematicians make mistakes. I objected to this, pointing out that students have ample opportunity to see THAT and that learning the actual scientific material is difficult enough without the extra punishment that he was in effect advocating. But our parting was very amicable with the agreement to further consider the matter. Aurelio agreed with my point. In the end the publication did not take place. Only several years later did Maltsiniotis and Cisinski work out the mathematics and bring this magnificent homotopy program to an initial fruition.</p>\n</blockquote>",
        "id": 370971166,
        "sender_full_name": "John Baez",
        "timestamp": 1688091853
    },
    {
        "content": "<p>Wow. I had read that at some point, but I forgot about the detail that Lawvere was au fait with Grothendieck's work on homotopy theory of what can only include simplicial sheaves. A pity he didn't know this was was <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">∞</mi><mo separator=\"true\">,</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(\\infty,1)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord\">∞</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord\">1</span><span class=\"mclose\">)</span></span></span></span>-category theory was all about.</p>",
        "id": 370988055,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1688097548
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276693\">Bryce Clarke</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/Lawvere/near/370840103\">said</a>:</p>\n<blockquote>\n<p>Question: Why is it <em>Andreas</em> Kock on the webpage, but <em>Anders</em> Kock in the PDF (and everywhere else I know him). </p>\n</blockquote>\n<p>I contacted the European Mathematical Society and they fixed it.</p>",
        "id": 371212385,
        "sender_full_name": "John Baez",
        "timestamp": 1688139651
    }
]