[
    {
        "content": "<p>I am not a logician, and I only know the basics of model theory, so this is just an idea I’ve been ruminating on, but:</p>\n<p>What if we humans <em>are</em> the initial model of logic? (Alternatively, it is whatever physics drive the computational mechanisms of our universe and brains.)</p>\n<p>My understanding is that model theory concerns deriving new models of logic from old ones, and this process can be considered transitive in some sense. In particular, if we build models in a metatheory, and then we pick some models of the metatheory (within some metametatheory), we get some models of the theory within the metametatheory.</p>\n<p>But where could this process stop? What do the (meta^n)-theories all have in common?</p>\n<p>Well, us. We are what they all have in common.</p>\n<p>In particular, they all rely on our abilities of reason (constrained by the computational limits of our brain and the physics of the universe) to construct things. And even though our brain can only deal with finite things directly, we get to build models that appear infinite from the inside by virtue of the structure of logic and our capacity for imagination.</p>\n<p>I think some introductions to logic rely on this already ... in particular I think I read an intro to either HoTT or elementary set theory where the author mentioned something to the effect of “Don’t worry about what particular metatheory is used to talk about these rules, it should be intuitive”.</p>\n<p>Anyways, just some thoughts. I’m sure that someone’s said something about these matters before.</p>\n<p>Idea: could we account for the error-prone nature of human reason (and the error-correcting codes, if you will, that we thus rely upon)? what about the social nature of research and teaching/learning? is our initial model really the collective collection of initial models that we hold individually, and thus is unbounded in some sense that it could continue to replicate forever (even though human life must eventually die out)?</p>\n<p>P.S. apologies if I am abusing the term initial model, feel free to suggest more accurate terms</p>",
        "id": 221974256,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610041143
    },
    {
        "content": "<blockquote>\n<p>I think I read an intro to either HoTT or elementary set theory where the author mentioned something to the effect of “Don’t worry about what particular metatheory is used to talk about these rules, it should be intuitive”.</p>\n</blockquote>\n<p>I think they can get away with this because almost mathematicians and computer scientists have been trained in a bunch of mathematical/logical conventions that allow them to read a book like this and understand it.  I think someone without previous training would have  a lot of trouble understanding such a book.  And indeed, basic undergraduate courses on logic have to explain how mathematicians use words like \"or\", \"implies\", \"assume\", etc.   Students often have a lot of trouble with this.</p>",
        "id": 221988001,
        "sender_full_name": "John Baez",
        "timestamp": 1610047304
    },
    {
        "content": "<p>In short I don't think the \"metatheory\" used in math textbooks is the common property of all humans, only those who have undergone some training.</p>",
        "id": 221988103,
        "sender_full_name": "John Baez",
        "timestamp": 1610047351
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276057\">Nick Scheel</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/The.20initial.20model.20of.20logic.3A.20humans.3F!/near/221974256\">said</a>:</p>\n<blockquote>\n<p>Well, us. We are what they all have in common.</p>\n</blockquote>\n<p>It seems like you're saying that humans are somehow the progenitors of logic, and that seems like a stretch, even if we're the first species that we know of to have formal expressions/languages for working with it.</p>",
        "id": 221998159,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1610052297
    },
    {
        "content": "<p>I think people have some common ways of thinking and reasoning, but the \"common core\" is smaller than one might naively think if one spends a lot of time hanging out with 21st-century Westerner who have some education in math and science.</p>",
        "id": 222003389,
        "sender_full_name": "John Baez",
        "timestamp": 1610054874
    },
    {
        "content": "<p>Lately psychologists have started noticing that most test subjects in psychology experiments are WEIRD: Western, educated, industrialized, rich and democratic.</p>",
        "id": 222003597,
        "sender_full_name": "John Baez",
        "timestamp": 1610054973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276057\">Nick Scheel</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/The.20initial.20model.20of.20logic.3A.20humans.3F!/near/221974256\">said</a>:</p>\n<blockquote>\n<p>I think I read an intro to either HoTT or elementary set theory where the author mentioned something to the effect of “Don’t worry about what particular metatheory is used to talk about these rules, it should be intuitive”.</p>\n</blockquote>\n<p>I think there's a grain of truth to this in that the metatheory required for <em>stating</em> syntactic rules is usually very simple, and most metatheories you could think of agree. You start needing to worry about metatheory when you want to <em>prove</em> something about that system.</p>",
        "id": 222007334,
        "sender_full_name": "James Wood",
        "timestamp": 1610056736
    },
    {
        "content": "<p>Perhaps a good place to look to examine the things “everyone agrees on” is Σ₁-validity.</p>",
        "id": 222007405,
        "sender_full_name": "James Wood",
        "timestamp": 1610056784
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"281583\">@James Wood</span>, I think that’s most closely what I was trying to get at.</p>",
        "id": 222007645,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610056875
    },
    {
        "content": "<p>I didn't mean to imply that logic exists because of humans, but just that if we are creating models in some metatheory we need to have enough tools available in that metatheory with which to craft our models, and so on, and so we must be conduct our reasoning in _some_ base system, and then build up more powerful theories and models inside of that base system</p>",
        "id": 222009319,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610057664
    },
    {
        "content": "<p>The other thing I would compare it to is enrichment in CT: when you're working with “plain” categories, you can actually think of them as being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi><mi>e</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">Set</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05764em;\">S</span><span class=\"mord mathnormal\">e</span><span class=\"mord mathnormal\">t</span></span></span></span>-enriched, where <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>S</mi><mi>e</mi><mi>t</mi></mrow><annotation encoding=\"application/x-tex\">Set</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.05764em;\">S</span><span class=\"mord mathnormal\">e</span><span class=\"mord mathnormal\">t</span></span></span></span> is really the metatheory you're working in (modulo size issues). I think I am not articulating myself well enough here … :-/</p>",
        "id": 222009637,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610057814
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/The.20initial.20model.20of.20logic.3A.20humans.3F!/near/221988001\">said</a>:</p>\n<blockquote>\n<p>And indeed, basic undergraduate courses on logic have to explain how mathematicians use words like \"or\", \"implies\", \"assume\", etc.   Students often have a lot of trouble with this.</p>\n</blockquote>\n<p>This is a good point. But I wonder how much basic logic students could figure out, given enough time? Could they take their intuitive usages of quasi-logical notions and formalize them? I suppose the process of formalization might be difficult to explain to them, if they weren't already exposed to it.</p>\n<p>Edit: that is, how many of their mistakes are really mistakes, as opposed to discrepancies in how their understand logical concepts vs how those concepts have been rigorously defined.</p>",
        "id": 222009816,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610057918
    },
    {
        "content": "<p>And point well taken about the biases of assuming levels of knowledge, and cultural biases, etc. … it is interesting that games (like card games, but also other types) provide an example of logical rules (to varying levels of formality) that I think most people have some exposure to.</p>",
        "id": 222010037,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1610058017
    },
    {
        "content": "<p>Games are a great introduction to formal mathematics!</p>",
        "id": 222020954,
        "sender_full_name": "John Baez",
        "timestamp": 1610065579
    },
    {
        "content": "<p>There are some  amazing computer games these days that teach kids math... that are really <em>games</em>.</p>",
        "id": 222020982,
        "sender_full_name": "John Baez",
        "timestamp": 1610065604
    }
]