[
    {
        "content": "<p>Say I would want to understand the proof of Fermat's Last Theorem. Which book (or books) would I have to read to appreciate it?<br>\n(Checking out this questionaire on P vs NP posted on Zulip a while back, one of the people said that he fears that when P vs NP finally gets settled, it will be kinda like the proof of Fermat's Last Theorem, where he only has a vague sense of how it works, so I'm now kinda motivated to learn more about this)</p>",
        "id": 227339852,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614029130
    },
    {
        "content": "<p>Fermat's Last Theorem is now a corollary of a result called the <a href=\"https://en.wikipedia.org/wiki/Modularity_theorem\">modularity theorem</a>; 95% of the work in proving FLT is proving the modularity theorem (or at least a big enough special case to get the job done), and the modularity theorem is vastly more <em>interesting</em> than FLT.</p>\n<p>A good intro is Diamond and Shurman's book rather insolently titled <em><a href=\"https://link.springer.com/content/pdf/bfm%3A978-0-387-27226-9%2F1.pdf\">A First Course in Modular Forms</a></em>.   (This link just gives you the table of contents and the preface.)</p>",
        "id": 227345984,
        "sender_full_name": "John Baez",
        "timestamp": 1614031441
    },
    {
        "content": "<p>For a quick tour of the overall architecture of the proof of FLT, this is good:</p>\n<ul>\n<li>Wikipedia, <a href=\"https://en.wikipedia.org/wiki/Wiles%27s_proof_of_Fermat%27s_Last_Theorem#Summary_of_Wiles's_proof\">Fermat's last theorem: summary of Wiles' proof</a>.</li>\n</ul>",
        "id": 227347712,
        "sender_full_name": "John Baez",
        "timestamp": 1614031908
    },
    {
        "content": "<p>From reading the preface of that book it looks like it still assumes many things about complex analysis and number theory that I do not know. Well, nobody said it would be easy :P</p>",
        "id": 227356943,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614036264
    },
    {
        "content": "<p>I think most of the stuff in the preface is explained in the book; here they are just trying to rapidly zip through the statement of the Modularity Theorem.</p>\n<p>Calling a book that leads up to a proof of the modularity theorem <em>A First Course in Modular Forms</em> is sort of a joke, though.</p>",
        "id": 227363059,
        "sender_full_name": "John Baez",
        "timestamp": 1614039880
    },
    {
        "content": "<p>This theorem is the towering achievement in the theory of modular forms.</p>",
        "id": 227363130,
        "sender_full_name": "John Baez",
        "timestamp": 1614039941
    },
    {
        "content": "<p>The preface says</p>\n<blockquote>\n<p>The minimal prerequisites are undergraduate semester courses in linear al-gebra, modern algebra, real analysis, complex analysis, and elementary number theory. Topics such as holomorphic and meromorphic functions, congruences, Euler’s totient function, the Chinese Remainder Theorem, basics of general point set topology, and the structure theorem for modules over  a principal ideal domain are used freely from the beginning, and the Spectral Theorem of linear algebra is cited in Chapter 5. A few facts about representations and tensor products are also cited in Chapter 5, and Galois theory is used extensively in the later chapters. Chapter 3 quotes formulas from Riemann surface theory, and later in the book Chapters 6 through 9 cite steadily more results from Riemann surface theory, algebraic geometry, and algebraic number theory.</p>\n</blockquote>\n<p>These prerequisites are pretty minimal for a book trying to explain the proof of Fermat's Last Theorem.</p>",
        "id": 227372920,
        "sender_full_name": "John Baez",
        "timestamp": 1614046584
    },
    {
        "content": "<p>It looks like the climb gets steeper near the end.</p>",
        "id": 227372979,
        "sender_full_name": "John Baez",
        "timestamp": 1614046635
    },
    {
        "content": "<p>Oh, actually Diamond and Shurman's book does not contain a proof of FLT, just a lot of prerequisites for the proof!   <a href=\"https://www.math.columbia.edu/~woit/wordpress/?p=249\">Peter Woit</a> wrote:</p>",
        "id": 227385820,
        "sender_full_name": "John Baez",
        "timestamp": 1614059447
    },
    {
        "content": "<blockquote>\n<p>I recently got a copy of a very interesting new textbook entitled <em><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/038723229X\">A First Course in Modular Forms</a></em> by Fred Diamond and Jerry Shurman.  Fred was a student of Andrew Wiles at Princeton, and came here to Columbia as a junior faculty member at the same time I did.  He now teaches at Brandeis.</p>\n</blockquote>\n<blockquote>\n<p>The title of the book is a bit deceptive, what it is really about is what used to be called the Taniyama-Shimura-Weil (or some subset of those names) conjecture, but now is often known as the Modularity Theorem.  Most of this theorem was proved by Andrew Wiles (with help from Richard Taylor), who famously used his result to prove Fermat's last theorem.  More recently, the proof of the full theorem was completed by Fred, together with collaborators Christophe Breuil, Brian Conrad and Richard Taylor.   Stating the modularity theorem precisely requires some serious mathematical technology, an imprecise statement is the \"All rational elliptic curves arise from modular forms\".  This fits into the Langlands program of establishing a correspondence between arithmetic objects (in this case elliptic curves over the rational numbers), and analytic objects (in this case modular forms).  If one can do this, typically the fact that the analytic objects are pretty well understood allows one to get a vast amount of very deep information about the more mysterious arithmetic objects (e.g. being able to count solutions to equations over the rationals or integers).</p>\n</blockquote>\n<blockquote>\n<p>The book takes an interesting approach to the Modularity Theorem, not trying to actually prove it.  The proof involves highly sophisticated mathematical technology, and really understanding it is still the province of experts.  If one wants to try and learn this technology, two places to look are the volumes <em><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0387989986\">Modular Forms and Fermat's Last Theorem</a></em> and <em><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0821821733\">Arithmetic Algebraic Geometry</a></em>, which are the proceedings of two different instructional conferences.  Instead of trying to give a proof, Diamond and Shurman&#8217;s book explains exactly what the various related versions of the Modularity Theorem say.  This covers a range of beautiful mathematical ideas, much of which hasn't before had a particularly readable exposition.  Until now, the main reference for some of this material has been Shimura's <em><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0691080925\">Introduction to Arithmetic Theory of Automorphic Functions</a></em>, a famously difficult text.</p>\n</blockquote>\n<blockquote>\n<p>The book is advertised as <em>A First Course</em> and attempts to minimize the prerequisites necessary to read it, making it conceivable to even use the book with advanced undergraduates.  This is a worthy goal, but may be a bit over-ambitious.  I suspect most people will get more out of the book if they already have had exposure to some of this mathematics at a slightly more basic level. One place to get this is Neal Koblitz's <em><a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0387979662\">Introduction to Elliptic Curves and Modular Forms</a></em>.  But this really is a wonderful book, making accessible parts of the really beautiful mathematics which mathematicians have been making great progress in understanding over the last decade.</p>\n</blockquote>",
        "id": 227385933,
        "sender_full_name": "John Baez",
        "timestamp": 1614059535
    },
    {
        "content": "<p>Kevin Buzzard (who worked on the Langlands program and in particular on modular  forms, Galois representations, and was a student of Richard Taylor) now <a href=\"https://xenaproject.wordpress.com/2019/09/27/does-anyone-know-a-proof-of-fermats-last-theorem/\">thinks</a> that there is no one on earth who \"knows\" all of the components of the proof of Fermat's last theorem, to the point of being able to reproduce it in outline, without putting in serious study and work. There are so many many pieces that go into it, for instance bits of analytic work by Langlands and Tunnell that give one of the important cases that Wiles needed.</p>\n<p>Buzzard gives a bunch of things in comments on this question: <a href=\"https://mathoverflow.net/questions/97820/a-recommended-roadmap-to-fermats-last-theorem\">https://mathoverflow.net/questions/97820/a-recommended-roadmap-to-fermats-last-theorem</a> and answers there give serious resources one might wish to consult.</p>",
        "id": 227387725,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1614061557
    },
    {
        "content": "<p>Thanks for all the great resources! I had kinda hoped the proof would have been more streamlined after 20 years, but it looks like it still requires an ungodly amount of knowledge to get there. Maybe in another life I would be able to understand all this :)</p>",
        "id": 227409729,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614076646
    },
    {
        "content": "<p>Perhaps I could just start with the basic theory of elliptic curves and see if it strikes my fancy</p>",
        "id": 227409826,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1614076693
    },
    {
        "content": "<p>Elliptic curves are great fun!  I explained the basic ideas here:</p>\n<ul>\n<li>\n<p><a href=\"https://math.ucr.edu/home/baez/week13.html\">This Week's Finds in Mathematical Physics (Week 13)</a>.</p>\n</li>\n<li>\n<p><a href=\"https://math.ucr.edu/home/baez/week125.html\">This Week's Finds in Mathematical Physics (Week 125)</a>.</p>\n</li>\n</ul>",
        "id": 227462065,
        "sender_full_name": "John Baez",
        "timestamp": 1614098552
    }
]