[
    {
        "content": "<p>I am writing a paper which heavily draws on some ideas by Richard Garner. I noticed an opportunity for improvement in one of the definitions of his paper, and propose a strengthened definition which is adequate for my purposes.<br>\nAt some point I want to reach out and discuss my idea, I am wondering, should I wait until my paper is in a near final form (could take months) or fire off an email immediately explaining the basic gist?<br>\nMore generally the question is how early do you communicate with others about the ideas in a half written paper?</p>",
        "id": 361994677,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685378793
    },
    {
        "content": "<p>To me the answer depends a lot on how well I know the person and also what I'm trying to achieve.  If I don't know them and just want to inform them of what I've done, I might wait until my work is nicely written up, to make it easy for them to understand what I've done.   If I'm hoping that conversations with someone will help me, or if I know them, I might do it earlier.</p>",
        "id": 362002646,
        "sender_full_name": "John Baez",
        "timestamp": 1685381537
    },
    {
        "content": "<p>Richard Garner is a very nice guy and very smart, so I believe the worst thing that could happen by telling him your ideas soon is that he'd understand them and say some things that would make you rethink those ideas.   \"Worst\", not because it's so bad - it may actually be very good - but because sometimes it can be demoralizing to have someone rapidly improve ideas one has been working on for a long time.</p>",
        "id": 362003023,
        "sender_full_name": "John Baez",
        "timestamp": 1685381700
    },
    {
        "content": "<p>Yes, hahaha, I understand. I don't think he'll have trouble understanding because the basic point is very much in the context of his paper rather than relying on much from my independent work.</p>",
        "id": 362004054,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685382037
    },
    {
        "content": "<p>I'll just send him a quick email.</p>",
        "id": 362004065,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685382044
    },
    {
        "content": "<p>Lmao never mind. Before hitting send I decided to do a more careful literature search. He realized this himself eight years after the original paper was published and wrote a second paper incorporating this point of view. And I thought I was so clever.</p>",
        "id": 362013270,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685385301
    },
    {
        "content": "<p>Spend your time reading literature -&gt; not actually proving theorems -&gt; stress<br>\nSpend your time proving theorems -&gt; you're possibly proving something already known -&gt; stress</p>",
        "id": 362014135,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685385611
    },
    {
        "content": "<p>I understand that it is frustrating. But you can still be happy to have rediscovered this idea by yourself. It means more that you're clever than the contrary! If you continue to think to these matters, next time your ideas will probably be really new!</p>",
        "id": 362017076,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1685386794
    },
    {
        "content": "<p>That's an encouraging perspective. Anyway, I only spent like a day or two thinking about this so this just means all the hard work has been done for me already.</p>",
        "id": 362019100,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685387522
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424412\">Patrick Nicodemus</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/When.20to.20contact.20an.20author.3F/near/362014135\">said</a>:</p>\n<blockquote>\n<p>Spend your time reading literature -&gt; not actually proving theorems -&gt; stress<br>\nSpend your time proving theorems -&gt; you're possibly proving something already known -&gt; stress</p>\n</blockquote>\n<p>I've heard a saying in the empirical sciences that 6 months in the lab is often a great way to save an afternoon in the library.</p>",
        "id": 362025439,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1685390346
    },
    {
        "content": "<p>Hahahaha!<br>\nSo if I'm working on a theorem that is close to / extends something in an existing paper, should I reach out to them and share my result and ask if there are relevant papers on that topic? I guess I am wondering about how much of my results it's appropriate to discuss informally by email with the people who are closest to it before it is in a final state. For example my work is very close to a paper of Michel Hébert from 2011.</p>",
        "id": 362026116,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685390700
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"424412\">Patrick Nicodemus</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/When.20to.20contact.20an.20author.3F/near/362013270\">said</a>:</p>\n<blockquote>\n<p>Lmao never mind. Before hitting send I decided to do a more careful literature search. He realized this himself eight years after the original paper was published and wrote a second paper incorporating this point of view. And I thought I was so clever.</p>\n</blockquote>\n<p>Out of curiosity, what was the observation (if you're happy sharing)?</p>",
        "id": 362029582,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1685392449
    },
    {
        "content": "<p>The definition of \"cofibrantly generated\" that he gives in the 2007 paper \"Cofibrantly generated natural weak factorization systems\" is insufficiently general. <br>\n He gives a better definition in the 2015 paper \"Algebraic weak factorisation systems I: Accessible AWFS\" using double categories, the paper explains pretty well what the improvement is.</p>",
        "id": 362031146,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1685393369
    },
    {
        "content": "<p>In my experience bothering people is always a good idea. Also, the average researcher is usually happy to discuss work with someone else. If you are mailing a Nobel laureate things will probably be different, but for the average researcher in a not-too-mainstream field of math, knowing that someone is really interested in your ideas is a nice ego boost.<br>\nJust make sure that your questions are well formulated tho, otherwise it may feel like you are wasting people time!</p>",
        "id": 362280360,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1685474510
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/266967-general.3A-mathematics/topic/When.20to.20contact.20an.20author.3F/near/362280360\">said</a>:</p>\n<blockquote>\n<p>Just make sure that your questions are well formulated tho, otherwise it may feel like you are wasting people time!</p>\n</blockquote>\n<p>Building on this, I would suggest taking a moment to consider the subject line of the e-mail as well.  I know I typically won't even look at an e-mail from someone I don't recognize if the subject line looks too spammy unless I'm very bored.</p>",
        "id": 362327521,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1685496874
    },
    {
        "content": "<p>I'm not smart or famous or anything near the norm, but I can safely say that half of my production so far is:</p>\n<blockquote>\n<p>I saw this cool thing of yours, I have ideas on how to make it cooler, no precise strategy yet, but let's do it!</p>\n</blockquote>\n<p>...and the other half of my production so far is:</p>\n<blockquote>\n<p>I saw this cool thing of yours, I have ideas on how to make it cooler, no precise strategy yet, but let's do it!</p>\n</blockquote>\n<p>the only difference is that in the first half I was the sender of the message, in the second half the receiver <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 363272327,
        "sender_full_name": "fosco",
        "timestamp": 1685789736
    }
]