[
    {
        "content": "<p>Hello folks: I'm hoping to have discussions with people who have an expansive view on the use of commutative rings, not only classically but also in the past 50 years.  If you are familiar with Harry Hutchins' \"Examples of Commutative rings\" from 1981, he and I are working on new material together, and we're hoping to round out what was missing from the original and what has transpired since 1981.  </p>\n<p>Commutative rings are such a huge subject I think we need advice from a wide audience!</p>\n<p>If you can't lay your hands on \"Examples of Commutative Rings,\" I can easily supply the table of contents and index material here so that you can get an idea of what's inside, and then extrapolate what you think are the omissions.  </p>\n<p>And if it's one of your friends you think I should be talking to, I would appreciate introductions.  Thanks!</p>",
        "id": 555708810,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1763177267
    },
    {
        "content": "<p>I am interested in your project, due to my interest in <em>categorified</em> (semi)rings <a href=\"https://arxiv.org/abs/2103.00938\">https://arxiv.org/abs/2103.00938</a> (ping to <span class=\"user-mention\" data-user-id=\"277611\">@Todd Trimble</span> !)</p>",
        "id": 555725609,
        "sender_full_name": "fosco",
        "timestamp": 1763193673
    },
    {
        "content": "<p>I too have an expansive view on the use of rings and rigs (= semirings) and 2-rigs (= categorified semirings).  This is no coincidence, since both <span class=\"user-mention\" data-user-id=\"282822\">@fosco</span> and I collaborate with Todd Trimble on 2-rigs.</p>",
        "id": 555734957,
        "sender_full_name": "John Baez",
        "timestamp": 1763203534
    },
    {
        "content": "<p>My former student <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> has done some great work on <a href=\"https://ncatlab.org/nlab/show/quantales\">[[quantales]]</a>, which are very nice rigs where the \"addition\" is coproduct - I think <em>Seven Sketches</em> has a nice introduction to quantales, so you may already know about them.   Jade has applied quantales to many things - see this paper, and especially the table on page 4:</p>\n<ul>\n<li>Jade Master, <em><a href=\"https://arxiv.org/abs/2005.06682\">The open algebraic path problem</a></em>.</li>\n</ul>\n<p>The table shows you how useful graphs with edges labeled by elements of a quantale can be!</p>",
        "id": 555735404,
        "sender_full_name": "John Baez",
        "timestamp": 1763203996
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  Years ago I looked into Golan's <em>Semirings and their Applications</em> and Gondran and Minoux's <em>Graphs, Dioids and Semirings: New Models and Algorithms</em> which I think uses quantales.  I wondered how anyone was ever going to make any sense of the latter book, but when I started seeing categorical connections surface in Seven Sketches I was starting to gain hope.</p>",
        "id": 556605783,
        "sender_full_name": "Ryan Schwiebert",
        "timestamp": 1763213453
    },
    {
        "content": "<p>Cool!    I wonder if <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> has read these books!   Her work on the open algebraic path problem essentially describes a very general algorithm for finding shortest paths but also solving many other analogous problems, depending on what quantale you use to label the edge of your graph.  That's what that table on page 4 is all about.</p>",
        "id": 556632950,
        "sender_full_name": "John Baez",
        "timestamp": 1763238865
    }
]