[
    {
        "content": "<p>In his works on polymathematics [1, 2], V.I. Arnold discusses the philosophy of N.V. Bugaev, who distinguished between two fundamental types of mathematics:</p>\n<ol>\n<li>\n<p>Mathematics of Predestination (e.g., Complex Analysis): In this framework, a \"germ\" at a single point (or a Taylor series) determines the entire function via analytic continuation. The local history rigidly constrains the global future.</p>\n</li>\n<li>\n<p>Mathematics of Free Will (e.g., Real Analysis): Here, no such rigid constraint exists; a function can exhibit local behavior without determining its global trajectory.</p>\n</li>\n</ol>\n<p>I am investigating whether F.W. Lawvere's 1984 definition of \"chaos\" [3] provides the precise machinery to formalize this distinction. According to Lawvere, the essence of chaos lies in two features: (i) the surjectivity of an induced map, and (ii) the right adjointness of the inducing process. He proposes the following generalization:</p>\n<p>Definition of a T-Chaotic Observable (Reference [3]): Let Y be a category of spaces (such as topological or differentiable spaces) and T be a monoid representing time. Let X be the category of dynamical systems (denoted as Y^T), consisting of objects from Y equipped with an action of T. An observable map phi: X -&gt; Y is defined as T-chaotic if and only if the induced map phi-bar: X -&gt; H(Y) is an epimorphism.</p>\n<p>(Historical Note: The terminology \"chaotic\" for such \"codiscrete\" objects—where a structural map is an isomorphism or surjection—traces back to Grothendieck's SGA 4 (1972) [4], where it was used in the context of topologies.)</p>\n<p>Meaning of Symbols:<br>\n    X (The Dynamical System): An object in the category Y^T. It represents the actual state space of the system, equipped with a specific T-action that defines how the states evolve over time.<br>\n    Y (The Observable Space): An object in the category Y. It represents a static space of values (without a T-action) that can be measured or observed.<br>\n    phi (The Observable Map): A morphism X -&gt; Y. This map acts as an \"observable of state,\" recording the value of the system at the initial moment (the unit element of time).<br>\n    H(Y) (The Space of All Histories): Also denoted as Y^T, this is the internal function space containing all possible functions from T to Y. It serves as the \"right adjoint\" to the underlying space functor and is equipped with a standard \"shift\" action where the time element translates the function values: (y.t)(s) = y(ts).<br>\n    phi-bar (The Induced Trajectory Map): The unique T-equivariant map X -&gt; H(Y) generated by the adjunction. It maps a specific initial state x to its complete future trajectory (or \"symbolic dynamic\"), which is the function of time giving the progression of observed values.<br>\n    Epimorphism (The Chaos Condition): In categories where epimorphisms are surjective, this condition implies that the map phi-bar is surjective. This means the system is \"chaotic\" because every mathematically possible history (every function in H(Y)) is realized as the actual trajectory of some state x in the system X. For the general notion of epimorphism, see: <a href=\"https://ncatlab.org/nlab/show/epimorphism\">https://ncatlab.org/nlab/show/epimorphism</a></p>\n<p>When applying this definition to the foundations of calculus, Bugaev's philosophical distinction maps perfectly onto Lawvere's categorical framework:</p>\n<ul>\n<li>\n<p>The Real Case is Chaotic (Free Will): Consider the algebra of smooth real functions. The map sending a function to its Taylor series is surjective. This is a consequence of Borel's Theorem, which states that for any arbitrary sequence of real numbers, there exists a smooth function having that sequence as its derivatives. In Lawvere's terms, this surjectivity makes real calculus \"chaotic.\" It possesses \"Free Will\" because the formal symbolic history (the series) does not constrain the existence of the function; any history is realizable.</p>\n</li>\n<li>\n<p>The Complex Case is Non-Chaotic (Predestination): Consider the algebra of holomorphic functions. The map sending a function to its Taylor series is <em>not</em> surjective onto the space of all formal power series; it covers only those series that converge. Because the \"formal\" possibilities are not all realizable, the system is not chaotic. This corresponds to \"Predestination\": the requirement of convergence (and resulting analytic continuation) imposes a rigidity that precludes the chaotic \"freedom\" seen in the real case.</p>\n</li>\n</ul>\n<p>Questions for the Community:</p>\n<ol>\n<li>\n<p>Does Lawvere's generalization of chaos adequately reflect Bugaev's intuition regarding the distinction between predestination and free will in mathematics?</p>\n</li>\n<li>\n<p>If the answer is positive, how might one establish this result in a general setting?</p>\n</li>\n<li>\n<p>If the answer is negative, what counter-examples demonstrate the divergence between these concepts?</p>\n</li>\n</ol>\n<p>Kind regards,</p>\n<p>José Manuel Rodriguez Caballero</p>\n<p>(Université Laval)</p>\n<p>References:</p>\n<p>[1] V.I. Arnold, \"Polymathematics: is mathematics a single science or a set of arts?\", Steklov Mathematics Institute. URL: <a href=\"https://math.ucr.edu/home/baez/Polymath.pdf\">https://math.ucr.edu/home/baez/Polymath.pdf</a></p>\n<p>[2] V.I. Arnold, \"Symplectization, Complexification and Mathematical Trinities\", Fields Institute Communications, 1997. URL: <a href=\"https://webhomes.maths.ed.ac.uk/~v1ranick/papers/arnold4.pdf\">https://webhomes.maths.ed.ac.uk/~v1ranick/papers/arnold4.pdf</a></p>\n<p>[3] F.W. Lawvere, \"Functorial Remarks on the General Concept of Chaos\", IMA Preprint Series # 87, 1984. URL: <a href=\"https://lawverearchives.com/wp-content/uploads/2024/12/1984-functorial-remarks-on-the-general-concept-of-chaos.pdf\">https://lawverearchives.com/wp-content/uploads/2024/12/1984-functorial-remarks-on-the-general-concept-of-chaos.pdf</a></p>\n<p>[4] M. Artin, A. Grothendieck, J. L. Verdier, \"Théorie des Topos et Cohomologie Etale des Schémas (SGA 4)\", Tome 1, Lecture Notes in Mathematics 269, Springer, 1972.<br>\n--</p>\n<p>Supplementary Videos:</p>\n<ul>\n<li>\n<p>Vladimir I. Arnold - Polymathematics: complexification, symplectization and all that (1998 lecture). URL: <a href=\"https://youtu.be/jdD5CTZhjoM?si=h7VFr5BgIiydry5X\">https://youtu.be/jdD5CTZhjoM?si=h7VFr5BgIiydry5X</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"jdD5CTZhjoM\" href=\"https://youtu.be/jdD5CTZhjoM?si=h7VFr5BgIiydry5X\"><img src=\"https://uploads.zulipusercontent.net/18d94f9546cfee403fe2162ad9e11a7d5876c6e1/68747470733a2f2f692e7974696d672e636f6d2f76692f6a64443543545a686a6f4d2f6d7164656661756c742e6a7067\"></a></div></li>\n<li>\n<p>Bill Lawvere on the origin of adjoint functors. URL: <a href=\"https://youtu.be/zXUfABbaOGc?si=mwBh7pLJc3E6uYPJ\">https://youtu.be/zXUfABbaOGc?si=mwBh7pLJc3E6uYPJ</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"zXUfABbaOGc\" href=\"https://youtu.be/zXUfABbaOGc?si=mwBh7pLJc3E6uYPJ\"><img src=\"https://uploads.zulipusercontent.net/da64bc9cded559036178ce4f1c84bc2ae41066b4/68747470733a2f2f692e7974696d672e636f6d2f76692f7a585566414262614f47632f6d7164656661756c742e6a7067\"></a></div></li>\n</ul>",
        "id": 574174487,
        "sender_full_name": "José Manuel Rodríguez Caballero",
        "timestamp": 1771271200
    },
    {
        "content": "<p>Hm. I would have rather said that the determinism of complex analysis were in the <em>injectivity</em> of the Taylor expansion, and the free will of real analysis in its non-injectivity: the behavior of a real smooth function can’t be constrained by the symbolic data. I guess your idea is that real functions are freer in the sequence of choices of derivatives? But in that sense the unfreedom of complex functions only comes when the infinite sequences of choices is completed, not at any stage, which doesn’t sound particularly free to me. I’m a bit dubious about this connection of Lawvere chaos to free will</p>",
        "id": 574178376,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1771273131
    },
    {
        "content": "<p>Lawvere explicitly defines a map as <em>chaotic</em> if and only if the induced map to the space of histories is an epimorphism. He clarifies that in the categories he is discussing, this means the map is surjective. Specifically, he states that an observable is chaotic if every possible sequence of symbols is realized as the trajectory of at least one state in the system.</p>",
        "id": 574181514,
        "sender_full_name": "José Manuel Rodríguez Caballero",
        "timestamp": 1771274796
    },
    {
        "content": "<p>Your focus on injectivity or non-injectivity contradicts the primary example Lawvere uses to illustrate his definition. He analyzes the algebra of smooth functions on a manifold and the map sending a function to its Taylor series. He invokes Borel's theorem, which guarantees that for any formal power series, there exists a smooth function with that series as its expansion. Lawvere concludes that because this map is surjective, the system is chaotic relative to the adjunction. This demonstrates that in his framework, the \"freedom\" or chaos of the system is defined by the capability to realize every formally possible history, which aligns with the surjectivity condition rather than the non-injectivity you suggested.</p>",
        "id": 574181529,
        "sender_full_name": "José Manuel Rodríguez Caballero",
        "timestamp": 1771274806
    },
    {
        "content": "<p>I agree that Lawvere describes real smooth functions as chaotic for the reason you described. I haven't \"contradicted\" anything that Lawvere said that I can see. The effort to map this onto Bugaev appears to be yours, and it's the success of that effort which I was questioning. \"The local history constrains the global future\" clearly sounds more like injectivity than non-surjectivity to me. The latter would be \"not every local history can be realized\", with no implication one way or another with whether those local histories which can be realized fully determine the global future.</p>",
        "id": 574190686,
        "sender_full_name": "Kevin Carlson",
        "timestamp": 1771280617
    },
    {
        "content": "<p>It seems to me that you are effectively describing the same structural reality as Lawvere, but from the opposite end of the adjunction. Lawvere's adjunction relates a static space Y to the dynamic space of all possible histories H(Y)=Y^T over time T.</p>\n<p>You are defining the system by the constraints it imposes on the future (\"The local history constrains the global future\"), specifically, whether a history uniquely determines the state (Injectivity). This is the hallmark of \"Predestination,\" where the rigidity of the space ensures a single path.</p>\n<p>Lawvere, conversely, defines the system by the freedom it allows in the past (\"not every local history can be realized\"), specifically, whether the state space covers all possible symbolic histories (Surjectivity). This is the hallmark of \"Chaos\" or Free Will, where the plasticity of the space ensures that any history is realizable.</p>\n<p>In the \"sister theories\" of Real and Complex analysis that Arnold describes, these are dual properties: the rigid structure that grants your \"Uniqueness\" is exactly what imposes the censorship that destroys Lawvere's \"Existence.\" Lawvere’s definition is simply the positive test for the plasticity required for Free Will.</p>",
        "id": 574201630,
        "sender_full_name": "José Manuel Rodríguez Caballero",
        "timestamp": 1771289201
    }
]