[
    {
        "content": "<p>Are there any good surveys on subcanonical Grothendieck topologies, coverages and sites in Sheaf Theory? Looking for things like operations that can produce one subcanonical site from another, or sufficient (but possibly not necessary) conditions for proving subcanonicity.</p>\n<p>E.g. in the Elephant they say that the slice of a subcanonical site is also subcanonical, and I'm looking for more properties like this.</p>",
        "id": 397675747,
        "sender_full_name": "Joey Eremondi",
        "timestamp": 1697796737
    },
    {
        "content": "<p>These notes by Angelo Vistoli contain a good amount of information on Grothendieck topologies. I don't know how much on subcanonical sites specifically. <br>\n<a href=\"https://arxiv.org/abs/math/0412512\">https://arxiv.org/abs/math/0412512</a></p>",
        "id": 397895584,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1697939893
    },
    {
        "content": "<p>I'm not aware of a survey. There are people that prefer to work on general sites, such as <span class=\"user-mention\" data-user-id=\"284392\">@Olivia Caramello</span>, since it avoids having to check subcanonicity, see her paper <a href=\"https://arxiv.org/pdf/1906.08737.pdf\">here</a> for example. You can always complete a site to a subcanonical one by extracting the full subcategory of the category of sheaves on the representable ones, and that paper of Caramello's also enables you to explicitly compute that in terms of sieves in the site (if you really want to).</p>\n<p>If you really want to work with subcanonical sites, you can of course take any Grothendieck topology contained in a subcanonical topology and produce a new subcanonical site. More generally, if you take any full subcategory and retain only (some of the) covering sieves which are generated by families of morphisms in that subcategory, you again get a subcanonical site.</p>\n<p>Disjoint unions of subcanonical sites are not necessarily subcanonical (consider empty sieves), and products fail to be for a similar reason. That said, if you restrict your sieves a little and consider sub<em>dense</em> subcanonical sites you might be able to avoid those issues - I won't check myself right now since I don't know what you're looking for exactly.</p>",
        "id": 397933312,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1697970281
    },
    {
        "content": "<p>If you have a super(<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>κ</mi></mrow><annotation encoding=\"application/x-tex\">\\kappa</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">κ</span></span></span></span>-)extensive pretopology, you can form the unary pretopology by taking the coproduct of the maps in a covering family, assuming the families are <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>κ</mi></mrow><annotation encoding=\"application/x-tex\">\\kappa</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">κ</span></span></span></span>-small. This preserves subcanonicity.</p>",
        "id": 397938643,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1697975183
    }
]