[
    {
        "content": "<p>Hi,</p>\n<p>I'm defining an algebraic structure in terms of a set some functions on that set, and some added constraints that must hold for those functions. Is there a way to translate this into a functor from some index category into Set? </p>\n<p>In my example,  I start by defining the category of free monoids with 3 generators by taking an index category that has three freely composing non-identity arrows, and taking all functors from this category into Set. However, I want to get a sub-category of this, which has a few additional constrains. For example,  if we call the endofunctions f, g, and h, I want to say that if an element is fixed under f and g i.e., if f(x) = g(x) = x , then h(x) must be a special element p. In addition, I want to say that there are three distinct special elements {a,b,c} in the monoid's underlying set, which are such that for all elements x, h(x) is not an element of {a,b,c}. </p>\n<p>I know there is probably some super general/abstract way to do this in general using Yoneda's lemma and such, but I'm wondering if there is a more concrete way to think about this for simple definitions like the example I gave.</p>",
        "id": 233492599,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1617804116
    },
    {
        "content": "<p>Perhaps Lawvere theories are what you're looking for?</p>",
        "id": 233493053,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1617804250
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Encoding.20algebraic.20constrains.20as.20functors/near/233493053\">said</a>:</p>\n<blockquote>\n<p>Perhaps Lawvere theories are what you're looking for?</p>\n</blockquote>\n<p>Do you know of an accessible introduction to this?</p>",
        "id": 233493985,
        "sender_full_name": "Avi Craimer",
        "timestamp": 1617804549
    },
    {
        "content": "<p><a href=\"https://perso.uclouvain.be/enrico.vitale/gab_CUP2.pdf\">Algebraic Theories: A Categorical Introduction to General Algebra</a> is very good.</p>",
        "id": 233496150,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1617805311
    },
    {
        "content": "<p>If you want something slightly easier and which also deals with the monad approach to universal algebra, you could take a look at Manes' book 'Algebraic Theories'</p>",
        "id": 233497372,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1617805687
    }
]