[
    {
        "content": "<p>The principle of equivalence advocates (among other things) to avoid talking about equality between objects of a category. For instance, mostly the notion of equivalence between categories is more useful than the notion of isomorphism between categories, because the latter demands a strict bijection between the classes of objects, while the former only demands a bijection between the isomorphism classes of objects.</p>\n<p>The nLab has material about this principle of equivalence and breaking this principle is often referred to as being evil.</p>\n<p>I'm wondering why considering (strict) 2-categories and proving coherence theorems like \"every bicategory is biequivalent to a 2-category\" isn't evil. After all, when checking whether a bicategory is strict (i.e., a \"2-category\"), one needs (e.g., in the axiom of associativity of composition) to verify that two 1-cells are equal. And 1-cells are just objects of a hom-category, so here one talks about equality of objects.</p>\n<p>One justification could be: one defines \"category\" (\"bicategory\") in such a way that the class of objects (1-cells) explicitly comes equipped with an equivalence relation that is then called \"equality\". In this way, talking about 2-categories and coherence theorems doesn't break the principle of equivalence, while stating for example \"Cat is a 2-category\" does.</p>\n<p>Somehow this answer doesn't satisfy me completely. If one is just interested in the notion of a bicategory that doesn't come equipped with an equality relation, why should one nevertheless study bicategories that are equipped with an equality relation? Does this help with studying bicategories without equality at all? Note that then \"every bicategory is biequivalent to a 2-category\" isn't even a meaningful statement.</p>\n<p>Can one motivate coherence theorems for structuralists only interested in bicategories without equality?</p>",
        "id": 236990470,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1619894918
    },
    {
        "content": "<blockquote>\n<p>I'm wondering why considering (strict) 2-categories and proving coherence theorems like \"every bicategory is biequivalent to a 2-category\" isn't evil. </p>\n</blockquote>\n<p>It's evil.  But sometimes it pays to be evil.  <span aria-label=\"smiling devil\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling devil\">:smiling_devil:</span></p>",
        "id": 237008960,
        "sender_full_name": "John Baez",
        "timestamp": 1619911198
    },
    {
        "content": "<p>This sort of thing is one reason we got rid of the term \"evil\".</p>",
        "id": 237010327,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1619912563
    },
    {
        "content": "<p>Strictification theorems are, almost by definition, not equivalence-invariant.  They are nevertheless extraordinarily useful.  However, there are times when one has to work totally invariantly, and then such strictification theorems are not available.</p>",
        "id": 237010358,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1619912636
    },
    {
        "content": "<p>Note though that not every coherence theorem is, or gives rise to, a strictification theorem, and these more general kinds of coherence theorems can still be useful in an equivalence-invariant context.</p>",
        "id": 237010449,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1619912719
    }
]