[
    {
        "content": "<p>THE FOLLOWING IS THE ABSTRACT OF A (draft) 70 PAGE RESEARCH REPORT, \"Microlectics, Mathematics, and Life.\"</p>\n<p>Microlectics is a specialized language - a \"microlect\" - for expressing an intuitive model of specialized languages for expressing intuitive models. The proposal is a mathematical theory  combining observation of \"real\" patterns with invention of \"imaginary\" patterns of chunks - things or beings, and overt (e.g., conscious thought) and covert (e.g., dance) behavioral-patterns of beings. It introduces a spectrum of microlects, from poetry to philosophy to mathematics to code, for expressing intuitive models in minds of beings. Intuitive models resonate more or less, and resonances are invoked by encounters between things and beings and between beings and beings. The mathematical tool is a multi-dimensional linguistic topos. The objects are situations and the morphisms are events with propensities defined by probability and time. Stories are chains of situations and events conforming to a pattern (of things) or behavioral pattern (of beings). The algebro-diagrammatic microlect of the linguistic topos is a framework for expressing Five Laws of Biology, including formalized statements of the meaning and purpose of Life. The result is a contribution to the mathematical philosophy of biology.</p>\n<p>behavior, being , encounter,  event, intuitive-model, intuitive-resonance,  Life,  linguistic topos, microlect, pattern, propensity, situation, thing</p>",
        "id": 294149231,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660848685
    },
    {
        "content": "<ol>\n<li>Would this fit better in <a class=\"stream\" data-stream-id=\"258900\" href=\"/#narrow/stream/258900-practice.3A-our-papers\">#practice: our papers</a>? </li>\n<li>What is a \"multi-dimensional linguistic topos\"?</li>\n<li>What are the Five Laws of Biology, and would a biologist acknowledge them?</li>\n</ol>",
        "id": 294212800,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1660892867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> </p>\n<ol>\n<li>No, it stands alone.</li>\n<li>\"Linguistic topos\" is defined by J. L. Bell. (\"Every topos is equivalent to a linguistic topos,\" in \"Toposes and Local Set Theories,\" p. 105)\"Multi-dimensional\" renames his \"ground-type symbols\" merely for clarity of exposition.</li>\n<li>Yes, a biologist would agree, for example, that \"all living things have DNA\" as a universal truth of biology. Also, for example, that \"all living things die.\" One of the proposed \"laws\" may be controversial, as it asserts that multiple-realizability (sufficiently qualified) implies strong emergence.</li>\n</ol>",
        "id": 294238848,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660906072
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/stream.20events/near/294238848\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> </p>\n<ol start=\"3\">\n<li>Yes, a biologist would agree, for example, that \"all living things have DNA\" as a universal truth of biology. Also, for example, that \"all living things die.\" One of the proposed \"laws\" may be controversial, as it asserts that multiple-realizability (sufficiently qualified) implies strong emergence.</li>\n</ol>\n</blockquote>\n<p>\"All living things have DNA\" seems not a universal truth for any reasonable definitions of \"living\" and \"thing\". Can you elaborate? Curious to know about these Five Laws of Biology.</p>",
        "id": 294239872,
        "sender_full_name": "Carlos Zapata-Carratala",
        "timestamp": 1660906488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"407556\">@Carlos Zapata-Carratala</span> <br>\nThat \"law\" about DNA is an assertion by Stephen J. Gould in \"The Book of Life.\"</p>",
        "id": 294240345,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660906689
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/stream.20events/near/294240345\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"407556\">Carlos Zapata-Carratala</span> <br>\nThat \"law\" about DNA is an assertion by Stephen J. Gould in \"The Book of Life.\"</p>\n</blockquote>\n<p>Sounds to me like a rather questionable assertion in the light of modern theories of the origin of life (particularly the RNA world hypothesis). Could you state the Five Laws of Biology? A quick google search didn't produce anything concrete...</p>",
        "id": 294241423,
        "sender_full_name": "Carlos Zapata-Carratala",
        "timestamp": 1660907148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"407556\">@Carlos Zapata-Carratala</span> <br>\nThis list is an original idea. All quotation of any part or all of these \"Laws\" must acknowledge that I wrote them. They have algebro-diagrammatic representation in a multi-dimensional linguistic topos.</p>\n<ol start=\"0\">\n<li>Life is all beings. 1. Life must persist. 2 Every being dies. 3. The development of every being is determined by a DNA molecule. 4. Multiple realizability is ubiquitous in Life and implies strong-emergence of purpose.</li>\n</ol>",
        "id": 294243492,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660907984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/stream.20events/near/294238848\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> </p>\n<ol>\n<li>No, it stands alone.</li>\n<li>\"Linguistic topos\" is defined by J. L. Bell. (\"Every topos is equivalent to a linguistic topos,\" in \"Toposes and Local Set Theories,\" p. 105)\"Multi-dimensional\" renames his \"ground-type symbols\" merely for clarity of exposition.</li>\n<li>Yes, a biologist would agree, for example, that \"all living things have DNA\" as a universal truth of biology. Also, for example, that \"all living things die.\" One of the proposed \"laws\" may be controversial, as it asserts that multiple-realizability (sufficiently qualified) implies strong emergence.</li>\n</ol>\n</blockquote>\n<ol>\n<li>It seems to me that this is an article that you have written, which is why I suggested a topic in an existing stream rather than a standalone stream.</li>\n<li>Since you haven't linked to/shared the report, it's not clear to me how the structure of a topos is involved, why it matters that it's a linguistic topos (do you construct the topos that way?) or how describing \"multiple dimensions\" makes the categorical structure clearer. I'm curious, though. Would you like to share more detail?</li>\n</ol>\n<p>3a. Is the assertion \"Life is all beings\" a semantic claim (that is, defining life to correspond to the collection of all \"beings\") or a claim of a different sort? What are \"beings\"?<br>\n3b. In what sense \"must\" life persist? Is this a claim about the definition, that something must exist for a certain period of time in order to count as life, or another type of claim?<br>\n3c. Is death also a clearly defined notion?<br>\n3d. Are you arguing for biological determinism in this statement, or something less strong?<br>\n3e. What are \"multiple realizibility\" and \"strong-emergence of purpose\"?</p>",
        "id": 294245579,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1660908768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> </p>\n<ol>\n<li>The research report is less than a rough draft, although all the content is in it. I am holding off on refining it into something that can be submitted, but it it is quite long already. If I had a Supplementary Materials section it would be even longer. So, I posted the abstract here to \"take the temperature\" in the community with which I most identify.</li>\n<li>After a bit more feedback on the abstract, and the very helpful postings coming in here, I will start the refinement. As for \"share more detail,\" I need to find out the best way to publish (ArXiv? Synthese? Axiomathes?...)<br>\n3a. It is not a definition, it is an axiom. Yes, Life is the collection of all beings throughout all time on Earth. \"Beings\" is an \"undefined term,\" and are distinct from \"things,\" also an undefined term. Both are macroscopic \"chunks\" of \"matter.\"<br>\n3b. It is a probabilistic axiom expressed in a topos with a natural numbers object, and (with a certain assumption, Dedekind) real numbers.<br>\n3c. Yes.<br>\n3d. The axiom expresses a widely shared intuitive-model. Like, e.g., \"two distinct points determine a line.\"<br>\n3e. See multiple papers by G. F. R. Ellis. There is a reason I call this \"mathematical philosophy,\" not mathematics.</li>\n</ol>",
        "id": 294261022,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660914381
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/Microlectics.2C.20Mathematics.2C.20and.20Life/near/294261022\">said</a>:</p>\n<blockquote>\n<ol start=\"2\">\n<li>After a bit more feedback on the abstract, and the very helpful postings coming in here, I will start the refinement. As for \"share more detail,\" I need to find out the best way to publish (ArXiv? Synthese? Axiomathes?...)</li>\n</ol>\n</blockquote>\n<p>I haven't suggested refinements yet, I'm still trying to understand what your draft is about!</p>\n<blockquote>\n<p>3a. It is not a definition, it is an axiom. Yes, Life is the collection of all beings throughout all time on Earth. \"Beings\" is an \"undefined term,\" and are distinct from \"things,\" also an undefined term. Both are macroscopic \"chunks\" of \"matter.\"<br>\n3b. It is a probabilistic axiom expressed in a topos with a natural numbers object, and (with a certain assumption, Dedekind) real numbers.<br>\n3c. Yes.<br>\n3d. The axiom expresses a widely shared intuitive-model. Like, e.g., \"two distinct points determine a line.\"<br>\n3e. See multiple papers by G. F. R. Ellis. There is a reason I call this \"mathematical philosophy,\" not mathematics.</p>\n</blockquote>\n<p>Beware of premature axiomatization.<br>\n3a. This distinction is rather mysterious. If you're asserting that Life \"is\" this collection of \"beings\", surely its properties must be determined by the properties of that collection. In other words, this amounts to a definition. Or are you saying that Life <em>includes</em> those beings but also includes some further structure?<br>\n3b. What is the axiom?<br>\n3c. What is the definition of death, then?<br>\n3d. I don't think there is a widely shared intuition that \"The development of every being is determined by a DNA molecule\". Many conditions external to the molecule are involved in the development of (what I intuitively understand by) a being.<br>\n3e. Unfortunately, G.F.R. Ellis' work is similarly inaccessible... Do you have a link to a non-paywalled pdf of his work somewhere, by any chance? Or perhaps you could explain these terms here?</p>",
        "id": 294279721,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1660919942
    },
    {
        "content": "<p>Officially (i.e., in the draft research report) I call them \"Laws\" not axioms. They are intended roughly to be to biology what the \"laws\" of thermodynamics are to thermodynamics. That is to say, widely understood, widely misunderstood, widely discussed, and extremely important.<br>\n 3a. Just like the laws of thermodynamics in some sense \"define\" thermodynamics, so my idea is a \"definition\" of biology.<br>\n3b. Informally, every being has a positive probability (not a certainty) of reproducing. That depends on the situation (formally defined in the topos as a pointed object in a topos of pointed objects (cf. Freyd).<br>\n3c. A situation in which a being has no propensity (formally defined in the topos) of continuing being a being.<br>\n3d. That \"law\" about DNA is just a quote from \"A Book of Life\" edited by Stephen Jay Gould. \"Gould spent most of his career teaching at Harvard University and working at the American Museum of Natural History in New York. In 1996, Gould was hired as the Vincent Astor Visiting Research Professor of Biology at New York University, after which he divided his time teaching between there and Harvard.\" (Wikipedia) That is good enough for me until further notice.<br>\n3e. A small collection of my references is available for download at <a href=\"http://www.cognocity.org/circularchy/ELLIS-TROIKA-H.pdf\">http://www.cognocity.org/circularchy/ELLIS-TROIKA-H.pdf</a>   .<br>\nPage 148 (out of 331) by G. F. R. Ellis should  be helpful.</p>",
        "id": 294288981,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660922808
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/Microlectics.2C.20Mathematics.2C.20and.20Life/near/294288981\">said</a>:</p>\n<blockquote>\n<p>Officially (i.e., in the draft research report) I call them \"Laws\" not axioms. They are intended roughly to be to biology what the \"laws\" of thermodynamics are to thermodynamics. That is to say, widely understood, widely misunderstood, widely discussed, and extremely important.</p>\n</blockquote>\n<p>You want your work to be \"widely misunderstood\"..? <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span><br>\nWhat makes/will make your laws important?</p>\n<blockquote>\n<p>3a. Just like the laws of thermodynamics in some sense \"define\" thermodynamics, so my idea is a \"definition\" of biology.</p>\n</blockquote>\n<p>That's a nice analogy, but unlike in thermodynamics, I get the impression that biologists already have a solid idea of what their work applies to without someone introducing laws to delineate it. So what do you imagine biologists (or even philosophers of biology) getting out of your laws?</p>\n<blockquote>\n<p>3b. Informally, every being has a positive probability (not a certainty) of reproducing. That depends on the situation (formally defined in the topos as a pointed object in a topos of pointed objects (cf. Freyd).</p>\n</blockquote>\n<p>Is this the case for all \"beings\" you expect the laws to apply to?</p>\n<blockquote>\n<p>3d. That \"law\" about DNA is just a quote from \"A Book of Life\" edited by Stephen Jay Gould. \"Gould spent most of his career teaching at Harvard University and working at the American Museum of Natural History in New York. In 1996, Gould was hired as the Vincent Astor Visiting Research Professor of Biology at New York University, after which he divided his time teaching between there and Harvard.\" (Wikipedia) That is good enough for me until further notice.</p>\n</blockquote>\n<p>That is an explicit appeal to authority with no actual argument attached. Are you just including this law in your list because someone influential wrote it in a book?</p>\n<blockquote>\n<p>3e. A small collection of my references is available for download at <a href=\"http://www.cognocity.org/circularchy/ELLIS-TROIKA-H.pdf\">http://www.cognocity.org/circularchy/ELLIS-TROIKA-H.pdf</a>   .<br>\nPage 148 (out of 331) by G. F. R. Ellis should  be helpful.</p>\n</blockquote>\n<p>Thanks for the reference material! Now I've read enough to understand the principles you mention; to save anyone else from searching, my quick summary is that \"strong emergence\" refers to phenomena which cannot be explained 'even in principle' in terms of lower level phenomena, and that G.F.R. Ellis argues that strongly emergent phenomena exist as a result of \"multiple realizability\", that the same high-level phenomenon can be produced in many ways from lower-level phenomena.</p>\n<p>I personally find Ellis' analysis (on page 148 of the pdf you linked, say) self-defeating, but at least I understand more of the words now. Does \"purpose\" refer to the distinction between biology and physics that Ellis and Kopel make on page 126 of the pdf you shared?</p>",
        "id": 294322203,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1660927271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\nNo, my ambition is to do something as important as thermodynamics. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> </p>\n<p>I believe that Darwin's principles of evolution are formally derivable from my \"Laws\" of biology. Theoretical biologists and philosophers of biology are not adequately acquainted with mathematical frameworks that can express intuitive-models of autopoiesis, closure of constraints, and multiple time-scales. My framework does that. In other words, part of my audience is not experimental biologists per se, but mathematical biologists, theoretical biologists, and philosophers of biology.<br>\n3b. Yes. The \"laws\" apply to Life as a whole.<br>\n3d. Yes, citing an authority on anything is an appeal to authority. If I quote John Bell on the statement of a theorem and cite him for the proof, that is an explicit appeal to his authority as a well-known and highly-regarded category theorist. Same goes for Gould.  Every standard textbook on biology puts DNA at the foundation of molecular biology. It is called something like the \"standard dogma of molecular biology.\" It is NOT enough, so is just one of my five \"laws\". Molecular biologists hardly talk about Life in its entirety, as I do. Systems biologists (with one of whom I have been collaborating for over a year) do not mention DNA much. Actually, not at all. My research report is a few steps above systems biology and molecular biology.</p>\n<p>Quoting myself, \"Beings are the meaning of Life and the purpose of Life is more beings.\" The words \"being,\" \"meaning,\" and \"purpose\" and \"more\" are technically defined in my framework. The word \"Life\" refers to all beings, for all time. </p>\n<p>I found G. F. R. Ellis writings to be quite thought-provoking, especially his discussions of multiple-realizability, and the physics and biology to which he refers. I am particularly happy to see his arguments against the entire life-work of Kim, which voluminously argues against downward causation. Then again, the more I read G. F. R. Ellis I feel that his \"argument\" to get from multiple-realizability to strong-emergence begs the question. But it IS widely demonstrable in biology, including neuro-biology (Edelman's \"degeneracy\" is an example of multiple-realizability; see the MES work of Andree Ehresmann).</p>\n<p>In my framework there are two kinds of chunks of matter. The beings and the things. Things have patterns, beings have behavioral-patterns. For example, things do not reproduce, beings do. To me the being-thing distinction is utterly fundamental, and far more meaningful than the mind-body distinction, or the fact-value distinction, or the materialism-idealism distinction, and the like. When a being dies it becomes a thing. There is a technical definition of that transition in my framework.</p>",
        "id": 294351647,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660938333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-MATHEMATICAL-PHILOSOPHY-OF-BIOLOGY/topic/Microlectics.2C.20Mathematics.2C.20and.20Life/near/294351647\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <br>\nNo, my ambition is to do something as important as thermodynamics. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> I believe that Darwin's principles of evolution are formally derivable from my \"Laws\" of biology. Theoretical biologists and philosophers of biology are not adequately acquainted with mathematical frameworks that can express intuitive-models of autopoiesis, closure of constraints, and multiple time-scales. My framework does that. In other words, part of my audience is not experimental biologists per se, but mathematical biologists, theoretical biologists, and philosophers of biology.</p>\n</blockquote>\n<p>Certainly sounds ambitious. I'll reserve judgement for the time being, then.</p>\n<blockquote>\n<p>3b. Yes. The \"laws\" apply to Life as a whole.</p>\n</blockquote>\n<p>I asked because it seems to me that there are individuals who are incapable of reproduction for a variety of reasons, and counterintuitive that this fact should disqualify them from being-hood.</p>\n<blockquote>\n<p>3d. Yes, citing an authority on anything is an appeal to authority. If I quote John Bell on the statement of a theorem and cite him for the proof, that is an explicit appeal to his authority as a well-known and highly-regarded category theorist.</p>\n</blockquote>\n<p>Absolutely not. A citation is a reference to an argument that someone else has proposed. If you cite John Bell's proof, I can in principle verify that proof for myself if I am so inclined, and dismiss it if I find it contains an error, irrespective of Bell's standing. You have made clear that your five Laws are your original creation, so there is no way that Gould could have proposed an argument for this particular one to feature among them; it's that argument I was after. Fortunately you have outlined one after all:</p>\n<blockquote>\n<p>Every standard textbook on biology puts DNA at the foundation of molecular biology. It is called something like the \"standard dogma of molecular biology.\" It is NOT enough, so is just one of my five \"laws\".</p>\n</blockquote>\n<p>It certainly is true that DNA is important in biology. But I was questioning the \"development\" being \"determined\" by a (single?) DNA molecule. Perhaps I'm just reading too much into the wording you've presented.</p>\n<blockquote>\n<p>Then again, the more I read G. F. R. Ellis I feel that his \"argument\" to get from multiple-realizability to strong-emergence begs the question. But it IS widely demonstrable in biology, including neuro-biology (Edelman's \"degeneracy\" is an example of multiple-realizability; see the MES work of Andree Ehresmann).</p>\n</blockquote>\n<p>This seems like a good topic for a separate discussion, as does this:</p>\n<blockquote>\n<p>In my framework there are two kinds of chunks of matter. The beings and the things. To me the being-thing distinction is utterly fundamental.</p>\n</blockquote>\n<p>...but it looks like understanding these things will require a lot more effort on my part, so perhaps I'll wait and see if those discussions arise organically.</p>",
        "id": 294363441,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1660943481
    },
    {
        "content": "<p>A behavioral pattern of a being is a directed-graph of events (morphisms) in a topos of situations (objects). The topos is generated by \"dimensions,\" i.e., ground-symbol types in Bell's terminology. These include, e.g., time and space and any other kind of values needed for expressing an intuitive-model. A situation is basically a point in a finite product of dimensions, so could include the positions, orientations, and shapes of chunks of matter. Chunks could be things, or they could be beings. The topos is equipped with additional structure, including enough for a real numbers object, and its unit interval. That provides enough formulas for stochastic processes to be defined. In particular, each event has a \"propensity\" leading from the domain situation to the codomain situation with a certain probability in a certain amount of time. (This is enough for a categorical generalization of the Gillespie Stochastic Simulation Algorithm.) That is called a propensity. In other words, every situation has a propensity to transition to some subsequent situation.  What makes a being a being and not a thing is that beings have a non-zero probability (but no guarantee) of reproducing. Reproduction is the result of breaking bonds between chunks (e.g., cutting the umbilical cord). Development (e.g., the Life Cycle) is determined by DNA, in the sense that all the macromolecules in a being are generated according to the genotype. The events in a behavioral pattern are called its \"means.\" Beings are the meaning of Life, and the purpose of Life is more beings. </p>\n<p>Let me know if anyone would like to download the glossary (4 pages) of the draft research report , \"Microlectics, Mathematics, and Life.\" Microlectics and the intuitive-model it expresses requires some mastery of its microlect, hence the glossary.</p>",
        "id": 294431550,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660996736
    },
    {
        "content": "<p>Theorem. If Life is all beings, and Life must persist, and all beings die, and the physical development of a being is determined by a particular DNA macromolecule, then there exists Darwinian Evolution of beings (blind variation, selective retention, and reproduction).</p>\n<p>Proof. FIRST TRY. If there must be beings, and all beings die, then beings must replicate. The probability of replicating could be thwarted by the situation. For example, situations resulting from encounters of beings with other chunks (especially other beings). The more beings, the more encounters. Yet Life must keep going, so different variations of the same starting DNA are more or less selected for reproduction. It is not only that Life must keep going, it must keep going in any way it can. Different kinds of beings result from the different ways. More encounters with more different kinds of beings (and things) select for greater complexity of intuitive-models in minds of beings, and hence of their expression. (Did dance predate speech in some way?) End FIRST TRY.</p>\n<p>Today we have macrolects (i.e., natural language) and microlects (specialized key-terms plus special-symbols plus special equations or diagrams). Mathematical-microlects include proofs. Formal-microlects are without inference-rules. Symbolic-microlects are verbal-microlects plus special symbols. Verbal-microlelcts are sub-languages of macrolects, plus key-term declarations. Then, there are diagrammatic- microlects, and there are behavioral-microlects (e.g., dance styles such as rhumba and flamenco,...; e.g., sports,...; e.g., laboratory protocols;...).</p>\n<p>SECOND TRY. The assumption that Life is infinite while beings are finite, implies that somehow new beings are created. One way would be that they come out of thin air. Another way, the preferred way to think about it, is that somehow one being becomes two beings by breaking physical bonds. This is preferred because here we are in that way. Every kind of Life can occur, modulo fatalities due to encounters. The more kinds of Life there are, the more varied are the encounters. Hence, the evolution of complex Life. So complex, indeed, that it can resonate with the intuitive-model expressed by what you are reading in its verbal-microlect. End SECOND TRY.</p>\n<p>Whether there is or could be a physical theory that predicts that Life according to the postulates (or \"Laws\") predicated herein, is a hard question. That goes to the questions of \"reductionism.\"</p>\n<p>Another question is whether morality of some kind is derivable from postulating only that Life must persist even though beings are finite. Is it enough to say that whatever thwarts Life on the whole is \"bad,\" and that whatever enhances Life on the whole is \"good\"? How could one tell the good from the bad from such a view of Life, which is on time-scales from the cosmological to the macromolecular? Perhaps the best one can do is make guesses based on using a major part of one's finite being to learn as much as possible about Life as a whole. The more intuitive-models, the wider the options for expressing oneself.</p>",
        "id": 294540732,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661086277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-theory.3A-biology/topic/microlectics.2C.20mathematics.2C.20and.20life/near/294540732\">said</a>:</p>\n<blockquote>\n<p>Proof. FIRST TRY. If there must be beings, and all beings die, then beings must replicate. </p>\n<p>SECOND TRY. The assumption that Life is infinite while beings are finite, implies that somehow new beings are created. One way would be that they come out of thin air. Another way, the preferred way to think about it, is that somehow one being becomes two beings by breaking physical bonds. This is preferred because here we are in that way.</p>\n</blockquote>\n<p>This isn't how proof works. Observing that \"we are in that way\" or that one option is \"preferred\" doesn't cut it; you have to incorporate that constraint into your assumptions in order to rule out the others. How have you eliminated the possibility that beings are spontaneously created? If there was a first being, how did it arise other than spontaneous creation?</p>\n<p>You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.</p>",
        "id": 294543095,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661087714
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\n&lt;&lt;Observing that \"we are in that way\" or that one option is \"preferred\" doesn't cut it; you have to incorporate that constraint into your assumptions in order to rule out the others.&gt; &gt;</p>\n<p>Fine, thank you, that rhetorical, facetious flourish should and shall be removed with prejudice.</p>\n<p>&lt;&lt;How have you eliminated the possibility that beings are spontaneously created? &gt;&gt;</p>\n<p>The way I am proceeding is inspired by Imre Lakatos. \"Imre Lakatos’ influential essay Proofs and Refutations. It’s written as a dialogue between fictional students and teacher, as they discover and prove (and disprove?) Euler’s V − E + F = 2 formula ... One of Lakatos’ goals in writing this dialogue was to argue that mathematics is a dynamic process and that proofs and discoveries are not final, immutable, bulletproof kernels of truth. Mathematics proceeds through a dialogue.\" (<a href=\"https://math.berkeley.edu/~kpmann/Lakatos.pdf\">https://math.berkeley.edu/~kpmann/Lakatos.pdf</a>)</p>\n<p>My postulates are supposed to express an intuitive-model of Life as a whole. It is obvious to me that \"spontaneous generation\" is a non-starter. It is also obvious to me that I had parents and that I am a parent. And that every being I ever heard of was and is and will be like that. Some postulates are supposed to (ultimately formally) express the obvious. Like, \"two distinct points determine a straight line\" in Hilbert's axiomatization of Euclidean geometry. He didn't have to eliminate the possibility that one point determines a straight line. Then again, the parallel postulate has not been so obvious, but it is a really good assumption for many deductions. Nor is my \"law\" that \"multiple-realizability is ubiquitous in Life and implies strong-emergence of purpose\" at all obvious, even if one had careful definitions of the key-terms (as yet there is no mathematical-microlect in which those key-terms are well-defined, but that is one objective of my work).</p>\n<p>&lt;&lt;If there was a first being, how did it arise other than spontaneous creation?&gt;&gt;<br>\nThe \"laws\" I propose are not about origins but about what is. Life is all beings, however it started. The axioms that define a topos, for example, tell you nothing about a \"first topos.\"</p>\n<p>&lt;&lt;You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.&gt;&gt;</p>\n<p>Right. How about this: \"In any finite interval of time there are at most a finite number of beings.\"</p>",
        "id": 294564018,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661100742
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-theory.3A-biology/topic/microlectics.2C.20mathematics.2C.20and.20life/near/294564018\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>How have you eliminated the possibility that beings are spontaneously created?</p>\n</blockquote>\n<p>The way I am proceeding is inspired by Imre Lakatos’ influential essay Proofs and Refutations.</p>\n</blockquote>\n<p>I like that dialogue very much, and I am happy to act as the students do in attacking your attempts at proof. On the other hand, I do not like the teacher's identification of the term \"proof\" with \"thought experiment\". The standard for proofs has been raised to a demand of rigour in the time since Cauchy's \"proof\" of Euler's formula in the 19th century.</p>\n<blockquote>\n<p>My postulates are supposed to express an intuitive-model of Life as a whole. It is obvious to me that \"spontaneous generation\" is a non-starter. It is also obvious to me that I had parents and that I am a parent. And that every being I ever heard of was and is and will be like that. Some postulates are supposed to (ultimately formally) express the obvious. Like, \"two distinct points determine a straight line\" in Hilbert's axiomatization of Euclidean geometry. He didn't have to eliminate the possibility that one point determines a straight line.</p>\n</blockquote>\n<p>If these things are obvious to you, why do they not feature in your laws? All results of Euclidean geometry can be proved from Hilbert's axioms with no supplementary assertions of what is \"obvious\". One <em>can</em> eliminate using Hilbert's axioms the possibility that there is some point which lies on a unique line (which I presume is what you mean by \"determines\").</p>\n<blockquote>\n<p>Then again, the parallel postulate has not been so obvious, but it is a really good assumption for many deductions. Nor is my \"law\" that \"multiple-realizability is ubiquitous in Life and implies strong-emergence of purpose\" at all obvious, even if one had careful definitions of the key-terms (as yet there is no mathematical-microlect in which those key-terms are well-defined, but that is one objective of my work).</p>\n</blockquote>\n<p>The parallel postulate is \"obvious\" for an axiomatization that is intended to abstract plane geometry; it's just an observation about how lines behave in the plane. What's not obvious is that it is independent (not derivable from) the other axioms, and it took the discovery of other geometries to realize that. Your fifth law, on the other hand, doesn't seem like an intuitive property of life; it even seems superficially like a very strong assumption about the nature of life.</p>\n<blockquote>\n<blockquote>\n<p>If there was a first being, how did it arise other than spontaneous creation?</p>\n</blockquote>\n<p>The \"laws\" I propose are not about origins but about what is. Life is all beings, however it started. The axioms that define a topos, for example, tell you nothing about a \"first topos.\"</p>\n</blockquote>\n<p>Are you proposing that life has existed for all of time? If so, I expect this will be disputed. If not, then at some point in time, life was spontaneously created (replication not being an option). Given this initial case, how can you eliminate the possibility that this spontaneous creation event isn't still happening periodically? For example, if a scientist designs a strand of DNA, builds it and generates an organism from it, that organism has no parents. Is it not a being, then?<br>\nYou claim to be building a theory of biology, a scientific theory, so your ideas should correspond to reality (which is the source of your intuition about life, after all). Topos theory is not held to the same expectations of corresponding to reality.</p>\n<blockquote>\n<blockquote>\n<p>You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.</p>\n</blockquote>\n<p>Right. How about this: \"In any finite interval of time there are at most a finite number of beings.\"</p>\n</blockquote>\n<p>Will this be your sixth law?</p>",
        "id": 294627830,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661156885
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\nMany thanks, Sir, for participating in this dialogue.<br>\nTHIRD TRY:</p>\n<p>World is a mathematical-structure with DATA: the set of all things, and the set of all encounters between things, in spacetime. CONDITIONS: (W1) The beginning of Life, i.e., creation of the first-beings, results from bond-making between things. (W2) Things do not die.</p>\n<p>Life is a mathematical-structure with DATA: the set of all beings and the set of all encounters between beings and things, and between beings and beings, in spacetime. CONDITIONS: (L1) All beings die with certainty. (L2) With positive probability, Life never ends. (L3) Subsequent to the first-beings, new beings result only from bond-breaking within a being. (L4) Every being has a Life-cycle based on  DNA macromolecules.</p>\n<p>\"Encounter,\" \"bond-making,\" and \"bond-breaking\" are events in spacetime. There does exist a topos-theoretic mathematical definition of \"event\" in \"spacetime\" but that may best be left aside for now (it is detailed in the draft Research Report, and in the Glossary). \"DNA macromolecule\" and \"Life-cycle\" are well-documented in the biology literature. </p>\n<p>Also for now it is best to leave aside philosopher terms such as \"multiple-realizability\" and \"strong-emergence,\" let alone distinctions between \"supervenience,\" \"theory reductionism,\" \"explanatory reductionism,\" and \"constitutive reductionism.\"</p>",
        "id": 294874378,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661264196
    },
    {
        "content": "<p>For (W2), is this a consequence of semantics, that a thing must be alive at some point in order to \"die\"?<br>\nFor (L3), that doesn't address the example I gave of how spontaneous production could occur (via the same process that originated life or by artificial cloning/production of DNA).<br>\nThanks for labelling the assumptions, it makes referring to them a lot easier!<br>\nDo \"encounters\" affect the \"life-cycle\" of beings?</p>",
        "id": 294994729,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661327028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\nFOURTH TRY:</p>\n<p>(T4.0) Things and beings are subsets (world-tubes) in Minkowski-spacetime M, multiplied by a set of additional dimensions, Dim. (Every world-tube corresponds to a predicate in M x Dim.)<br>\n(T4.1) LIFE begins at time 0, and LIFE lasts forever.<br>\n(T4.2) Life is the set of beings.<br>\n(T4.3) No being lasts forever.<br>\n(T4.4) There exists a finite number of first beings.<br>\n(T4.5) All first beings are formed from things by assembly,  i.e., bond-making.<br>\n(T4.6a)For any subsequent being (i.e., non-first-being)   there exists a unique prior being from which the   subsequent being arises by bond-breaking.<br>\n(T4.6b)At most a finite number of subsequent beings  are formed from any prior being. <br>\n(T4.7) Theorem. In any finite interval of time, there is  a positive finite number of beings.<br>\n(T4.8) Definition. A situation is a point in M x Dim.  An event is an ordered quadruple (x,y,p,dt) in which x and y are situations, p is a probability, and dt is a finite (or non-standard infinitesimal) clock-time  duration.   <br>\n(T4.9) Notation for an event is defined by x-(p,dt)-&gt;y = (x,y,p,dt). The pair (p,dt) is called a  propensity. The notation may be read as  \"the propensity of situation x transitioning to situation y has probability p over time dt.\" <br>\n(T4.10)This use of the word \"event\" is at odds with standard terminology in spacetime, which considers an \"event\" to be what is dubbed here a \"situation.\" The word \"event\" will be used  here only in the sense defined here.          <br>\n(T4.11)A pattern is a directed-graph of situations and events.<br>\n(T4.12)Definition. The life-cycle of a being is the pattern of situations and events specific to the being from the moment of its formation (T4.6a) to the moment that it ceases being (T4.3).<br>\n(T4.13)Definition. The activity of a thing is the pattern of situations and events specific to the thing.           </p>\n<p>Do \"encounters\" affect the \"life-cycle\" of beings?</p>\n<p>(T4.14)For any situation there exists a set of events with domain equal to that situation. The probabilities of the propensities of those events sum to 1.<br>\n(T4.15)Definition. A story about a being (resp., thing) is a path in the category generated by the life-cycle pattern (resp., activity pattern) of the being. As such, a story is a sequence of situations connected by events with propensities. A multi-track story is a finite set of stories beginning at the same clock-time and ending at the same clock-time (in a specified inertial frame).  </p>\n<p>An event in one track may involve transition to  a situation with alternate propensities in another track. That is called an encounter.  Therefore, yes, it is possible that an encounter between a being  and another being or thing \"affect\" the life-cycle of the being.</p>",
        "id": 295435150,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661524188
    },
    {
        "content": "<p>Regarding (T4.7) Theorem, there is a counter-example because there is no postulate so far that puts a lower bound on how long it takes for a being to mature before it can reproduce.</p>",
        "id": 295843520,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661779344
    },
    {
        "content": "<p>Sorry for not continuing to engage Ellis. I hope that our discussion helped you to developed your ideas more though <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 303050417,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1665253601
    },
    {
        "content": "<p>Yes, Morgan, thank you very much, that thread of discussion with you was indeed helpful. It turned into \"Microlect 4\" in my work, \"Microlects are Specialized Behavioral, Verbal, Diagrammatic, and Mathematical Languages.\" That article explains microlectics, and includes \"Categorical Mereology Deductive Microlect\" which extends Fong-Myers-Spivak work, \"Behavioral Mereology\" towards biology. </p>\n<p>I have not been attending this forum much, so if you care to correspond, I am at <a href=\"mailto:xtalv1@netropolis.net\">xtalv1@netropolis.net</a> . I have tried to adjust my zulip account to send me alerts of postings...</p>",
        "id": 313544811,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1670000648
    }
]