[
    {
        "content": "<p>the (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">∞</mi><mo separator=\"true\">,</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(\\infty,1)</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord\">∞</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.16666666666666666em;\"></span><span class=\"mord\">1</span><span class=\"mclose\">)</span></span></span></span>-) category of cochain complexes of coherent sheaves on a Noetherian smooth scheme (say) is known to be equivalent to the category of complexes of sheaves with coherent cohomology, and the proof usually passes through the category of perfect complexes. in the analytic case, i think this is known to be true for very low dimensions, but am i right in thinking that it is still an open question in general?</p>",
        "id": 192514756,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585741320
    },
    {
        "content": "<p>If this doesn't get any bites here, I suspect there would be a good response in the homotopy theory chat room on MathOverflow</p>",
        "id": 192560997,
        "sender_full_name": "Jonathan Beardsley",
        "timestamp": 1585760939
    },
    {
        "content": "<p>yeah? i wasn't sure if it was too \"algebraic geometry-y\" for there</p>",
        "id": 192577380,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585767937
    },
    {
        "content": "<p>as a partial answer, there is an essentially surjective functor to complexes with coherent cohomology from \"complexes of sheaves that are _locally_ coherent\", where the latter is constructed as the homotopy colimit over refinement of covers</p>",
        "id": 192717135,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585857211
    },
    {
        "content": "<p>and it looks like perfect complexes and complexes of coherent sheaves should still be equivalent</p>",
        "id": 192717159,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585857227
    },
    {
        "content": "<p>but the question is (as far as i can tell) whether or not perfect = formal</p>",
        "id": 192717229,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1585857245
    },
    {
        "content": "<p>When people prove theorems of this kind for 'nice' schemes, 'nice' usually means 'quasi-separated and quasi-compact'. Of course you can unpack the conditions and see what they mean in terms of diagonals and affine maps, and use those properties in the proofs, but I would like to advocate a as-of-yet-little-known viewpoint introduced by Coquand, Lombardi and Schuster, namely that the quasi-separated quasi-compact schemes are precisely the <em>constructive</em> schemes. This means that they can be constructed from locally ringed lattices by finite gluings. Locally ringed lattices is a constructive foundation for algebraic geometry discovered 50 years ago by Joyal, completely avoiding the use of prime ideals (whose existence relies on the axiom of choice). Even if you are not interested in constructive mathematics per se, you may enjoy the slogan that 'constructive mathematics is instructive mathematics'. When translated back to ordinary algebraic geometry, the characterisation says that the quasi-separated quasi-compact schemes are those that can be obtained by finite gluings of affine schemes along affine overlaps.</p>\n<p>Here are two references:</p>\n<p>Coquand-Lombardi-Schuster, <em>Spectral schemes as ringed lattices</em>, Ann. Math. Artif. Intell. 2009</p>\n<p>Bondal-van den Bergh, <em>Generators and representability of functors in commutative and noncommutative geometry</em>, Mosc. Math. J. 2003</p>\n<p>The second states a very useful induction principle for quasi-separated quasi-compact schemes. (In SGA4 it is suggested that quasi-separated quasi-compact should be called 'coherent'.)</p>",
        "id": 192737125,
        "sender_full_name": "Joachim Kock",
        "timestamp": 1585867536
    },
    {
        "content": "<p>this is very nice, but seems to only apply in the algebraic setting, right? is there something similar in the analytic setting?</p>",
        "id": 193119420,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1586219300
    }
]