[
    {
        "content": "<p>I've been trying to learn some algebraic geometry and I've come across some notes which take seriously the functorial POV so I thought they may be worth sharing here (seeing as there aren't many textbooks which fully commit in this direction). <a href=\"/user_uploads/21317/s4L234KlCSMdWlc6KWX11sDD/M392c-Notes_-Algebraic-Geometry-Sam-Raskin.pdf\">Sam Raskin's notes</a>, <a href=\"/user_uploads/21317/z1KCkOuh9nRrj1K0dvd12a7C/Math-6170_-Algebraic-Geometry-Jonathan-Wise.pdf\">Jonathan Wise's notes</a>, <a href=\"/user_uploads/21317/cH-INFWgHeQAdB_s1SjeiXGK/Idea-of-Space-in-Algebraic-Geometry-Ivan-Mirkovic.pdf\">Ivan Mirkovic's notes</a>. If anyone has any other relevant references (books, notes, papers, whatever) that would be great.</p>",
        "id": 235698317,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619105195
    },
    {
        "content": "<p>It's quite miraculous how much simpler (and even more concrete) the subject becomes when you take this approach. The only hump for some I guess is fully internalising the Yoneda lemma but that's still much simpler than say a whole preliminary chapter on sheaves, locally ringed spaces, etc.. as in Vakil's notes (which are nevertheless still great).</p>",
        "id": 235698684,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619105349
    },
    {
        "content": "<p>Maybe you've read the comments about how to teach algebraic geometry on <a href=\"https://sbseminar.wordpress.com/2009/08/06/algebraic-geometry-without-prime-ideals/\">this blog article</a>?   The whole conversation is interesting, but I especially like the part around where James Borger says:</p>\n<blockquote>\n<p>I agree completely with David Ben-Zvi. It seems vastly preferable to me to <em>define</em> the category of schemes (or better, algebraic spaces) as a certain full subcategory of the category of functors from Rings to Sets. Then things simplify greatly. No silly topological spaces, no prime ideals, no axiom of choice, no local rings, no fields. All you need is all you ever used anyway: the category of rings, covers, and descent. Of course, you can use ideals, for instance prime and maximal ideals, if you want– they’re just no longer necessary to set up the theory.</p>\n</blockquote>\n<blockquote>\n<p>I would love to teach a class from this point of view.</p>\n</blockquote>",
        "id": 235715636,
        "sender_full_name": "John Baez",
        "timestamp": 1619112086
    },
    {
        "content": "<p>Yeah I’ve read that blog post and the comments - definitely worthwhile.</p>",
        "id": 235716259,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619112370
    },
    {
        "content": "<p>I'm glad you're looking around for sources that actually teach algebraic geometry.  I'm not very good at algebraic geometry and would like to learn it this way sometime.</p>",
        "id": 235716460,
        "sender_full_name": "John Baez",
        "timestamp": 1619112465
    },
    {
        "content": "<p>The thing I’m most surprised with is the concreteness and geometric intuition in those three notes I posted. </p>\n<p>I initially expected that the ‘functorial approach’ would come with a sterility and lack of motivation but that’s not the case.</p>",
        "id": 235716833,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619112616
    },
    {
        "content": "<p>All of those notes actually develop a lot of the algebra (normalisation, nullstellensatz, dimension, etc) along with the geometry so the prerequisites are quite low</p>",
        "id": 235717173,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1619112741
    },
    {
        "content": "<p>Great!   So it's a teachable approach.</p>",
        "id": 235717400,
        "sender_full_name": "John Baez",
        "timestamp": 1619112832
    },
    {
        "content": "<p>This is old, but there's a textbook by Demazure and Gabriel's called  _Groupes Algebriques_ that takes a serious functorial approach to the underlying scheme theory, IIRC. There's fair amount in there that is really just algebraic geometry, and one review of the english translation of the first half complains there's not enough material on algebraic groups!</p>",
        "id": 249328762,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1628837415
    },
    {
        "content": "<p>It's very interesting to see that Grothendieck was Demazure's doctoral advisor.</p>",
        "id": 249713130,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1629204602
    },
    {
        "content": "<p>Also, there is a partial english translation of the book by J. Bell which goes under the name <em>Introduction to Algebraic Geometry and Algebraic Groups</em>.</p>",
        "id": 249714208,
        "sender_full_name": "সায়ন্তন রায়",
        "timestamp": 1629205107
    },
    {
        "content": "<p>Yeah I’ve seen that book. It’s nice although it doesn’t really commit fully to the functor of points approach.</p>",
        "id": 249715047,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1629205509
    },
    {
        "content": "<p>I have found though some more references since I first asked the question. My favourite by far are still Wise’s notes but there are the <a href=\"http://www.math.lsa.umich.edu/~idolga/631.pdf\">fantastic notes</a> by Dolgachev which actually introduce AG from scratch using the functor of points</p>",
        "id": 249715513,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1629205733
    },
    {
        "content": "<p>I'm glad this topic popped back up. I've been thinking recently I want to learn this stuff, but I forgot all the resources I had previously opened.</p>",
        "id": 249715680,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1629205806
    },
    {
        "content": "<p>It’s been a bit of a hassle finding sources online but I’ve managed to compile a reasonable list. I should probably link them on the nLab at some point.</p>",
        "id": 249715739,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1629205843
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"341237\">@Fawzi Hreiki</span> that's asking me for a password :-(</p>",
        "id": 249813813,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629269409
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276422\">David Michael Roberts</span> <a href=\"#narrow/stream/231112-theory.3A-algebraic.20geometry/topic/Functorial.20algebraic.20geometry.20notes/near/249813813\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"341237\">Fawzi Hreiki</span> that's asking me for a password :-(</p>\n</blockquote>\n<p>That's strange. Perhaps try this: <a href=\"/user_uploads/21317/7KKqNKUm8GGYefwloR5CMQJp/Introduction-to-Algebraic-Geometry-Igor-V.-Dolgachev.pdf\">Introduction-to-Algebraic-Geometry-Igor-V.-Dolgachev.pdf</a></p>",
        "id": 249814751,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1629270399
    },
    {
        "content": "<p>Yeah, it's weird. Even just his main website, coming from a Google search gets me the password page</p>",
        "id": 249831587,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629283161
    }
]