[
    {
        "content": "<p>What do rings look like from the point of view of their own spectra? If you have any ring then the topos of sheaves over its spectrum contains a canonical ring object given by the structure sheaf. Can we say what theorems hold of this ring internally to the topos, that don't hold of rings in general?</p>",
        "id": 193293990,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1586338032
    },
    {
        "content": "<p>In particular, which statements are theorems about all such rings?</p>",
        "id": 193294098,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1586338095
    },
    {
        "content": "<p>I think they are simply called \"local rings\".</p>",
        "id": 193309073,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586347628
    },
    {
        "content": "<p>Well, Spec of an ordinary local ring is not always a point so maybe there's more to it than that.</p>",
        "id": 193309581,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586347941
    },
    {
        "content": "<p>Maybe it's this Proposition 3.7 of <a href=\"https://rawgit.com/iblech/internal-methods/master/notes.pdf\" title=\"https://rawgit.com/iblech/internal-methods/master/notes.pdf\">Ingo Blechschmidt's thesis</a>: every element which is not invertible is nilpotent, combined with the ring being local.</p>",
        "id": 193309896,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586348154
    },
    {
        "content": "<p>Right, I suspect it's that as well. I think that you don't have to add that the ring is local, because that's implied by the other property: the nilpotents give you your maximal ideal.</p>",
        "id": 193311939,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1586349290
    },
    {
        "content": "<p>I expected such rings to be well-studied, because any theorem you can prove about them constructively automatically tells you something about <em>every</em> ring. But I can't find much about them.</p>",
        "id": 193312286,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1586349447
    },
    {
        "content": "<p>Unfortunately that argument rarely applies: just because something should provide very far-reaching results doesn't mean that anyone has had the energy or courage to put the work into it. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 193314539,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586350452
    },
    {
        "content": "<p>Oh whoops yes. I thought for some reason that products of fields would also have this property, but they actually don't. I was misled by the following Remark 3.8 I guess.</p>",
        "id": 193315248,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586350752
    },
    {
        "content": "<p>Despite the apparent power of directly studying the classifying topos of a theory that one is interested in, Ingo is one of the few people I know of that has attacked this line of research in a systematic way. One reason for this is that unless you have several presentations for this topos, it can be very difficult to concretely compute much about it. However, my advisor has done a great deal of work on toposes of presheaf type, so in principal the tools are out there to get people going on other lines parallel to Ingo's..!<br>\nLook at Section 12.6 onwards in Ingo's thesis and you might find some answers, or at least a framework for looking for results of the kind you describe.</p>",
        "id": 193321820,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1586353631
    },
    {
        "content": "<p>I just want to say that's a great question.  I don't know the answer.  I imagine something cool happens because prime ideals of the ring give points in the spectrum, and the points of the spectrum should be visible in the topos of sheaves <em>on</em> that spectrum.</p>",
        "id": 193339921,
        "sender_full_name": "John Baez",
        "timestamp": 1586361159
    }
]