[
    {
        "content": "<p>In behavioral mereology each whole, b, has a set B(b) of possible behaviors. The parts of a whole are partially ordered by the \"part of\" relation, so a&lt;=b means a is a part of b. There is a surjective function e(b,a):B(b)-&gt;&gt;B(a) for which the equation y=e(b,a)(x) means behavior x of the whole entails behavior y of the part. Hence, many behaviors of the whole may entail the same behavior of a part, and also, any behavior of a part is entailed by some behavior of the whole. By categorical logic there are universal and existential quantifications All(b,a) and Exists(b,a) left and right adjoint respectively to the inverse image function P(e(b,a)):PB(a)-&gt;PB(b), in which P is the power set operator, and subsets of B(a), B(b) are regarded as the extensions of predicates (or \"properties\" or \"conditions\" or \"constraints\") on behaviors. See (@article{fongetal:2018, author = {Brendan Fong and David Jaz Myers and David I. Spivak},title ={Behavioral Mereology},journal={arXiv:1811.00420v [mathLO] 1 Nov 2018},year={2018},}). The challenge is to extend behavioral mereology with a concept of \"bonds\" between parts, whether they are parts of the same or different wholes. At the least, bonds constrain behaviors. For motivation, consider the following examples. Human organizations (nations, corporations,...) that are the parts of contractual bonds are constrained to behave in specified ways. Human beings who are parts of marital bonds, likewise, are constrained. Architectural structures made by bolting or welding steel girders constrain their steel girder parts. Cell-adhesion bonds between biological cells in tissues constrain them, and macromolecules bonded at epitopes, or at reaction sites, are constrained. In all cases, at all scales of space and time, bonds constrain the behaviors of their member parts. Moreover, any whole is made either by creating or by breaking bonds: a sperm bonds to an ovum, an umbilical cord is cut. There are different kinds of bonds (e.g., in chemistry there are covalent and ionic bonds), and the bond expression a~c(k,t) denotes the situation that part a is bonded to c by bond of kind k at time t. The relation ~ is assumed to be irreflexive, symmetric, and intransitive. A proposition composed of bond expressions with the usual logical connectives and quantifiers is called a situation. A situation may involve more than one time. If the points p of three-dimensional Euclidean space are called locations, then the location bond expression a~p(t) denotes the situation that part a is at location p at time t. Thus, a~p(t) AND a~q(t') is the proposition that part a is at p at time t and at q at time t', where it can be assumed that t&lt;t', hence part a moves from p to q in time t'-t starting at p at time t. It seems to me that with these notations,  an infinite variety of physical, and other, situations can be expressed by bond notation. Particular kinds of bonds satisfy special conditions. For example, in systems biology sites of molecules can bond at most once, so a~b(k,t) AND b~c(k,t) IMPLIES a=c. No two parts can bond to the same location at the same time, so a~p(t) AND c~p(t) IMPLIES a=c. The set S of all situations, which are first-order propositions, is the set of objects of a category, I think, in which the morphisms prescribe how each situation may change. Speaking of change, there is a notion that each situation has some \"propensity\" to change into any other situation. In other words, situation dynamics may be encoded in a function p that assigns to each situation a probability distribution over the cartesian product of a slice of S and time, say, the real numbers. In other words, if u is a situation then p(u)(v)(t) is the probability that situation u changes to situation v at time t. A sequence of situations may begin at u and time t, there is a simulation of p that chooses a morphism from u to some situation at some later time t'&gt;t, and so on. The result is a random walk in the category of situations.  The function p may be considered a pattern. (This is a generalization of the Gillespie stochastic simulation algorithm widely developed and used in systems biology simulators.) The challenge is to assemble a categorical theory of bonds that extends behavioral mereology along these lines.</p>",
        "id": 314780320,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1670536851
    }
]