[
    {
        "content": "<p>It's taken a long time, but our paper on strong laws of large numbers in categorical probability is finally out: <a href=\"https://arxiv.org/abs/2503.21576\">https://arxiv.org/abs/2503.21576</a></p>",
        "id": 508905267,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1743240306
    },
    {
        "content": "<p>Since taking limits is a partial operation (defined when the limits exist), this relies on a theory of quasi-Markov categories by <span class=\"user-mention\" data-user-id=\"318831\">@Areeb SM</span>, which has not appeared yet but should also be out soon. (A quasi-Markov category is a CD category in which all morphisms are quasi-total in the sense of <a href=\"https://arxiv.org/abs/2301.12989\">partial Markov categories</a>, and this turns out to be a particularly well-behaved notion of partiality.)</p>",
        "id": 508905279,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1743240318
    },
    {
        "content": "<p>While our typical categorical probability papers in recent years have generalized classical results from probability and statistics to Markov categories and proven them from simple categorical axioms, this one is a bit different: it would be more accurate to say that we use something like a law of large numbers <em>as an axiom</em> and then derive other things from that. Formally, this is encoded in our empirical adequacy axiom for empirical sampling morphisms:<br>\n<a href=\"/user_uploads/21317/-q0JCjZbn22lGJ6O_RQbRQDn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/-q0JCjZbn22lGJ6O_RQbRQDn/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"810x455\" src=\"/user_uploads/thumbnail/21317/-q0JCjZbn22lGJ6O_RQbRQDn/image.png/840x560.webp\"></a></div>",
        "id": 508905488,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1743240515
    },
    {
        "content": "<p>The idea behind empirical sampling is that such a morphism takes an infinite sequence as input and then returns a <em>uniformly random</em> sample from the sequence as output. Since this doesn't formally make sense for all sequences, it can only be a partial morphism. I think that this idea of empirical sampling is a fundamental concept in probability theory that has been overlooked so far, as we have not seen it considered anywhere else.  We also don't know of any Markov categories other than measure-theoretic probability in which empirical sampling morphisms would exist, so it's tempting to wonder if these can perhaps be turned into a new axiomatization of probability theory as a whole.</p>",
        "id": 508905798,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1743240782
    }
]