[
    {
        "content": "<p>A sheaf on some topological space formalizes the idea of local data that we can glue to obtain global data. It's also useful to be able to do this in the real world. For instance you want to obtain an idea of the mean temperature on the Earth by picking up the temperature in a finite number of points on the earth. But you can't hope to obtain the exact mean temperature like this, only an approximation and your thermometers also give you only an approximation of the temperature around the thermometer. So, I've been wondering if you can define some \"probabilistic sheaf\" that will formalize this situation.</p>\n<ul>\n<li>\n<p>Do you know resources that explain how you can obtain global approximate information from local approximation information using sheaves and probability theory?</p>\n</li>\n<li>\n<p>Without necessarily using sheaves, what would be a more classical way to estimate the mean temperature on the earth from thermometers around the globe?</p>\n</li>\n</ul>",
        "id": 358278896,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684078684
    },
    {
        "content": "<p>I'm also interested in this kind of thing! The application I have in mind is medical imaging. In medical imaging, we make a lot of partial measurements - maybe these can be formalized as \"local data\".  For example, in ultrasound imaging, we observe many small parts of the total ultrasonic response by using an array of sensors, so each sensor observes that data at one location in space. Forming an estimate of a \"global\" response - the entire ultrasound response produced over an entire sphere - that is consistent with each local observation, could potentially be a nice step on the way to making good images.</p>\n<p>Here are the titles of a couple papers possibly related to this topic, although I have not read them yet. \"Sheaves as a Framework for Understanding and Interpreting Model Fit\" (Kvinge et al.) and \"Sheaves are the canonical data structure for sensor integration\" (Robinson).</p>",
        "id": 358296880,
        "sender_full_name": "David Egolf",
        "timestamp": 1684086451
    },
    {
        "content": "<p>Thanks, these papers look very interesting!</p>",
        "id": 358306103,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684090458
    },
    {
        "content": "<p>This vaguely reminds me of  the sheaf-theoretic approach to contextuality in QM. In a sense, there the point is that probabilities fail to form a sheaf: if you have a matching family of probability distributions, it might not glue to a global joint distribution. Moreover we do see this kind of data in nature. <a href=\"https://arxiv.org/abs/1502.03097\">Here's</a> a decent entry-point to this.</p>",
        "id": 358321474,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1684099655
    },
    {
        "content": "<p>unrelated to the topic, but this funny mistake is in that paper you linked:<br>\n<a href=\"/user_uploads/21317/PZdJ7AH_07fu-kvYnnnhg5JO/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/PZdJ7AH_07fu-kvYnnnhg5JO/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/PZdJ7AH_07fu-kvYnnnhg5JO/image.png\"></a></div>",
        "id": 358527692,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1684171852
    },
    {
        "content": "<p>So now people will start referring to the \"Open-Access theorem\".</p>",
        "id": 358576985,
        "sender_full_name": "John Baez",
        "timestamp": 1684187190
    },
    {
        "content": "<p>such jokes are how the <a href=\"https://en.wikipedia.org/wiki/Cox–Zucker_machine\">https://en.wikipedia.org/wiki/Cox–Zucker_machine</a> was invented</p>",
        "id": 358582909,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1684189942
    },
    {
        "content": "<p>that's an hilarious story</p>",
        "id": 358586868,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1684191878
    }
]