[
    {
        "content": "<p>To those of you who are interested in categorical probability, categorical quantum mechanics, and/or potential applications of these to information processing, cryptography or causal inference, I'd like to advertise the recent thesis of <a href=\"https://www.math.ku.dk/english/about/news/new-names/nicholas-gauguin-houghton-larsen/\">Nicholas Gauguin Houghton-Larsen</a> at the University of Copenhagen. It's here:</p>\n<p><a href=\"https://arxiv.org/abs/2103.02302\">https://arxiv.org/abs/2103.02302</a></p>\n<p>This document is a treasure trove of ideas and results that may be of interest for years to come, and it's quite a pleasant read on top of that. Unfortunately, Nicholas may be about to leave the scientific community, and it is unclear whether any of this will appear in any other form than in the thesis. I'm therefore trying to advertise this material a bit in order to prevent it from going unnoticed, especially as Nicholas has not known about the ACT community until very recently.</p>\n<p>As a teaser, here's a selection-biased summary of the things that I've personally found the most interesting:</p>\n<ul>\n<li>Chapter 2 shows that one can already do a surprising amount of categorical probability and categorical quantum mechanics in any semicartesian monoidal category satisfying a bunch of natural axioms. These axioms are then used to prove an entirely new generalization of the <a href=\"https://en.wikipedia.org/wiki/No-cloning_theorem\">no-cloning theorem</a> as Theorem 2.5.18, which in addition also specializes to the recent <a href=\"https://arxiv.org/pdf/1608.01695\">no-masking theorem</a> and other results of this type. I'm already using some of the chapter's theory of dilations in my own work.</li>\n<li>Chapter 3 considers the extension to categories enriched in metric spaces and proposes axioms for how the metric ought to be compatible with dilations. It applies these definitions and results in order to develop a new notion of distance of quantum channels.</li>\n<li>Chapter 4 is the heart of the thesis. It develops a categorical framework for the joint analysis of causal structure and information leaking to and from the environment. Among other things, this involves a generalization of traced monoidal categories that seems to be new. It clearly provides a convincing categorical setting for causal inference. I also wonder if this framework could serve as a foundation for a categorical approach to cryptography, at least insofar as the analysis of information flow and information leakage is concerned.</li>\n</ul>\n<p>So if you know of any others who may be interested in this sort of thing but may not read this forum, please spread the word!</p>",
        "id": 231165662,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1616267645
    },
    {
        "content": "<p>By chapter 2, do you mean that it's possible to something similar to Markov categories but without the comultiplication/copy morphisms?</p>",
        "id": 231167171,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616269398
    },
    {
        "content": "<p>I just mean that it's been surprising to me personally that one can do <em>anything</em> that vaguely resembles probability theory or a nontrivial theory of information flow with semicartesianness only. I can't say for sure that one can do as much with it as one can do with Markov categories, but I believe that the answer is yes, in the following (uninteresting) way.<br>\nMy hypothesis is that suitable versions of Nicholas's axioms, in particular universal dilations, will <em>imply</em> that copy morphisms exist, with the idea being that copying and leaking one copy is the universal way of leaking information to the enviroment. If this conjecture is true, then being a Markov category is morally an extra <em>property</em> of a semicartesian category rather than extra structure. (Although it technically is extra structure, that extra structure is unique in typical examples and behaves more like extra property.) Does this sound plausible?</p>",
        "id": 231167981,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1616270339
    },
    {
        "content": "<p>Interesting...</p>",
        "id": 231168590,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616270952
    },
    {
        "content": "<p>Thanks for pointing out this thesis! I haven't gotten very far yet, but I already feel like I'm learning new things about dilations</p>",
        "id": 231214499,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1616330898
    },
    {
        "content": "<p>It does look like he's missing several references to work that I'd say should be of interest to him, like the symmetric purification of Selby et al. <a href=\"https://arxiv.org/abs/1802.00367\">https://arxiv.org/abs/1802.00367</a> or the categorical reconstruction of Tull that uses dilations in a more abstract categorical section to derive something very close to quantum theory <a href=\"https://lmcs.episciences.org/6035\">https://lmcs.episciences.org/6035</a>, or the theory of infinite-dimensional dilations of Westerbaan^2 <a href=\"https://arxiv.org/abs/1603.04353v2\">https://arxiv.org/abs/1603.04353v2</a></p>",
        "id": 231215301,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1616331920
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"296293\">@John van de Wetering</span> for pointing those out! I've forwarded that to Nicholas and encouraged him to also drop by here and say hi. (And I had recently already pointed out the Westerbaan^2 paper to him as well as <span class=\"user-mention\" data-user-id=\"296639\">@Arthur Parzygnat</span>'s <a href=\"https://arxiv.org/abs/1807.02533\">Stinespring's construction as an adjunction</a>, which seem to be of a similar flavour as the thesis's Theorem 2.4.11. It's a bit unfortunate that he missed all of this literature which arguably should have been referenced and discussed, but also not very surprising given that he was embedded in a different community.)</p>",
        "id": 231224943,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1616342793
    },
    {
        "content": "<p>This is a reminder of what the situation was like for <em>everybody</em> only a few years ago, before the amazing community building work by the organisers of ACT1</p>",
        "id": 231225094,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1616342984
    },
    {
        "content": "<p>Yeah, personally I'm legendarily bad at the reference game, so a community like this (and a place like Zulip) are fundamental for me to have a vague idea of what's going on in ACT. I'd have no hope otherwise</p>",
        "id": 231226925,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1616345045
    },
    {
        "content": "<p>Hi all,</p>\n<p>First of all many thanks <span class=\"user-mention\" data-user-id=\"276702\">@Tobias Fritz</span>  for promoting my thesis and introducing me to this community!</p>\n<p>As Tobias wrote I will probably soon be leaving academia, but I am planning to first write a few papers based on the thesis. It has been very uplifting to me that this work may be of interest more broadly. If you wish to discuss elements of the thesis, or have other comments or corrections, please feel free to contact my by email (<a href=\"mailto:nicholas.gauguin@gmail.com\">nicholas.gauguin@gmail.com</a>).</p>\n<p>Many thanks <span class=\"user-mention\" data-user-id=\"296293\">@John van de Wetering</span> for pointing out those references, I'll  consult them before future presentations of the material. It was never an explicit objective for me to reconstruct quantum theory axiomatically, but it is of course a natural problem to consider in this context. </p>\n<p>Best regards,<br>\nNicholas</p>",
        "id": 231291117,
        "sender_full_name": "Nicholas Gauguin Houghton-Larsen",
        "timestamp": 1616410426
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276702\">Tobias Fritz</span> <a href=\"#narrow/stream/253118-theory.3A-probability/topic/Thesis.20of.20Nicholas.20Gauguin.20Houghton-Larsen/near/231167981\">said</a>:</p>\n<blockquote>\n<p>I just mean that it's been surprising to me personally that one can do <em>anything</em> that vaguely resembles probability theory or a nontrivial theory of information flow with semicartesianness only. I can't say for sure that one can do as much with it as one can do with Markov categories, but I believe that the answer is yes, in the following (uninteresting) way.<br>\nMy hypothesis is that suitable versions of Nicholas's axioms, in particular universal dilations, will <em>imply</em> that copy morphisms exist, with the idea being that copying and leaking one copy is the universal way of leaking information to the enviroment. If this conjecture is true, then being a Markov category is morally an extra <em>property</em> of a semicartesian category rather than extra structure. (Although it technically is extra structure, that extra structure is unique in typical examples and behaves more like extra property.) Does this sound plausible?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"276702\">@Tobias Fritz</span>  I think this sounds very plausible :)</p>",
        "id": 231291435,
        "sender_full_name": "Nicholas Gauguin Houghton-Larsen",
        "timestamp": 1616410580
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399597\">@Nicholas Gauguin Houghton-Larsen</span> My primary reason for mentioning those two reconstruction results is because the way they use dilations seems to me to be more closely aligned to how you do it. In Tull's paper, he defines purity as dilational purity, as opposed to convex purity in the Pavia reconstruction, and in Selby  et al. they use a symmetric dilation that holds for all processes, and not just states, and which is also true for classical processes and not just the quantum ones.</p>",
        "id": 231291852,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1616410818
    },
    {
        "content": "<p>Anyway, let me congratulate you on an excellent thesis. I'm finding it a joy to read :)</p>",
        "id": 231291914,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1616410840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"296293\">@John van de Wetering</span> I'm pleased that you like it! <br>\nAnd I see, that is of course relevant. I think I only reference Chiribella (Def. 2.4 in <a href=\"https://arxiv.org/pdf/1411.3035.pdf\">https://arxiv.org/pdf/1411.3035.pdf</a>) when comparing to other categorical notions of purity. <br>\nNote, incidentally, that his purity notion (which agrees with Tull's as far as I can see) is slightly different from the one I employ, due to their restriction to one-sided dilations. For example, in the category of surjective functions, a bijection has only trivial one-sided dilations (i.e. is pure in their terminology) but in general has non-trivial two-sided dilations (i.e. is not pure in my terminology). <br>\nThis is briefly mentioned in footnote 7 on page 49 of the thesis.</p>",
        "id": 231296544,
        "sender_full_name": "Nicholas Gauguin Houghton-Larsen",
        "timestamp": 1616413680
    },
    {
        "content": "<p>There's also this approach to purification: <a href=\"https://arxiv.org/abs/1705.07652\">https://arxiv.org/abs/1705.07652</a></p>",
        "id": 231321236,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1616424172
    },
    {
        "content": "<p>That paper is actually referenced. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 231322506,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1616424637
    },
    {
        "content": "<p>Oh oops</p>",
        "id": 231374842,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1616442950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277285\">@Martti Karvonen</span> Absolutely, my apologies. I guess I meant \"when comparing to purity notions based on dilations\".<br>\n<span class=\"user-mention\" data-user-id=\"276945\">@Oscar Cunningham</span> Maybe I missed a journal reference, which I'll be happy to give in the future (I reference an arXiv-version) :)</p>",
        "id": 231440885,
        "sender_full_name": "Nicholas Gauguin Houghton-Larsen",
        "timestamp": 1616491058
    },
    {
        "content": "<p>I'm not fussed, but it's in the conference proceedings here <a href=\"http://eptcs.web.cse.unsw.edu.au/paper.cgi?QPL2017.20\">http://eptcs.web.cse.unsw.edu.au/paper.cgi?QPL2017.20</a> if you want to cite the 'real' version.</p>",
        "id": 231442896,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1616492234
    }
]