[
    {
        "content": "<p>This Wednesday (the <strong>18th of May</strong>) at <strong>16:00 UTC</strong></p>\n<p><strong>Juan F. Meleiro</strong> (Universidade de São Paulo) — <em>Towards Modular Mathematics</em></p>\n<p>Synthetic Reasoning is a style of mathematics based on axiomatic theories that aim to capture the fundamental and essential structures in a particular subject. Such theories are often type theories with intended interpretations inside structured categories such as toposes.</p>\n<p>But theorycrafting is currently an artisanal job, that requires analysis and synthesis from scratch for every theory that will be created. A formal (and categorical) toolkit for manipulating these theories could aid the synthetic mathematician in their endeavors, just as a toolbox can help any artisan in their craft.</p>\n<p>Modular mathematics is mathematics based on these formal theories that capture a way of Synthetic Reasoning in particular fields, and can then be combined and compared. In this talk, I will present work in progress towards a framework for such modular mathematics. Universal Logic will be our guide for the capabilities that such a framework should provide, including translation between, and combinations of theories. I will present a formal theory called MMT (introduced by Florian Rabe) that follows such a guide. I will then present three formal approaches to the definition of the fundamental group, each following a distinct style: a purely categorical, a syntactical-categorical, and a purely syntactical one; all in order to explore some possible ways to do Modular Mathematics.</p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/86201468397?pwd=L0NER3FCOFZpTHRWMWVVMEZ5ckJoZz09\">https://topos-institute.zoom.us/j/86201468397?pwd=L0NER3FCOFZpTHRWMWVVMEZ5ckJoZz09</a><br>\nYouTube: <a href=\"https://www.youtube.com/watch?v=kQIloPijGaw\">https://www.youtube.com/watch?v=kQIloPijGaw</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"kQIloPijGaw\" href=\"https://www.youtube.com/watch?v=kQIloPijGaw\"><img src=\"https://uploads.zulipusercontent.net/f226d8c137d47be88456b066f1bf7e12d4c0c404/68747470733a2f2f692e7974696d672e636f6d2f76692f6b51496c6f50696a4761772f64656661756c742e6a7067\"></a></div>",
        "id": 282566374,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1652738335
    }
]