[
    {
        "content": "<p>a week today (on Wednesday the 29th of September), Em-Cats will have its second talk — details below!</p>",
        "id": 254409878,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632333286
    },
    {
        "content": "<p><strong>A categorical study of quasi-uniform structures</strong><br>\n<em>Minani Iragi (University of South Africa)</em></p>\n<p>A topology on a set is usually defined in terms of neighbourhoods, or equivalently in terms of open sets or closed sets. Each of these frameworks allows, among other things, a definition of continuity. Uniform structures are topological spaces with structure to support definitions such as uniform continuity and uniform convergence. Quasi-uniform structures then generalise this idea in a similar way to how quasi-metrics generalise metrics, that is, by dropping the condition of symmetry.</p>\n<p>In this talk we will show how to view these as constructions on the category of topological spaces, enabling us to generalise the constructions to an arbitrary ambient category. We will show how to relate quasi-uniform structures on a category with closure operators. Closure operators generalise the concept of topological closure operator, which can be viewed as structure on the category of topological spaces obtained by closing subspaces of topological spaces. This method of moving from Top to an arbitrary category is often called \"doing topology in categories\", and is a powerful tool which permits us to apply topologically motivated ideas to categories of other branches of mathematics, such as groups, rings, or topological groups.</p>",
        "id": 254409951,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632333314
    },
    {
        "content": "<p>YouTube: <a href=\"https://youtu.be/7brh6N0AUsc\">https://youtu.be/7brh6N0AUsc</a><br>\nZoom: [see <a href=\"https://researchseminars.org/talk/EmCats/2/\">https://researchseminars.org/talk/EmCats/2/</a> ]</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"7brh6N0AUsc\" href=\"https://youtu.be/7brh6N0AUsc\"><img src=\"https://uploads.zulipusercontent.net/fca54f41943bc1de320834a07e2e112548fd29ef/68747470733a2f2f692e7974696d672e636f6d2f76692f37627268364e30415573632f64656661756c742e6a7067\"></a></div>",
        "id": 254409993,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632333335
    },
    {
        "content": "<p>starting in 20 minutes!</p>",
        "id": 255410965,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1632926501
    }
]