[
    {
        "content": "<p>This coming week will see the third talk in the Em-Cats seminar series, with <strong>Nuiok Dicaire</strong> speaking on Wednesday the <strong>17th of November</strong>, at <strong>16:00 UTC</strong>. For more information, including links to the Zoom meeting and the YouTube livestream, please see the seminar webpage: <a href=\"https://topos.site/em-cats\">https://topos.site/em-cats</a> .</p>\n<p>Everybody is welcome, and we look forward to seeing you all there!</p>",
        "id": 261439392,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636925599
    },
    {
        "content": "<p><strong>Nuiok Dicaire</strong>: <em>Localisable monads, from global to local</em></p>\n<p>Monads have many useful applications. In mathematics they are used to study algebras at the level of theories rather than specific structures. In programming languages, monads provide a convenient way to handle computational side-effects which include, roughly speaking, things like interacting with external code or altering the state of the program's variables. An important question is then how to handle several instances of such side-effects or a graded collection of them. The general approach consists in defining many “small” monads and combining them together using distributive laws.</p>\n<p>In this talk, we take a different approach and look for a pre-existing internal structure to a monoidal category that allows us to develop a fine-graining of monads. This uses techniques from tensor topology and provides an intrinsic theory of local computational effects without needing to know how the constituent effects interact beforehand. We call the monads obtained \"localisable\" and show how they are equivalent to monads in a specific 2-category. To motivate the talk, we will consider two concrete applications in concurrency and quantum theory. This is all covered in our recent paper: <a href=\"http://arxiv.org/abs/2108.01756\">arxiv.org/abs/2108.01756</a>.</p>",
        "id": 261439397,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636925606
    },
    {
        "content": "<p><a href=\"https://www.youtube.com/watch?v=-5JQktuzMc0\">https://www.youtube.com/watch?v=-5JQktuzMc0</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"-5JQktuzMc0\" href=\"https://www.youtube.com/watch?v=-5JQktuzMc0\"><img src=\"https://uploads.zulipusercontent.net/49741b0f927c90cd0c8a37feccd8b0f5ae0c24bb/68747470733a2f2f692e7974696d672e636f6d2f76692f2d354a516b74757a4d63302f64656661756c742e6a7067\"></a></div>",
        "id": 261439403,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1636925632
    },
    {
        "content": "<p>starting in 15 minutes!</p>",
        "id": 261802330,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1637163851
    }
]