[
    {
        "content": "<p><strong>Seminário de Teoria das Categorias</strong> (formato híbrido)</p>\n<p>Durante o II Encontro Brasileiro de Teoria das Categorias, concluímos que necessitamos de iniciativas para manter o contato entre os pesquisadores da área no Brasil e internacionalmente. Por esse motivo, estamos organizando o retorno do Seminário de Teoria de Categorias do IME-USP como um primeiro passo no sentido dessa articulação. </p>\n<p>Caso tenha interesse em apresentar neste seminário, preencha este <a href=\"https://forms.gle/SSobNyyNi1qSR6BY8\">formulário</a> com sua disponibilidade. Será muito bem vindo!</p>\n<p>Horários: 16:00hrs (horário de Brasília), às Sextas-Feiras. O local ainda será definido. Casos excepcionais poderão ocorrer.</p>\n<p>Duração: 40min de apresentação + tempo de discussão.</p>\n<p>Como ainda somos um grupo pequeno, composto em grande parte de estudantes e profissionais em início de carreira, optamos por dividir as apresentações em dois tipos:</p>\n<p>Palestra - voltado para quem deseja apresentar resultados de pesquisa em estágio mais avançado e com caráter de originalidade, mas não necessariamente novos ou mesmo em estágio final.</p>\n<p>Sessão de discussão - voltado para a apresentação de artigos ou assuntos de interesse da comunidade, com caráter de divulgação científica e sem pretensão de originalidade.</p>\n<p>Em ambos os casos, o objetivo final é promover trocas de experiências e acúmulos de conhecimento!</p>\n<p>Os seminários serão híbridos e o apresentador poderá escolher se deseja que a apresentação seja gravada e disponibilizada ao público no YouTube. Escolha a opção que lhe faça sentir mais a vontade!</p>\n<p>Link para inscrição:<br>\n<a href=\"https://forms.gle/SSobNyyNi1qSR6BY8\">https://forms.gle/SSobNyyNi1qSR6BY8</a></p>",
        "id": 390916839,
        "sender_full_name": "Ana Luiza Tenorio",
        "timestamp": 1694693755
    },
    {
        "content": "<p>Parece que o seminário da USP vai retomar amanhã!</p>\n<p><a href=\"https://cat.ime.usp.br/semin%C3%A1rios\">https://cat.ime.usp.br/semin%C3%A1rios</a></p>",
        "id": 401165058,
        "sender_full_name": "Daniel Teixeira",
        "timestamp": 1699539530
    }
]