[
    {
        "content": "<p>I am researching how cognitive frameworks in our minds manifest in advanced mathematics, where we run up against the limits of our imagination.  Currently, I am collecting and analyzing all manner of examples of adjunctions with the hope of systematizing them in a way that would reveal an inherent mental structure underlying the possibilities.  Here are my notes so far <a href=\"https://www.math4wisdom.com/wiki/Research/ClassifyAdjunctions\">https://www.math4wisdom.com/wiki/Research/ClassifyAdjunctions</a>  I will be attending the Applied Category Theory 2023 conference where I look forward to learning how and why people think about adjunctions.  I appreciate your comments, ideas and suggestions!</p>",
        "id": 376789635,
        "sender_full_name": "Andrius Kulikauskas",
        "timestamp": 1689800403
    },
    {
        "content": "<p>I share a diagram of my current, preliminary understanding. I think adjunctions express mathematical analogies that relate two worlds (categories)  The analogy depends on two metaphors (functors). One metaphor (the left adjoint) pre-processes the input and the other metaphor (the right adjoint) post-processes the output.  The purpose of the analogy is to yield shared meaning in two different contexts, a synchronized window relating the two worlds.  <br>\nThere seem to be four ways to mediate shared meaning through a variable.  Free-forgetful adjunctions manifest Whether a variable signifies (by freely generating or forgetting).  Galois connections manifest What a variable signifies (the content or the context). Logical quantifiers manifest How a variable signifies: a free variable is bound, either by specifying it (\"there exists\") or by not specifying it (\"for all\"). Thus here the variable is explicitly understood as a functor with both a left and right adjoint.  This is also the case for Colimit-Limit adjunctions, which show Why a variable signifies, namely, the same variable is propagated to different locations in propositions, thus we deal with a diagram, which we interpret in terms of internal structure (colimits) or external relationships (limits).   <br>\nFinally, there are two ways of establishing shared meaning through a slot for a variable.  The tensor-hom adjunction can be set up with regard to some object A. But also there is a similar adjunction that centers on a change of rings.  I need to understand this all better but I feel I am making progress!  Thank you for helping me with ideas and suggestions!<br>\n<a href=\"/user_uploads/21317/vVFq0mMWK7fODcrL2lJW0LOr/ClassificationOfAdjunctions2.png\">ClassificationOfAdjunctions2.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/vVFq0mMWK7fODcrL2lJW0LOr/ClassificationOfAdjunctions2.png\" title=\"ClassificationOfAdjunctions2.png\"><img src=\"/user_uploads/21317/vVFq0mMWK7fODcrL2lJW0LOr/ClassificationOfAdjunctions2.png\"></a></div>",
        "id": 377087288,
        "sender_full_name": "Andrius Kulikauskas",
        "timestamp": 1689880412
    },
    {
        "content": "<p>\"Binomial Theorem Is a Portal to Your Mind\" <a href=\"https://www.youtube.com/watch?v=mfItf8mQUT0\">https://www.youtube.com/watch?v=mfItf8mQUT0</a> is my submission to the Summer of Math Exposition Contest <a href=\"https://some.3b1b.co\">https://some.3b1b.co</a>   I contrast the choice between \"this or that\" (which defines the state of the observed) and a choice between \"observe or not\" (which defines the world of the observe).  This distinction could help model what it means for nature to observe itself.  The theme of choice is key in my study of how cognitve frameworks manifest in mathematics.  In my community Math 4 Wisdom, I have started a study group for the math of the \"divisions of everything\", the basic mental contexts.  We are starting with the binomial theorem, which models subsets of sets, and then exploring subspaces of spaces, which appear in Gaussian binomial coefficients, Grassmannians and Bott periodicity.  Let me know if you'd like to join us!</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"mfItf8mQUT0\" href=\"https://www.youtube.com/watch?v=mfItf8mQUT0\"><img src=\"https://uploads.zulipusercontent.net/22a3fe6653425cd6bf2755fcb0308d3ac9a776ee/68747470733a2f2f692e7974696d672e636f6d2f76692f6d66497466386d515554302f64656661756c742e6a7067\"></a></div>",
        "id": 386149271,
        "sender_full_name": "Andrius Kulikauskas",
        "timestamp": 1692482651
    }
]