[
    {
        "content": "<p>the book \"Programs as diagrams\" is complete and in production. the good news is that the contract allows me to distribute 75% for free:<br>\n<a href=\"https://arxiv.org/abs/2208.03817\">https://arxiv.org/abs/2208.03817</a><br>\nbut it needs to be updated. the bad news is that the fun stuff (categorical gossips and degeneracies) are in the other 25%. i had mistakenly compiled the whole thing... and in the meantime had to fix it. ask me at <a href=\"mailto:dusko@hawaii.edu\">dusko@hawaii.edu</a>.</p>",
        "id": 349017822,
        "sender_full_name": "dusko",
        "timestamp": 1681369624
    },
    {
        "content": "<p>That's strange.   You mean you're not allowed to update the arXiv version to fix it?</p>",
        "id": 350076464,
        "sender_full_name": "John Baez",
        "timestamp": 1681522294
    },
    {
        "content": "<p>If I were you I'd just go ahead and fix it when nobody is looking, and not tell the world about it.</p>",
        "id": 350076546,
        "sender_full_name": "John Baez",
        "timestamp": 1681522327
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/274877-practice.3A-our-work/topic/categorical.20computability.20book/near/350076464\">said</a>:</p>\n<blockquote>\n<p>That's strange.   You mean you're not allowed to update the arXiv version to fix it?</p>\n</blockquote>\n<p>no i can post on arxiv whatever i like, as long as it is not more than 75% of the book. but processing a new verision on arxiv takes like 10 min of processing and the computer starts shaking and smoking a little... i'll do it next week.</p>\n<p>i meant to say that the arxiv version does not contain \"stories\" and \"workouts\" which might be more fun than the stuff that i did post. i have chosen to cut that out because \"stories\" contain most of the photos, and the current text is already above arxiv's size limit...</p>\n<p>speaking of arxiv: is it me or are they a little in disarray? maybe trying to keep gpt-generated papers out? they introduced lots of moderators who don't seem to know what they are doing. someone rejected v4 of the book because \"stories\" and \"workouts\" were commented out, and \"arxiv does not accept incomplete work\". and i was saying in the abstract from the outset what was commented out. so i just commented out the titles as well. and another paper got held for crossreferencing for a week, and then released, but not returned in the queue. so i had to resubmit...</p>",
        "id": 350081329,
        "sender_full_name": "dusko",
        "timestamp": 1681525788
    },
    {
        "content": "<blockquote>\n<p>no i can post on arxiv whatever i like, as long as it is not more than 75% of the book. </p>\n</blockquote>\n<p>Hmm, too bad.   I would never accept that.</p>",
        "id": 350081489,
        "sender_full_name": "John Baez",
        "timestamp": 1681525891
    },
    {
        "content": "<blockquote>\n<p>speaking of arxiv: is it me or are they a little in disarray? </p>\n</blockquote>\n<p>I don't know!</p>",
        "id": 350081533,
        "sender_full_name": "John Baez",
        "timestamp": 1681525915
    },
    {
        "content": "<p>I quite frequently have issues with the arXiv arbitrarily reassigning my papers to unrelated categories and refusing to fix this when I complain, but this has been a problem since before ChatGPT came out.</p>",
        "id": 350141188,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1681558416
    }
]