[
    {
        "content": "<p>For a while I've been thinking about the \"geometry of composition\", or in more technical terms, the higher-dimensional analogs of string diagrams (see <a href=\"https://ncatlab.org/nlab/show/manifold%20diagram\">[[manifold diagram]]</a>). There is a bigger story to be told here, about \"geometric\", \"topological\" and \"algebraic\" models of higher structures, and I tried to sketch this story in a recent <a href=\"https://golem.ph.utexas.edu/category/2023/03/an_invitation_to_geometric_hig.html\"><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span>-Category Café post</a>. There are two distinct types of interactions in the geometry of composition, and one of my long-term goals is to understand these two parts individually and how they interplay.</p>\n<ul>\n<li>distant interactions: <em>isotopies</em> (also called <em>homotopies</em>, or just <em>coherences</em>) are higher-dimensional analogs of braids. Examples include, for instance, the braid, the Yang-Baxterator, the <a href=\"https://blogs.ams.org/visualinsight/2016/03/15/zamolodchikov-tetrahedron-equation/\">Zamolodchikov eversion</a>, etc. </li>\n<li>local interactions: <em>singularities</em> are local neighborhoods of the critical points of strata in diagrams (more precisely, in tangle diagrams). Examples include, for instance, the cup/cap, the birth/death of a circle, the saddle, the <a href=\"https://en.wikipedia.org/wiki/Monkey_saddle\">monkey saddle</a>, the swallowtail, etc. ...</li>\n</ul>\n<p>In combination, isotopies and singularities make up all of homotopical behaviour (such as the homotopy groups of spheres; e.g. the <a href=\"https://ncatlab.org/nlab/show/Hopf+fibration\">hopf fibration</a> is a capped-off braid, and the <a href=\"https://ncatlab.org/nlab/show/quaternionic+Hopf+fibration\">quaterniotic hopf fibration</a> is a 'capped-off' Zamolodchikov eversion). In general, homotopical behaviour is very complicated... I'd say much of Algebraic Topology is dedicated to finding patterns in it. However, individually (to the extend that they can be separated) isotopies and singularities don't seem that complicated! Well, still complicated, but somehow tractably so. Indeed, both can be formalized in a few words in the framework of manifold diagrams, and due to the combinatorial classification of such diagrams, they can be worked with easily 'by hand' up to the higher low dimension range. Both appear to have connections to loads of existing math, but the challenge is to understand those connections.</p>\n<p>While the above provides my motivation for studying manifold diagrams, here are some more concrete short-term projects I've been thinking about.</p>\n<ol>\n<li>\n<p>Genericity properties of manifold diagrams: show that, while by default manifold diagrams are weakly globular, generically they are strictly globular. (project with <span class=\"user-mention\" data-user-id=\"351586\">@Lukas Heidemann</span>  and Christopher Douglas)</p>\n</li>\n<li>\n<p>Theory of geometric computads: geometric computads and their functors are easily defined, but describing the higher category of geometric computads and its properties is work in progress. (project with <span class=\"user-mention\" data-user-id=\"351586\">@Lukas Heidemann</span>)</p>\n</li>\n<li>\n<p>Complexification: there are a more or less straight-forward complex analogs of meshes (the 'regular cell structures' of diagrams). The role of resulting notions of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">C</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbb{C}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6889em;\"></span><span class=\"mord mathbb\">C</span></span></span></span>-tangle diagrams should be similar to the role of complex singularities in Arnold's singularity theory. (project with Christopher Douglas)</p>\n</li>\n</ol>\n<p>(A further fun project I have been thinking about on and off with others: if one would understand isotopies, I claim <a href=\"https://cxdorn.github.io/assets/pdfs/nine-stories.pdf#subsection.2.9\">here</a> that that brings us one step closer to using the geometry of composition to write down a peculiar but potentially interesting 'geometric' higher directed type theory.)</p>",
        "id": 342089493,
        "sender_full_name": "Christoph Dorn",
        "timestamp": 1678893813
    },
    {
        "content": "<p>Thanks for writing that summary &amp; n-cafe blog post. I don't have much to say here, except cheer you on from the sidelines. I'm a big fan of graphical calculi.</p>",
        "id": 342281697,
        "sender_full_name": "Simon Burton",
        "timestamp": 1678965918
    }
]