[
    {
        "content": "<p>Hi everyone, I'm Daniel. I'm a logician with some interest in categorical logic and categorical knowledge representation. Let me share my recent preprint on subexponentials in linear logic. Subexponentials generalise the bang operator in (intuitionistic) linear logic. The recent preprint suggests some semantic analysis for subexponentials by refining some results related to the semantics of linear logic.<br>\nThe preprint is available at <a href=\"https://arxiv.org/abs/2507.12360\">https://arxiv.org/abs/2507.12360</a>. I also do a bit more applied research at Noeon Research on categorical knowledge representation, so I also wrote a multimedia essay with my own drawings on the philosophical big picture standing behind the paper (<a href=\"https://subexponentials.substack.com/p/a-walk-through-l\">https://subexponentials.substack.com/p/a-walk-through-l</a>).</p>\n<p>Any feedback (especially criticism) is welcome!</p>",
        "id": 532771763,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754329546
    },
    {
        "content": "<p>I strongly agree with this paragraph:</p>\n<blockquote>\n<p>Many visionaries, investors and top-level managers are led by a rather simplistic system of values, being an amalgamation of libertarianism à la Ayn Rand, uncritical belief in progress and growth at any cost, and the cult of technology. Consider <em>The Techno-Optimist Manifesto</em> by billionaire venture capitalist and self-described “tech bro” Marc Andreessen as an example. Andreessen's manifesto reflects well the axiological principles that guide current tendencies in technology development. The manifesto (along with other outstanding pieces of thought, such as <em>Why AI will save the world</em>) presents the rapid tempo of technological progress as a self-contained value and the universal solution to the most crucial problems. Moreover, the manifesto declares those who propose some reflection beyond progress to be ‘enemies’. Market fundamentalism plays the role of an institution, forcing researchers and engineers’ ideas and inquiries to be market-fit and stigmatising the concepts beyond the needs of the marketplace as a sort of gnostical turpitude. I believe that this system of beliefs is the axiological foundation of the industry's endeavours to subjugate all the segments of our life to neural networks and large language models.</p>\n</blockquote>\n<p>Do  you hope interpretable AI and/or better mathematical logic and/or category theory can help  weaken this system of beliefs?</p>",
        "id": 532864072,
        "sender_full_name": "John Baez",
        "timestamp": 1754382860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> thanks for your comment! Gnostical turpitude is a reference to Vladimir Nabokov's Invitation to a Beheading. It's (roughly) analogous to 1984's thoughtcrime, but I just prefer Nabokov over Orwell :)</p>",
        "id": 532865182,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754383150
    },
    {
        "content": "<p>(In case anyone is wondering, I decided to edit my comment to remove my remarks questioning the use of fancy language like \"axiological\" (a perfectly fine technical term, which however limits the audience that can understand what one is saying) and \"<a href=\"https://www.quora.com/What-is-meant-by-gnostical-turpitude\">gnostical turpitude</a>\".  I put strong value on using simple language, but this is a complete digression from my main point.)</p>",
        "id": 532865907,
        "sender_full_name": "John Baez",
        "timestamp": 1754383333
    },
    {
        "content": "<blockquote>\n<p>Do you hope interpretable AI and/or better mathematical logic and/or category theory can help weaken this system of beliefs?</p>\n</blockquote>\n<p>I think that the weakening of such a system of beliefs should be mainly overcome by tackling intellectual consumerism and its related practices and by studying the complexity of complex ideas (as something that probably has a self-contained value). This is why I refer to Jean Baudrillard and his Consumer Society below.</p>",
        "id": 532865962,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754383349
    },
    {
        "content": "<blockquote>\n<p>I put strong value on using simple language, but this is a complete digression from my main point.</p>\n</blockquote>\n<p>This is a fair point, but I was trying to achieve several goals at the same time: put some ideas in a philosophical landscape with some cultural reminiscences. This is why I refer to Nabokov and put all those drawings. In particular, I mentioned \"gnostical turpitude\" to emphasise the (a sort of) repressive nature of market fundamentalism, often precluding the development of concepts beyond current trends or market conditions</p>",
        "id": 532866612,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754383527
    },
    {
        "content": "<p>UPD: I've just left footnotes to simplify readability for other readers</p>",
        "id": 532905181,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754396626
    },
    {
        "content": "<p>I'm very interested in what we can do anything to help society out of the economic framework we find ourselves trapped in, where the majority of us are (supposedly) reduced to \"consumers\", and the solution to all problems is (supposedly) more \"economic growth\".    It's an urgent problem, as described in the book reviewed here:</p>\n<ul>\n<li>Damian Carrington, <a href=\"https://www.theguardian.com/environment/2025/aug/02/self-termination-history-and-future-of-societal-collapse\">Self-termination is most likely’: the history and future of societal collapse</a>, <em>The Guardian</em>, August 2, 2025.</li>\n</ul>\n<p>So, that's the part of your essay I was most interested in.  The part advocating forms of logic more flexible than classical logic is preaching to the choir here on this Zulip  - I think all but one person here agrees with that.   So that's less gripping to me, though <em>most</em> people on the planet have no clue about different kinds of logic.</p>",
        "id": 532926704,
        "sender_full_name": "John Baez",
        "timestamp": 1754403343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> Thanks very much! I do appreciate your comment. The topic you emphasised appeals to me quite significantly, but I'm not sure whether it fits the topic of this Zulip. Within the context of the essay, the point was that regardless of whether the concepts from the paper (not the essay) allow rigorising knowledge representation, it doesn't suffice to say only \"sorry guys, you're neural nets are just rubbish, you should consider monoidal categories with a bunch of comonads\". It's also worth critically revising what values the industry is currently led by. This is why I criticise such people as Anderseen and all those tech bros. They suggest the modus operandi implying the imitation of knowledge. That's the part of the essay I would also consider the most important one (as well as the drawings).  There will be more logics and their categorical (or algebraic, or Kripke, or realisability, or whatever) semantic frameworks, but the bigger picture of a context requires scrutinising those aspects I call 'axiological'.</p>",
        "id": 532929346,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754404132
    },
    {
        "content": "<p>Thanks for explaining your motives.  I think maybe a short preliminary section in your essay explaining what you're trying to do here might help.</p>\n<p>This Zulip is not a great place to talk about how civilization as we know it is doomed and we should rapidly change our behavior to minimize the catastrophe.   I do however sometimes gently remind people of this.   </p>\n<p>Moving right along:</p>\n<p>One curious thing is that you start by (rightly) criticizing the straitjacket of a \"rather archaic\" approach to logic - classical logic - that category theory helps us escape from, but then switch at the very end to (rightly) criticizing LLMs, which discard classical logic and replace it with the stochastic production of symbol strings.</p>\n<p>So it's as if we were trying to replace classical logic by something more refined, and then the tech bros came along and replaced it with an ingenious box that randomly spews out sentences.</p>",
        "id": 532931123,
        "sender_full_name": "John Baez",
        "timestamp": 1754404717
    },
    {
        "content": "<blockquote>\n<p>Thanks for explaining your motives. I think maybe a short preliminary section in your essay explaining what you're trying to do here might help.</p>\n</blockquote>\n<p>I think I would later publish a Director's cut version that would involve feedback from those who read it critically. I would extend the Foreword section or add some external annotation.</p>",
        "id": 532932056,
        "sender_full_name": "Daniel Rogozin",
        "timestamp": 1754405026
    }
]