[
    {
        "content": "<p>Today I passed my final oral exam for my thesis-based MSc in electrical and computer engineering! My thesis is called \"Enhancing Photoacoustic Resolution Using Sparsity-Based Reconstruction\". Basically, by incorporating prior information about the simplicity of some very simple imaging targets, we were able to make more finely resolved images of them. I'm happy to chat more about this work with anyone that's interested.</p>\n<p>It was extra tough to get to this point because of my health; I have Crohn's Disease, and I struggle with a lot of fatigue. Relating to that, I'd like to thank the people on this zulip for providing a consistently positive and interesting space; it's been a notable support for me.</p>\n<p>I don't know what will come next, but I am hoping that it can include me learning (and ideally applying) some cool math! I'd love to learn a lot more math and see how I can apply it to more deeply understand some of the imaging systems I've worked with in the course of my MSc. On that note, I'll look forward to many more interesting mathematical conversations on this zulip!</p>",
        "id": 350857744,
        "sender_full_name": "David Egolf",
        "timestamp": 1681842573
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> -- I saw this thread from the messages page and hoped to see this post! CONGRATULATIONS! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span>  To overcome all that is truly inspiring! It's been great interacting on Zulip and I hope to see you around more; greatly been enjoying our discussions! Now, go celebrate! <span aria-label=\"partying face\" class=\"emoji emoji-1f973\" role=\"img\" title=\"partying face\">:partying_face:</span></p>",
        "id": 350859322,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1681843052
    },
    {
        "content": "<p>Congratulations!  I'd gotten so interested in my conversations with you here that I'd almost forgotten you have an existence outside Zulip.</p>",
        "id": 350877780,
        "sender_full_name": "John Baez",
        "timestamp": 1681849224
    },
    {
        "content": "<p>My MSc thesis is now available online! Here it is: <a href=\"https://era.library.ualberta.ca/items/a982a37d-ced9-44b7-9ab5-f28cf3e0373f\">thesis link</a>.</p>",
        "id": 403448762,
        "sender_full_name": "David Egolf",
        "timestamp": 1700595041
    },
    {
        "content": "<p>Congratulations!  For those too uncommitted to click the link, the title is <em>Enhancing Photoacoustic Resolution Using Sparsity-Based Reconstruction</em>.</p>",
        "id": 403546696,
        "sender_full_name": "John Baez",
        "timestamp": 1700643261
    }
]