[
    {
        "content": "<p>I wanted to give a bit of an update on my work that intersects with this community.</p>\n<ul>\n<li>Our paper <a href=\"https://arxiv.org/abs/2208.13687\">Categorical semantics of compositional reinforcement learning</a> has finally been accepted at the <a href=\"https://www.jmlr.org/\">Journal of Machine Learning Research</a> with minor revisions. However, the reviewers had some really good feedback that was more expansive that my coauthors and I are addressing in the meantime. There will be an update to the arXiv as soon as we finish those.</li>\n<li>Our simulated results from the theory of the above paper, <a href=\"https://arxiv.org/abs/2408.13376\">Reduce, Reuse, Recycle: Categories for Compositional Reinforcement Learning</a>, got accepted in the 2024 European Conference on Artificial Intellince (ECAI).</li>\n</ul>\n<p>We are now working on an extension trying to understand the concept of generalization in reinforcement learning from a categorical lens, but since I recently moved to Catalunya for a job at Universitat Politècnica de Catalunya - BarcelonaTech (UPC) as faculty, work has been rather slow. I am open to sharing more about the idea if people are interested however (it is in very draft form).</p>\n<p>And a sidenote, I hope to make it to ACT next year, the past three years have been difficult with respect to finding a job and moving a lot (part of academic life) so it made it hard for me to stay on top of what this community is doing. If some of this work intersects with something I have not seen/read (especially in case it is your own work!) please put me back in the loop. As faculty I hope that I will find students (and money for those students) to continue working on this field. In particular, <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> had some good ideas for using Dialectica categories for modeling multi-agent systems that I didn't follow up as much as I hoped and want to revisit. I also have some work on using pullbacks to come up with a more direct algorithm for physical contracts in control that we are now rewriting for submission. Just to not give the impression I am only working on reinforcement learning these days :)</p>",
        "id": 469341032,
        "sender_full_name": "Georgios Bakirtzis",
        "timestamp": 1726047102
    },
    {
        "content": "<p>Congrats on getting your academic job at UPC Barcelona, <span class=\"user-mention\" data-user-id=\"275902\">@Georgios Bakirtzis</span> ! Splendid news! I have not done anything about multiagents and dialectica constructions. yet. Still on my TODO list. so we should chat sometime.</p>",
        "id": 469388906,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1726059061
    }
]