[
    {
        "content": "<p>I love this idea of sharing what we are doing. I will have a go.<br>\nRight now my main focus is to:</p>\n<ul>\n<li>Find a (hopefully interesting) story to structure my thesis around. It will most likely be to perform the following strategy on different examples:<ul>\n<li>To choose a (fragment of a) logic </li>\n<li>To identify a sequent calculus for it where all the structural rules are encoded in the shape of the sequents (without mentioning any connective)</li>\n<li>To define a generalised structure (multicategory/polycategory) that has morphisms of the same shape</li>\n<li>To get a notion of representable objects/universal properties that captures the connectives/logical rules</li>\n<li>To prove that such a structure with all the representable objects is equivalent to the usual categorical models of the logic </li>\n<li>(optionally) To show that the universal properties are in fact specific fibrational properties</li>\n</ul>\n</li>\n</ul>\n<p>I am trying to make this intuition more convincing by:</p>\n<ul>\n<li>Writing down the details of well-known cases:<ul>\n<li>Intuitionistic multiplicative linear logic -&gt; symmetric multicategories -&gt; symmetric monoidal closed categories </li>\n<li>Intuitionistic logic -&gt; symmetric cartesian multicategories -&gt; cartesian closed categories</li>\n</ul>\n</li>\n<li>Clean up the MFPS paper with Noam Zeilberger on <ul>\n<li>Classical multiplicative linear logic -&gt; symmetric polycategories -&gt; *-autonomous categories (the original part is really the fibrational perspective here)</li>\n</ul>\n</li>\n<li>Testing this on a new example inspired by some recent work by Christine Tasson and Martin Hyland<ul>\n<li>Linear-non-linear logic -&gt; LNL-multicategory -&gt; LNL-adjunction</li>\n</ul>\n</li>\n<li>Wondering if something similar could be done for some notion of polarised/focused logic</li>\n</ul>\n<p>Other things that I need to do</p>\n<ul>\n<li>Preparing my semestrial thesis group report/meeting</li>\n<li>Potentially submitting on the non-proceeding track of some conference(s) </li>\n<li>Starting to think about organising the future (graduation early 2022 hopefully): writing up process, listing potential external jury members, informing myself about postdocs/jobs...</li>\n<li>Preparing my talk about categorical semantics of linear logic at our PhD seminar on Monday</li>\n</ul>",
        "id": 235900885,
        "sender_full_name": "Nicolas Blanco",
        "timestamp": 1619208235
    },
    {
        "content": "<p>Sounds like good stuff!   Where are you, and whom are you working with?</p>",
        "id": 235919518,
        "sender_full_name": "John Baez",
        "timestamp": 1619217816
    },
    {
        "content": "<p>Thanks! I am a PhD student at the uni of Birmingham although I am currently living in Paris. My supervisors are Noam Zeilberger and Paul Levy. I also started to collaborate with Alexander Gietelink Oldenziel, who will start a PhD will Paul-André Melliès soon.</p>",
        "id": 235921779,
        "sender_full_name": "Nicolas Blanco",
        "timestamp": 1619219367
    },
    {
        "content": "<p>I've also been thinking recently about LNL-multicategories (and LNL-polycategories).  Maybe we can chat about them sometime.</p>",
        "id": 235922574,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1619220012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span> I would love to! LNL-polycategories was also something I wanted to consider at some point. I am a PhD student so I always have something to do while simultaneously always being available for having a chat about research! Let me know when you have any availability.</p>",
        "id": 235923321,
        "sender_full_name": "Nicolas Blanco",
        "timestamp": 1619220681
    }
]