[
    {
        "content": "<p>In a little over two weeks I'll be giving a talk about my recent paper with Nick Gurski on coherence for pseudomorphisms (details below).  The talk will be in-person with a remote option, and I'd be happy to give the details if anyone is interested. (Send me a chat message.)</p>\n<p>The paper is <a href=\"https://arxiv.org/abs/2312.11261\">arxiv:2312.11261</a>, and I wrote a general-audience overview on this <a href=\"https://mathstodon.xyz/@nilesjohnson/111607399597070286\">mastodon thread</a>.  The main application gives coherence for braided monoidal functors, but the setup is more general.</p>\n<p>If that seems like the kind of thing you're interested in, let me know!</p>\n<p>Talk details:<br>\nTuesday, 02 April<br>\n13:50 Eastern (EDT)<br>\n<time datetime=\"2024-04-02T17:50:00Z\">2024-04-02T17:50:00Z</time><br>\nOSU Quantum Symmetries Group</p>\n<p>Also, if you just have questions about the paper itself, I'm of course happy to talk about it either here or on mastodon :)</p>",
        "id": 426613938,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1710444516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"623323\">@Niles Johnson</span>: if you type <code>&lt;time</code> in Zulip, it will give you a time picker that will automatically format the time according to each user's time zone, which makes it easier for people to tell exactly when the talk is. If I converted correctly, it will be <time datetime=\"2024-04-02T17:50:00Z\">2024-04-02T17:50:00Z</time>?</p>",
        "id": 426654499,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1710463606
    },
    {
        "content": "<p>Thanks; I think I did it now!</p>",
        "id": 426660578,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1710467992
    },
    {
        "content": "<p>Reminder: I'll be giving this talk a week from today at <time datetime=\"2024-04-02T17:50:00Z\">2024-04-02T13:50:00-04:00</time>.  I decided to make the middle half of the talk more accessible with a review/introduction to coherence theorems as characterizations of free algebras.   So, if that's something that interests you, let me know and I'll send you the zoom details.  I'll also post the slides afterward.</p>",
        "id": 429729154,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1711482985
    },
    {
        "content": "<p>Does anyone want a _physical_ copy of my ring categories book with Donald Yau!?  I've got a few extra copies from the publisher (just Volume III).  As a reminder, all three volumes are available for free download:</p>\n<p><a href=\"https://nilesjohnson.net/drafts/Johnson_Yau_ring_categories.pdf\">https://nilesjohnson.net/drafts/Johnson_Yau_ring_categories.pdf</a><br>\n<a href=\"https://nilesjohnson.net/En-monoidal.html\">https://nilesjohnson.net/En-monoidal.html</a></p>\n<p>So I'm just interested if anyone would actually use a physical copy.  I posted more details here on mathstodon:</p>\n<p><a href=\"https://mathstodon.xyz/@nilesjohnson/113636070787494856\">https://mathstodon.xyz/@nilesjohnson/113636070787494856</a></p>\n<p>There, I said I'll mail a copy to anyone who makes a mastodon donation, but I'm open to any donation to any organization you think is appropriate :)  I had five copies, and currently three have been claimed.</p>",
        "id": 488718978,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1734037917
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"623323\">@Niles Johnson</span> , I would love to learn about ring categories and there is more than a 0 percent chance than I try to use it some day in some math project once I understand how cool it is. Is it ok if I make just a super small donation? (I'm a grad student, not very rich ahah)</p>",
        "id": 488724504,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1734039990
    },
    {
        "content": "<p>Or do you want a donation of the real price of the book?</p>",
        "id": 488724708,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1734040084
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/channel/274877-community.3A-our-work/topic/Niles.20Johnson/near/488724708\">said</a>:<br>\nAwesome!</p>\n<blockquote>\n<p>Or do you want a donation of the real price of the book?</p>\n</blockquote>\n<p>Oh no, not even close! An amount that approximately covers shipping would be totally fine, and I'm very open to any amount (including zero!) that is reasonable to you.</p>",
        "id": 488725368,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1734040392
    },
    {
        "content": "<p>I got these copies for free (well, free after a <em>giant</em> amount of work ;) and I want them to go to people who might actually use them.  The donation idea is just a way for me to make a slightly nontrivial barrier, so that people think about whether they really want a physical copy.</p>",
        "id": 488725652,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1734040521
    },
    {
        "content": "<p>If that's you, just send me a dm or email with your address, and tell me something nice you'll do for someone else in return.</p>",
        "id": 488725798,
        "sender_full_name": "Niles Johnson",
        "timestamp": 1734040573
    }
]