[
    {
        "content": "<p>Hi, Our paper about affine monads and lazy Bayesian programming was just accepted to the POPL conference (Principles of Programming Languages). It's more practical than I'm used to, but I'm hoping one use is as a way of experimenting with categorical probability, Markov categories etc.. </p>\n<p>We previously spoke about it at ACT 2022. Quick summary from the ACT abstract is in the table below, although the main technical substance in the POPL paper is probably the new Metropolis-Hastings kernel that works well for laziness. </p>\n<p>A draft of the POPL paper is <a href=\"https://www.cs.ox.ac.uk/people/samuel.staton/papers/popl23.pdf\">here</a>, and the implementation \"LazyPPL\" and examples are <a href=\"https://lazyppl.bitbucket.io/\">here</a>. Very happy to discuss. If you have any corrections, clarifications, or missing citations, I'm very grateful to hear them, although they haven't given us long for the \"camera-ready\" deadline, Thurs 10 Nov AOE. </p>\n<table>\n<thead>\n<tr>\n<th>Traditional probability</th>\n<th>Categorical probability</th>\n<th>Programming in LazyPPL</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Spaces</td>\n<td>Objects</td>\n<td>Types</td>\n</tr>\n<tr>\n<td>Parameterized distributions</td>\n<td>Morphisms</td>\n<td>Programs</td>\n</tr>\n<tr>\n<td>Fubini’s theorem</td>\n<td>Monoidal interchange law</td>\n<td>Reordering lines of programs</td>\n</tr>\n<tr>\n<td>Normalized probabilities (sum to 1)</td>\n<td>Semi-cartesian / terminal unit</td>\n<td>Laziness</td>\n</tr>\n</tbody>\n</table>",
        "id": 308748383,
        "sender_full_name": "Sam Staton",
        "timestamp": 1667986535
    },
    {
        "content": "<p>Looks really interesting,haven't looked into probabilistic programming much but will read this now.That table is really interesting though,since i'm experimenting with 'fuzzifying'/stochastifying basic category theory (specifically universal constructions),so that table looks like additional columns in the computational trilogy table</p>",
        "id": 308754729,
        "sender_full_name": "Simonas Tutlys",
        "timestamp": 1667988710
    }
]