[
    {
        "content": "<p><a href=\"https://meetings.ams.org/math/jmm2023/meetingapp.cgi/Paper/16804\">I'll be talking at the JMM session on topology, algebra, and geometry in data science on 5 Jan.</a> Among other things, I'll be briefly advertising/ranting about magnitude homology and prospective applications for it. </p>\n<p>The underlying position paper is <a href=\"https://hal.archives-ouvertes.fr/hal-03688966\">here</a>. (FWIW, arXiv seemed to really get wrapped around the axle about the \"advertisement\" and/or \"rant\" language: HAL is much more permissive with that and using PDFs instead of killing yourself with LaTeX wrangling). </p>\n<p>I won't be talking about more concrete applications of magnitude to various problems in optimization, but some of these are <a href=\"https://arxiv.org/abs/2201.11677\">here</a> , <a href=\"https://doi.org/10.1145/3520304.3534006\">here</a>, and <a href=\"https://arxiv.org/abs/2201.10037\">here</a>.</p>\n<p>I will be missing the ACT days and most of the rest too, but also won't be representing my employer when I am around, so if anyone wants to give me a piece of their mind (in exchange for a piece of mine) they are most welcome.</p>",
        "id": 307813595,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1667500788
    },
    {
        "content": "<p>Just on the arXiv in time for Thanksgiving: <a href=\"https://arxiv.org/abs/2211.12337\">Quality-diversity in dissimilarity spaces</a>. </p>\n<p><em>The theory of magnitude provides a mathematical framework for quantifying and maximizing diversity. We apply this framework to formulate quality-diversity algorithms in generic dissimilarity spaces. In particular, we instantiate and demonstrate a very general version of Go-Explore with promising performance.</em></p>\n<p>I think this will probably be the last paper I write on applying (Lawvere metric) magnitude to optimization for a while. But there are many other (probably pretty good) applications I have in mind to statistical and ML-type problems, as well as what I think is a family of instantiations of magnitude involving arrow categories generated by data on a transitively closed directed acyclic graph. Over Vect these would be morally close to quantum circuits (though the actual results for unitaries appear trivially uninteresting) or more interestingly and usefully, to the sorts of \"computational graphs\" encountered in automatic differentiation.</p>",
        "id": 311818086,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1669207741
    },
    {
        "content": "<p>Very interesting concrete connection between QD algos and RL,exciting!</p>",
        "id": 311833581,
        "sender_full_name": "Simonas Tutlys",
        "timestamp": 1669212615
    },
    {
        "content": "<p>My paper <a href=\"https://arxiv.org/abs/2201.10037\">Diversity Enhancement via Magnitude</a> has been accepted to <a href=\"https://emo2023.liacs.leidenuniv.nl/\">Evolutionary Multi-Criterion Optimization 2023</a></p>",
        "id": 314292173,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1670349754
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/274877-practice.3A-our-work/topic/Steve.20Huntsman/near/311818086\">said</a>:</p>\n<blockquote>\n<p>Just on the arXiv in time for Thanksgiving: <a href=\"https://arxiv.org/abs/2211.12337\">Quality-diversity in dissimilarity spaces</a>. </p>\n<p><em>The theory of magnitude provides a mathematical framework for quantifying and maximizing diversity. We apply this framework to formulate quality-diversity algorithms in generic dissimilarity spaces. In particular, we instantiate and demonstrate a very general version of Go-Explore with promising performance.</em></p>\n</blockquote>\n<p><a href=\"https://gecco-2023.sigevo.org/Best-Paper-Nominations#&amp;sort[wptrackerlist23-1]=0-0&amp;filter[wptrackerlist23-1]=GECH--\">The nominee for best paper</a> from the <a href=\"https://gecco-2023.sigevo.org/Tracks#GECH%20-%20General%20Evolutionary%20Computation%20and%20Hybrids\">General Evolutionary Computation and Hybrids track</a> at GECCO 2023. The paper includes code and examples, including scripts in the LaTeX source for reproducing results (Gitlab is annoying).</p>",
        "id": 360290906,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684765958
    },
    {
        "content": "<p>I'll also be talking in my personal capacity on 10 July at the <a href=\"https://meetings.siam.org/sess/dsp_programsess.cfm?SESSIONCODE=77580\">Applications of Magnitude and Magnitude Homology to Network Analysis minisymposium</a> at the <a href=\"https://www.siam.org/conferences/cm/conference/ag23\">SIAM Conference on Applied Algebraic Geometry</a> at TU Eindhoven.</p>",
        "id": 360291967,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684766166
    },
    {
        "content": "<p>And giving a <a href=\"https://gecco-2023.sigevo.org/Accepted-Hot-off-the-Press-Papers\">non-proceedings talk</a> on enhancing diversity in multiobjective optimization at GECCO as well.</p>",
        "id": 360292414,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1684766275
    }
]