[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/Mike.20Shulman/near/224275261\">said</a>:</p>\n<blockquote>\n<p>Ok, let's inaugurate this stream.  The idea was for people to share something in personal threads about what they're working on right now, following on what <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> did in another stream.   So here's what I'm working on right now research-wise:</p>\n<ol>\n<li>\n<p>Finish <em>The univalence principle</em> with Benedikt Ahrens and Paige North, a much longer elaboration of <em>A Higher Structure Identity Principle</em>.</p>\n</li>\n<li>\n<p>&lt;redacted&gt;</p>\n</li>\n<li>\n<p>Revise and submit <em>All (∞,1)-toposes have strict univalent universes</em> for publication.</p>\n</li>\n<li>\n<p>Revise <em>Constructing symmetric monoidal bicategories functorially</em> (with Linde Wester Hansen), <em>Linear logic for constructive mathematics</em>, and <em>A practical type theory for symmetric monoidal categories</em> based on referee reports.</p>\n</li>\n<li>\n<p>Expand my categorical logic notes into a textbook.</p>\n</li>\n<li>\n<p>Various less-well-defined pending projects about HoTT and its semantics, including modal dependent type theory (with Dan Licata and Mitchell Riley), modeling HITs, modeling cubical type theories, modeling HoTT in elementary/realizability (∞,1)-toposes, stack semantics of 1-toposes, and impredicative constructions of HITs.</p>\n</li>\n<li>\n<p>A couple of unfinished projects involving <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous categories.</p>\n</li>\n</ol>\n</blockquote>\n<p>On a much more general level, I partially dislike the idea of declaring what we are working on.</p>\n<p>In order to motivate this, let me provide a very concrete example. In your personal nlab wiki you started describing the broad project of 2-categorical logic. What one sees on the nlab is a collection of statements that mostly puts together the standard australian literature on the topic. Yet, from time to time I have seen people saying \"Shulman's treatment of n-categorical logic\". Now, as a young researcher I am very interesting in the topic, but one feels like all the theorems I could be proving somehow already have a name on them, even though as a fact no publication, nor preprint discusses them. I do understand that it was not your intention to \"delimiter your territory\", but one should consider, especially with such an influential character, that this is the possible outcome of such a thing.</p>\n<p>Now, I am sure that some people will come here and say \"Are you saying that you do mathematics to pur your name on it?\", and I honestly believe that on a very human level, the answer to this question is - at least partially - always yes. To be more precise, what I would definitely dislike is if I prove something, possibly putting a lot of effort in it, and someone else gets his/her name on it. This is very different from \"I want my name on stuff\", it's just \"I don't like when someone eventually get his/her name attached to everything just because he or she is sufficiently famous or influential\".</p>\n<p>Again, Mike, I hope you will not take it personally, and from the very surperficial interaction I had with you, it seems evident to me that you are not trying to do anything like what I have described. On the other hand, heterogony of ends is a thing.</p>",
        "id": 224322986,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1611839450
    },
    {
        "content": "<p>I moved this comment to a new topic because it's tangential to the original topic, and I wanted to respond with my own thoughts without distracting from that one.</p>",
        "id": 224332296,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611843944
    },
    {
        "content": "<p>I disagree that sharing what people are working on contributes to these sorts of problems, at least not to the extent that the situation becomes worse than it is now. It is already the case that folklore in mathematics (more infamously in certain areas) is problematic, in that newer researchers end up rediscovering known results that are not written down anyway (or at least anywhere that is accessible or discoverable) and are penalised for this. Sharing the ideas one is working on does not make this worse: the ideas are known to someone whether they are widely shared immediately, or only later (or never at all), and that person may declare the ideas to be originally theirs. However, if they are shared widely from the outset, it sets precedent, making it clearer who really is the originator of a certain idea or result; it also gives other people an opportunity to start discussion and sharing ideas at a much earlier point in the process.</p>\n<p>Let's say someone did write down an idea that was known to someone else already, and people were inclined to attribute that idea to them. Now, either they were the first to come up with that idea, in which case it seems reasonable to attribute that idea to them; or someone else came up with the idea first. In the latter case, if it is already in the literature, then someone may point to this as an example of priority; if it is not, then it is folklore, and we have exactly the same problem we have already.</p>",
        "id": 224333381,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611844345
    },
    {
        "content": "<p>Sharing the ideas one is working on seems much the same as giving a talk at a conference on unpublished work: the ideas may be there, but it has not been fully worked out.</p>",
        "id": 224333791,
        "sender_full_name": "Nathanael Arkor",
        "timestamp": 1611844501
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276092\">Nathanael Arkor</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/thoughts.20on.20sharing.20ideas/near/224333381\">said</a>:</p>\n<blockquote>\n<p>I disagree that sharing what people are working on contributes to these sorts of problems, at least not to the extent that the situation becomes worse than it is now. It is already the case that folklore in mathematics (more infamously in certain areas) is problematic, in that newer researchers end up rediscovering known results that are not written down anyway (or at least anywhere that is accessible or discoverable) and are penalised for this. Sharing the ideas one is working on does not make this worse: the ideas are known to someone whether they are widely shared immediately, or only later (or never at all), and that person may declare the ideas to be originally theirs. However, if they are shared widely from the outset, it sets precedent, making it clearer who really is the originator of a certain idea or result; it also gives other people an opportunity to start discussion and sharing ideas at a much earlier point in the process.</p>\n<p>Let's say someone did write down an idea that was known to someone else already, and people were inclined to attribute that idea to them. Now, either they were the first to come up with that idea, in which case it seems reasonable to attribute that idea to them; or someone else came up with the idea first. In the latter case, if it is already in the literature, then someone may point to this as an example of priority; if it is not, then it is folklore, and we have exactly the same problem we have already.</p>\n</blockquote>\n<p>You know how much I respect you Nathanael, but I think this is naive perspective on the problem. Let me discuss this:</p>\n<ol>\n<li>\n<p>A project, especially a very broad one, can be more or less evident (or natural, or canonical) to all the expert enough members of the community. If one of these experts discusses the project, considering that many non-experts (or non-mature researchers) inside the community are not aware of the big picture, is capitalizing the attention of the community on him/herself. I do not want to offend anyone here, but there is an incredible amount of examples of this. Often, even worse happens, the outer communities tend to attribute everything to those aggregator of ideas. This has happened for example to Jacob Lurie, (who is of course a genius, and a fantastic mathematician), but nowadays gets credited for essentially the invention of the weel. I have heard from algebraic geometers that he invented the tensor product of locally presentable categories (!). So that's the first thing I think you are underestimating, that social aspects of mathematics are attached to communities full of people that do not know the whole story, and will not read it.</p>\n</li>\n<li>\n<p>You link this to the very famous story of \"folklore mathematics\", well, I think this is much worse than that. In the case of folklore mathematics, most of the time, the result is truly known. But when I say (the following is a made-up example) \"my big project is to develop the theory of 2-monads, inspired by this and this paper\", I am even \"taking merits\" for theorems that are not even formulated!</p>\n</li>\n</ol>\n<p>Unfortunately, I have the impression that when one sees my message from the fairy point of view that academia is a collection of individuals that are all working together towards a world of wisdom and knowlege, everything I say will always look strange and unmotivated. On the other hand, when you look at academia as a collection of communities, paying tribute to their cultural totems, having their idols and heroes, the discussion is suddenly much more realistic and pertinent.</p>",
        "id": 224335713,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1611845244
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277318\">Ivan Di Liberti</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/thoughts.20on.20sharing.20ideas/near/224335713\">said</a>:</p>\n<div class=\"codehilite\"><pre><span></span><code>This has happened for example to Jacob Lurie, (who is of course a genius, and a fantastic mathematician), but nowadays gets credited for essentially the invention of the weel. I have heard from algebraic geometers that he invented the tensor product of locally presentable categories (!).\n</code></pre></div>\n<p>Let me stress here, that I believe this process is partially unavoidable, especially on the long run. I just don't want to boost it!</p>",
        "id": 224337474,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1611845976
    },
    {
        "content": "<p>But is the responsibility not on the readers to correctly attribute the ideas they read about?</p>",
        "id": 224338544,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611846373
    },
    {
        "content": "<p>This is especially true when it comes to the nLab where the mission statement very explicitly states that it is basically an open notebook.</p>",
        "id": 224338673,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611846426
    },
    {
        "content": "<p>Some people like to communicate what they’re thinking about maybe because it helps them think clearer. I can’t really fault them, particularly when this communication is helping others learn too.</p>",
        "id": 224339504,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1611846804
    },
    {
        "content": "<p>I'll have more to say about this question later, which I think is a very important one.  But I want to say regarding my nLab pages on 2-categorical logic that I disagree they are just \"a collection of statements that mostly puts together the standard australian literature on the topic\".  It's true that some of what's there is a reworking of some older Australian stuff, but there is plenty of new stuff there too, e.g. the material on local exponentials, fibrational slices, cores, different levels of exactness, and so on. </p>\n<p>At the same time, for reasons including the ones you give, I am unhappy with how that project got started and then \"abandoned in public view\", with the result that I haven't ever used my \"personal nLab space\" for anything like that again.  Generally I either do my work privately until it's complete, or work on the main nLab so that it's clearly a collaborative effort with anyone else in the world and everything is \"finished\" as soon as it's written.</p>\n<p>However, this is not the same question as sharing brief descriptions of things that we're working on privately.</p>",
        "id": 224343377,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611848293
    },
    {
        "content": "<p>Also, keep in mind that I was not at all \"influential\" at the time I wrote those 2-categorical logic pages!  Most of them were written when I was still a graduate student.  Nor was the nLab nearly as well-known as it is now.</p>",
        "id": 224344038,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611848487
    },
    {
        "content": "<p>For reference, <span class=\"user-mention\" data-user-id=\"277318\">@Ivan Di Liberti</span>, see <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/HIstory.20of.20Ideas.20AMA.3A.20John.20Baez/near/223943860\">this thread</a> for the motivation for this stream.<br>\nI would say this stream is limited enough in scope to avoid the problems you're worrying about; someone saying \"hey, I'm working on X\" is far from a formal claim over any results proved in domain X. The hope was to inspire some excitement and discussion about what people are working on without them having to present anything fully polished.</p>",
        "id": 224344258,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1611848561
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> last comments.   Here's the sort of thing I'm likely to say in <a class=\"stream\" data-stream-id=\"274877\" href=\"/#narrow/stream/274877-practice.3A-our-work\">#practice: our work</a>.  Note, it's not explaining ideas I've had, it's just saying in a rather mundane way what I need to do:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/232163-learning.3A-history.20of.20ideas/topic/HIstory.20of.20Ideas.20AMA.3A.20John.20Baez/near/223943800\">said</a>:</p>\n<blockquote>\n<p>My life is changing now that I've finished all papers with grad students except for one!   Here's my to-do list now:</p>\n<ol>\n<li>\n<p>Finish \"Structured versus decorated cospans\" with <span class=\"user-mention silent\" data-user-id=\"276972\">Kenny</span>  and @_<strong>Christina V</strong> .    Submitted to the arXiv and <em>Transactions of the AMS</em>, but Kenny and I are still writing up all details of the proofs of two theorems, which involve lots of big commutative diagrams.  We're meeting once a week on Mondays at 11 to work on that.</p>\n</li>\n<li>\n<p>Submit LaTeX of \"Open systems in classical mechanics\" to <em>Journal of Mathematical Physics</em>, who accepted this paper with David Weisbart and Adam Yassine.</p>\n</li>\n<li>\n<p>Work on \"Schur functors\" with <span class=\"user-mention silent\" data-user-id=\"275914\">Joe Moeller</span> and <span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span>.  Stalled, but soon to be revived.   It's about 3/4 done.</p>\n</li>\n<li>\n<p>Prepare a talk for Friday  February 5, 2021 on \"Structured versus Decorated Cospans\" for the Yorkshire and Midlands Category Seminar.</p>\n</li>\n<li>\n<p>Prepare a talk for Monday March 8, 2021 at the Zurich Theoretical Physics Colloquium, perhaps called \"Theoretical Physics in the 21st Century\", as part of their Sustainability Week.    The idea is to talk about the most exciting areas in physics... but with an emphasis on what physicists can do to save the planet.</p>\n</li>\n<li>\n<p>Prepare a talk  for Thursday March 18, 2021 for the Topos Institute seminar.   Maybe something similar to 4. but with applied category theory instead of physics.</p>\n</li>\n<li>\n<p>Prepare a talk on octonions and the Standard Model for Kirill Krasnov's workshop on this seminar.</p>\n</li>\n<li>\n<p>Write an article on condensed matter physics for <em>Nautilus</em> magazine.</p>\n</li>\n</ol>\n</blockquote>",
        "id": 224349993,
        "sender_full_name": "John Baez",
        "timestamp": 1611850631
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>'s post was similar:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/Mike.20Shulman/near/224275261\">said</a>:</p>\n<blockquote>\n<p>Ok, let's inaugurate this stream.  The idea was for people to share something in personal threads about what they're working on right now, following on what <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> did in another stream.   So here's what I'm working on right now research-wise:</p>\n<ol>\n<li>\n<p>Finish <em>The univalence principle</em> with Benedikt Ahrens and Paige North, a much longer elaboration of <em>A Higher Structure Identity Principle</em>.</p>\n</li>\n<li>\n<p>&lt;redacted&gt;</p>\n</li>\n<li>\n<p>Revise and submit <em>All (∞,1)-toposes have strict univalent universes</em> for publication.</p>\n</li>\n<li>\n<p>Revise <em>Constructing symmetric monoidal bicategories functorially</em> (with Linde Wester Hansen), <em>Linear logic for constructive mathematics</em>, and <em>A practical type theory for symmetric monoidal categories</em> based on referee reports.</p>\n</li>\n<li>\n<p>Expand my categorical logic notes into a textbook.</p>\n</li>\n<li>\n<p>Various less-well-defined pending projects about HoTT and its semantics, including modal dependent type theory (with Dan Licata and Mitchell Riley), modeling HITs, modeling cubical type theories, modeling HoTT in elementary/realizability (∞,1)-toposes, stack semantics of 1-toposes, and impredicative constructions of HITs.</p>\n</li>\n<li>\n<p>A couple of unfinished projects involving <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>∗</mo></mrow><annotation encoding=\"application/x-tex\">\\ast</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.46528em;vertical-align:0em;\"></span><span class=\"mord\">∗</span></span></span></span>-autonomous categories.</p>\n</li>\n</ol>\n</blockquote>",
        "id": 224350705,
        "sender_full_name": "John Baez",
        "timestamp": 1611850863
    },
    {
        "content": "<p>On the whole I think it helps the world more than hurts to have people explain what they're doing in this way.</p>",
        "id": 224350902,
        "sender_full_name": "John Baez",
        "timestamp": 1611850932
    },
    {
        "content": "<p>There's also a lot to say about how people get credit for ideas, how people describe some results as being \"folklore\", how hard we try to find citations for results, how likely we are to cite famous people vs. less famous people, etc.</p>",
        "id": 224351644,
        "sender_full_name": "John Baez",
        "timestamp": 1611851233
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/thoughts.20on.20sharing.20ideas/near/224343377\">said</a>:</p>\n<blockquote>\n<p>I'll have more to say about this question later, which I think is a very important one.  But I want to say regarding my nLab pages on 2-categorical logic that I disagree they are just \"a collection of statements that mostly puts together the standard australian literature on the topic\".  It's true that some of what's there is a reworking of some older Australian stuff, but there is plenty of new stuff there too, e.g. the material on local exponentials, fibrational slices, cores, different levels of exactness, and so on. </p>\n</blockquote>\n<p>You are right, but I think this does not change the validity of my argument.</p>",
        "id": 224354159,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1611852217
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/274877-practice.3A-our.20work/topic/thoughts.20on.20sharing.20ideas/near/224343377\">said</a>:</p>\n<blockquote>\n<p>At the same time, for reasons including the ones you give, I am unhappy with how that project got started and then \"abandoned in public view\", with the result that I haven't ever used my \"personal nLab space\" for anything like that again.  Generally I either do my work privately until it's complete, or work on the main nLab so that it's clearly a collaborative effort with anyone else in the world and everything is \"finished\" as soon as it's written.</p>\n</blockquote>\n<p>I am happy that you partially share my reasons. Again, this was very far from being a personal attack.</p>",
        "id": 224354332,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1611852287
    },
    {
        "content": "<p>Don't worry, you were very clear, and I didn't take it as one.</p>",
        "id": 224359339,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611853863
    },
    {
        "content": "<p>Regarding the main point of this thread, while I generally agree with Morgan and John that what we're proposing to do here is not likely to become a big problem because of its limited scope, I do think we should take care to <em>keep</em> that scope limited.  John's to-do list didn't really discuss any actual mathematics; it was mainly about papers he was revising or finishing, with nothing mentioned about the paper except the name and collaborators.  Of course, in some cases even the name of a paper-in-preparation (or the people working on it) carries some mathematical information, but I think it's limited enough not to be much of a problem (especially if it's limited to mentioning papers that are almost finished) -- and, of course, mentioning the revision of preprints that are already posted should be unproblematic.</p>\n<p>My to-do list mostly adhered to the same limits, except for point (6).  I'm open to the argument that including point (6) was a mistake.  In hindsight, I can see that mentioning those ideas for future work, even at a vague and high level, might discourage others from working on those same problems -- which is, in fact, especially problematic given that I myself very well might not get around to actually working on any of those subjects!  I will try to be more concrete and less mathematically specific in future.  (Although, to be fair to myself, many of the subjects mentioned in that list are ones that I've already given talks or written blog posts about, so the information that I'm thinking about them is already \"out there\" somewhere.)</p>",
        "id": 224363449,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1611855461
    },
    {
        "content": "<p>I think many people on here are interested in the idea of public research, i.e. open collaboration and knowledge sharing. we need better infrastructure for this; <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> and I want to help in development. we'll start a conversation sometime soon.</p>",
        "id": 224618951,
        "sender_full_name": "Christian Williams",
        "timestamp": 1612062332
    }
]