[
    {
        "content": "<p>I think the idea of this channel is very nice, but find kind of difficult to write my own version. Here's an attempt.</p>\n<ol>\n<li>I intend to continue thinking and writing about  \"Dialectica constructions and Polynomials\" -- the \"and\" is distributive, only dialectica and only polynomials are included. There's the work with Davide Trotta and Matteo Spadetto on the Godel Fibration (<a href=\"https://arxiv.org/abs/2104.14021\">https://arxiv.org/abs/2104.14021</a>), which has just appeared in MFCS and its sequel, which we're working on now.</li>\n<li>There is the work on networked mathematics with Brendan and others that need to be written about. But at least there is the blog post (<a href=\"https://topos.site/blog/2021/07/introducing-the-mathfoldr-project/\">https://topos.site/blog/2021/07/introducing-the-mathfoldr-project/</a>)</li>\n<li>There is the work with Katerina Kalouli on semantics of natural languages, available from her resources page (<a href=\"https://cis.lmu.de/~kalouli/resources.html\">https://cis.lmu.de/~kalouli/resources.html</a>) that needs to be explored. The beautiful GKR framework (for graphical knowledge representation) has been put in place (go and play with it, if interested), now is time to use it!</li>\n<li>There is the work with Luiz Carlos and Elaine in ecumenical systems (these have in the same framework both constructive and classical logic), after \"A proof theoretical view of ecumenical systems\"  and \"An Ecumenical Notion of Entailment\" (<a href=\"https://vcvpaiva.github.io/includes/pubs/2019-ecumenical.pdf\">https://vcvpaiva.github.io/includes/pubs/2019-ecumenical.pdf</a>). We're working on the role of negation in this framework.</li>\n<li>There are several  semi-written papers about lexical resources and semantics for Portuguese with Alexandre Rademaker that need to be finished. The Portuguese wordnet project is up at <a href=\"http://openwordnet-pt.org\">http://openwordnet-pt.org</a>, but I need to think about next steps.</li>\n</ol>\n<p>So there are too many  loose ends and what I call facetiously \"ValeriaReprints\" that need to be finished. Collaboration in all  these projects is very welcome!</p>",
        "id": 252336178,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1631033688
    },
    {
        "content": "<p>small update:</p>\n<ol>\n<li>\n<p>sequel of previous item #1 is \"Dialectica Logical Principles\" (<a href=\"https://arxiv.org/abs/2109.08064\">https://arxiv.org/abs/2109.08064</a>), accepted for LFCS2022.  Davide and Matteo working very fast.<br>\nwork with Elena di Lavore and Wilmer Leal in \"Dialectica Petri Nets\" is in the arXiv <a href=\"https://arxiv.org/abs/2105.12801\">https://arxiv.org/abs/2105.12801</a>, has been submitted to SYCO.</p>\n</li>\n<li>\n<p>Some work on NLI/ECD is still been written, but a paper was accepted and will be presented at STIL (Nov 29th to Dec 3rd, 2021) <a href=\"http://comissoes.sbc.org.br/ce-pln/stil2021/index.html\">http://comissoes.sbc.org.br/ce-pln/stil2021/index.html</a></p>\n</li>\n<li>Work on Ecumenical systems still not written, but talk submitted to  1st Meeting Brazil-Colombia in Logic<br>\n<a href=\"https://sites.google.com/unal.edu.co/i-enclogbracol/\">https://sites.google.com/unal.edu.co/i-enclogbracol/</a><br>\n#2 and #5 are letting the side down, but happy to report that the work on IMLA (Intuitionistic Modal Logic and Applications 2017) with Artemov has just appeared  (<a href=\"https://collegepublications.co.uk/ifcolog/?00050\">https://collegepublications.co.uk/ifcolog/?00050</a>) and I got to know about it because a friend in Australia  Shawn tweeted about it!<br>\nHugo's undergrad thesis submitted as conference paper, Roberta master thesis on CodeNames examined are the extras, so far.</li>\n</ol>",
        "id": 259587984,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1635544697
    },
    {
        "content": "<p>I had almost given up on writing here on things that will happen, but now I have an important announcement.<br>\nNext year there will be a Hausdorff Institute of Mathematics (Bonn, DE) Trimester on <a href=\"https://www.him.uni-bonn.de/programs/future-programs/future-trimester-programs/prospects-of-formal-mathematics/description/\">\"Prospects on Formalized Mathematics\"</a> and people can apply to it, especially junior people. So if you're interested in Formalization of Mathematics, read about the trimester, May-August 2024 (organized together with Kevin Buzzard, <span class=\"user-mention\" data-user-id=\"296322\">@Jacques Carette</span> , Michael Kohlhase, and Josef Urban) and apply!</p>",
        "id": 385762548,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1692311387
    },
    {
        "content": "<p>Great!</p>",
        "id": 385921146,
        "sender_full_name": "John Baez",
        "timestamp": 1692366957
    }
]