[
    {
        "content": "<p>We (<span class=\"user-mention\" data-user-id=\"319149\">@Nivedita</span>  and I) wanted to introduce elliptic cohomology and Stolz-Teichner's conjecture. in a CFT class consisting of undergrads and first year grad students in physics. We tried going along the route taken by <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span>  in <a href=\"https://math.ucr.edu/home/baez/week197.html\">TWF Week 197</a>.</p>\n<p>However, the class didn't quite see the point and didn't want abstract mathematical definitions. They wanted some sort of a calculation that would illustrate the point. So we were thinking of going through Witten's paper <a href=\"https://projecteuclid.org/euclid.cmp/1104117076\">Elliptic Genera and Quantum Field Theory</a>.</p>\n<p>Can you think of some other good ways to motivate the subject to the class via a basic CFT/String theory calculation?</p>",
        "id": 214415171,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1603527478
    },
    {
        "content": "<p>In an undergrad / first year physics class I would try to explain the <em>physics</em> of string theory, not elliptic cohomology.</p>",
        "id": 214435103,
        "sender_full_name": "John Baez",
        "timestamp": 1603555644
    },
    {
        "content": "<p>I would probably follow this book:</p>\n<ul>\n<li>Barton Zwiebach, <em>A First Course in String Theory</em>, Cambridge U. Press, Cambridge, 2004.</li>\n</ul>",
        "id": 214435162,
        "sender_full_name": "John Baez",
        "timestamp": 1603555697
    },
    {
        "content": "<p>I don't know how to get people interested in elliptic cohomology if they don't already understand algebraic topology pretty well... and I also don't know <em>why</em> such people should study elliptic cohomology.</p>",
        "id": 214435199,
        "sender_full_name": "John Baez",
        "timestamp": 1603555792
    },
    {
        "content": "<p>The reason I thought they may be interested is because the Stolz-Teichner conjecture basically says that TMF is related to the (homotopy type) of the space of Supersymmetric CFTs. The homotopy type of a space of QFTs is interesting (especially in condensed matter) as it is used to classify phases. That's why I thought there may be a physicsy way to motivate the subject.</p>",
        "id": 214439536,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1603561031
    },
    {
        "content": "<p>Students are always more amenable to formalisms if they know what they're for, speaking as a student rather than an experienced teacher.</p>\n<p>To explain advanced topics to someone without the relevant background to accept it as self-motivated (or motivated by the matter it builds off), the key is to identify what that topic can <em>do</em> for them, and to wrap the theory around the promised utility carried by that strand. That might be the result of a calculation (eg, the classic one in algebraic topology is \"the invariant of space X is A, but the invariant of space Y is B, so these spaces are not equivalent!\"), a sketch of a correspondence (eg, \"the semi-simple Lie algebras correspond to these Dynkin diagrams!\") or just a picture of a situation that is not apparent from basic definitions (eg, how Jordan Normal Form gives us a way to straightforwardly decompose the information content of a matrix). The phase classification and the TMF/CFT correspondence both sound like promising starting points, if you can explain how it relates to physical phases.</p>",
        "id": 214503228,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1603649014
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319282\">Chetan Vuppulury</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/CFT.20and.20Elliptic.20Cohomology.20for.20Physicists/near/214439536\">said</a>:</p>\n<blockquote>\n<p>The reason I thought they may be interested is because the Stolz-Teichner conjecture basically says that TMF is related to the (homotopy type) of the space of Supersymmetric CFTs. The homotopy type of a space of QFTs is interesting (especially in condensed matter) as it is used to classify phases. That's why I thought there may be a physicsy way to motivate the subject.</p>\n</blockquote>\n<p>Okay, that could be interesting!  You could explain a (small, manageable) space of QFTs and show how a noncontractible loop in it gives something interesting in condensed matter physics.   That would be mind-blowing to students, yet also much more \"practical\" than anything about TMF or supersymmetric CFTs.</p>",
        "id": 214503995,
        "sender_full_name": "John Baez",
        "timestamp": 1603649879
    },
    {
        "content": "<p>I should admit - though it's probably already evident - that I'm not a big fan of teaching beginning students about the latest fashionable fancy ideas.  I think it serves them better to get really clear explanations of fundamental concepts.</p>",
        "id": 214504279,
        "sender_full_name": "John Baez",
        "timestamp": 1603650138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> <span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span>  , I think I wasn't clear. I too am a student in this class, and as part of the course, we are all presenting some more advanced aspects of the subject. Being mathematically inclined, with a background in algebraic topology and category theory, I wanted to do something mathematical. However, the rest of the students and the instructor are more traditional physicists, and they couldn't quite understand the point. As the instructor (a string theorist) claimed, they thought it was just math, not interesting to a physicist. So I thought there would be some good way to convince them otherwise.</p>",
        "id": 214538729,
        "sender_full_name": "Chetan Vuppulury",
        "timestamp": 1603695051
    },
    {
        "content": "<p><del>Kind of ironic for a string theorist to be claiming anything is \"just math, not interesting to a physicist\".</del><br>\nIn that case, I would like to add to my previous suggestion that if you haven't gotten deep enough into the theory to articulate clearly what 'the point' is to yourself, it may be difficult to convince anyone else of its value. Going from understanding some theory to teaching it coherently requires a lot of time and patience in the condensation and refinement process. If you have time to undergo that process and to try to present the material again later in the course, maybe you'll find some insight that will get your fellow students on board.</p>",
        "id": 214553220,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1603706035
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319282\">@Chetan Vuppulury</span> - I take back my complaints: I thought you were teaching the course.  As an instructor it'd be your duty to focus on ideas that would help the students as much as possible; as a student it's great to dive into whatever excites you most!  But getting other students interested may be tough.</p>",
        "id": 214590297,
        "sender_full_name": "John Baez",
        "timestamp": 1603726847
    },
    {
        "content": "<p>There is probably <em>some</em> way to convince physics students that the Witten genus, elliptic cohomology and the Stolz-Teichner conjecture are interesting, but I don't know enough string theory to know the right angle.  For me they're mainly great examples of how string theory has uncovered fundamental mathematical structures - in this case, great new ideas in topology.</p>",
        "id": 214591203,
        "sender_full_name": "John Baez",
        "timestamp": 1603727139
    }
]