[
    {
        "content": "<p>I updated the \"open questions in physics\" FAQ on cosmic censorship:</p>\n<ul>\n<li><a href=\"https://johncarlosbaez.wordpress.com/2020/12/31/cosmic-censorship/\">Cosmic censorship</a>.</li>\n</ul>\n<p>Here's the current version, minus the references.  If it seems too confusing, please ask a question.  You folks - mostly not physicists - are more or less the target audience of the FAQ, though most of you know too much math to fit squarely into that demographic.  So, I don't state the cosmic censorship hypothesis in a mathematically precise way here: that can be found in the references (omitted here):</p>\n<blockquote>\n<p><strong>Does Cosmic Censorship hold? Roughly, is general relativity a deterministic theory—and when an object collapses under its own gravity, are the singularities that might develop guaranteed to be hidden behind an event horizon?</strong></p>\n<p>Proving a version of Cosmic Censorship is a matter of mathematical physics rather than physics per se, but doing so would increase our understanding of general relativity. There are actually at least two versions: Penrose formulated the \"Strong Cosmic Censorship Conjecture\" in 1986 and the \"Weak Cosmic Censorship Hypothesis\" in 1988.  Very roughly, strong cosmic censorship asserts that under reasonable conditions general relativity is a deterministic theory, while weak cosmic censorship asserts that that any singularity produced by gravitational collapse is hidden behind an event horizon.  Despite their names, strong cosmic censorship does not imply weak cosmic censorship.</p>\n<p>In 1991, Preskill and Thorne made a bet against Hawking in which they claimed that weak cosmic censorship was false.  Hawking conceded this bet in 1997 when a counterexample was found by Matthew Choptuik.  This features finely-tuned infalling matter poised right on the brink of forming a black hole.  It <em>almost</em> creates a region from which light cannot escape—but not quite.  Instead, it creates a naked singularity!</p>\n<p>Given the delicate nature of this construction, Hawking did not give up.  Instead he made a new bet, which says that weak cosmic censorship holds \"generically\"—that is, except for very unusual conditions that require infinitely careful fine-tuning to set up.   </p>\n<p>In 1999, Christodoulou proved that for spherically symmetric solutions of Einstein's equation coupled to a massless scalar field, weak cosmic censorship holds generically.  While spherical symmetry is a very restrictive assumption, this result is a good example of how, with plenty of work, we can make progress in rigorously settling the questions raised by general relativity.</p>\n<p>What about strong cosmic censorship?   In general relativity, for each choice of initial data—that is, each choice of the gravitational field and other fields at \"time zero\"—there is a region of spacetime whose properties are completely determined by this choice.  The question is whether this region is always the whole universe.  That is: does the present determine the whole future?</p>\n<p>The answer is: not always!  By carefully choosing the fields at time zero you can manufacture counterexamples.  But Penrose, knowing this, claimed only that <em>generically</em> the fields at time zero determine the whole future of the universe.</p>\n<p>In 2017, Mihalis Dafermos and Jonathan Luk showed that even this is false if you don't demand that the fields stay smooth.  But perhaps the conjecture can be saved if we require that:</p>\n<p>• Kevin Hartnett, <a href=\"https://www.quantamagazine.org/mathematicians-disprove-conjecture-made-to-save-black-holes-20180517\">Mathematicians Disprove Conjecture Made to Save Black Holes</a>.<br>\n</p>\n</blockquote>",
        "id": 221802855,
        "sender_full_name": "John Baez",
        "timestamp": 1609957343
    }
]