[
    {
        "content": "<p>here's a very vague and barely-thought-out question that i'm hoping somebody will reply to with either an answer or a better version of my question: when dealing with quantum channels (or super-operators, or CPTP maps, or whatever you want to call them), it is a nice fact that we can always decompose them into three parts:</p>\n<ol>\n<li>an <strong>expansion</strong> (via an isometric embedding);</li>\n<li>a unitary evolution (of the whole system); and<br>\n3  a <strong>reduction</strong> (via a partial trace).</li>\n</ol>\n<p>Now, i'm very much not a quantum information scientist, nor am i really a category theorist (in fact, what am i?), but this sort of decomposition looks very categorical to me. I know that categorical quantum mechanics is a hot topic, but i've only ever seen the categories show up in terms of string diagrams and such like. What's happening here looks a bit more like some sort of \"model category\" thing, or maybe something closer to an exact sequence...</p>",
        "id": 222183300,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610217660
    },
    {
        "content": "<p>i guess there's not really a question in the above (so i've become one of those people who, during the question time after a talk, says \"this is really more of a comment...\", sorry!), but i guess i'm just looking for comments rather than answers then :-)</p>",
        "id": 222183328,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610217701
    },
    {
        "content": "<p>Given any <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"normal\">†</mi></mrow><annotation encoding=\"application/x-tex\">\\dag</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mord\">†</span></span></span></span> -compact closed category, there is a notion of category of quantum channels, called the CPM construction.  This was first discovered in the following paper of Selinger <a href=\"https://ncatlab.org/nlab/files/SelingerPositiveMaps.pdf\">https://ncatlab.org/nlab/files/SelingerPositiveMaps.pdf</a></p>",
        "id": 222183525,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1610217940
    },
    {
        "content": "<p>that's a really interesting read, thanks!</p>",
        "id": 222183758,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610218213
    },
    {
        "content": "<p>In addition to the various CP constructions that Cole mentioned, the factorization that you mentioned has been studied in terms of different universal properties by  <a href=\"https://arxiv.org/pdf/1603.04353.pdf\">A &amp; B Westerbaan</a> and <a href=\"https://arxiv.org/abs/1807.02533\">Arthur Parzygnat</a>. Arthur gave a talk about it in the MIT series not long ago.   </p>\n<p>My own simple position, with Mathieu Huot, is <a href=\"https://arxiv.org/pdf/1901.10117v1.pdf\">this</a>. Say a monoidal category is \"affine\" if its unit is a terminal object. For any monoidal category C, there is an \"affine reflection\" LC, which is the universal category with a terminal unit and a monoidal functor C-&gt;LC. Now here's a theorem: the category of CPTP maps (your parts 1, 2 and 3) is the affine reflection of the category of isometries (just parts 1 and 2). I quite like this because it matches my intuitions from physics: a terminal unit means that you can hide things, and the passage from pure quantum (isometries) to quantum channels (CPTP) arises precisely from hiding things in a free way. And it turns out that the affine reflection of _any_ monoidal category has factorizations like your 1,2,3.</p>\n<p>There has been some work on connecting all these different views, but I think there is more to be done.</p>",
        "id": 222187264,
        "sender_full_name": "Sam Staton",
        "timestamp": 1610223185
    },
    {
        "content": "<p>seeing universal properties turn up is also exactly the sort of thing that i was looking for, so thank you!</p>",
        "id": 222191204,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610228688
    },
    {
        "content": "<p>i still feel that there is <em>something</em> hidden in the fact that 1. looks a bit like a cofibration, 2. like a weak equivalence (since unitary \"=\" time invertible), and 3. looks a bit like a fibration, but i have nothing more concrete than a sneaking suspicion...</p>",
        "id": 222191287,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610228808
    },
    {
        "content": "<p>Cole and Sam's comments show how you can go from a category to a bigger one where the maps have this sort of decomposition. However, it is also possible to \"recognize\" categories that arise in these ways via <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0890540116000341\">environment structures</a>. When you know even more about the category this is even sufficient to characterise it as a \"category of matrices\": <a href=\"https://arxiv.org/abs/1804.02265\">https://arxiv.org/abs/1804.02265</a></p>",
        "id": 222223455,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1610287143
    },
    {
        "content": "<p>Also related might be my paper with Chris Heunen where we show that deterministic and random channels form a weak factorisation system. <a href=\"https://arxiv.org/abs/1705.07652\">https://arxiv.org/abs/1705.07652</a></p>",
        "id": 222242918,
        "sender_full_name": "Oscar Cunningham",
        "timestamp": 1610313957
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276945\">Oscar Cunningham</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/model.20categories.20and.20quantum.20channels/near/222242918\">said</a>:</p>\n<blockquote>\n<p>Also related might be my paper with Chris Heunen where we show that deterministic and random channels form a weak factorisation system. <a href=\"https://arxiv.org/abs/1705.07652\">https://arxiv.org/abs/1705.07652</a></p>\n</blockquote>\n<p>oh this is very much an answer to my vague question, thank you!</p>",
        "id": 222245322,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1610317222
    }
]