[
    {
        "content": "<p>I was a member of the Perimeter Institute around 2004.  I have always liked what has come out of there.  I found Sabine Hossenfelder's book a real page turner.  I would like to hear some opinions on this book.</p>\n<p>Lost in Math: How Beauty Leads Physics Astray<br>\nBy Sabine Hossenfelder</p>",
        "id": 217228460,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1605759702
    },
    {
        "content": "<p>I haven't read it, but I'm full of opinions on this general subject, because I used to work on quantum gravity and a bit of particle physics.</p>",
        "id": 217235675,
        "sender_full_name": "John Baez",
        "timestamp": 1605769734
    },
    {
        "content": "<p>By the way, have you read Woit's <em>Not Even Wrong</em> and Smolin's <em>The Trouble With Physics</em>?  Those tackle somewhat similar issues to Hossenfelder's book, I think.</p>",
        "id": 217235749,
        "sender_full_name": "John Baez",
        "timestamp": 1605769813
    },
    {
        "content": "<p>I have not read those.  I will start with Woit's book.  Thanks!!</p>",
        "id": 217277197,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1605796560
    },
    {
        "content": "<p>(Context: student of mathematical/theoretical physics here. Also, this accidentally turned into a bit of an essay — sorry!)</p>\n<p>One of the things I took from Hossenfelder's book was her call for more serious consideration of the social structures underpinning science. This comes up also in Smolin's book in a different form (I haven't gotten hold of a copy of Woit's yet). But it was from Hossenfelder's discussion of various cognitive and social biases in play, that I got the sense that there was more to the \"sociological aspects of science\" than just managing the power dynamics between various camps/research programmes.</p>\n<p>I recall some of Hossenfelder's arguments involving very apt historical examples of long-ago natural philosophers using their own notions of beauty/naturalness/etc. to defend theories that we now know to be false. This made me reflect that my own physics education thus far has been missing any sufficiently-in-depth learning about the history of physics.</p>\n<p>The more physicists capable of individually analyzing \"philosophical\" arguments about naturality, multiverses, anthropic principle, beauty, etc., the more resilient physics-as-a-whole would be to some of the biases Hossenfelder talks about. Most physicists I know learn more by example/familiarity than by abstract or structural reasoning (lots of physicists prefer <em>calculations</em> over <em>theorems</em>). So I'd guess that most theoretical physicists would be better equipped to evaluate such \"philosophical\" arguments  by expanding their stock of historical examples of failed theories, the arguments that supported them, and how exactly they ended up failing.</p>\n<p>But the physics education I've received, at least, has had an obvious focus on teaching only those theories that <em>haven't failed</em> in this way. (For good reason I suppose — getting to grips with currently accepted or proposed theories is tough enough for a student, without having to learn failed or abandoned theories as well…)</p>\n<p>Of course at some point, it is up to students to learn such things themselves. However, for some of the very same \"sociological\" reasons these authors have discussed, most non-historian students of theoretical physics probably won't choose to spend much of their time learning history.</p>\n<p>Maybe this is a bit more \"meta\" than what Hossenfelder was aiming for when she called for greater consideration of the sociology, but anyway this is where my thoughts ended up.</p>",
        "id": 217277986,
        "sender_full_name": "Alastair Grant-Stuart",
        "timestamp": 1605796919
    },
    {
        "content": "<p>There are plenty of examples of \"outdated\" theories that are still taught and applied because they are sufficient approximations to reality to be useful, so it's not like theoretical physics is totally insulated from its historical and philosophical underpinnings. Do you remember any of those examples of defences of bogus theories? (since I don't have the book to hand)</p>",
        "id": 217279625,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1605797593
    },
    {
        "content": "<p>A very good example of a failed theory that is taught is the aether theory of light and Michelson Morley's experiment that disproved it.</p>",
        "id": 217284883,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1605799779
    },
    {
        "content": "<p>Kelvin had a theory that atoms were knots in the aether.... this was a cute idea and there was a bit of a flurry of work based on this.  The idea of matter as knots ended up being declared \"wrong\" but knot theory hibernated in mathematics for about a 100 years until spreading back over to physics again. How crazy is that?</p>",
        "id": 217286668,
        "sender_full_name": "Simon Burton",
        "timestamp": 1605800464
    },
    {
        "content": "<p>Does anyone actually teach the aether theory of light?   People <em>talk</em> about it a lot in physics courses, but I don't remember them seriously <em>teaching</em> it - with equations and the like.   I couldn't do it myself.   But I'll be able to in a year, because I've just started reading Sir Edmund Whittaker's monumental 2-volume book <em>A History of the Theories of Aether and Electricity</em>.   So far it's really good.  I've only gotten to Descartes' aether theory, which was very influential but only qualitative - words more than equations - and discredited before Newton came on the scene.</p>",
        "id": 217286881,
        "sender_full_name": "John Baez",
        "timestamp": 1605800535
    },
    {
        "content": "<p>I find Hossenfelder's book (and other writings) to be far to negative and humorless. Let's bring down the particle physicists a few notches, sure, but there is so much other interesting stuff going on in physics &amp; mathematical physics. It's really seems like a golden age of discovery to me. Not some dried up husk that Hossenfelder keeps going on about.</p>",
        "id": 217287100,
        "sender_full_name": "Simon Burton",
        "timestamp": 1605800626
    },
    {
        "content": "<p>High-energy particle physics, quantum gravity, and the quest to understand dark matter (or whatever causes the effects that dark matter seeks to explain) are in serious trouble.   We know very little for sure about physics of this sort since I was an undergrad in 1981 and saw Witten give a talk on grand unified theories, despite a massive intellectual investment in supersymmetry and string theory and a massive financial investment in the LHC - which did, I'll admit, nicely confirm the Standard Model.</p>",
        "id": 217287990,
        "sender_full_name": "John Baez",
        "timestamp": 1605800963
    },
    {
        "content": "<p>I fled this general area around 2005, and I'm sure glad I did:</p>\n<ul>\n<li>John Baez, <a href=\"https://www.edge.org/response-detail/11356\">Should I be thinking about quantum gravity?</a>, <em>Edge</em>, 2008.</li>\n</ul>",
        "id": 217288442,
        "sender_full_name": "John Baez",
        "timestamp": 1605801115
    },
    {
        "content": "<p>So if one focuses on <em>this</em> part of physics one's mood is bound to be grim if one is not utterly deluded.</p>",
        "id": 217288648,
        "sender_full_name": "John Baez",
        "timestamp": 1605801197
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217287990\">said</a>:</p>\n<blockquote>\n<p>High-energy particle physics, quantum gravity, and the quest to understand dark matter (or whatever causes the effects that dark matter seeks to explain) are in serious trouble.   We know very little for sure about physics of this sort since I was an undergrad in 1981 and saw Witten give a talk on grand unified theories, despite a massive intellectual investment in supersymmetry and string theory and a massive financial investment in the LHC - which did, I'll admit, nicely confirm the Standard Model.</p>\n</blockquote>\n<p>So, if this massive investment did not lead to definite answers, should we conclude that maybe we didn't invest in the right thing?</p>",
        "id": 217289225,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605801427
    },
    {
        "content": "<p>I find the main ideas of superstring theory, of which I know very little, fascinating. Still, it is my understanding that untill very recently doing foundations of physics in a way that was different from superstring theory was considered a bit of a career killer</p>",
        "id": 217289385,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605801485
    },
    {
        "content": "<p>Probably this sort of almost-monolithic effort/investment made things worse. We bet everything on one theory, and when this one theory didn't delivered, we've been left adrift</p>",
        "id": 217289507,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605801533
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217289225\">said</a>:</p>\n<blockquote>\n<p>So, if this massive investment did not lead to definite answers, should we conclude that maybe we didn't invest in the right thing?</p>\n</blockquote>\n<p>Yes.  And there were plenty of people arguing against this route all along.   I've always argued against supersymmetry and I didn't think the LHC was worthwhile, though now that it's been done I think it's had a clarifying effect: the Standard Model is very accurate up to this energy scale, and there's no hint so far supersymmetry at the electroweak symmetry breaking energy scale.</p>",
        "id": 217289767,
        "sender_full_name": "John Baez",
        "timestamp": 1605801620
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217279625\">said</a>:</p>\n<blockquote>\n<p>There are plenty of examples of \"outdated\" theories that are still taught and applied because they are sufficient approximations to reality to be useful...</p>\n</blockquote>\n<p>True — I meant \"failed theories\" in the sense that they were unsatisfactory even within their targeted regimes of applicability.</p>\n<blockquote>\n<p>Do you remember any of those examples of defences of bogus theories? (since I don't have the book to hand)</p>\n</blockquote>\n<p>So (mentioned in Chapter 4) there's the example of Tycho Brahe defending a geocentric model of the solar system against heliocentrism. More-or-less, since measurements of parallax weren't so good at the time, Brahe ended up figuring that heliocentrism demanded that the stars had to be much bigger than the Sun and/or much further away than the planets, by factors that he considered unnaturally large (for the modern physics sense of naturality).</p>\n<p>A review by Jeremy Butterfield (a philosopher of science) pointed out another example, but I don't think it actually came up in Hossenfelder's book: Aristotle apparently insisted that light is a \"transparency of the medium\" (Butterfield's words — I've never read any Aristotle) rather than a propagation (of waves, particles, anything else) because he observed that at sunrise, the whole large area gets lit up at once, and that this demands any light propagation be faster than anything else he was familiar with, by factors too large for his comfort (again, a naturalness argument).</p>\n<p>One notable thing about these examples (in contrast to the aether example) is that they both predate \"modern\" or \"empirical\" science. So maybe what I'm trying to get at is this: some of the ideas up for debate in books like Hossenfelder's, Smolin's, Woit's etc. require <em>post-empirical</em> arguments (in the words of Dawid, \"String Theory and the Scientific Method\"). But maybe we should be learning historical examples of <em>pre-empirical</em> arguments in physics, and whether/how they failed, to make sure any attempts at <em>post-empirical</em> reasoning avoid the same pitfalls.</p>",
        "id": 217289884,
        "sender_full_name": "Alastair Grant-Stuart",
        "timestamp": 1605801662
    },
    {
        "content": "<p>I wouldn't call geocentrism a \"bogus theory\", since in the hands of Ptolemy it produced results of high accuracy, better than Copernicus' crude heliocentric theory.  It turned out to be wrong, but \"bogus\" is an undeserved insult.</p>",
        "id": 217290200,
        "sender_full_name": "John Baez",
        "timestamp": 1605801768
    },
    {
        "content": "<p>Anyone interested in the story of wrong turns in physics after Newton would enjoy Helge Kragh's book <em>Higher Speculations: Grand Theories and Failed Revolutions in Physics and Cosmology</em>.   I especially enjoyed the part before 1950 because I didn't know as much about those older theories.</p>\n<p>For example, around 1895-1915 there were a bunch of good physicists trying to explain all physics, including the electron, using Maxwell's equations or mild variants.</p>",
        "id": 217290549,
        "sender_full_name": "John Baez",
        "timestamp": 1605801888
    },
    {
        "content": "<p>Smolin has some interesting comments to make here in this interview <a href=\"https://youtu.be/WgLo4gmEraU?t=3960\">https://youtu.be/WgLo4gmEraU?t=3960</a> . He seems to be saying that his \"trouble with physics\" was not specific to string theory, but that's just what he chose to write about at that time. It was more of a sociological critique of physics that he was wanting to write.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"WgLo4gmEraU\" href=\"https://youtu.be/WgLo4gmEraU?t=3960\"><img src=\"https://i.ytimg.com/vi/WgLo4gmEraU/default.jpg\"></a></div>",
        "id": 217290815,
        "sender_full_name": "Simon Burton",
        "timestamp": 1605801988
    },
    {
        "content": "<p>One problem is that quantum field theory, being nonrigorous and very complex, is quite hard to learn: there are a lot of different formulations, each involving some rigorous math but also some rules of thumb and some optimistic guesses.   Since physicists tend to be in a hurry, tend to rely on what they've heard from other physicists, rather than understanding everything in detail and clearly distinguishing between what's known for sure, what <em>might</em> be true, etc.   This tends to make group-think a bigger problem than in some other areas.</p>",
        "id": 217291845,
        "sender_full_name": "John Baez",
        "timestamp": 1605802344
    },
    {
        "content": "<p>There are, of course, some physicists who understand quantum field theory extremely well, like Weinberg and Witten and ... I could list a bunch of them.</p>",
        "id": 217291920,
        "sender_full_name": "John Baez",
        "timestamp": 1605802383
    },
    {
        "content": "<p>But even among these, no one understands the whole subject.  And most physicists rely on second-hand information - some of which they call \"theorems\",  but without knowing the precise hypotheses.</p>",
        "id": 217292186,
        "sender_full_name": "John Baez",
        "timestamp": 1605802474
    },
    {
        "content": "<p>Unfortunately, I think the realistic solution is for lots of people to quit working on elementary particle physics, as the subject continues to fail.</p>",
        "id": 217292429,
        "sender_full_name": "John Baez",
        "timestamp": 1605802574
    },
    {
        "content": "<p>With fewer people involved, the urge to follow trends will diminish.   The remaining people are likely to be more independent-minded, more deeply concerned with figuring out what's really going on, less concerned with status.</p>",
        "id": 217292649,
        "sender_full_name": "John Baez",
        "timestamp": 1605802672
    },
    {
        "content": "<p><em>Most</em> physicists would have a lot more fun working on condensed matter physics right now.  It uses a lot of the same math and physics ideas, and you do experiments on a table-top that discover amazing new things.</p>",
        "id": 217293322,
        "sender_full_name": "John Baez",
        "timestamp": 1605802935
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315002\">Alastair Grant-Stuart</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217277986\">said</a>:</p>\n<blockquote>\n<p>The more physicists capable of individually analyzing \"philosophical\" arguments about naturality, multiverses, anthropic principle, beauty, etc., the more resilient physics-as-a-whole would be to some of the biases Hossenfelder talks about. </p>\n</blockquote>\n<p>I'm actually not sure whether the amount \"beauty arguments\" of physics would necessarily go down by such education.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217287100\">said</a>:</p>\n<blockquote>\n<p>I find Hossenfelder's book (and other writings) to be far to negative and humorless. Let's bring down the particle physicists a few notches, sure, but there is so much other interesting stuff going on in physics &amp; mathematical physics. It's really seems like a golden age of discovery to me. Not some dried up husk that Hossenfelder keeps going on about.</p>\n</blockquote>\n<p>What do you make of someone like Peter Thiel (not a physicist) who oughtright says that physics have not really progressed at all in theory and they in the last decades they were outshined by the hardware and computation sector? <br>\nMaybe one can make an argument that semiconductor physics is of course also physics - but I guess it's fair to say that 1900-1940 saw development that sounds much more exciting in a physics books than whatever happened after. It feels like events did not - as one initially might expect - \"accelerate exponentially\" overturn each other. </p>\n<p>I would also think that people liked to \"stick with QFT\" as they thought maybe they would be the ones coming up with something fundamental that would be fundamental to the physical world.</p>",
        "id": 217344036,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1605827928
    },
    {
        "content": "<p>Computing doesn't really seem like an admirable example to me, and it's what I do. :)</p>",
        "id": 217345689,
        "sender_full_name": "Dan Doel",
        "timestamp": 1605829197
    },
    {
        "content": "<p>I don't think Thiel has any clue what he's talking about. Sure the iphone is amazing, but has he heard about the Jones polynomial ? Maybe I'm talking from the ivory tower here, but if so, i'm very interested in letting down the drawbridge. This is culture that all of humanity deserves to enjoy.</p>",
        "id": 217346419,
        "sender_full_name": "Simon Burton",
        "timestamp": 1605829718
    },
    {
        "content": "<p>I'm less familiar with hardware stuff, but I think that is mainly engineering effort. And all the effort is essentially spent to optimize using the same 'theory' as we did 50 years ago, which wasn't even cutting edge then.</p>",
        "id": 217346595,
        "sender_full_name": "Dan Doel",
        "timestamp": 1605829893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281274\">Nikolaj Kuntner</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217344036\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"315002\">Alastair Grant-Stuart</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217277986\">said</a>:</p>\n<blockquote>\n<p>The more physicists capable of individually analyzing \"philosophical\" arguments about naturality, multiverses, anthropic principle, beauty, etc., the more resilient physics-as-a-whole would be to some of the biases Hossenfelder talks about. </p>\n</blockquote>\n<p>I'm actually not sure whether the amount \"beauty arguments\" of physics would necessarily go down by such education.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217287100\">said</a>:</p>\n<blockquote>\n<p>I find Hossenfelder's book (and other writings) to be far to negative and humorless. Let's bring down the particle physicists a few notches, sure, but there is so much other interesting stuff going on in physics &amp; mathematical physics. It's really seems like a golden age of discovery to me. Not some dried up husk that Hossenfelder keeps going on about.</p>\n</blockquote>\n<p>What do you make of someone like Peter Thiel (not a physicist) who oughtright says that physics have not really progressed at all in theory and they in the last decades they were outshined by the hardware and computation sector? <br>\nMaybe one can make an argument that semiconductor physics is of course also physics - but I guess it's fair to say that 1900-1940 saw development that sounds much more exciting in a physics books than whatever happened after. It feels like events did not - as one initially might expect - \"accelerate exponentially\" overturn each other. </p>\n<p>I would also think that people liked to \"stick with QFT\" as they thought maybe they would be the ones coming up with something fundamental that would be fundamental to the physical world.</p>\n</blockquote>\n<p>Thiel is probably the most devilish billionaire out there at the moment. This makes him one of the most devilish people around overall. And he doesn't know a thing about physics (nor human decency, for what matters). I wouldn't focus too much on his opinions about physics. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 217349715,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605832694
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217288648\">said</a>:</p>\n<blockquote>\n<p>So if one focuses on <em>this</em> part of physics one's mood is bound to be grim if one is not utterly deluded.</p>\n</blockquote>\n<p>I haven't talked with Urs Schreiber for some time, but he always struck me as generally sympathetic to string theory and supersymmetry. (The <a href=\"https://ncatlab.org/nlab/show/string+theory+FAQ\">FAQ page on string theory</a> at the nLab seems to support that impression.)</p>",
        "id": 217351632,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1605834823
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217351632\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217288648\">said</a>:</p>\n<blockquote>\n<p>So if one focuses on <em>this</em> part of physics one's mood is bound to be grim if one is not utterly deluded.</p>\n</blockquote>\n<p>I haven't talked with Urs Schreiber for some time, but he always struck me as generally sympathetic to string theory and supersymmetry. (The <a href=\"https://ncatlab.org/nlab/show/string+theory+FAQ\">FAQ page on string theory</a> at the nLab seems to support that impression.)</p>\n</blockquote>\n<p>Oh yes, he's <em>very</em> sympathetic to these.    We completely disagree on the probability that these ideas will connect to real-world physics.   We fight about that all the time, and that's one reason we don't talk much anymore.    I support what he's doing just because it's mathematically beautiful.  But it's not helping us understand the patterns in the Standard Model, the puzzles concerning neutrinos, dark matter... or in short, anything we can study experimentally.</p>",
        "id": 217351937,
        "sender_full_name": "John Baez",
        "timestamp": 1605835176
    },
    {
        "content": "<p>It may someday.</p>",
        "id": 217352551,
        "sender_full_name": "John Baez",
        "timestamp": 1605835865
    },
    {
        "content": "<p>One argument I've heard in favour of string theory research is that even if it never cashes out experimentally, its contributions to mathematics (e.g. mirror symmetry) justify its existence. I've even heard the phrase 'physical mathematics' thrown around which I guess is meant to refer to the grey area between pure mathematics and theoretical physics.</p>",
        "id": 217352845,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1605836231
    },
    {
        "content": "<p>Sure, the mathematics of string theory is some of the most exciting math around these days!   It's affecting many other areas of math, from geometry to topology to number theory to category theory to homotopy theory.   This is one reason why string theory continues to be popular despite the fact that it's never made a single correct experimental prediction after over 30 years.</p>",
        "id": 217353810,
        "sender_full_name": "John Baez",
        "timestamp": 1605837530
    },
    {
        "content": "<p>I certainly think people should keep studying string theory, but mainly for its mathematical importance.    </p>\n<p>If there's some law saying that beautiful math must eventually be important in physics, then string theory will eventually be important in physics.</p>",
        "id": 217353905,
        "sender_full_name": "John Baez",
        "timestamp": 1605837668
    },
    {
        "content": "<p>However, to make progress in high-energy particle physics, I think people need some big new ideas, even <em>if</em> string theory is part of the story.</p>",
        "id": 217353979,
        "sender_full_name": "John Baez",
        "timestamp": 1605837748
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217351632\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217288648\">said</a>:</p>\n<blockquote>\n<p>So if one focuses on <em>this</em> part of physics one's mood is bound to be grim if one is not utterly deluded.</p>\n</blockquote>\n<p>I haven't talked with Urs Schreiber for some time, but he always struck me as generally sympathetic to string theory and supersymmetry. (The <a href=\"https://ncatlab.org/nlab/show/string+theory+FAQ\">FAQ page on string theory</a> at the nLab seems to support that impression.)</p>\n</blockquote>\n<p>I wanted to point exactly to that page. I think Urs arguments in favor of string theory are reasonable, though I can't assess whether he's right or wrong in saying certain things. So I was very curious about <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> 's opinion, in particular on the question \"<a href=\"https://ncatlab.org/nlab/show/string+theory+FAQ#HowDoesStringTheoryMakePredictions\">Does string theory make predictions? How?</a>\"</p>",
        "id": 217377500,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605864180
    },
    {
        "content": "<p>To briefly sum up his argument there: he says string theory is a <em>theory</em>, inasmuch as QFT is one, and theories do not make predictions. What you need to make experimental predictions are <em>models</em>, which are theories + a bunch of arbitrary choices of parameters of the theories. So the Standard <em>Model</em> is indeed this: QFT + a choice of its free parameters, namely coupling constants (and something else? idk).<br>\nThen he argues that string theory does have realistic models (<a href=\"http://ncatlab.org/nlab/show/string%20phenomenology#SemiRealisticModels\">Semi-realistic models of string theory</a>) agreeing with <em>current</em> experiments, but the experiments who would discern between quantum gravity models are not there yet.</p>",
        "id": 217377876,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605864477
    },
    {
        "content": "<p>I found the distinction between model and theory quite on point. That said, I don't know enough string theory to be able to say if the second part is right, especially when so many people complain about the lack of experimental predictions. Shouldn't a theory make predictions <em>despite</em> the lack of fixed free parameters? e.g. Newton's law makes a clear prediction of gravity, which one could test experimentally even without knowing G (you test that <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>F</mi><mo>∝</mo><mi>m</mi><mi>M</mi><mi mathvariant=\"normal\">/</mi><msup><mi>r</mi><mn>2</mn></msup></mrow><annotation encoding=\"application/x-tex\">F \\propto mM/r^2</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">F</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span><span class=\"mrel\">∝</span><span class=\"mspace\" style=\"margin-right:0.2777777777777778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1.064108em;vertical-align:-0.25em;\"></span><span class=\"mord mathnormal\">m</span><span class=\"mord mathnormal\" style=\"margin-right:0.10903em;\">M</span><span class=\"mord\">/</span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">r</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141079999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span></span></span></span></span></span></span></span>)</p>",
        "id": 217378110,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605864609
    },
    {
        "content": "<p>Maybe what happens here (something that Urs mentions later in the page) is that string theory's free parameters are not numbers, but higher objects like the geometry of spacetime compact dimensions or whatever. This makes it hard to make a definitive prediction up to a constant.</p>",
        "id": 217378302,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605864740
    },
    {
        "content": "<p>On the other hand you could argue that then either (a) everything we can measure would be fittable by a string theoretic models or (b) there is some data which would falsify any string theoretic model. Then in the first case you might say string theory isn't a good physical theory, since it's not falsifiable (though this argument feels stuck in 40s maybe), while in the second case you would have a definitive experimental prediction which is not bound by a choice of parameters, so string theory would make predictions</p>",
        "id": 217378943,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605865197
    },
    {
        "content": "<p>If (a) is true, perhaps it can still be salvaged as an organizational framework for physical theory? I believe this is more or less the theme behind the first half <a href=\"https://ncatlab.org/nlab/show/string+theory+results+applied+elsewhere\">this page</a></p>",
        "id": 217379084,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605865292
    },
    {
        "content": "<p>I don't think the real problem with superstring theory is that it doesn't make predictions. If it would make predictions that disagreed with the current state of the art we'd disregard it as wrong and we would go on. As you say, there aren't experiments that make superstring theory discernible from other theories, but then again, that would not be a problem per se. In principle, this being the case, any possible attack to superstring theory would be valid also towards quantum gravity, for instance</p>",
        "id": 217419804,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605888051
    },
    {
        "content": "<p>I think the main problem here is two-fold: First, given the monstrous amount of money and man-hours spent on superstring theory, one may conclude that not having definitive evidence of its validity is just not acceptable. This is a decent argument motivated by very practical reasons, I believe.</p>",
        "id": 217419950,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605888114
    },
    {
        "content": "<p>The second, probably deeper problem, is that the philosophical foundations of superstring theory are quite shaky. In principle, it is postulated for instance that there are fundamental lenghts, times, masses, etc: Everything is fully quantized, so for instance you cannot go below the Plank length. This by definition makes it not direactly measurable. This is in open contrast with the 400~ years old principle that you should be able to devise experiments that directly falsify or confirm some hypothesis</p>",
        "id": 217420694,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605888364
    },
    {
        "content": "<p>So, we need to find indirect reasons to prove that things are as superstring theory predicts. Again, this is in principle doable, but in my opinion having a theory that relies on such philosophical foundations makes it all the more prone to attack and criticism: We are going for a model of physics which, in this respect, is radically different from what we had up to now. It's natural that one wants a pretty damn compelling argument before accepting it.</p>",
        "id": 217420881,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605888467
    },
    {
        "content": "<p>BTW, I think the philosophical implications of superstring theory have been considered \"not really important\" by many in the community till recent times, mitigating, maybe, the relevance of good philosophical foundations. There's been a time in the recent history of physics when \"shut up and calculate\" was the mantra, that is: Absolute trust in the mathematical truths behind a model, with everything else being regarded as mere speculation. I can understand how this kind of attitude becomes mainstream in a research community, but I tend to consider it a bit toxic given the current state of affairs.</p>",
        "id": 217421556,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605888690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217420694\">said</a>:</p>\n<blockquote>\n<p>The second, probably deeper problem, is that the philosophical foundations of superstring theory are quite shaky. In principle, it is postulated for instance that there are fundamental lenghts, times, masses, etc: Everything is fully quantized, so for instance you cannot go below the Plank length. This by definition makes it not direactly measurable. This is in open contrast with the 400~ years old principle that you should be able to devise experiments that directly falsify or confirm some hypothesis</p>\n</blockquote>\n<p>Oh, I wasn't aware of this. Do you have a reference?</p>",
        "id": 217439969,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605896647
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217419950\">said</a>:</p>\n<blockquote>\n<p>I think the main problem here is two-fold: First, given the monstrous amount of money and man-hours spent on superstring theory, one may conclude that not having definitive evidence of its validity is just not acceptable. This is a decent argument motivated by very practical reasons, I believe.</p>\n</blockquote>\n<p>I'm wary of this kind of arguments since the necessary conclusion is that science which doesn't find applications in given timespan should not be pursued, which is very dangerous for hard sciences (I put math in this group). Many ideas took hundred of years to give birth to 'useful' stuff</p>",
        "id": 217440147,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605896753
    },
    {
        "content": "<p>Plus, string theory had some ripercussions in neighbouring fields, such as condensed matter physics or pure mathematics. So I think we can't really blame string theorist to have wasted time or money.</p>",
        "id": 217440310,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605896829
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217420694\">said</a>:</p>\n<blockquote>\n<p>The second, probably deeper problem, is that the philosophical foundations of superstring theory are quite shaky. In principle, it is postulated for instance that there are fundamental lenghts, times, masses, etc: Everything is fully quantized, so for instance you cannot go below the Plank length. This by definition makes it not direactly measurable. This is in open contrast with the 400~ years old principle that you should be able to devise experiments that directly falsify or confirm some hypothesis</p>\n</blockquote>\n<p>Well, this is partly true. If string theory manages to produce a theory of quantum gravity then there should be observable difference in high-energy systems such as black holes or particle colliders. The fact that those systems are hard to measure/work is not string theorists' fault.</p>",
        "id": 217440661,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605897003
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217440147\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217419950\">said</a>:</p>\n<blockquote>\n<p>I think the main problem here is two-fold: First, given the monstrous amount of money and man-hours spent on superstring theory, one may conclude that not having definitive evidence of its validity is just not acceptable. This is a decent argument motivated by very practical reasons, I believe.</p>\n</blockquote>\n<p>I'm wary of this kind of arguments since the necessary conclusion is that science which doesn't find applications in given timespan should not be pursued, which is very dangerous for hard sciences (I put math in this group). Many ideas took hundred of years to give birth to 'useful' stuff</p>\n</blockquote>\n<p>It's not that string theory hasn't produced anything useful, it's more that it's failed to fulfil the promises which it made, which were the basis of the investment in the field. If someone keeps insisting that you pay them as a columnist in your newspaper and then they just produce a comic strip every week, they haven't failed to make a usable contribution, but they have failed to do what you're supposedly paying them for.</p>",
        "id": 217441470,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1605897425
    },
    {
        "content": "<p>But can you promise a breakthrough? Funding research is more like an investment than a purchase</p>",
        "id": 217442052,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605897740
    },
    {
        "content": "<p>I mean, I'm sure string theorists were convinced their theory was going to work in the 80s, but it took them ~30 years to have hints it might not</p>",
        "id": 217442127,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605897799
    },
    {
        "content": "<p>Doesn't that leave out the part where directly competing research was artificially stifled in favor of the thing that didn't work out, way before it was clear whether or not it would work out?</p>",
        "id": 217443848,
        "sender_full_name": "Dan Doel",
        "timestamp": 1605898665
    },
    {
        "content": "<p>Well, that's bad behaviour of the community, of course, but it's a different kettle of fish.</p>",
        "id": 217444251,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605898832
    },
    {
        "content": "<p>The way I see it, it's simple: You can agree that the one I listed is or is not a good principle theoretically, but in practice you have a finite amount of money and resources to allocate and you have to make a budget</p>",
        "id": 217445168,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605899280
    },
    {
        "content": "<p>So if I have to choose between \"let's build another particle accelerator that will cost 1T so that maybe we'll get some definitive answers from Superstring theory\" and \"let's use 1T to finance research to solve climate change\" I have no doubt on which one I'd fund</p>",
        "id": 217445324,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605899350
    },
    {
        "content": "<p>Please notice that this comparison is not unfair, nor theoretical. It is happening now. Some physicists have already started saying that we need a bigger particle accelerator and as a consequence some other physicists signed a petition where they say \"please do not build any more particle accelerator, and use that money in a wiser way\"</p>",
        "id": 217445474,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605899407
    },
    {
        "content": "<p>These discourses do not exist in a vacuum. We are talking about the careers of thousands of people, and about monstrous amounts of resources (financial, intellectual) that can be allocated to solve long-standing problems. When you think about if some research effort should or should not be worth pursuiting, you should think along these lines, especially at such a scale. The theoretical value of the research in question is only one of the things to factor in.</p>",
        "id": 217445802,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605899577
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217439969\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217420694\">said</a>:</p>\n<blockquote>\n<p>The second, probably deeper problem, is that the philosophical foundations of superstring theory are quite shaky. In principle, it is postulated for instance that there are fundamental lenghts, times, masses, etc: Everything is fully quantized, so for instance you cannot go below the Plank length. This by definition makes it not direactly measurable. This is in open contrast with the 400~ years old principle that you should be able to devise experiments that directly falsify or confirm some hypothesis</p>\n</blockquote>\n<p>Oh, I wasn't aware of this. Do you have a reference?</p>\n</blockquote>\n<p>I remember having read it somewhere a long time ago. Looking around again I may have been mistaken tho <span aria-label=\"confused\" class=\"emoji emoji-1f615\" role=\"img\" title=\"confused\">:confused:</span></p>",
        "id": 217446423,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605899805
    },
    {
        "content": "<p>All the other arguments I made, tho, stand: Not enough interaction between Philosophers and Physicists is problematic, especially if results in mathematical models being pursued blindly. Deciding how to allocate resources should depend on the results/utility a given research pursuit brings: I agree this is in principle NOT a good idea, especially for acceptable budgets (thinking in such an obtuse way is one of the causes why humanities are so underfunded today), but when we are talking about multi-billion dollar budgets then this should be taken into account. Again, we are not talking about the average research grant worth a few hundred thousand dollars, but about building machines worth hundreds of billions of dollars, a completely different playing field. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 217447046,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1605900088
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217346419\">said</a>:</p>\n<blockquote>\n<p>I don't think Thiel has any clue what he's talking about. Sure the iphone is amazing, but has he heard about the Jones polynomial ?</p>\n</blockquote>\n<p>Well I'm sure Thiel would say the Jones polynomial is irrelevant and I can see why. That's something mathematicians and physicists find cool, but I guess it's fair to say that it doesn't in any way compare to coming up with a theory that makes one understand the nature of spectral lines of the atoms and such.</p>",
        "id": 217450607,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1605901881
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217377876\">said</a>:</p>\n<blockquote>\n<p>To briefly sum up his argument there: he says string theory is a <em>theory</em>, inasmuch as QFT is one, and theories do not make predictions. What you need to make experimental predictions are <em>models</em>, which are theories + a bunch of arbitrary choices of parameters of the theories. </p>\n</blockquote>\n<p>This is a clever rhetorical trick, redefining the usual concept of <a href=\"https://en.wikipedia.org/wiki/Scientific_theory\">scientific theory</a>:</p>\n<blockquote>\n<p>A scientific theory is an explanation of an aspect of the natural world that can be repeatedly tested and verified in accordance with the scientific method, using accepted protocols of observation, measurement, and evaluation of results. </p>\n</blockquote>\n<p>Urs is taking the pressure off string theory to make predictions.  Now it's the <em>models</em> that are left to take the fall.</p>\n<p>But the terminology doesn't really matter.  Theories, models, whatever.   The problem is that physicists are supposed to make predictions that match experiment.  String theorists make predictions that either <em>don't</em> match experiment, or match what the Standard Model predicts.</p>\n<p>By comparison many quantum field theories (models, whatever) have made useful predictions in particle physics.   Quantum electrodynamics was the first, quantum chromodynamics and the Weinberg-Salam model are two other famous ones, but there were many others.</p>\n<blockquote>\n<p>Then he argues that string theory does have realistic models (<a href=\"http://ncatlab.org/nlab/show/string%20phenomenology#SemiRealisticModels\">Semi-realistic models of string theory</a>) agreeing with <em>current</em> experiments...</p>\n</blockquote>\n<p>Most of the \"semi-realistic models\" listed there predict that for each boson there's a corresponding fermion of the same mass.  In fact there's not a single boson that has a fermion of the same mass!</p>\n<p>To get around this problem people then add, in a completely <em>ad hoc</em> way, extra terms to the equations to break this symmetry.   The result is an enormous mess that can approximate the Standard Model arbitrarily well if you make the masses of the unobserved particles sufficiently large and make them couple weakly enough to the observed particles.   </p>\n<p>People had hoped to see some of these unobserved particles, called \"superpartners\", at the Large Hadron Collider.  It didn't see them.  </p>\n<p>That nLab page also mentions <a href=\"https://ncatlab.org/nlab/show/string%20phenomenology#NonsusyModels\">non-supersymmetric models of string theory</a>.  These could be really interesting if you were trying to describe our universe.   But none of the 3 papers cited develops one in detail.  They talk about the general issues involved, but don't propose any specific model.</p>\n<blockquote>\n<p>So the Standard <em>Model</em> is indeed this: QFT + a choice of its free parameters, namely coupling constants (and something else? idk).</p>\n</blockquote>\n<p>The Standard Model is what I'd call a theory of physics: it makes predictions.   It has exactly <a href=\"https://math.ucr.edu/home/baez/constants.html\">25 dimensionless coupling constants</a>, most of which we know rather accurately.   (The least well-understood and most interesting ones are in the Pontecorvo-Maki-Nakagawa-Sakata matrix, which describes the behavior of neutrinos.)  </p>\n<p>When you introduce supersymmetry into the game, you get theories (models, whatever) that at best can match the \"minimal supersymmetric extension\" of the Standard Model.   And when you add extra terms to break the supersymmetry, this has over 110 dimensionless constants. Then you have to adjust them to make your theory indistinguishable from the Standard Model by all current experiments.   </p>\n<p>In short, a lot of work for no new predictions.</p>",
        "id": 217450661,
        "sender_full_name": "John Baez",
        "timestamp": 1605901914
    },
    {
        "content": "<p>Yesterday I actually watched the Smolin interview (by Lex Fridman) that Simon posted above, followed by one by Susskind.</p>\n<p>There he defends string theory with the argument that it's achievement was that QM and GR can in principle be reconciled, in a mathematically consistent way</p>",
        "id": 217451061,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1605902102
    },
    {
        "content": "<p>Which he argued works in String Theory and was previously not certain to be possible in principle.</p>",
        "id": 217451125,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1605902130
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281274\">Nikolaj Kuntner</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217451061\">said</a>:</p>\n<blockquote>\n<p>Yesterday I actually watched the Smolin interview (by Lex Fridman) that Simon posted above, followed by one by Susskind.</p>\n<p>There he defends string theory with the argument that it's achievement was that QM and GR can in principle be reconciled, in a mathematically consistent way</p>\n</blockquote>\n<p>That sounds great, but in fact string theory shows no such thing.  I could go over all the problems with it... but briefly, it doesn't cure the infinities that afflict other theories of quantum gravity.</p>",
        "id": 217451389,
        "sender_full_name": "John Baez",
        "timestamp": 1605902230
    },
    {
        "content": "<p>It's sad how these people resort to propaganda unbacked by fact.</p>",
        "id": 217451586,
        "sender_full_name": "John Baez",
        "timestamp": 1605902319
    },
    {
        "content": "<p>But of course, having spent their lives on string theory, they are unwilling to give a clear assessment of its problems.</p>",
        "id": 217451799,
        "sender_full_name": "John Baez",
        "timestamp": 1605902412
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281274\">Nikolaj Kuntner</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217450607\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277321\">Simon Burton</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217346419\">said</a>:</p>\n<blockquote>\n<p>I don't think Thiel has any clue what he's talking about. Sure the iphone is amazing, but has he heard about the Jones polynomial ?</p>\n</blockquote>\n<p>Well I'm sure Thiel would say the Jones polynomial is irrelevant and I can see why. That's something mathematicians and physicists find cool, but I guess it's fair to say that it doesn't in any way compare to coming up with a theory that makes one understand the nature of spectral lines of the atoms and such.</p>\n</blockquote>\n<p>The Jones polynomial was invented around 1984 when Vaughan Jones and Joan Birman had a conversation at lunch at the MSRI.  Both were mathematicians.  Jones was at a conference on von Neumann algebras (a kind of algebra invented for the purposes of physics, which however Jones was exploring in a purely mathematical way: he was classifying inclusions of type II subfactors).   Birman was at a conference on knot theory (which at the time was not connected to physics at all).   So we have to credit mathematicians for the Jones polynomial, not physicists.</p>\n<p>But then Witten came along and showed around 1989 that the Jones polynomial has a nice explanation in terms of a 3d topological quantum field theory called Chern-Simons theory.  This sparked an enormous industry - which is what got me interested in category theory in the first place.</p>\n<p>None of this yet involves real-world <em>experimental</em> physics.  It will become real-world physics if and when people succeed in creating <a href=\"https://en.wikipedia.org/wiki/Anyon#Non-abelian_anyons\">nonabelian anyons</a> on thin superconducting films.   People have been trying for a long time, with no definitive success yet.  I feel sure they will eventually succeed, because condensed matter physics is very flexible. </p>\n<p>There are a lot of hopes and dreams of making quantum computers using nonabelian anyons.    It's a huge amount of work to go from creating nonabelian anyons to controlling them well enough to get a working quantum computer.  I am much less optimistic about this.</p>",
        "id": 217453020,
        "sender_full_name": "John Baez",
        "timestamp": 1605903012
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217450661\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217377876\">said</a>:</p>\n<blockquote>\n<p>To briefly sum up his argument there: he says string theory is a <em>theory</em>, inasmuch as QFT is one, and theories do not make predictions. What you need to make experimental predictions are <em>models</em>, which are theories + a bunch of arbitrary choices of parameters of the theories. </p>\n</blockquote>\n<p>This is a clever rhetorical trick, redefining the usual concept of <a href=\"https://en.wikipedia.org/wiki/Scientific_theory\">scientific theory</a>:</p>\n<blockquote>\n<p>A scientific theory is an explanation of an aspect of the natural world that can be repeatedly tested and verified in accordance with the scientific method, using accepted protocols of observation, measurement, and evaluation of results. </p>\n</blockquote>\n<p>Urs is taking the pressure off string theory to make predictions.  Now it's the <em>models</em> that are left to take the fall.</p>\n<p>But the terminology doesn't really matter.  Theories, models, whatever.   The problem is that physicists are supposed to make predictions that match experiment.  String theorists make predictions that either <em>don't</em> match experiment, or match what the Standard Model predicts.</p>\n<p>By comparison many quantum field theories (models, whatever) have made useful predictions in particle physics.   Quantum electrodynamics was the first, quantum chromodynamics and the Weinberg-Salam model are two other famous ones, but there were many others.</p>\n<blockquote>\n<p>Then he argues that string theory does have realistic models (<a href=\"http://ncatlab.org/nlab/show/string%20phenomenology#SemiRealisticModels\">Semi-realistic models of string theory</a>) agreeing with <em>current</em> experiments...</p>\n</blockquote>\n<p>Most of the \"semi-realistic models\" listed there predict that for each boson there's a corresponding fermion of the same mass.  In fact there's not a single boson that has a fermion of the same mass!</p>\n<p>To get around this problem people then add, in a completely <em>ad hoc</em> way, extra terms to the equations to break this symmetry.   The result is an enormous mess that can approximate the Standard Model arbitrarily well if you make the masses of the unobserved particles sufficiently large and make them couple weakly enough to the observed particles.   </p>\n<p>People had hoped to see some of these unobserved particles, called \"superpartners\", at the Large Hadron Collider.  It didn't see them.  </p>\n<p>That nLab page also mentions <a href=\"https://ncatlab.org/nlab/show/string%20phenomenology#NonsusyModels\">non-supersymmetric models of string theory</a>.  These could be really interesting if you were trying to describe our universe.   But none of the 3 papers cited develops one in detail.  They talk about the general issues involved, but don't propose any specific model.</p>\n<blockquote>\n<p>So the Standard <em>Model</em> is indeed this: QFT + a choice of its free parameters, namely coupling constants (and something else? idk).</p>\n</blockquote>\n<p>The Standard Model is what I'd call a theory of physics: it makes predictions.   It has exactly <a href=\"https://math.ucr.edu/home/baez/constants.html\">25 dimensionless coupling constants</a>, most of which we know rather accurately.   (The least well-understood and most interesting ones are in the Pontecorvo-Maki-Nakagawa-Sakata matrix, which describes the behavior of neutrinos.)  </p>\n<p>When you introduce supersymmetry into the game, you get theories (models, whatever) that at best can match the \"minimal supersymmetric extension\" of the Standard Model.   And when you add extra terms to break the supersymmetry, this has over 110 dimensionless constants. Then you have to adjust them to make your theory indistinguishable from the Standard Model by all current experiments.   </p>\n<p>In short, a lot of work for no new predictions.</p>\n</blockquote>\n<p>John, thanks a lot for this explanation</p>",
        "id": 217462066,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605908239
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Sabine.20Hossenfelder's.20book/near/217447046\">said</a>:</p>\n<blockquote>\n<p>Deciding how to allocate resources should depend on the results/utility a given research pursuit brings [...] [W]hen we are talking about multi-billion dollar budgets then this should be taken into account. Again, we are not talking about the average research grant worth a few hundred thousand dollars, but about building machines worth hundreds of billions of dollars, a completely different playing field. :)</p>\n</blockquote>\n<p>It's hard to not agree with this! Or that those billions would be better spent on 'tackling climate change'.<br>\nOn the other hand, doesn't it feel like a slippery slope? There's always <em>something more important</em> to tackle first. But then, as humanity, we'd stagnate. And I have the impression that all the side, unexpected discoveries and technological advances one reaps from big-scale projects such as the LHC, or the Apollo program, couldn't be achieved through surgically targeted funding, mainly because serendipity plays a major role in even noticing the possibility one could achieve them.<br>\nFinally, one should mention scientific megaprojects are far from being of 'extraordinary expensive'. For example, olympic games in the last twenty years have at least twice equalled the cost of building LHC (<a href=\"https://en.wikipedia.org/wiki/Cost_of_the_Olympic_Games\">2004 and 2012, according to Wikipedia</a>). Or, quite famously, NASA budget <a href=\"https://en.wikipedia.org/wiki/Budget_of_NASA#/media/File:NASA-Budget-Federal.svg\">never surpassed 4% of US federal budget</a>, while military budget is <a href=\"https://en.wikipedia.org/wiki/Military_budget_of_the_United_States#Budget_by_year\">consistently 4x that</a>.<br>\nOne may consider budgets a boundary condition of scientific research, and thus deem the matter outside the scope of discussion, but so is climate change and the relevance of research topics then.<br>\nI'm mostly playing the devil's advocate here...  To circle back to were we started, I agree string theory is a bad physical theory, and pretending it's a good one is either ignorance or unethical. But I don't blame people studying that because is 'not effective', unless, of course, they do so by deceivingly convincing taxpayers they're studying a good physical theory, but, again, that's a different kettle of fish.</p>",
        "id": 217462290,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605908383
    },
    {
        "content": "<p>Also, I avidly follow Woit's and Hossenfelder's blogs so I'm very much on their side of the discussion <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 217465386,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1605910305
    }
]