[
    {
        "content": "<p>When I was younger, I was cautioned about doing anything on my own when it came to physics research.  Instead, I was told, expect to achieve results by working as part of a group.  I then went straight into a student position at the Perimeter Institute working with my advisor Lucien Hardy.  It was the kind of thing I wanted because of the speculation they were undertaking at the institute.</p>\n<p>After I left, I started reading about category Theory and it's applications.  I didn't realize that my proclivities for the unexplored were leading me down a dangerous path as an academic.  I feel that many-a-genius has been wrecked on the rocks of explicitly doing category theory as a career.</p>\n<p>This all came to a head when I went to McGill to work with Prakash Panangaden with the intention of doing the right thing.  I intended to do machine learning and secretly investigate category theory on the side.  It did not work out.  After getting out with my MSc in CompSci, I went to work in industry.  I kept up my research in CT and ML.</p>\n<p>By focusing on my well being, I eventually succeeded as an engineer and programmer.  I have also launched a very interesting ML startup with a core engine designed with CT.</p>\n<p>In my spare time, I have been working on a novel kind of physics which uses CT.  One might say this is an approach to quantum gravity, but in fact it is much larger in scope.  It is a rather general way to apply Category Theory to doing science.  Naturally, comparisons to Spivak's work are understandable.  I would say, though, that I have attempted things that Spivak has never written about.  On some level these might be the same thing.  Unfortunately, no one in the broader community will talk to me about what I'm trying to do, so who is to say.</p>\n<p>I was really hoping someone in this forum could read my two short papers and tell me if they agree or disagree as to whether there may be a \"respectable\" theory there and then engage with me in a discussion about the work.  I am aware that there are many problems with the papers.</p>\n<p>I will post links to the papers if anyone is interested in doing this.</p>",
        "id": 219721115,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607798122
    },
    {
        "content": "<p>Sounds like a fun activity for the holidays, why not? <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 219722053,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1607799440
    },
    {
        "content": "<p>Is that a yes?  Do you want me to post my papers?</p>",
        "id": 219723750,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607801158
    },
    {
        "content": "<p>Anyway, here they are:</p>\n<p><a href=\"https://www.researchgate.net/publication/322766016_Experiments_and_Theories_A_Fundamental_Model\">https://www.researchgate.net/publication/322766016_Experiments_and_Theories_A_Fundamental_Model</a></p>\n<p><a href=\"https://www.researchgate.net/publication/327977298_A_Concise_Depiction_of_Cosmological_Experiments\">https://www.researchgate.net/publication/327977298_A_Concise_Depiction_of_Cosmological_Experiments</a></p>",
        "id": 219723913,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607801344
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span></p>",
        "id": 219724799,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607802707
    },
    {
        "content": "<p>\"Unfortunately, no one in the broader community will talk to me about what I'm trying to do\"</p>\n<p>I definitely sympathize with this. Keep in mind that it is a problem faced by everyone who is not famous... which is most of us. Steven Pressfield has a blunt sounding book called \"no one wants to read your sh*t\" which i find helpful to think about sometimes.</p>\n<p>Anyway I had a look at your two papers and they seem fine to me. It's not clear who your audience is... They read a bit like notes to yourself. I liked the part about experiments being both epistemic and ontic, and thought you might be about to formalize this, but didn't seem to go anywhere with it..</p>",
        "id": 219734488,
        "sender_full_name": "Simon Burton",
        "timestamp": 1607817246
    },
    {
        "content": "<blockquote>\n<p>Steven Pressfield has a blunt sounding book called \"no one wants to read your sh*t\" which i find helpful to think about sometimes.</p>\n</blockquote>\n<p>Does he have any useful advice beyond \"so don't bother sending it to us\"?   <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 219734611,
        "sender_full_name": "John Baez",
        "timestamp": 1607817508
    },
    {
        "content": "<p>It is a rather short book.. but there's good advice in there.</p>",
        "id": 219734687,
        "sender_full_name": "Simon Burton",
        "timestamp": 1607817606
    },
    {
        "content": "<p>Indeed a major problem in science is getting people to pay attention to what you're doing.  I've tried to tackle this using a sneaky trick: putting a lot of working into writing clearly.</p>",
        "id": 219734695,
        "sender_full_name": "John Baez",
        "timestamp": 1607817610
    },
    {
        "content": "<p>I'd be interested to hear someone else's advice.</p>",
        "id": 219734806,
        "sender_full_name": "John Baez",
        "timestamp": 1607817776
    },
    {
        "content": "<p>Yeah, i think that's the key, putting a lot of work into it.</p>",
        "id": 219734896,
        "sender_full_name": "Simon Burton",
        "timestamp": 1607817943
    },
    {
        "content": "<p>Pressfield's blunt advice is meant to shake people out of their laziness.</p>",
        "id": 219734937,
        "sender_full_name": "Simon Burton",
        "timestamp": 1607817971
    },
    {
        "content": "<p>I did a lot of this work while holding down a good job as a programmer and also helping to raise my son.  The reason why that is relevant is that it could not have been done any other way.  You can't take risks like that as an academic where you have lots of time.  I had to develop a career which was indifferent to espousing these ideas.</p>",
        "id": 219737327,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607821870
    },
    {
        "content": "<p>Sure, but then you can’t be too surprised that academics don’t really engage with those outside of academia. Like any other system, academia has its own mechanisms and norms, and this is one of them. I think it’s mostly a matter of time constraints and priorities rather than purposeful neglect.</p>",
        "id": 219739747,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607826299
    },
    {
        "content": "<p>Most academics can barely find the time to study what is being done by their direct peers, let alone by those outside of the whole system.</p>",
        "id": 219739812,
        "sender_full_name": "Fawzi Hreiki",
        "timestamp": 1607826383
    },
    {
        "content": "<p>I agree.  I did not want to sound sore or anything.  The papers would get read if they were good enough quality to be published, which they are not.</p>",
        "id": 219743157,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607833075
    },
    {
        "content": "<p>Anyone listening, please let me know if you would like to have a discussion about the papers.</p>",
        "id": 219743201,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1607833117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308261\">@Ben Sprott</span> skimmed it and saw one typo in 4.1, bullet point 3: <code>gieger counter</code>. It's written correctly thereafter. Geige means violin, btw.</p>",
        "id": 220329691,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1608257553
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"281274\">@Nikolaj Kuntner</span></p>",
        "id": 220330966,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608258874
    },
    {
        "content": "<p>Hi Everyone <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>, no one has contacted me yet to talk about the papers.  I understand there are some confusing things in there and perhaps it may be a bit elementary mathematically.  It would make my day if someone would engage with me.</p>\n<p>Thanks in advance.</p>",
        "id": 220599648,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608566932
    },
    {
        "content": "<p>I will try to respond to <span class=\"user-mention\" data-user-id=\"277321\">@Simon Burton</span> about his comment that I made a claim about experiments, saying they are both ontic and epistemic.  My papers, as far as I can tell, are a way to formalize this.  You take some category for the apparatus that is a known category.  You state that you have total ontic and epistemic access to this category: i.e. you know exactly which morphisms you applied and in what order.  The probing of imprecisely understood (distant, microscopic, outside your normal senses) systems is given as a functor from some category that describes that system into the category of the apparatus.  We take morphisms (or processes) as the ontic objects, and the need for an apparatus and a functor as an epistemic restriction.  This does not exist anywhere in the literature, so if there is  a respectable theory here, it is important to discuss it further.</p>",
        "id": 220601355,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608567686
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Seeking.20help.20applying.20CT.20to.20physics.20and.20science/near/220601355\">said</a>:</p>\n<blockquote>\n<p>This does not exist anywhere in the literature...</p>\n</blockquote>\n<p>Saying this makes me think you are (a) lazy, (b) arrogant, or (c) both. I don't think these qualities are necessarily a bad thing, and I personally am guilty of these aswell, but you should at least try to hide it. You really need to backup this claim you are making, for example by comparing and contrasting to existing literature. I just don't believe that your theory exists as a wholly uncharted island somewhere.</p>",
        "id": 220607749,
        "sender_full_name": "Simon Burton",
        "timestamp": 1608571579
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277321\">@Simon Burton</span> I encourage anyone reading to find comparable work.  That's the point of my posting here.</p>",
        "id": 220610651,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608573293
    },
    {
        "content": "<p>I use the fact that histories are captured by comonads.  This can be seen in Perrone:</p>\n<p><a href=\"https://arxiv.org/abs/1912.10642\">https://arxiv.org/abs/1912.10642</a></p>\n<p>Just search for\"history\"</p>",
        "id": 220613170,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608574786
    },
    {
        "content": "<p>One question the math community could help with is this:</p>\n<p>Take the functor on Set that maps a set to the set of all domains on that set. Does this functor admit a comonad structure?</p>",
        "id": 220613710,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608575083
    },
    {
        "content": "<p>Domain= dcpo</p>\n<p>And better yet is interval domains.</p>",
        "id": 220613779,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608575123
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Seeking.20help.20applying.20CT.20to.20physics.20and.20science/near/219723913\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://www.researchgate.net/publication/322766016_Experiments_and_Theories_A_Fundamental_Model\">https://www.researchgate.net/publication/322766016_Experiments_and_Theories_A_Fundamental_Model</a></p>\n</blockquote>\n<p>I started reading this. I can't get past this bewildering claim: \"It is likely an effect of the desire for realism that experiments are treated as entirely subjective and not worthy of a role in the central theory of physics.\"<br>\nIn what sense are experiments treated in this way, and by whom? Isn't falsifiability of theories through experiment one of the pillars of modern science?</p>",
        "id": 220714199,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1608658307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span>  there is a deeply entrenched belief that science should have nothing to do with humans ability to observe it.  The belief is that any theory must focus entirely on ontic things that have nothing to do with observation.</p>",
        "id": 220717842,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608660435
    },
    {
        "content": "<p>Scientific theories have to consist of objects that exist independently of observers.  I am just saying that this leads toward the utter lack of the experiment as a core feature of theories</p>",
        "id": 220718111,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608660606
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@[Mod] Morgan Rogers</span> I appreciate your input</p>",
        "id": 220718202,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608660680
    },
    {
        "content": "<p>In contrast to this is the development of the idea of an \"observable\" in modern physics which I take as an ad hoc and problematic addition</p>",
        "id": 220718309,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608660747
    },
    {
        "content": "<p>It isn't natural</p>",
        "id": 220718319,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608660759
    },
    {
        "content": "<p>Okay, that explanation is enough for me to keep reading. I'll come back with more feedback soon!</p>",
        "id": 220718893,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1608661182
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Seeking.20help.20applying.20CT.20to.20physics.20and.20science/near/220718309\">said</a>:</p>\n<blockquote>\n<p>In contrast to this is the development of the idea of an \"observable\" in modern physics which I take as an ad hoc and problematic addition</p>\n</blockquote>\n<p>\"Modern\" meaning around 1930.   It's a  basic part of quantum physics.  It's definitely something people like to argue about!  Some people prefer to talk about \"beables\" rather than \"observables\".</p>",
        "id": 220722461,
        "sender_full_name": "John Baez",
        "timestamp": 1608663490
    },
    {
        "content": "<p>I read Asher Peres write about how theorists can squeeze the classical world (which consists of everything we can see and sense in any way), out of quantum mechanics.  It is a baffling acrobatics.</p>\n<p><a href=\"https://arxiv.org/abs/quant-ph/9906023\">https://arxiv.org/abs/quant-ph/9906023</a></p>",
        "id": 220736727,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608672998
    },
    {
        "content": "<p>I've spent a lot of time thinking about this stuff.   Since quantum mechanics is the basis of  our understanding of chemistry and everyday technologies like bar code scanners (lasers) and cell phones (transistors), we have to get used to it, and learn how to talk about it.   At the Centre for Quantum Technologies, where I often work in the summer, people seem to know how to talk about it without getting tangled up in linguistic knots - perhaps because it's their job to dream up systems that exploit the unusual features of quantum mechanics.</p>",
        "id": 220741068,
        "sender_full_name": "John Baez",
        "timestamp": 1608676179
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308261\">Ben Sprott</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Seeking.20help.20applying.20CT.20to.20physics.20and.20science/near/220717842\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277473\">[Mod] Morgan Rogers</span>  there is a deeply entrenched belief that science should have nothing to do with humans ability to observe it.  The belief is that any theory must focus entirely on ontic things that have nothing to do with observation.</p>\n</blockquote>\n<p>This is not true, this is discussed a lot in philosophy of science, and concepts such as the antropic principle come from this kind of discussion (one may agree with the principle or not, but it's not like people haven't thought about this stuff)</p>",
        "id": 220746395,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1608679821
    },
    {
        "content": "<p>Also, my stance is that in criticizing quantum mechanics one should remain humble. As of now, quantum mechanics has given the most precise physical predictions we ever got. From a very practical point of view, one may say that it is the best theory we developed so far. So, in speaking about \"entrenched beliefs\", or \"ad hoc problematic addition\" one should remember that, as of now, these beliefs and additions have produced the most amazing predictions we got so far. And that's no small feat considering \"modern\" physics is roughly half a millennium old.</p>",
        "id": 220746617,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1608679986
    },
    {
        "content": "<p>To clarify: I'm not saying your work is not worth reading or stuff like that. But given the language you use, I would understand if people were put off and didn't want to dig deeper.</p>",
        "id": 220746774,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1608680087
    },
    {
        "content": "<p>It really looks like I am proposing a radical change to physics  and science.  However, I see quantum mechanics as something that can be derived from data within my theory.  I can spell that out if anyone wants.</p>\n<p>Instead what I wanted to mention was something related to this</p>\n<blockquote>\n<p>I've spent a lot of time thinking about this stuff.   Since quantum mechanics is the basis of  our understanding of chemistry and everyday technologies like bar code scanners (lasers) and cell phones (transistors), we have to get used to it, and learn how to talk about it.</p>\n</blockquote>\n<p>Really, it is about trust.  We've all heard about the ancient 80's cpu's onboard the space shuttle and the floppy disk drives and lack of internet in the nuclear control rooms.  These old technologies are like quantum mechanics and QFT and GR.  They are there because we know we can rely on them and they are known to work.</p>\n<p>There are many Scientists doing work on foundations and improvements.  My work honours those efforts.</p>",
        "id": 220746894,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608680167
    },
    {
        "content": "<p>I spend a lot of time working on foundations and improvements... so thanks!</p>",
        "id": 220747548,
        "sender_full_name": "John Baez",
        "timestamp": 1608680700
    },
    {
        "content": "<p>Beyond trust, lack of internet in nuclear control rooms should be basic common sense.  Something that goes catastrophically wrong if it goes wrong at all should not even make the appearance of being susceptible to antagonistic agents.</p>",
        "id": 220747986,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1608681041
    },
    {
        "content": "<p>This is getting personal, so I apologise for that.  John's work from early in the 2000's was what got me into CT in the first place so I consider this all in honour of him too.  Let's focus on getting some readers who may want to discuss the papers.</p>",
        "id": 220749723,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608682491
    },
    {
        "content": "<p>I have no interest in criticising quantum theory.  Let's move on.</p>\n<blockquote>\n<p>Also, my stance is that in criticizing quantum mechanics one should remain humble.</p>\n</blockquote>",
        "id": 220749932,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1608682697
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Seeking.20help.20applying.20CT.20to.20physics.20and.20science/near/220741068\">said</a>:</p>\n<blockquote>\n<p>At the Centre for Quantum Technologies, where I often work in the summer, people seem to know how to talk about it without getting tangled up in linguistic knots - perhaps because it's their job to dream up systems that exploit the unusual features of quantum mechanics.</p>\n</blockquote>\n<p>Isn't this a general feature of the language people in quantum info/computing use? My impression is that they're much clearer than \"traditional\" physicists. Of course this could be just a matter of personal preference. After all, \"traditional\" physicists managed to develop things like the standard model and modern condensed matter using their own language, so they're doing more than fine!</p>",
        "id": 220787074,
        "sender_full_name": "Javier Prieto",
        "timestamp": 1608729072
    },
    {
        "content": "<p>Does anybody know of a repository list of physics experiments together with some hints to how they are usually understand in terms of mathematical models? <br>\nThe interaction between theory and experiment feels like the most essential part of the subject of physics, especially since making good predictions should be more tangible than \"describing reality\" beyond that. But it's actually also hard to make sense of \"the correctly described physics experiment\" and, for me, even to buy half of what's being said. Maybe in part because physics appears to be burdened with conceptions and physical principles in that people try really hard to keep them alive. Imagine a superhuman was thrown into this world, with expansive state of the art pure-math-knowledge from functional analysis to topos theory. Having to engage with loaded and convoluted physics writing about how inertial frames relate to the real world would still lead to a lot of confusion, since they are entangled with ontological presuppositions from the get go. Even if all math were trivial to you, reading physics text would be as hard as reading Kant. <br>\nAnd for that reason it also seems more appealing to make your name by working on and coming up with a prime factoring algorithm and just demonstrate your solution to the world, than coming up with an appealing physical principle tying to the black hole information paradox and then having to argue for the other 40 years of your life that it's a worthwhile idea. <br>\nPeople generally witness that those who do quantum chemistry or quantum computing indeed manage to contribute to models of chemical reactions resp. quantum chip design, so researching physics must be - in some way - be about researching the physical world. But unlike in math, everybody somehow must try to make sense of how this works on their own.</p>",
        "id": 220897069,
        "sender_full_name": "Nikolaj Kuntner",
        "timestamp": 1608854480
    },
    {
        "content": "<p>It seems a lot like math to me.  Since I do both math and physics, I've observed personally that for both you need to actually engage with the community - i.e., take courses, do homework, go to colloquia, have a thesis advisor, talk to lots of people, read a lot of papers they write, and so on - before you can really get the point of what's going on.</p>",
        "id": 220928470,
        "sender_full_name": "John Baez",
        "timestamp": 1608915705
    },
    {
        "content": "<p>In math we can <em>imagine</em> perfectly formalized proofs and a computer program who could verify these proofs without needing to pick up the \"culture\" of mathematics.  But that's not how humans actually learn math.   And more importantly, none of that would explain why mathematicians do math, or why they think  some math is more important than other math, or why they study particular topics, or even what counts as a \"topic\" (a body of related questions).  All those things are very hard to explain.</p>",
        "id": 220928586,
        "sender_full_name": "John Baez",
        "timestamp": 1608915897
    },
    {
        "content": "<p>I know lots of physicists who think math makes sense <em>when it's used for physics</em>, but find it completely mysterious and almost repulsive when it's not.   They don't understand why mathematicians are interested in math.</p>",
        "id": 220928723,
        "sender_full_name": "John Baez",
        "timestamp": 1608916174
    },
    {
        "content": "<p>Experimental physicists build and operate physical systems (without biological organisms - that would be experimental biology). Such systems may be duplicated (with adequate funding) and duplicates behave more less identically. These systems are usually represented before construction with blueprints (for mechanical devices), circuit diagrams (for electronic, hydraulic, pneumatic, or thermal subsystems), and computer code (for control sub-systems). All such representations (and instruction manuals)  are expressions in specialized formal languages, usually elements of languages generated by context-free grammars (or elaborations such as augmented transition networks).</p>\n<p>Moreover, the physical manipulations performed by experimenter musculature (in workshops with machinists, technicians, programmers, and other crafts-persons) are also expressions (up to homotopy) in specialized behavioral languages (operations of lathes, milling machines, circuit board fabricators, programmer development user interfaces, etc.).</p>\n<p>I do not know of a formal language for experimental physicists behavior, but I can imagine it could be something like musical notation, or a formal language of choreography (e.g., labanotation). The various wide-ranging above-mentioned formal languages might be described in general along the lines of Jan Rutten (et al) coalgebra of context-free languages, and in particular, behavioral differential equations. </p>\n<p>However, this would likely require a mathematical theory of shapes moving in space, and there is more to a shape than how many holes it has, so algebraic topology does not go far enough.</p>\n<p>Anyhow, it seems to me there may be a way to formalize physical experimentation in balance with formalization of physical theory.</p>",
        "id": 221087159,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1609185543
    },
    {
        "content": "<blockquote>\n<p>Anyhow, it seems to me there may be a way to formalize physical experimentation in balance with formalization of physical theory..</p>\n</blockquote>\n<p>I have an older paper that was my first attempt to formalize this theory I am working on.  In it, I attempt to give a description of the development of physical apparatuses that likens it to the computing of real numbers.  It proposes that you can use domain theory to capture the refinement process of producing an instrument.</p>\n<p>Here is a link to that paper:</p>\n<p><a href=\"http://benjaminsprott.com/EvolvingUniverseFeb24.pdf\">http://benjaminsprott.com/EvolvingUniverseFeb24.pdf</a></p>\n<p>It is not a good paper and is full of odd stuff and mistakes and poor terminology.  Still, there are a few topics in there that I would like to show people.  The first of these has to do with Ellis' comment which I included, and is about the construction of physical instruments.  You can find it in section 5.4.  It is also a discussion on how mathematical idealizations can be applied to the physical world.</p>",
        "id": 221090503,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1609188752
    },
    {
        "content": "<p>At the end of that section, I mention something about a Java vector math package.  You can see that at the beginning of section 5: Approximation and Idealization of Structures Themselves</p>",
        "id": 221091068,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1609189298
    },
    {
        "content": "<p>Has anyone found time to digest the two papers?  Does anyone want to start some discussions?</p>",
        "id": 221416880,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1609620883
    },
    {
        "content": "<p>I skimmed \"Experiments and Theories, A Fundamental Model\". My impression was that it sought to provide some examples to help develop intuition about how category theory can help us talk about how observations of some structure (in particular, the universe) capture some of that structure.</p>\n<p>You may have already read this, but I'm currently working through <a href=\"https://math.mit.edu/~dspivak/teaching/sp18/7Sketches.pdf\">Seven Sketches in Compositionality:\nAn Invitation to Applied Category Theory</a>, which I believe delves into some interesting examples of these broad ideas. For example, it talks about some applications of adjoint functors.</p>\n<p>On the topic of observation, <a href=\"http://www.mit.edu/~eadam/eadam_PhDThesis.pdf\">this</a> thesis is cited by \"Seven Sketches\" and focuses on \"generative effects\". To my understanding, generative effects can in some cases be viewed as surprises we get when observing systems - the sum of our observations of the parts is different than our observation of the sum of the parts.</p>\n<p>Disclaimer: I'm very new to category theory. Still, I hope there might be something of interest to you in the resources above.</p>",
        "id": 221424360,
        "sender_full_name": "David Egolf",
        "timestamp": 1609632196
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span>  !! I am going to take a look at the paper on generative effects.  I have seen Seven Sketches and it is quite good.</p>",
        "id": 222780227,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1610656566
    }
]