[
    {
        "content": "<p>I came across this <a href=\"https://arxiv.org/abs/hep-th/9404101\">paper</a> by Horava where he discusses Chern-Simons theory on an orbifold. The upshot is that one needs to account for the orbifold singularities by inserting Wilson lines in a particular way and computing on the underlying topological space. This seems like a curious result to me, since I would expect a TQFT such as CS to not care about the orbifold singularities. If I recall correctly, there is a de Rham theorem for orbifolds where indeed the orbifold singularities do not survive. So my question is twofold. First, what's the reason why CS is actually sensitive to orbifold singularities? And if not CS, then what nontrivial QFT truly only cares about the topology and ignores orbifold singularities?</p>",
        "id": 326489776,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1675819508
    },
    {
        "content": "<p>I have read this paper so I don't know much.   But I think an orbifold is really not just a topological space with extra properties, <a href=\"https://arxiv.org/abs/0806.4160\">it's a kind of stack</a>.  Thus, I'd expect that to really understand TQFTs on orbifolds we'd need to improve the concept of TQFT a bit so it takes account of the extra symmetries of the stacky points.</p>",
        "id": 326490416,
        "sender_full_name": "John Baez",
        "timestamp": 1675819925
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/Topological.20QFT.20on.20orbifolds.3F/near/326490416\">said</a>:</p>\n<blockquote>\n<p>I have read this paper so I don't know much.   But I think an orbifold is really not just a topological space with extra properties, <a href=\"https://arxiv.org/abs/0806.4160\">it's a kind of stack</a>.  Thus, I'd expect that to really understand TQFTs on orbifolds we'd need to improve the concept of TQFT a bit so it takes account of the extra symmetries of the stacky points.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> I agree with you, I have been looking for some time for concrete work on gauge theories genuinely defined on orbifolds but I haven't found much. Are you aware of any work that has tried to address this? I've only been able to see, buried among all the (arguably unrelated) literature on target space orbifolds, the occasional paper trying to relate orbifold points to sources/punctures.</p>",
        "id": 326492003,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1675821271
    },
    {
        "content": "<p>No, I haven't seen anything about gauge theories on orbifolds, nor thought about it myself.</p>",
        "id": 326492145,
        "sender_full_name": "John Baez",
        "timestamp": 1675821392
    },
    {
        "content": "<p>If you're really interested in this, you could ask Urs Schreiber, e.g. on the n-Forum.</p>",
        "id": 326492196,
        "sender_full_name": "John Baez",
        "timestamp": 1675821443
    },
    {
        "content": "<p>His concept of gauge theory should be general enough to handle that kind of case.</p>",
        "id": 326492211,
        "sender_full_name": "John Baez",
        "timestamp": 1675821465
    },
    {
        "content": "<p>And he'd also be likely to know about work on this if it exists.</p>",
        "id": 326492264,
        "sender_full_name": "John Baez",
        "timestamp": 1675821485
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"275920\">@John Baez</span> !</p>",
        "id": 326492590,
        "sender_full_name": "Alonso Perez-Lona",
        "timestamp": 1675821767
    }
]