[
    {
        "content": "<p>I just noticed that the usual zigzag identities could have a physical interpretation as Feynman diagrams. I guess this is nothing new since the nLab cites at least two papers where Feynman diagrams are introduced as graphical calculus for a monoidal category, but I'm posting it anyway because I think it's neat <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> <br>\n<a href=\"/user_uploads/21317/PYLF8fViECpRfeIZfxB5GtZS/Quick-sheets-page-36.png\">Quick-sheets-page-36.png</a> <br>\nThere is a question, by the way: the identity doesn't look quite right. There's no photon on the right side! Plus, the electron and the photon switch position in the interaction, is this irrelevant o ar Feynman diagrams commutative (as in commutative monoidal, i.e. braiding = 1)?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/PYLF8fViECpRfeIZfxB5GtZS/Quick-sheets-page-36.png\" title=\"Quick-sheets-page-36.png\"><img src=\"/user_uploads/21317/PYLF8fViECpRfeIZfxB5GtZS/Quick-sheets-page-36.png\"></a></div>",
        "id": 217781392,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1606236669
    },
    {
        "content": "<p>These are the zigzag identities of a rigid monoidal category</p>",
        "id": 217781924,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1606236873
    },
    {
        "content": "<p>Well, this is one of them</p>",
        "id": 217781942,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1606236883
    },
    {
        "content": "<p>The problem with the zig-zag identities is this.  In the category of representations of U(1), the electron and the positron are dual objects and the photon is isomorphic to the unit object, so you can cross out those photon lines in the zigzag diagram.</p>",
        "id": 217784762,
        "sender_full_name": "John Baez",
        "timestamp": 1606238048
    },
    {
        "content": "<p>But this is not true in the category of representations of the Poincare group: the electron and the positron are both \"positive-energy\" representations, so they can't be dual.   In more physical language: since the electron and positive both have positive energy, they can't annihilate and turn into nothing without violating conservation of energy!  They must turn into something else... like a photon.</p>",
        "id": 217784997,
        "sender_full_name": "John Baez",
        "timestamp": 1606238160
    },
    {
        "content": "<p>More generally: antiparticles aren't really dual to particles as representations of the Poincare group.  But they are as representations of certain other groups, like U(1).   Or in physics language: antiparticles don't have the opposite energy from their corresponding particles.  But they do have the opposite charge.</p>",
        "id": 217785262,
        "sender_full_name": "John Baez",
        "timestamp": 1606238261
    },
    {
        "content": "<p>Thanks John! What's the difference between U(1) and Poincarè's group?</p>",
        "id": 217785587,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1606238387
    },
    {
        "content": "<p>I mean, what's the physical interpretation?</p>",
        "id": 217785703,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1606238423
    },
    {
        "content": "<p>I'm not quite sure what you want to know so I'll just say some random stuff.  Symmetries correspond to conserved quantities via Noether's theorem.   U(1) is the group of symmetries whose corresponding conserved quantity is charge.  The Poincare group is the symmetry group whose corresponding conserved quantities are energy, momentum, angular momentum and the velocity of the center of mass.  U(1) is 1-dimensional so it gives 1 conserved quantity; the Poincare group is 10-dimensional so it gives 10.</p>",
        "id": 217786314,
        "sender_full_name": "John Baez",
        "timestamp": 1606238717
    }
]